author: Zach Mathis
date: 2022/02/10
modified: 2022/02/10

title: USB Plugged In
title_jp: 'USBデバイスが挿入された'
details: 'Instance ID: %InstanceId%'
details_jp: 'インスタンスID: %InstanceId%'
description:
description_jp:

id: b39b18a5-cece-4e7d-a438-827d0b0e8a82
level: informational
status: expiremental
detection:
    selection:
        Channel: Microsoft-Windows-DriverFrameworks-UserMode/Operational
        EventID: 2003
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
logsource: non-default
ruletype: Hayabusa
