title: Forest Blizzard APT - Process Creation Activity
id: bdf164e3-a724-140c-60ba-88a87f1416e4
related:
    - id: 07db928c-8632-488e-ac7d-3db847489175
      type: derived
status: experimental
description: |
    Detects the execution of specific processes and command line combination.
    These were seen being created by Forest Blizzard as described by MSFT.
references:
    - https://www.microsoft.com/en-us/security/blog/2024/04/22/analyzing-forest-blizzards-custom-post-compromise-tool-for-exploiting-cve-2022-38028-to-obtain-credentials/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-04-23
modified: 2025-01-22
tags:
    - attack.defense-evasion
    - attack.execution
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_hashes:
        Hashes|contains:
            - SHA256=6b311c0a977d21e772ac4e99762234da852bbf84293386fbe78622a96c0b052f
            - SHA256=c60ead92cd376b689d1b4450f2578b36ea0bf64f3963cfa5546279fa4424c2a5
    selection_schtasks_create:
        CommandLine|contains|all:
            - Create
            - /RU
            - SYSTEM
            - \Microsoft\Windows\WinSrv
        CommandLine|contains:
            - servtask.bat
            - execute.bat
            - doit.bat
        NewProcessName|endswith: \schtasks.exe
    selection_schtasks_delete:
        CommandLine|contains|all:
            - Delete
            - '/F '
            - \Microsoft\Windows\WinSrv
        NewProcessName|endswith: \schtasks.exe
    selection_powershell:
        CommandLine|contains|all:
            - Get-ChildItem
            - .save
            - Compress-Archive -DestinationPath C:\ProgramData\
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
