title: Forest Blizzard APT - Custom Protocol Handler Creation
id: b08e9928-878e-3e97-524a-036710d6f3f9
related:
    - id: 5cdeb555-65de-4767-99fe-e26807465148
      type: derived
status: test
description: |
    Detects the setting of a custom protocol handler with the name "rogue".
    Seen being created by Forest Blizzard APT as reported by MSFT.
references:
    - https://www.microsoft.com/en-us/security/blog/2024/04/22/analyzing-forest-blizzards-custom-post-compromise-tool-for-exploiting-cve-2022-38028-to-obtain-credentials/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-04-23
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1547.001
    - detection.emerging-threats
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: \PROTOCOLS\\Handler\rogue\CLSID
        NewValue: '{026CC6D7-34B2-33D5-B551-CA31EB6CE345}'
    condition: registry_set and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
