title: Peach Sandstorm APT Process Activity Indicators
id: 6121f712-be20-aaa7-5e1b-548946bb4cf6
related:
    - id: 2e7bbd54-2f26-476e-b4a1-ba5f1a012614
      type: derived
status: test
description: Detects process creation activity related to Peach Sandstorm APT
references:
    - https://twitter.com/MsftSecIntel/status/1737895710169628824
    - https://www.virustotal.com/gui/file/364275326bbfc4a3b89233dabdaf3230a3d149ab774678342a40644ad9f8d614/details
author: X__Junior (Nextron Systems)
date: 2024-01-15
tags:
    - attack.execution
    - detection.emerging-threats
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains: QP's\*(58vaP!tF4
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
