title: Lazarus System Binary Masquerading
id: c451e783-f3fc-738b-e5fb-e40879c5804a
related:
    - id: 3f7f5b0b-5b16-476c-a85f-ab477f6dd24b
      type: derived
status: test
description: Detects binaries used by the Lazarus group which use system names but are executed and launched from non-default location
references:
    - https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/07180244/Lazarus_Under_The_Hood_PDF_final.pdf
author: Trent Liffick (@tliffick), Bartlomiej Czyz (@bczyz1)
date: 2020-06-03
modified: 2023-03-10
tags:
    - attack.defense-evasion
    - attack.t1036.005
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith:
            - \msdtc.exe
            - \gpsvc.exe
    filter:
        NewProcessName|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
