title: Remove Exported Mailbox from Exchange Webserver
id: 47e67dfc-354a-0989-f6b1-f3f888a31278
related:
    - id: 09570ae5-889e-43ea-aac0-0e1221fb3d95
      type: derived
status: test
description: Detects removal of an exported Exchange mailbox which could be to cover tracks from ProxyShell exploit
references:
    - https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430
author: Christian Burkard (Nextron Systems)
date: 2021-08-27
modified: 2023-01-23
tags:
    - attack.defense-evasion
    - attack.t1070
logsource:
    service: msexchange-management
    product: windows
detection:
    msexchange_management:
        Channel: MSExchange Management
    keywords:
        '|all':
            - Remove-MailboxExportRequest
            - ' -Identity '
            - ' -Confirm "False"'
    condition: msexchange_management and keywords
falsepositives:
    - Unknown
level: high
ruletype: Sigma
