title: MSExchange Transport Agent Installation - Builtin
ruletype: Sigma
author: Tobias Michalski (Nextron Systems)
date: 2021/06/08
description: Detects the Installation of a Exchange Transport Agent
detection:
    SELECTION_1:
        Channel: MSExchange Management
    SELECTION_2:
    - Install-TransportAgent
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator
    for this.
fields:
- AssemblyPath
id: 4fe151c2-ecf9-4fae-95ae-b88ec9c2fca6
level: medium
logsource:
    product: windows
    service: msexchange-management
modified: 2022/11/27
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=7
related:
-   id: 83809e84-4475-4b69-bc3e-4aad8568612f
    type: derived
status: test
tags:
- attack.persistence
- attack.t1505.002

