title: Mailbox Export to Exchange Webserver
ruletype: Sigma
author: Florian Roth (Nextron Systems), Rich Warren, Christian Burkard (Nextron Systems)
date: 2021/08/09
description: Detects a successful export of an Exchange mailbox to untypical directory
    or with aspx name suffix which can be used to place a webshell or the needed role
    assignment for it
detection:
    SELECTION_1:
        Channel: MSExchange Management
    SELECTION_2:
    - New-MailboxExportRequest
    SELECTION_3:
    - ' -Mailbox '
    SELECTION_4:
    - -FilePath "\\\\
    - .aspx
    SELECTION_5:
    - New-ManagementRoleAssignment
    SELECTION_6:
    - ' -Role "Mailbox Import Export"'
    SELECTION_7:
    - ' -User '
    condition: (SELECTION_1 and (((SELECTION_2 and SELECTION_3) and (SELECTION_4))
        or (SELECTION_5 and SELECTION_6 and SELECTION_7)))
falsepositives:
- Unlikely
id: 516376b4-05cd-4122-bae0-ad7641c38d48
level: critical
logsource:
    product: windows
    service: msexchange-management
modified: 2023/02/28
references:
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
status: experimental
tags:
- attack.persistence
- attack.t1505.003

