title: Remove Exported Mailbox from Exchange Webserver
ruletype: Sigma
author: Christian Burkard
date: 2021/08/27
description: Detects removal of an exported Exchange mailbox which could be to cover
    tracks from ProxyShell exploit
detection:
    SELECTION_1:
        Channel: MSExchange Management
    SELECTION_2:
    - Remove-MailboxExportRequest
    SELECTION_3:
    - ' -Identity '
    SELECTION_4:
    - ' -Confirm "False"'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 09570ae5-889e-43ea-aac0-0e1221fb3d95
level: high
logsource:
    product: windows
    service: msexchange-management
modified: 2023/01/06
references:
- https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430
status: test
tags:
- attack.defense_evasion
- attack.t1070

