title: Mailbox Export to Exchange Webserver
ruletype: Sigma
author: Florian Roth, Rich Warren, Christian Burkard
date: 2021/08/09
description: Detects a successful export of an Exchange mailbox to untypical directory
    or with aspx name suffix which can be used to place a webshell or the needed role
    assignment for it
detection:
    SELECTION_1:
        Channel: MSExchange Management
    SELECTION_2:
    - New-MailboxExportRequest
    - ' -Mailbox '
    SELECTION_3:
    - -FilePath "\\\\
    - .aspx
    SELECTION_4:
    - New-ManagementRoleAssignment
    - ' -Role "Mailbox Import Export"'
    - ' -User '
    condition: (SELECTION_1 and (((SELECTION_2) and (SELECTION_3)) or (SELECTION_4)))
falsepositives:
- Unlikely
id: 516376b4-05cd-4122-bae0-ad7641c38d48
level: critical
logsource:
    product: windows
    service: msexchange-management
modified: 2022/10/26
references:
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
status: experimental
tags:
- attack.persistence
- attack.t1505.003

