title: Suspicious New Printer Ports in Registry (CVE-2020-1048)
id: 7ec912f2-5175-4868-b811-ec13ad0f8567
status: test
description: Detects a new and suspicious printer port creation in Registry that could be an attempt to exploit CVE-2020-1048
references:
    - https://windows-internals.com/printdemon-cve-2020-1048/
author: EagleEye Team, Florian Roth (Nextron Systems), NVISO
date: 2020/05/13
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.execution
    - attack.defense_evasion
    - attack.t1112
    - sysmon
logsource:
    product: windows
    category: registry_set
detection:
    registry_set:
        EventID: 13
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetObject|startswith: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Ports
        Details|contains:
            - .dll
            - .exe
            - .bat
            - .com
            - 'C:'
    condition: registry_set and selection
falsepositives:
    - New printer port install on host
level: high
ruletype: Sigma
