title: Password Spraying via Explicit Credentials
ruletype: Sigma
author: Mauricio Velazco, Zach Mathis
date: 2021/06/01
description: Detects a single user failing to authenticate to multiple users using
    explicit credentials.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4648
    SELECTION_3:
        SubjectUserName: '*$'
    condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3)) | count(TargetUserName)
        by SubjectUserName > 10
    timeframe: 1h
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: 196a29c2-e378-48d8-ba07-8a9e61f7fab9
level: medium
logsource:
    product: windows
    service: security
modified: 2023/02/24
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
status: unsupported
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation

