title: Stored Credentials in Fake Files
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
date: 2020/10/05
description: Search for accessing of fake files with stored credentials
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4663
    SELECTION_3:
        AccessList: '*%%4416*'
    SELECTION_4:
        ObjectName:
        - '*\%POLICY_ID%\Machine\Preferences\Groups\Groups.xml'
        - '*\%FOLDER_NAME%\Unattend.xml'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- EventID
- AccessList
- ObjectName
id: 692b979c-f747-41dc-ad72-1f11c01b110e
level: high
logsource:
    product: windows
    service: security
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-13-638.jpg
status: unsupported
tags:
- attack.credential_access
- attack.t1555

