title: Malicious Service Installations
ruletype: Sigma
author: Florian Roth (Nextron Systems), Daniil Yugoslavskiy, oscd.community (update)
date: 2017/03/27
description: Detects known malicious service installs that only appear in cases of
    lateral movement, credential dumping, and other suspicious activities.
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath: '*\PAExec*'
    SELECTION_5:
        ServiceName: mssecsvc2.0
    SELECTION_6:
        ImagePath: '*net user*'
    SELECTION_7:
        ServiceName: Java(TM) Virtual Machine Support Service
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5 or SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
id: 2cfe636e-317a-4bee-9f2c-1066d9f54d1a
level: critical
logsource:
    product: windows
    service: system
modified: 2022/03/21
references:
- https://awakesecurity.com/blog/threat-hunting-for-paexec/
- https://www.fireeye.com/blog/threat-research/2017/05/wannacry-malware-profile.html
- https://blog.f-secure.com/wp-content/uploads/2019/10/CosmicDuke.pdf
status: unsupported
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1003
- attack.t1035
- attack.t1050
- car.2013-09-005
- attack.t1543.003
- attack.t1569.002

