title: Remote Schtasks Creation
ruletype: Sigma
author: Jai Minton, oscd.community
date: 2020/10/05
description: Detects remote execution via scheduled task creation or update on the
    destination host
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4624
    SELECTION_3:
        Logon_Type: 3
    SELECTION_4:
        Source_Network_Address:
        - ::1
        - 127.0.0.1
    SELECTION_5:
        EventID: 4698
    SELECTION_6:
        EventID: 4702
    SELECTION_7:
        Source_Network_Address: '-'
    condition: (SELECTION_1 and (((SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
        or ((SELECTION_5 or SELECTION_6) and  not (SELECTION_7))))
    timeframe: 30d
falsepositives:
- Unknown
id: cf349c4b-99af-40fa-a051-823aa2307a84
level: medium
logsource:
    definition: The Advanced Audit Policy setting Object Access > Audit Other Object
        Access Events has to be configured to allow this detection (not in the baseline
        recommendations by Microsoft).
    product: windows
    service: security
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
status: unsupported
tags:
- attack.lateral_movement
- attack.persistence
- attack.execution
- attack.t1053.005

