
title: WMI Persistence
ruletype: Sigma
author: Florian Roth, Gleb Sukhodolskiy, Timur Zinniatullin oscd.community
date: 2017/08/22
description: Detects suspicious WMI event filter and command line event consumer based
  on WMI and Security Logs.
detection:
  SELECTION_1:
    EventID: 5861
  SELECTION_2:
  - ActiveScriptEventConsumer
  - CommandLineEventConsumer
  - CommandLineTemplate
  SELECTION_3:
    EventID: 5859
  SELECTION_4:
    Provider: SCM Event Provider
  SELECTION_5:
    Query: select * from MSFT_SCMEventLogEvent
  SELECTION_6:
    User: S-1-5-32-544
  SELECTION_7:
    PossibleCause: Permanent
  condition: (((SELECTION_1 and (SELECTION_2)) or SELECTION_3) and  not (SELECTION_4
    and SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown (data set is too small; further testing needed)
id: 0b7889b4-5577-4521-a60a-3376ee7f9f7b
level: medium
logsource:
  definition: WMI Namespaces Auditing and SACL should be configured, EventID 5861
    and 5859 detection requires Windows 10, 2012 and higher
  product: windows
  service: wmi
modified: 2022/02/10
references:
- https://twitter.com/mattifestation/status/899646620148539397
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.003
