
title: Dynamic C Sharp Compile Artefact
ruletype: Sigma
author: frack113
date: 2022/01/09
description: |
  When C# is compiled dynamically, a .cmdline file will be created as a part of the process.
  Certain processes are not typically observed compiling C# code, but can do so without touching disk.
  This can be used to unpack a payload for execution
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename: '*.cmdline'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: e4a74e34-ecde-4aab-b2fb-9112dd01aed0
level: low
logsource:
  category: file_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1027.004/T1027.004.md#atomic-test-2---dynamic-c-compile
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.004
