
title: Suspicious Scheduled Task Write to System32 Tasks
author: Florian Roth
date: 2021/11/16
description: Detects the creation of tasks from processes executed from suspicious
  locations
detection:
  SELECTION_1:
    TargetFilename: '*\Windows\System32\Tasks*'
  SELECTION_2:
    Image:
    - '*\AppData\\*'
    - '*C:\PerfLogs*'
    - '*\Windows\System32\config\systemprofile*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 80e1f67a-4596-4351-98f5-a9c3efabac95
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/01/12
references:
- Internal Research
status: experimental
tags:
- attack.persistence
- attack.execution
- attack.t1053
