
title: Suspicious Word Cab File Write CVE-2021-40444
author: Florian Roth, Sittikorn S
date: 2021/09/10
description: Detects file creation patterns noticeable during the exploitation of
  CVE-2021-40444
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: \winword.exe
  SELECTION_4:
    TargetFilename: '*.cab'
  SELECTION_5:
    TargetFilename: '*\Windows\INetCache*'
  SELECTION_6:
    Image: \winword.exe
  SELECTION_7:
    TargetFilename: '*\AppData\Local\Temp\\*'
  SELECTION_8:
    TargetFilename: '*.inf*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
fields:
- TargetFilename
id: 60c0a111-787a-4e8a-9262-ee485f3ef9d5
level: critical
logsource:
  category: file_event
  product: windows
modified: 2021/09/13
references:
- https://twitter.com/RonnyTNL/status/1436334640617373699?s=20
- https://twitter.com/vanitasnk/status/1437329511142420483?s=21
status: experimental
tags:
- attack.resource_development
- attack.t1587
