
title: Creation Exe for Service with Unquoted Path
ruletype: Sigma
author: frack113
date: 2021/12/30
description: "Adversaries may execute their own malicious payloads by hijacking vulnerable\
  \ file path references.\nAdversaries can take advantage of paths that lack surrounding\
  \ quotations by placing an executable in a higher level directory within the path,\
  \ so that Windows will choose the adversary's executable to launch. \n"
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename: C:\program.exe
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 8c3c76ca-8f8b-4b1d-aaf3-81aebcd367c9
level: high
logsource:
  category: file_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1574.009/T1574.009.md
status: experimental
tags:
- attack.persistence
- attack.t1547.009
