
title: WScript or CScript Dropper
ruletype: Sigma
author: Tim Shelton
date: 2022/01/10
description: Detects a file ending in jse, vbe, js, vba, vbs written by cscript.exe
  or wscript.exe
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Image:
    - '*\wscript.exe'
    - '*\cscript.exe'
  SELECTION_3:
    TargetFilename:
    - C:\Users\\*
    - C:\ProgramData*
  SELECTION_4:
    TargetFilename:
    - '*.jse'
    - '*.vbe'
    - '*.js'
    - '*.vba'
    - '*.vbs'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- Image
- TargetFilename
id: 002bdb95-0cf1-46a6-9e08-d38c128a6127
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/01/11
references:
- WScript or CScript Dropper (cea72823-df4d-4567-950c-0b579eaf0846)
related:
- id: cea72823-df4d-4567-950c-0b579eaf0846
  type: derived
status: experimental
