
title: File Created with System Process Name
author: Sander Wiebing, Tim Shelton
date: 2020/05/26
description: Detects the creation of an executable with a system process name in a
  suspicious folder
detection:
  SELECTION_1:
    TargetFilename:
    - '*\svchost.exe'
    - '*\rundll32.exe'
    - '*\services.exe'
    - '*\powershell.exe'
    - '*\regsvr32.exe'
    - '*\spoolsv.exe'
    - '*\lsass.exe'
    - '*\smss.exe'
    - '*\csrss.exe'
    - '*\conhost.exe'
    - '*\wininit.exe'
    - '*\lsm.exe'
    - '*\winlogon.exe'
    - '*\explorer.exe'
    - '*\taskhost.exe'
    - '*\Taskmgr.exe'
    - '*\taskmgr.exe'
    - '*\sihost.exe'
    - '*\RuntimeBroker.exe'
    - '*\runtimebroker.exe'
    - '*\smartscreen.exe'
    - '*\dllhost.exe'
    - '*\audiodg.exe'
    - '*\wlanext.exe'
  SELECTION_2:
    TargetFilename:
    - C:\Windows\System32\\*
    - C:\Windows\system32\\*
    - C:\Windows\SysWow64\\*
    - C:\Windows\SysWOW64\\*
    - C:\Windows\winsxs\\*
    - C:\Windows\WinSxS\\*
    - \SystemRoot\System32\\*
  SELECTION_3:
    Image:
    - '*\Windows\System32\dism.exe'
    - '*\TiWorker.exe'
  SELECTION_4:
    TargetFilename: C:\$WINDOWS.~BT\\*
  SELECTION_5:
    Image: C:\$WINDOWS.~BT\Sources\SetupHost.exe
  SELECTION_6:
    TargetFilename: '*\RuntimeBroker.exe'
  SELECTION_7:
    Image: C:\Windows\system32\wbengine.exe
  condition: (SELECTION_1 and  not ((SELECTION_2 and SELECTION_3) or (SELECTION_4
    and SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- System processes copied outside the default folder
fields:
- Image
id: d5866ddf-ce8f-4aea-b28e-d96485a20d3d
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/02/22
status: test
tags:
- attack.defense_evasion
- attack.t1036.005
