
title: ISO or Image Mount Indicator in Recent Files
ruletype: Sigma
author: Florian Roth
date: 2022/02/11
description: Detects the creation of recent element file that points to an .ISO, .IMG,
  .VHD or .VHDX file as often used in phishing attacks. This can be a false positive
  on server systems but on workstations users should rarely mount .iso or .img files.
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename:
    - '*.iso.lnk'
    - '*.img.lnk'
    - '*.vhd.lnk'
    - '*.vhdx.lnk'
  SELECTION_3:
    TargetFilename:
    - '*\Microsoft\Windows\Recent\\*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Cases in which a user mounts an image file for legitimate reasons
id: 4358e5a5-7542-4dcb-b9f3-87667371839b
level: medium
logsource:
  category: file_event
  product: windows
references:
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://www.trendmicro.com/vinfo/us/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
- https://blog.emsisoft.com/en/32373/beware-new-wave-of-malware-spreads-via-iso-file-email-attachments/
- https://insights.sei.cmu.edu/blog/the-dangers-of-vhd-and-vhdx-files/
status: experimental
