
title: Dump Office Macro Files from Commandline
author: frack113
date: 2022/01/23
description: A office file with macro is created from a commandline or a script
detection:
  SELECTION_1:
    TargetFilename:
    - '*.docm'
    - '*.dotm'
    - '*.xlsm'
    - '*.xltm'
    - '*.potm'
    - '*.pptm'
    - '*.pptx'
  SELECTION_2:
    Image:
    - '*\cmd.exe'
    - '*\powershell.exe'
  SELECTION_3:
    ParentImage:
    - '*\cmd.exe'
    - '*\powershell.exe'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: b1c50487-1967-4315-a026-6491686d860e
level: medium
logsource:
  category: file_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1566.001/T1566.001.md
- https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
status: experimental
tags:
- attack.initial_access
- attack.t1566.001
