
title: Windows Webshell Creation
author: Beyu Denis, oscd.community
date: 2019/10/22
description: Possible webshell file creation on a static web site
detection:
  SELECTION_1:
    TargetFilename: '*\inetpub\wwwroot\\*'
  SELECTION_10:
    TargetFilename:
    - '*\AppData\Local\Temp\\*'
    - '*\Windows\Temp\\*'
  SELECTION_2:
    TargetFilename:
    - '*.asp*'
    - '*.ashx*'
    - '*.ph*'
  SELECTION_3:
    TargetFilename:
    - '*\AppData\Local\Temp\\*'
    - '*\Windows\Temp\\*'
  SELECTION_4:
    TargetFilename:
    - '*\www\\*'
    - '*\htdocs\\*'
    - '*\html\\*'
  SELECTION_5:
    TargetFilename: '*.ph*'
  SELECTION_6:
    TargetFilename:
    - '*\AppData\Local\Temp\\*'
    - '*\Windows\Temp\\*'
  SELECTION_7:
    TargetFilename: '*.jsp'
  SELECTION_8:
    TargetFilename: '*\cgi-bin\\*'
  SELECTION_9:
    TargetFilename: '*.pl*'
  condition: ((((SELECTION_1 and SELECTION_2) and  not (SELECTION_3)) or ((SELECTION_4
    and SELECTION_5) and  not (SELECTION_6))) or ((SELECTION_7 or (SELECTION_8 and
    SELECTION_9)) and  not (SELECTION_10)))
falsepositives:
- Legitimate administrator or developer creating legitimate executable files in a
  web application folder
id: 39f1f9f2-9636-45de-98f6-a4046aa8e4b9
level: critical
logsource:
  category: file_event
  product: windows
modified: 2021/11/27
references:
- PT ESC rule and personal experience
status: test
tags:
- attack.persistence
- attack.t1505.003
