
title: Created Files by Office Applications
ruletype: Sigma
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: This rule will monitor executable and script file creation by office
  applications. Please add more file extensions or magic bytes to the logic of your
  choice.
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_10:
    TargetFilename:
    - '*.dll'
    - '*.exe'
  SELECTION_11:
    TargetFilename: '*\AppData\Local\assembly\tmp\\*'
  SELECTION_12:
    TargetFilename: '*.dll'
  SELECTION_2:
    Image:
    - '*winword.exe'
    - '*excel.exe'
    - '*powerpnt.exe'
  SELECTION_3:
    TargetFilename:
    - '*.exe'
    - '*.dll'
    - '*.ocx'
    - '*.com'
    - '*.ps1'
    - '*.vbs'
    - '*.sys'
    - '*.bat'
    - '*.scr'
    - '*.proj'
  SELECTION_4:
    TargetFilename: '*C:\Users\\*'
  SELECTION_5:
    TargetFilename: '*\AppData\Local\Microsoft\Office\\*'
  SELECTION_6:
    TargetFilename: '*\WebServiceCache\AllUsers*'
  SELECTION_7:
    TargetFilename: '*.com'
  SELECTION_8:
    Image: '*winword.exe'
  SELECTION_9:
    TargetFilename: '*\AppData\Local\Temp\webexdelta\\*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
    and SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
    and SELECTION_10) or (SELECTION_11 and SELECTION_12)))
falsepositives:
- Unknown
id: c7a74c80-ba5a-486e-9974-ab9e682bc5e4
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/03/02
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/main/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion
