
title: TeamViewer Remote Session
ruletype: Sigma
author: Florian Roth
date: 2022/01/30
description: Detects the creation of log files during a TeamViewer remote session
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename:
    - '*\TeamViewer\RemotePrinting\tvprint.db'
    - '*\TeamViewer\TVNetwork.log'
  SELECTION_3:
    TargetFilename: '*\TeamViewer*'
  SELECTION_4:
    TargetFilename: '*_Logfile.log*'
  condition: (SELECTION_1 and (SELECTION_2 or (SELECTION_3 and SELECTION_4)))
falsepositives:
- Legitimate uses of TeamViewer in an organisation
id: 162ab1e4-6874-4564-853c-53ec3ab8be01
level: medium
logsource:
  category: file_event
  product: windows
references:
- https://www.teamviewer.com/en-us/
status: experimental
tags:
- attack.command_and_control
- attack.t1219
