
title: Creation of an Executable by an Executable
ruletype: Sigma
author: frack113
date: 2022/03/09
description: Detects the creation of an executable by another executable
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_10:
    Image: C:\WINDOWS\system32\cleanmgr.exe
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*.exe'
  SELECTION_4:
    TargetFilename: '*.exe'
  SELECTION_5:
    Image: C:\WINDOWS\system32\svchost.exe
  SELECTION_6:
    TargetFilename: C:\Windows\SoftwareDistribution\Download\Install\\*
  SELECTION_7:
    Image: C:\Windows\WinSxS\\*
  SELECTION_8:
    Image: '*\TiWorker.exe'
  SELECTION_9:
    Image: C:\Windows\System32\msiexec.exe
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9)
    or (SELECTION_10)))
falsepositives:
- Software installers
- Update utilities
id: 297afac9-5d02-4138-8c58-b977bac60556
level: low
logsource:
  category: file_event
  product: windows
modified: 2022/03/29
references:
- Malware Sandbox
status: experimental
tags:
- attack.resource_development
- attack.t1587.001
