
title: Creation of an Executable by an Executable
ruletype: Sigma
author: frack113
date: 2022/03/09
description: Detects the creation of an executable by another executable
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Image: '*.exe'
  SELECTION_3:
    TargetFilename: '*.exe'
  SELECTION_4:
    Image: C:\WINDOWS\system32\svchost.exe
  SELECTION_5:
    TargetFilename: C:\Windows\SoftwareDistribution\Download\Install\\*
  SELECTION_6:
    Image: C:\Windows\WinSxS\\*
  SELECTION_7:
    Image: '*\TiWorker.exe'
  SELECTION_8:
    Image: C:\Windows\System32\msiexec.exe
  SELECTION_9:
    Image: C:\WINDOWS\system32\cleanmgr.exe
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
    and SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8) or (SELECTION_9)))
falsepositives:
- Software installers
- Update utilities
id: 297afac9-5d02-4138-8c58-b977bac60556
level: low
logsource:
  category: file_event
  product: windows
modified: 2022/03/29
references:
- Malware Sandbox
status: experimental
tags:
- attack.resource_development
- attack.t1587.001
