
title: Suspicious Creation Of a Exe By a Exe
author: frack113
date: 2022/03/09
description: A executable drop another executable
detection:
  SELECTION_1:
    Image: '*.exe'
  SELECTION_2:
    TargetFilename: '*.exe'
  SELECTION_3:
    Image: C:\WINDOWS\system32\svchost.exe
  SELECTION_4:
    TargetFilename: C:\Windows\SoftwareDistribution\Download\Install\\*
  SELECTION_5:
    Image: C:\Windows\WinSxS\\*
  SELECTION_6:
    Image: '*\TiWorker.exe'
  SELECTION_7:
    Image: C:\Windows\System32\msiexec.exe
  condition: ((SELECTION_1 and SELECTION_2) and  not ((SELECTION_3 and SELECTION_4)
    or (SELECTION_5 and SELECTION_6) or (SELECTION_7)))
falsepositives:
- Unknown
id: 297afac9-5d02-4138-8c58-b977bac60556
level: low
logsource:
  category: file_event
  product: windows
modified: 2022/03/13
references:
- Malware Sandbox
status: experimental
tags:
- attack.resource_development
- attack.t1587.001
