
title: CrackMapExec File Creation Patterns
ruletype: Sigma
author: Florian Roth
date: 2022/03/12
description: Detects suspicious file creation patterns found in logs when CrackMapExec
  is used
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename: C:\Windows\Temp\\*
  SELECTION_3:
    Image: C:\WINDOWS\system32\rundll32.exe
  SELECTION_4:
    User:
    - '*NT AUTHORI*'
    - '*NT AUTORI*'
  SELECTION_5:
    TargetFilename:
    - '*.rtf'
    - '*.otf'
    - '*.odt'
    - '*.txt'
    - '*.doc'
    - '*.pdf'
    - '*.dll'
    - '*.docx'
    - '*.wpd'
    - '*.icns'
    - '*.db'
    - '*.ini'
    - '*.tex'
    - '*.sys'
    - '*.csv'
    - '*.fon'
    - '*.tar'
    - '*.ttf'
    - '*.xml'
    - '*.cfg'
    - '*.cpl'
    - '*.jpg'
    - '*.drv'
    - '*.cur'
    - '*.tmp'
  SELECTION_6:
    TargetFilename: C:\Windows\Temp\procdump.exe
  SELECTION_7:
    User:
    - '*NT AUTHO*'
    - '*NT AUTO*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 9433ff9c-5d3f-4269-99f8-95fc826ea489
level: high
logsource:
  category: file_event
  product: windows
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
