
title: Suspicious NTDS Exfil Filename Patterns
ruletype: Sigma
author: Florian Roth
date: 2022/03/11
description: Detects suspicious creations of files with names used in various tools
  that export the NTDS.DIT for exfiltration
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    TargetFilename:
    - '*\All.cab'
    - '*.ntds.cleartext'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 3a8da4e0-36c1-40d2-8b29-b3e890d5172a
level: high
logsource:
  category: file_event
  product: windows
references:
- https://github.com/rapid7/metasploit-framework/blob/master/modules/post/windows/gather/ntds_grabber.rb
- https://github.com/rapid7/metasploit-framework/blob/master/data/post/powershell/NTDSgrab.ps1
- https://github.com/SecureAuthCorp/impacket/blob/7d2991d78836b376452ca58b3d14daa61b67cb40/impacket/examples/secretsdump.py#L2405
status: experimental
tags:
- attack.credential_access
- attack.t1003.003
