title: Remote Access Tool - ScreenConnect Command Execution
id: 8df2af03-bf29-1ee2-5e6e-476326c561d7
related:
    - id: b1f73849-6329-4069-bc8f-78a604bb8b23
      type: similar
    - id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
      type: derived
status: test
description: Detects command execution via ScreenConnect RMM
references:
    - https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
    - https://github.com/SigmaHQ/sigma/pull/4467
author: Ali Alwashali
date: 2023-10-10
tags:
    - attack.execution
    - attack.t1059.003
logsource:
    service: application
    product: windows
detection:
    application:
        Channel: Application
    selection:
        Provider_Name: ScreenConnect
        EventID: 200
        Data|contains: Executed command of length
    condition: application and selection
falsepositives:
    - Legitimate use of ScreenConnect
level: low
ruletype: Sigma
