title: Suspicious Encoded Scripts in a WMI Consumer
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/09/01
description: Detects suspicious encoded payloads in WMI Event Consumers
detection:
    SELECTION_1:
        EventID: 19
    SELECTION_2:
        EventID: 20
    SELECTION_3:
        EventID: 21
    SELECTION_4:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_5:
        Destination|base64offset|contains:
        - WriteProcessMemory
        - This program cannot be run in DOS mode
        - This program must be run under Win32
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- User
- Operation
id: 83844185-1c5b-45bc-bcf3-b5bf3084ca5b
level: high
logsource:
    category: wmi_event
    product: windows
modified: 2022/10/09
references:
- https://github.com/RiccardoAncarani/LiquidSnake
status: test
tags:
- attack.execution
- attack.t1047
- attack.persistence
- attack.t1546.003

