
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "timeflame \n"
detection:
  SELECTION_1:
    EventID: 3
  condition: SELECTION_1
  timeflame: 2d
falsepositives:
- Unknown
id: 000000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
