
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "condition not ()\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    aaa: bbb
  SELECTION_3:
    ccc: ddd
  SELECTION_4:
    eee: fff
  SELECTION_5:
    ggg: hhh
  condition: ( not (SELECTION_1) and  not ((SELECTION_2 and  not ((SELECTION_3 or
    SELECTION_4)))) and SELECTION_5)
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
