
title: test
ruletype:Test
author: test
date: 2021/12/4
description: "endswith pipe modifier and startswith pipe modifier\n"
detection:
  SELECTION_1:
    UserName: '*hogehoge_end'
  SELECTION_2:
    TargetUserName: test_start*
  condition: (SELECTION_1 or SELECTION_2)
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
