
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "base64 encode modifier\n"
detection:
  SELECTION_1:
    UserName: YmFzZTY0X2VuY29kZWQ=
  SELECTION_2:
    TargetUserName: test_start
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
