
title: test
ruletype: Test
author: test
date: 2021/12/4
description: "condition and or\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    aaa: bbb
  SELECTION_3:
    ccc: ddd
  SELECTION_4:
    eee: fff
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
  timeflame: 2d
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
