
title: test
ruletype: SIGMA
author: test
date: 2021/12/4
description: "condition count\n"
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    aaa: bbb
  condition: (SELECTION_1 and  not (SELECTION_2)) | count() < 3
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
