
title: test
ruletype: Test
author: test
date: 2021/12/4
description: "condition not\n"
detection:
  SELECTION_1:
    EventID: 3
  condition: ' not (SELECTION_1)'
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
