
title: test
ruletype:Test
author: test
date: 2021/12/4
description: "contains modifier\n"
detection:
  SELECTION_1:
    UserName: '*hogehoge*'
  SELECTION_2:
    TargetUserName: '*testest2*'
  condition: (SELECTION_1 or SELECTION_2)
falsepositives:
- Unknown
id: 00000000-0000-0000-0000-000000000000
level: medium
logsource:
  product: windows
  service: security
status: experimental
