title: New RDP Connection Initiated From Domain Controller
id: 23ef76b6-d6b4-dcb6-d48f-a246567ebccf
related:
    - id: fda34293-718e-4b36-b018-38caab0d1209
      type: derived
status: test
description: Detects an RDP connection originating from a domain controller.
references:
    - Internal Research
author: Josh Nickels
date: 2024-05-10
tags:
    - attack.lateral-movement
    - attack.t1021
    - sysmon
logsource:
    product: windows
    category: network_connection
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_connection:
        Initiated: 'True'
        DestinationPort: 3389
    selection_hosts:
        Computer|expand: '%domain_controller_hostnames%'
    filter_optional_defender_identity:
        Image|endswith: \Microsoft.Tri.Sensor.exe   # Microsoft Defender for Identity service makes port 3389 connections to hosts
    condition: network_connection and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Legitimate administration activity
level: high
ruletype: Sigma
