title: VHD Image Download Via Browser
ruletype: Sigma
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021/10/25
description: 'Detects creation of ".vhd"/".vhdx" files by browser processes.

    Malware can use mountable Virtual Hard Disk ".vhd" files to encapsulate payloads
    and evade security controls.

    '
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\brave.exe'
        - '*\chrome.exe'
        - '*\firefox.exe'
        - '*\iexplore.exe'
        - '*\maxthon.exe'
        - '*\MicrosoftEdge.exe'
        - '*\msedge.exe'
        - '*\msedgewebview2.exe'
        - '*\opera.exe'
        - '*\safari.exe'
        - '*\seamonkey.exe'
        - '*\vivaldi.exe'
        - '*\whale.exe'
    SELECTION_4:
        TargetFilename: '*.vhd*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate downloads of ".vhd" files would also trigger this
id: 8468111a-ef07-4654-903b-b863a80bbc95
level: medium
logsource:
    category: file_event
    product: windows
modified: 2023/05/05
references:
- https://redcanary.com/blog/intelligence-insights-october-2021/
- https://www.kaspersky.com/blog/lazarus-vhd-ransomware/36559/
- https://securelist.com/lazarus-on-the-hunt-for-big-game/97757/
status: test
tags:
- attack.resource_development
- attack.t1587.001

