title: Creation In User Word Startup Folder
ruletype: Sigma
author: frack113
date: 2022/06/05
description: Detects the creation of an file in user Word Startup
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\AppData\Roaming\Microsoft\Word\STARTUP\\*'
    SELECTION_4:
        TargetFilename:
        - '*.docx'
        - '*.docm'
        - '*.dotx'
        - '*.dotm'
        - '*.docb'
        - '*.pdf'
        - '*.wll'
        - '*.wwl'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Addition of legitimate plugins
id: a10a2c40-2c4d-49f8-b557-1a946bc55d9d
level: medium
logsource:
    category: file_event
    product: windows
references:
- Malware Sandbox https://app.any.run/tasks/d6fe6624-6ef8-485d-aa75-3d1bdda2a08c/
- http://addbalance.com/word/startup.htm
- https://answers.microsoft.com/en-us/msoffice/forum/all/document-in-word-startup-folder-doesnt-open-when/44ab0932-2917-4150-8cdc-2f2cf39e86f3
status: experimental
tags:
- attack.resource_development
- attack.t1587.001

