title: Creation of an Executable by an Executable
ruletype: Sigma
author: frack113
date: 2022/03/09
description: Detects the creation of an executable by another executable
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_10:
        TargetFilename: '*\WindowsUpdateBox.exe*'
    SELECTION_11:
        Image: C:\WINDOWS\SoftwareDistribution\Download\\*
    SELECTION_12:
        Image: '*\WindowsUpdateBox.Exe'
    SELECTION_13:
        TargetFilename: C:\$WINDOWS.~BT\Sources\\*
    SELECTION_14:
        Image: C:\Windows\WinSxS\\*
    SELECTION_15:
        Image: '*\TiWorker.exe'
    SELECTION_16:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_17:
        TargetFilename:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_18:
        Image: C:\ProgramData\Microsoft\Windows Defender\\*
    SELECTION_19:
        TargetFilename: '*\Microsoft\WindowsApps\\*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        Image: C:\Users\\*
    SELECTION_21:
        Image: '*\AppData\Local\Microsoft\Teams\Update.exe'
    SELECTION_22:
        TargetFilename: C:\Users\\*
    SELECTION_23:
        TargetFilename:
        - '*\AppData\Local\Microsoft\Teams\stage\Teams.exe'
        - '*\AppData\Local\Microsoft\Teams\stage\Squirrel.exe'
        - '*\AppData\Local\Microsoft\SquirrelTemp\tempb\'
    SELECTION_24:
        Image: C:\Windows\Microsoft.NET\Framework\\*
    SELECTION_25:
        Image: '*\mscorsvw.exe'
    SELECTION_26:
        TargetFilename: C:\Windows\assembly\NativeImages_*
    SELECTION_27:
        Image: C:\Users\\*
    SELECTION_28:
        Image: '*\AppData\Local\\*'
    SELECTION_29:
        Image: '*\Microsoft VS Code\Code.exe'
    SELECTION_3:
        Image: '*.exe'
    SELECTION_30:
        TargetFilename: '*\.vscode\extensions\\*'
    SELECTION_31:
        Image: '*\AppData\Local\GitHubDesktop\Update.exe'
    SELECTION_32:
        TargetFilename: '*\AppData\Local\SquirrelTemp\\*'
    SELECTION_4:
        TargetFilename: '*.exe'
    SELECTION_5:
        Image:
        - C:\Windows\System32\msiexec.exe
        - C:\Windows\system32\cleanmgr.exe
        - C:\Windows\explorer.exe
        - C:\WINDOWS\system32\dxgiadaptercache.exe
        - C:\WINDOWS\system32\Dism.exe
        - C:\Windows\System32\wuauclt.exe
    SELECTION_6:
        Image: C:\WINDOWS\system32\svchost.exe
    SELECTION_7:
        TargetFilename: C:\Windows\SoftwareDistribution\Download\\*
    SELECTION_8:
        Image: C:\Windows\system32\svchost.exe
    SELECTION_9:
        TargetFilename: '*:\WUDownloadCache\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13) or (SELECTION_14
        and SELECTION_15) or (SELECTION_16 or SELECTION_17) or (SELECTION_18) or (SELECTION_19)
        or (SELECTION_20 and SELECTION_21 and SELECTION_22 and SELECTION_23) or (SELECTION_24
        and SELECTION_25 and SELECTION_26) or (SELECTION_27 and SELECTION_28 and SELECTION_29
        and SELECTION_30) or (SELECTION_31 and SELECTION_32)))
falsepositives:
- Software installers
- Update utilities
- 32bit applications launching their 64bit versions
id: 297afac9-5d02-4138-8c58-b977bac60556
level: low
logsource:
    category: file_event
    product: windows
modified: 2023/01/20
references:
- Malware Sandbox
status: experimental
tags:
- attack.resource_development
- attack.t1587.001

