title: Legitimate Application Dropped Executable
ruletype: Sigma
author: frack113, Florian Roth
date: 2022/08/21
description: Detects programs on a Windows system that should not write executables
    to disk
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\winword.exe'
        - '*\excel.exe'
        - '*\powerpnt.exe'
        - '*\msaccess.exe'
        - '*\mspub.exe'
        - '*\eqnedt32.exe'
        - '*\visio.exe'
        - '*\wordpad.exe'
        - '*\wordview.exe'
        - '*\certutil.exe'
        - '*\certoc.exe'
        - '*\CertReq.exe'
        - '*\Desktopimgdownldr.exe'
        - '*\esentutl.exe'
        - '*\finger.exe'
        - '*\notepad.exe'
        - '*\AcroRd32.exe'
        - '*\RdrCEF.exe'
        - '*\mshta.exe'
        - '*\hh.exe'
    SELECTION_4:
        TargetFilename:
        - '*.exe'
        - '*.dll'
        - '*.ocx'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: f0540f7e-2db3-4432-b9e0-3965486744bc
level: high
logsource:
    category: file_event
    product: windows
references:
- https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

