title: New Outlook Macro Created
ruletype: Sigma
author: '@ScoubiMtl'
date: 2021/04/05
description: Detects the creation of a macro file for Outlook.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\outlook.exe'
    SELECTION_4:
        TargetFilename: '*\Microsoft\Outlook\VbaProject.OTM'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- User genuinely creates a VB Macro for their email
id: 8c31f563-f9a7-450c-bfa8-35f8f32f1f61
level: medium
logsource:
    category: file_event
    product: windows
modified: 2023/02/08
references:
- https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/
related:
-   id: 117d3d3a-755c-4a61-b23e-9171146d094c
    type: derived
status: test
tags:
- attack.persistence
- attack.command_and_control
- attack.t1137
- attack.t1008
- attack.t1546

