title: Suspicious File Creation In Uncommon AppData Folder
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/05
description: Detects the creation of suspicious files and folders inside the user's
    AppData folder but not inside any of the common and well known directories (Local,
    Romaing, LocalLow). This method could be used as a method to bypass detection
    who exclude the AppData folder in fear of FPs
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: C:\Users\\*
    SELECTION_4:
        TargetFilename: '*\AppData\\*'
    SELECTION_5:
        TargetFilename:
        - '*.bat'
        - '*.cmd'
        - '*.cpl'
        - '*.dll'
        - '*.exe'
        - '*.hta'
        - '*.iso'
        - '*.lnk'
        - '*.msi'
        - '*.ps1'
        - '*.psm1'
        - '*.scr'
        - '*.vbe'
        - '*.vbs'
    SELECTION_6:
        TargetFilename: C:\Users\\*
    SELECTION_7:
        TargetFilename:
        - '*\AppData\Local\\*'
        - '*\AppData\LocalLow\\*'
        - '*\AppData\Roaming\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6 and SELECTION_7))
falsepositives:
- Unlikely
id: d7b50671-d1ad-4871-aa60-5aa5b331fe04
level: high
logsource:
    category: file_event
    product: windows
modified: 2023/02/23
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.execution

