title: Suspicious Unattend.xml File Access
ruletype: Sigma
author: frack113
date: 2021/12/19
description: 'Attempts to access unattend.xml, where credentials are commonly stored,
    within the Panther directory where installation logs are stored.

    If these files exist, their contents will be displayed. They are used to store
    credentials/answers during the unattended windows install process

    '
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\unattend.xml'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 1a3d42dd-3763-46b9-8025-b5f17f340dfb
level: medium
logsource:
    category: file_event
    product: windows
modified: 2022/12/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
status: test
tags:
- attack.credential_access
- attack.t1552.001

