title: Potential DCOM InternetExplorer.Application DLL Hijack
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR), wagga
date: 2020/10/12
description: Detects potential DLL hijack of "iertutil.dll" found in the DCOM InternetExplorer.Application
    Class over the network
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: System
    SELECTION_4:
        TargetFilename: '*\Internet Explorer\iertutil.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 2f7979ae-f82b-45af-ac1d-2b10e93b0baa
level: critical
logsource:
    category: file_event
    product: windows
modified: 2022/12/18
references:
- https://threathunterplaybook.com/hunts/windows/201009-RemoteDCOMIErtUtilDLLHijack/notebook.html
related:
-   id: e554f142-5cf3-4e55-ace9-a1b59e0def65
    type: obsoletes
-   id: f354eba5-623b-450f-b073-0b5b2773b6aa
    type: similar
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
- attack.t1021.003

