title: Office Macro File Creation From Suspicious Process
ruletype: Sigma
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/23
description: Detects the creation of a office macro file from a a suspicious process
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\cscript.exe'
        - '*\mshta.exe'
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\wscript.exe'
    SELECTION_4:
        ParentImage:
        - '*\cscript.exe'
        - '*\mshta.exe'
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\wscript.exe'
    SELECTION_5:
        TargetFilename:
        - '*.docm'
        - '*.dotm'
        - '*.xlsm'
        - '*.xltm'
        - '*.potm'
        - '*.pptm'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: b1c50487-1967-4315-a026-6491686d860e
level: high
logsource:
    category: file_event
    definition: 'Requirements: The "ParentImage" field is not available by default
        on EID 11 of Sysmon logs. To be able to use this rule to the full extent you
        need to enriche the log with additional ParentImage data'
    product: windows
modified: 2023/02/22
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
- https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
status: experimental
tags:
- attack.initial_access
- attack.t1566.001

