title: VsCode Powershell Profile Modification
id: 5583f65d-0e3e-f8df-a8b1-09511073a77f
related:
    - id: b5b78988-486d-4a80-b991-930eff3ff8bf
      type: similar
    - id: 3a9fa2ec-30bc-4ebd-b49e-7c9cff225502
      type: derived
status: test
description: Detects the creation or modification of a vscode related powershell profile which could indicate suspicious activity as the profile can be used as a mean of persistence
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles?view=powershell-7.2
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-24
modified: 2023-01-06
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1546.013
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|endswith: \Microsoft.VSCode_profile.ps1
    condition: file_event and selection
falsepositives:
    - Legitimate use of the profile by developers or administrators
level: medium
ruletype: Sigma
