title: NET CLR Binary Execution Usage Log Artifact
ruletype: Sigma
author: frack113
date: 2022/11/18
description: Detects the creation of Usage Log files by the CLR (clr.dll). These files
    are named after the executing process once the assembly is finished executing
    for the first time in the (user) session context
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\UsageLogs\cscript.exe.log'
        - '*\UsageLogs\wscript.exe.log'
        - '*\UsageLogs\wmic.exe.log'
        - '*\UsageLogs\mshta.exe.log'
        - '*\UsageLogs\svchost.exe.log'
        - '*\UsageLogs\regsvr32.exe.log'
        - '*\UsageLogs\rundll32.exe.log'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use
id: e0b06658-7d1d-4cd3-bf15-03467507ff7c
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
- https://github.com/olafhartong/sysmon-modular/blob/fa1ae53132403d262be2bbd7f17ceea7e15e8c78/11_file_create/include_dotnet.xml
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

