title: Startup Folder File Write
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection for files being created in the Windows startup directory.
    This could be an indicator of persistence.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\Microsoft\Windows\Start Menu\Programs\StartUp*'
    SELECTION_4:
        Image: C:\Windows\System32\wuauclt.exe
    SELECTION_5:
        TargetFilename: C:\$WINDOWS.~BT\NewOS\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4
        or SELECTION_5))
falsepositives:
- FP could be caused by legitimate application writing shortcuts for example. This
    folder should always be inspected to make sure that all the files in there are
    legitimate
id: 2aa0a6b4-a865-495b-ab51-c28249537b75
level: medium
logsource:
    category: file_event
    product: windows
modified: 2022/10/07
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/12
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/5.B.1_611FCA99-97D0-4873-9E51-1C1BA2DBB40D.md
related:
-   id: 28208707-fe31-437f-9a7f-4b1108b94d2e
    type: similar
status: test
tags:
- attack.persistence
- attack.t1547.001

