title: Windows Binaries Write Suspicious Extensions
id: 9c5b0709-beda-4713-b14d-b243154cacda
related:
    - id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
      type: derived
    - id: b8fd0e93-ff58-4cbd-8f48-1c114e342e62
      type: derived
status: test
description: Detects Windows executables that write files with suspicious extensions
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-12
modified: 2025-08-05
tags:
    - attack.defense-evasion
    - attack.t1036
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_generic:
        Image|endswith:
            - \csrss.exe
            - \lsass.exe
            - \RuntimeBroker.exe
            - \sihost.exe
            - \smss.exe
            - \wininit.exe
            - \winlogon.exe
        TargetFilename|endswith:
            - .bat
            - .dll
            - .exe
            - .hta
            - .iso
            - .ps1
            - .txt
            - .vbe
            - .vbs
    selection_special:
        Image|endswith:
            - \dllhost.exe
            - \rundll32.exe
            - \svchost.exe
        TargetFilename|endswith:
            - .bat
            - .hta
            - .iso
            - .ps1
            - .vbe
            - .vbs
    filter_main_AppLockerPolicyTest:
        Image: C:\Windows\System32\dllhost.exe
        TargetFilename|contains|all:
            - :\Users\
            - \AppData\Local\Temp\__PSScriptPolicyTest_
        TargetFilename|endswith: .ps1
    filter_main_script_gpo_machine:
        Image: C:\Windows\system32\svchost.exe
        TargetFilename|contains|all:
            - C:\Windows\System32\GroupPolicy\DataStore\
            - \sysvol\
            - \Policies\
            - \Machine\Scripts\Startup\
        TargetFilename|endswith:
            - .ps1
            - .bat
    filter_main_clipchamp:
        Image: C:\Windows\system32\svchost.exe
        TargetFilename|contains|all:
            - C:\Program Files\WindowsApps\Clipchamp
            - .ps1
    condition: file_event and (1 of selection_* and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
