title: Suspicious DotNET CLR Usage Log Artifact
ruletype: Sigma
author: frack113, omkar72, oscd.community, Wojciech Lesicki
date: 2022/11/18
description: Detects the creation of Usage Log files by the CLR (clr.dll). These files
    are named after the executing process once the assembly is finished executing
    for the first time in the (user) session context.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\UsageLogs\cmstp.exe.log'
        - '*\UsageLogs\cscript.exe.log'
        - '*\UsageLogs\mshta.exe.log'
        - '*\UsageLogs\msxsl.exe.log'
        - '*\UsageLogs\regsvr32.exe.log'
        - '*\UsageLogs\rundll32.exe.log'
        - '*\UsageLogs\svchost.exe.log'
        - '*\UsageLogs\wscript.exe.log'
        - '*\UsageLogs\wmic.exe.log'
    SELECTION_4:
        ParentImage: '*\MsiExec.exe'
    SELECTION_5:
        ParentCommandLine: '* -Embedding*'
    SELECTION_6:
        Image: '*\rundll32.exe'
    SELECTION_7:
        CommandLine: '*Temp*'
    SELECTION_8:
        CommandLine: '*zzzzInvokeManagedCustomActionOutOfProc*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Rundll32.exe with zzzzInvokeManagedCustomActionOutOfProc in command line and msiexec.exe
    as parent process - https://twitter.com/SBousseaden/status/1388064061087260675
id: e0b06658-7d1d-4cd3-bf15-03467507ff7c
level: high
logsource:
    category: file_event
    definition: 'Requirements: UsageLogs folder must be monitored by the sysmon configuration'
    product: windows
modified: 2023/02/23
references:
- https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
- https://github.com/olafhartong/sysmon-modular/blob/fa1ae53132403d262be2bbd7f17ceea7e15e8c78/11_file_create/include_dotnet.xml
- https://web.archive.org/web/20221026202428/https://gist.github.com/code-scrap/d7f152ffcdb3e0b02f7f394f5187f008
- https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
- https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
related:
-   id: 4508a70e-97ef-4300-b62b-ff27992990ea
    type: derived
-   id: e4b63079-6198-405c-abd7-3fe8b0ce3263
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

