title: LSASS Process Dump Artefact In CrashDumps Folder
ruletype: Sigma
author: '@pbssubhash'
date: 2022/12/08
description: Detects the presence of an LSASS dump file in the "CrashDumps" folder.
    This could be a sign of LSASS credential dumping. Techniques such as the LSASS
    Shtinkering have been seen abusing the Windows Error Reporting to dump said process.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: C:\Windows\System32\config\systemprofile\AppData\Local\CrashDumps\\*
    SELECTION_4:
        TargetFilename: '*lsass.exe.*'
    SELECTION_5:
        TargetFilename: '*.dmp'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Rare legitimate dump of the process by the operating system due to a crash of lsass
id: 6902955a-01b7-432c-b32a-6f5f81d8f625
level: high
logsource:
    category: file_event
    product: windows
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

