title: Suspicious Executable File Creation
id: 74babdd6-a758-4549-9632-26535279e654
status: test
description: Detect creation of suspicious executable file name. Some strings look
    for suspicious file extensions, others look for filenames that exploit unquoted
    service paths.
references:
    - https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
    - https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/
author: frack113
date: 2022/09/05
tags:
    - attack.defense_evasion
    - attack.t1564
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_double:
        TargetFilename|endswith:
            - .bat.exe
            - .sys.exe
    selection_folder:
        TargetFilename:
            - C:\$Recycle.Bin.exe
            - C:\Documents and Settings.exe
            - C:\MSOCache.exe
            - C:\Recovery.exe
            - C:\PerfLogs.exe
    condition: file_event and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
