title: RDP File Creation From Suspicious Application
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/18
description: Detects Rclone config file being created
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\brave.exe'
        - '*\CCleaner Browser\Application\CCleanerBrowser.exe'
        - '*\chromium.exe'
        - '*\firefox.exe'
        - '*\Google\Chrome\Application\chrome.exe'
        - '*\iexplore.exe'
        - '*\microsoftedge.exe'
        - '*\msedge.exe'
        - '*\Opera.exe'
        - '*\Vivaldi.exe'
        - '*\Whale.exe'
        - '*\Outlook.exe'
        - '*\RuntimeBroker.exe'
        - '*\Thunderbird.exe'
        - '*\Discord.exe'
        - '*\Keybase.exe'
        - '*\msteams.exe'
        - '*\Slack.exe'
        - '*\teams.exe'
    SELECTION_4:
        TargetFilename: '*.rdp*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: fccfb43e-09a7-4bd2-8b37-a5a7df33386d
level: high
logsource:
    category: file_event
    product: windows
references:
- https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
- https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
status: experimental
tags:
- attack.defense_evasion

