title: Writing Local Admin Share
id: 8cda9d86-5fee-d4de-9a21-58cb9a894a2f
related:
    - id: 4aafb0fa-bff5-4b9d-b99e-8093e659c65f
      type: derived
status: test
description: |
    Aversaries may use to interact with a remote network share using Server Message Block (SMB).
    This technique is used by post-exploitation frameworks.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-4---execute-command-writing-output-to-local-admin-share
author: frack113
date: 2022-01-01
modified: 2022-08-13
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.lateral-movement
    - attack.t1546.002
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|contains|all:
            - \\\\127.0.0
            - \ADMIN$\
    condition: file_event and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
