title: Process Monitor Driver Creation By Non-Sysinternals Binary
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/05
description: Detects creation of the Process Monitor driver by processes other than
    Process Monitor (procmon) itself.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\procmon*'
    SELECTION_4:
        TargetFilename: '*.sys'
    SELECTION_5:
        Image:
        - '*\procmon.exe'
        - '*\procmon64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5)))
falsepositives:
- Some false positives may occur with legitimate renamed process monitor binaries
id: a05baa88-e922-4001-bc4d-8738135f27de
level: medium
logsource:
    category: file_event
    product: windows
references:
- Internal Research
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1068

