title: Potential Privilege Escalation Attempt Via .Exe.Local Technique
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), Subhash P (@pbssubhash)
date: 2022/12/16
description: Detects potential privilege escalation attempt via the creation of the
    "*.Exe.Local" folder inside the "System32" directory in order to sideload "comctl32.dll"
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - C:\Windows\System32\logonUI.exe.local*
        - C:\Windows\System32\werFault.exe.local*
        - C:\Windows\System32\consent.exe.local*
        - C:\Windows\System32\narrator.exe.local*
        - C:\Windows\System32\wermgr.exe.local*
    SELECTION_4:
        TargetFilename: '*\comctl32.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 07a99744-56ac-40d2-97b7-2095967b0e03
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/12/19
references:
- https://github.com/binderlabs/DirCreate2System
- https://github.com/sailay1996/awesome_windows_logical_bugs/blob/60cbb23a801f4c3195deac1cc46df27c225c3d07/dir_create2system.txt
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation

