title: Creation Of Non-Existent DLLs In System Folders
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/12/01
description: Detects the creation of system dlls that are not present on the system.
    Usualy to achieve dll hijacking
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - C:\Windows\System32\WLBSCTRL.dll
        - C:\Windows\System32\TSMSISrv.dll
        - C:\Windows\System32\TSVIPSrv.dll
    SELECTION_4:
        Image: C:\Windows\System32\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: df6ecb8b-7822-4f4b-b412-08f524b4576c
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://decoded.avast.io/martinchlumecky/png-steganography/
- https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

