title: PsExec Service File Creation
ruletype: Sigma
author: Thomas Patzke
date: 2017/06/12
description: Detects default PsExec service filename which indicates PsExec service
    installation and execution
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\PSEXESVC.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: 259e5a6a-b8d2-4c38-86e2-26c5e651361d
level: low
logsource:
    category: file_event
    product: windows
modified: 2022/10/26
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
-   id: 42c575ea-e41e-41f1-b248-8093c3e82a28
    type: derived
status: test
tags:
- attack.execution
- attack.t1569.002
- attack.s0029

