title: Suspicious Outlook Macro Created
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/08
description: Detects the creation of a macro file for Outlook.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\Microsoft\Outlook\VbaProject.OTM'
    SELECTION_4:
        Image: '*\outlook.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unlikely
id: 117d3d3a-755c-4a61-b23e-9171146d094c
level: high
logsource:
    category: file_event
    product: windows
references:
- https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53
- https://www.linkedin.com/pulse/outlook-backdoor-using-vba-samir-b-/
related:
-   id: 8c31f563-f9a7-450c-bfa8-35f8f32f1f61
    type: derived
status: test
tags:
- attack.persistence
- attack.command_and_control
- attack.t1137
- attack.t1008
- attack.t1546

