title: BloodHound Collection Files
ruletype: Sigma
author: C.J. May
date: 2022/08/09
description: Detects default file names outputted by the BloodHound collection tool
    SharpHound
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*_BloodHound.zip'
        - '*_computers.json'
        - '*_containers.json'
        - '*_domains.json'
        - '*_gpos.json'
        - '*_groups.json'
        - '*_ous.json'
        - '*_users.json'
    SELECTION_4:
        TargetFilename: '*BloodHound*'
    SELECTION_5:
        TargetFilename: '*.zip*'
    SELECTION_6:
        Image: '*\svchost.exe'
    SELECTION_7:
        TargetFilename: C:\Program Files\WindowsApps\Microsoft.*
    SELECTION_8:
        TargetFilename: '*\pocket_containers.json'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5)) and  not ((SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 02773bed-83bf-469f-b7ff-e676e7d78bab
level: high
logsource:
    category: file_event
    product: windows
modified: 2023/02/13
references:
- https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection
status: experimental
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001

