title: Hijack Legit RDP Session to Move Laterally
id: 52753ea4-b3a0-4365-910d-36cff487b789
status: test
description: Detects the usage of tsclient share to place a backdoor on the RDP source machine's startup folder
author: Samir Bousseaden
references:
    - Internal Research
date: 2019/02/21
modified: 2021/11/27
tags:
    - attack.command_and_control
    - attack.t1219
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \mstsc.exe
        TargetFilename|contains: \Microsoft\Windows\Start Menu\Programs\Startup\
    condition: file_event and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
