title: OneNote Attachment File Dropped In Suspicious Location
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/22
description: Detects creation of files with the ".one" extension in suspicious or
    uncommon locations. This could be a sign of attackers abusing OneNote attachments
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\AppData\Local\Temp\\*'
        - '*\Users\Public\\*'
        - '*\Windows\Temp\\*'
        - '*C:\Temp\\*'
    SELECTION_4:
        TargetFilename: '*.one'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate usage of ".one" files from those locations add-ins
id: 7fd164ba-126a-4d9c-9392-0d4f7c243df0
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://www.bleepingcomputer.com/news/security/hackers-now-use-microsoft-onenote-attachments-to-spread-malware/
- https://blog.osarmor.com/319/onenote-attachment-delivers-asyncrat-malware/
status: experimental
tags:
- attack.defense_evasion

