title: UAC Bypass Using Consent and Comctl32 - File
ruletype: Sigma
author: Christian Burkard (Nextron Systems)
date: 2021/08/23
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll
    (UACMe 22)
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: C:\Windows\System32\consent.exe.@*
    SELECTION_4:
        TargetFilename: '*\comctl32.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 62ed5b55-f991-406a-85d9-e8e8fdf18789
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/10/09
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002

