title: DLL Search Order Hijackig Via Additional Space in Path
id: 6bb7d861-706e-4da0-49cb-523e92af21fa
related:
    - id: b6f91281-20aa-446a-b986-38a92813a18f
      type: derived
status: test
description: |
    Detects when an attacker create a similar folder structure to windows system folders such as (Windows, Program Files...)
    but with a space in order to trick DLL load search order and perform a "DLL Search Order Hijacking" attack
references:
    - https://twitter.com/cyb3rops/status/1552932770464292864
    - https://www.wietzebeukema.nl/blog/hijacking-dlls-in-windows
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-30
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1574.001
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|startswith:
            - C:\Windows \
            - C:\Program Files \
            - C:\Program Files (x86) \
        TargetFilename|endswith: .dll
    condition: file_event and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
