title: Creation Of Non-Existent DLLs In System Folders
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/12/01
description: Detects the creation of system dlls that are not present on the system.
    Usualy to achieve dll hijacking
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - C:\Windows\System32\WLBSCTRL.dll
        - C:\Windows\System32\TSMSISrv.dll
        - C:\Windows\System32\TSVIPSrv.dll
        - C:\Windows\System32\wow64log.dll
    SELECTION_4:
        Image: C:\Windows\System32\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: df6ecb8b-7822-4f4b-b412-08f524b4576c
level: medium
logsource:
    category: file_event
    product: windows
modified: 2022/12/09
references:
- https://decoded.avast.io/martinchlumecky/png-steganography/
- https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
- https://clement.notin.org/blog/2020/09/12/CVE-2020-7315-McAfee-Agent-DLL-injection/
- https://github.com/Wh04m1001/SysmonEoP
- https://www.hexacorn.com/blog/2013/12/08/beyond-good-ol-run-key-part-5/
related:
-   id: 6b98b92b-4f00-4f62-b4fe-4d1920215771
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

