title: Suspicious File Drop by Exchange
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/10/04
description: Detects suspicious file type dropped by an Exchange component in IIS
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\w3wp.exe'
    SELECTION_4:
        CommandLine: '*MSExchange*'
    SELECTION_5:
        TargetFilename:
        - '*.aspx'
        - '*.asp'
        - '*.ashx'
        - '*.ps1'
        - '*.bat'
        - '*.exe'
        - '*.dll'
        - '*.vbs'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 6b269392-9eba-40b5-acb6-55c882b20ba6
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
- https://www.gteltsc.vn/blog/canh-bao-chien-dich-tan-cong-su-dung-lo-hong-zero-day-tren-microsoft-exchange-server-12714.html
- https://en.gteltsc.vn/blog/cap-nhat-nhe-ve-lo-hong-bao-mat-0day-microsoft-exchange-dang-duoc-su-dung-de-tan-cong-cac-to-chuc-tai-viet-nam-9685.html
related:
-   id: bd1212e5-78da-431e-95fa-c58e3237a8e6
    type: similar
status: experimental
tags:
- attack.persistence
- attack.t1190
- attack.initial_access
- attack.t1505.003

