title: WinSxS Executable File Creation By Non-System Process
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/11
description: Detects the creation of binaries in the WinSxS folder by non-system processes
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: C:\Windows\WinSxS\\*
    SELECTION_4:
        TargetFilename: '*.exe'
    SELECTION_5:
        Image:
        - C:\Windows\Systems32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5)))
falsepositives:
- Unknown
id: 34746e8c-5fb8-415a-b135-0abc167e912a
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://media.defense.gov/2023/May/09/2003218554/-1/-1/0/JOINT_CSA_HUNTING_RU_INTEL_SNAKE_MALWARE_20230509.PDF
related:
-   id: 64827580-e4c3-4c64-97eb-c72325d45399
    type: derived
status: experimental
tags:
- attack.execution

