title: Creation of WerFault.exe/Wer.dll in Unusual Folder
id: 9b429517-f998-5ff2-0d42-88171bd63546
related:
    - id: 28a452f3-786c-4fd8-b8f2-bddbe9d616d1
      type: derived
status: test
description: Detects the creation of a file named "WerFault.exe" or "wer.dll" in an uncommon folder, which could be a sign of WerFault DLL hijacking.
references:
    - https://www.bleepingcomputer.com/news/security/hackers-are-now-hiding-malware-in-windows-event-logs/
author: frack113
date: 2022-05-09
modified: 2025-12-03
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.defense-evasion
    - attack.t1574.001
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|endswith:
            - \WerFault.exe
            - \wer.dll
    filter_main_known_locations:
        TargetFilename|startswith:
            - C:\Windows\SoftwareDistribution\
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
            - C:\Windows\UUS\arm64\
    condition: file_event and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
