title: Potential Privilege Escalation Attempt Via Wermgr.Exe.Local
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/12/16
description: Detects potential privilege escalation attempt via the creation of the
    "Wermgr.Exe.Local" folder inside the "System32" directory in order to sideload
    "comctl32.dll"
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: C:\windows\system32\wermgr.exe.local\\*
    SELECTION_4:
        TargetFilename: '*\comctl32.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 07a99744-56ac-40d2-97b7-2095967b0e03
level: high
logsource:
    category: file_event
    product: windows
references:
- https://github.com/binderlabs/DirCreate2System
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation

