title: VsCode Powershell Profile Modification
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/24
description: Detects the creation or modification of a vscode related powershell profile
    which could indicate suspicious activity as the profile can be used as a mean
    of persistence
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\Microsoft.VSCode_profile.ps1'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use of the profile by developers or administrators
id: 3a9fa2ec-30bc-4ebd-b49e-7c9cff225502
level: medium
logsource:
    category: file_event
    product: windows
modified: 2023/01/06
references:
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_profiles?view=powershell-7.2
related:
-   id: b5b78988-486d-4a80-b991-930eff3ff8bf
    type: similar
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.013

