title: Windows Binaries Write Suspicious Extensions
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/12
description: Detects windows executables that writes files with suspicious extensions
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\rundll32.exe'
        - '*\smss.exe'
        - '*\RuntimeBroker.exe'
        - '*\sihost.exe'
        - '*\lsass.exe'
        - '*\csrss.exe'
        - '*\winlogon.exe'
        - '*\wininit.exe'
    SELECTION_4:
        TargetFilename:
        - '*.bat'
        - '*.vbe'
        - '*.txt'
        - '*.vbs'
        - '*.exe'
        - '*.ps1'
        - '*.hta'
        - '*.iso'
        - '*.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: b8fd0e93-ff58-4cbd-8f48-1c114e342e62
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/09/27
references:
- Internal Research
related:
-   id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
    type: derived
status: experimental

