title: Windows Shell/Scripting Application File Write to Suspicious Folder
id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
status: experimental
description: Detects Windows shells and scripting applications that write files to
    suspicious folders
references:
    - Internal Research
author: Florian Roth (Nextron Systems)
date: 2021/11/20
modified: 2023/03/29
tags:
    - attack.execution
    - attack.t1059
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_1:
        Image|endswith:
            - \bash.exe
            - \cmd.exe
            - \cscript.exe
            - \msbuild.exe
            - \powershell.exe
            - \pwsh.exe
            - \sh.exe
            - \wscript.exe
        TargetFilename|startswith:
            - C:\PerfLogs\
            - C:\Users\Public\
    selection_2:
        Image|endswith:
            - \certutil.exe
            - \forfiles.exe
            - \mshta.exe
            - \schtasks.exe
            - \scriptrunner.exe
            - \wmic.exe
        TargetFilename|contains:
            - C:\PerfLogs\
            - C:\Users\Public\
            - C:\Windows\Temp\
    condition: file_event and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
