title: Suspicious Interactive PowerShell as SYSTEM
id: e6264f91-2ab1-2e4d-ce48-420718a489c1
related:
    - id: 5b40a734-99b6-4b98-a1d0-1cea51a08ab2
      type: derived
status: test
description: Detects the creation of files that indicator an interactive use of PowerShell in the SYSTEM user context
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/PowerSploit_Invoke-Mimikatz.htm
author: Florian Roth (Nextron Systems)
date: '2021-12-07'
modified: '2022-08-13'
tags:
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename:
            - C:\Windows\System32\config\systemprofile\AppData\Roaming\Microsoft\Windows\PowerShell\PSReadLine\ConsoleHost_history.txt
            - C:\Windows\System32\config\systemprofile\AppData\Local\Microsoft\Windows\PowerShell\StartupProfileData-Interactive
    condition: file_event and selection
falsepositives:
    - Administrative activity
    - PowerShell scripts running as SYSTEM user
level: high
ruletype: Sigma
