title: Potential Winnti Dropper Activity
id: 130c9e58-28ac-4f83-8574-0a4cc913b97e
status: test
description: Detects files dropped by Winnti as described in RedMimicry Winnti playbook
references:
    - https://redmimicry.com/posts/redmimicry-winnti/#dropper
author: Alexander Rausch
date: 2020/06/24
modified: 2023/01/05
tags:
    - attack.defense_evasion
    - attack.t1027
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|endswith:
            - \gthread-3.6.dll
            - \sigcmm-2.4.dll
            - \Windows\Temp\tmp.bat
    condition: file_event and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
