title: NTDS.DIT Creation By Uncommon Process
ruletype: Sigma
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/11
description: Detects creation of a file named "ntds.dit" (Active Directory Database)
    by an uncommon process or a process located in a suspicious directory
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\ntds.dit'
    SELECTION_4:
        Image:
        - '*\cmd.exe'
        - '*\cscript.exe'
        - '*\mshta.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\wscript.exe'
        - '*\wsl.exe'
        - '*\wt.exe'
    SELECTION_5:
        Image:
        - '*\AppData\\*'
        - '*\Temp\\*'
        - '*\Public\\*'
        - '*\PerfLogs\\*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: 11b1ed55-154d-4e82-8ad7-83739298f720
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/07/14
references:
- https://stealthbits.com/blog/extracting-password-hashes-from-the-ntds-dit-file/
- https://adsecurity.org/?p=2398
related:
-   id: 4e7050dd-e548-483f-b7d6-527ab4fa784d
    type: similar
status: test
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.003

