title: Legitimate Application Dropped Script
id: 7d604714-e071-49ff-8726-edeb95a70679
status: experimental
description: Detects programs on a Windows system that should not write scripts to
    disk
references:
    - https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
author: frack113, Florian Roth (Nextron Systems)
date: 2022/08/21
modified: 2023/06/22
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    product: windows
    category: file_event
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith:
            - \eqnedt32.exe
            - \wordpad.exe
            - \wordview.exe
            - \certutil.exe
            - \certoc.exe
            - \CertReq.exe
            - \Desktopimgdownldr.exe
            - \esentutl.exe
            - \mshta.exe
            - \AcroRd32.exe
            - \RdrCEF.exe
            - \hh.exe
            - \finger.exe
        TargetFilename|endswith:
            - .ps1
            - .bat
            - .vbs
            - .scf
            - .wsf
            - .wsh
    condition: file_event and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
