title: BloodHound Collection Files
ruletype: Sigma
author: C.J. May
date: 2022/08/09
description: Detects default file names outputted by the BloodHound collection tool
    SharpHound
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*BloodHound.zip'
        - '*_computers.json'
        - '*_containers.json'
        - '*_domains.json'
        - '*_gpos.json'
        - '*_groups.json'
        - '*_ous.json'
        - '*_users.json'
    SELECTION_4:
        Image: '*\svchost.exe'
    SELECTION_5:
        TargetFilename: C:\Program Files\WindowsApps\Microsoft.*
    SELECTION_6:
        TargetFilename: '*\pocket_containers.json'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5 and SELECTION_6)))
falsepositives:
- Some false positives may arise in some environment and this may require some tuning.
    Add addional filters or reduce level depending on the level of noise
id: 02773bed-83bf-469f-b7ff-e676e7d78bab
level: high
logsource:
    category: file_event
    product: windows
modified: 2023/03/29
references:
- https://academy.hackthebox.com/course/preview/active-directory-bloodhound/bloodhound--data-collection
status: experimental
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001

