title: Potential Persistence Via Outlook Form
ruletype: Sigma
author: Tobias Michalski (Nextron Systems)
date: 2021/06/10
description: Detects the creation of a new Outlook form which can contain malicious
    code
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\outlook.exe'
    SELECTION_4:
        TargetFilename:
        - '*\AppData\Local\Microsoft\FORMS\IPM*'
        - '*\Local Settings\Application Data\Microsoft\Forms*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of outlook forms
id: c3edc6a5-d9d4-48d8-930e-aab518390917
level: high
logsource:
    category: file_event
    product: windows
modified: 2023/02/22
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=76
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=79
- https://learn.microsoft.com/en-us/office/vba/outlook/concepts/outlook-forms/create-an-outlook-form
- https://www.slipstick.com/developer/custom-form/clean-outlooks-forms-cache/
status: experimental
tags:
- attack.persistence
- attack.t1137.003

