title: Office Macro File Download
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/23
description: Detects the creation of a new office macro files on the systems via an
    application (browser, mail client).
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\outlook.exe'
        - '*\thunderbird.exe'
        - '*\HxOutlook.exe'
        - '*\brave.exe'
        - '*\chrome.exe'
        - '*\firefox.exe'
        - '*\iexplorer.exe'
        - '*\microsoftedge.exe'
        - '*\microsoftedgecp.exe'
        - '*\msedge.exe'
        - '*\opera.exe'
    SELECTION_4:
        TargetFilename:
        - '*.docm'
        - '*.dotm'
        - '*.xlsm'
        - '*.xltm'
        - '*.potm'
        - '*.pptm'
    SELECTION_5:
        TargetFilename:
        - '*.docm:Zone*'
        - '*.dotm:Zone*'
        - '*.xlsm:Zone*'
        - '*.xltm:Zone*'
        - '*.potm:Zone*'
        - '*.pptm:Zone*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Legitimate macro files downloaded from the internet
- Legitimate macro files sent as attachemnts via emails
id: 0e29e3a7-1ad8-40aa-b691-9f82ecd33d66
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
- https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
related:
-   id: 91174a41-dc8f-401b-be89-7bfc140612a0
    type: similar
status: experimental
tags:
- attack.initial_access
- attack.t1566.001

