title: Files With System Process Name In Unsuspected Locations
ruletype: Sigma
author: Sander Wiebing, Tim Shelton, Nasreddine Bencherchali
date: 2020/05/26
description: Detects the creation of an executable with a system process name in folders
    other than the system ones (System32, SysWOW64...etc).
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_10:
        Image: '*:\Windows\system32\svchost.exe'
    SELECTION_11:
        TargetFilename: C:\Windows\SoftwareDistribution\Download\\*
    SELECTION_12:
        TargetFilename:
        - '*\spoolsv.exe'
        - '*\bcdedit.exe'
    SELECTION_13:
        Image: '*:\Windows\system32\svchost.exe'
    SELECTION_14:
        TargetFilename: C:Program Files\WindowsApps\\*
    SELECTION_15:
        Image: C:\Windows\System32\wuauclt.exe
    SELECTION_16:
        TargetFilename: C:\Windows\explorer.exe
    SELECTION_17:
        Image: C:\WINDOWS\system32\msiexec.exe
    SELECTION_18:
        TargetFilename: C:\Program Files\PowerShell\7\pwsh.exe
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\AtBroker.exe'
        - '*\audiodg.exe'
        - '*\backgroundTaskHost.exe'
        - '*\bcdedit.exe'
        - '*\bitsadmin.exe'
        - '*\cmdl32.exe'
        - '*\cmstp.exe'
        - '*\conhost.exe'
        - '*\csrss.exe'
        - '*\dasHost.exe'
        - '*\dfrgui.exe'
        - '*\dllhost.exe'
        - '*\dwm.exe'
        - '*\eventcreate.exe'
        - '*\eventvwr.exe'
        - '*\explorer.exe'
        - '*\extrac32.exe'
        - '*\fontdrvhost.exe'
        - '*\ipconfig.exe'
        - '*\iscsicli.exe'
        - '*\iscsicpl.exe'
        - '*\logman.exe'
        - '*\LogonUI.exe'
        - '*\LsaIso.exe'
        - '*\lsass.exe'
        - '*\lsm.exe'
        - '*\msiexec.exe'
        - '*\msinfo32.exe'
        - '*\mstsc.exe'
        - '*\nbtstat.exe'
        - '*\odbcconf.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\regini.exe'
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\RuntimeBroker.exe'
        - '*\schtasks.exe'
        - '*\SearchFilterHost.exe'
        - '*\SearchIndexer.exe'
        - '*\SearchProtocolHost.exe'
        - '*\SecurityHealthService.exe'
        - '*\SecurityHealthSystray.exe'
        - '*\services.exe'
        - '*\ShellAppRuntime.exe'
        - '*\sihost.exe'
        - '*\smartscreen.exe'
        - '*\smss.exe'
        - '*\spoolsv.exe'
        - '*\svchost.exe'
        - '*\SystemSettingsBroker.exe'
        - '*\taskhost.exe'
        - '*\taskhostw.exe'
        - '*\Taskmgr.exe'
        - '*\TiWorker.exe'
        - '*\vssadmin.exe'
        - '*\w32tm.exe'
        - '*\WerFault.exe'
        - '*\WerFaultSecure.exe'
        - '*\wermgr.exe'
        - '*\wevtutil.exe'
        - '*\wininit.exe'
        - '*\winlogon.exe'
        - '*\winrshost.exe'
        - '*\WinRTNetMUAHostServer.exe'
        - '*\wlanext.exe'
        - '*\wlrmdr.exe'
        - '*\WmiPrvSE.exe'
        - '*\wslhost.exe'
        - '*\WSReset.exe'
        - '*\WUDFHost.exe'
        - '*\WWAHost.exe'
    SELECTION_4:
        TargetFilename:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
        - C:\Windows\SoftwareDistribution\\*
        - \SystemRoot\System32\\*
    SELECTION_5:
        Image:
        - '*\Windows\System32\dism.exe'
        - '*\TiWorker.exe'
    SELECTION_6:
        TargetFilename: C:\$WINDOWS.~BT\\*
    SELECTION_7:
        Image: C:\$WINDOWS.~BT\Sources\SetupHost.exe
    SELECTION_8:
        TargetFilename: '*\RuntimeBroker.exe'
    SELECTION_9:
        Image: C:\Windows\system32\wbengine.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14)
        or (SELECTION_15) or (SELECTION_16) or (SELECTION_17 and SELECTION_18)))
falsepositives:
- System processes copied outside their default folders for testing purposes
- Third party software naming their software with the same names as the processes
    mentioned here
fields:
- Image
id: d5866ddf-ce8f-4aea-b28e-d96485a20d3d
level: high
logsource:
    category: file_event
    product: windows
modified: 2023/01/24
status: test
tags:
- attack.defense_evasion
- attack.t1036.005

