title: Publisher Attachment File Dropped In Suspicious Location
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/08
description: Detects creation of files with the ".pub" extension in suspicious or
    uncommon locations. This could be a sign of attackers abusing Publisher documents
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\AppData\Local\Temp\\*'
        - '*\Users\Public\\*'
        - '*\Windows\Temp\\*'
        - '*C:\Temp\\*'
    SELECTION_4:
        TargetFilename: '*.pub'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate usage of ".pub" files from those locations
id: 3d2a2d59-929c-4b78-8c1a-145dfe9e07b1
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://twitter.com/EmericNasi/status/1623224526220804098
status: experimental
tags:
- attack.defense_evasion

