title: SCR File Write Event
ruletype: Sigma
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: 2022/04/27
description: Detects the creation of screensaver files (.scr) outside of system folders.
    Attackers may execute an application as an ".SCR" file using "rundll32.exe desk.cpl,InstallScreenSaver"
    for example.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*.scr'
    SELECTION_4:
        TargetFilename:
        - C:\$WINDOWS.~BT\NewOS\\*
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
        - :\WUDownloadCache\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- The installation of new screen savers by third party software
id: c048f047-7e2a-4888-b302-55f509d4a91d
level: medium
logsource:
    category: file_event
    product: windows
modified: 2023/02/23
references:
- https://lolbas-project.github.io/lolbas/Libraries/Desk/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011

