title: Potential Winnti Dropper Activity
ruletype: Sigma
author: Alexander Rausch
date: 2020/06/24
description: Detects files dropped by Winnti as described in RedMimicry Winnti playbook
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\gthread-3.6.dll'
        - '*\sigcmm-2.4.dll'
        - '*\Windows\Temp\tmp.bat'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 130c9e58-28ac-4f83-8574-0a4cc913b97e
level: high
logsource:
    category: file_event
    product: windows
modified: 2023/01/05
references:
- https://redmimicry.com/posts/redmimicry-winnti/#dropper
status: test
tags:
- attack.defense_evasion
- attack.t1027

