title: PDF File Created By RegEdit.EXE
id: 63e9a6a1-c3dc-7dfe-227d-0920f35e32d7
related:
    - id: 145095eb-e273-443b-83d0-f9b519b7867b
      type: derived
status: test
description: |
    Detects the creation of a file with the ".pdf" extension by the "RegEdit.exe" process.
    This indicates that a user is trying to print/save a registry key as a PDF in order to potentially extract sensitive information and bypass defenses.
references:
    - https://sensepost.com/blog/2024/dumping-lsa-secrets-a-story-about-task-decorrelation/
author: Nasreddine Bencherchali (Nextron Systems)
date: '2024-07-08'
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \regedit.exe
        TargetFilename|endswith: .pdf
    condition: file_event and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
