
title: Removal of Potential COM Hijacking Registry Keys
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection to trigger for processes removing .*\shell\open\command
  registry keys. Registry keys that might have been used for COM hijacking activities.
detection:
  SELECTION_1:
    EventType: DeleteKey
  SELECTION_2:
    TargetObject: '*\shell\open\command'
  SELECTION_3:
    NewProcessName: C:\Windows\system32\svchost.exe
  SELECTION_4:
    NewProcessName:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_5:
    NewProcessName: '*\OfficeClickToRun.exe'
  SELECTION_6:
    NewProcessName: C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  SELECTION_7:
    NewProcessName: '*\Dropbox.exe'
  SELECTION_8:
    TargetObject: HKCR\Dropbox.*
  condition: ((SELECTION_1 and SELECTION_2) and  not ((SELECTION_3) or (SELECTION_4
    and SELECTION_5) or (SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 96f697b0-b499-4e5d-9908-a67bec11cdb6
level: medium
logsource:
  category: registry_delete
  product: windows
modified: 2022/03/26
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/7
- https://threathunterplaybook.com/evals/apt29/detections/3.C.1_22A46621-7A92-48C1-81BF-B3937EB4FDC3.html
- https://docs.microsoft.com/en-us/windows/win32/shell/launch
- https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand
- https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code
status: test
tags:
- attack.defense_evasion
- attack.t1112
