title: AppX Package Installation Attempts Via AppInstaller
id: 7cff77e1-9663-46a3-8260-17f2e1aa9d0a
status: test
description: AppInstaller.exe is spawned by the default handler for the "ms-appinstaller"
    URI. It attempts to load/install a package from the referenced URL
references:
    - https://twitter.com/notwhickey/status/1333900137232523264
    - https://lolbas-project.github.io/lolbas/Binaries/AppInstaller/
author: frack113
date: 2021/11/24
modified: 2023/01/12
tags:
    - attack.command_and_control
    - attack.t1105
    - sysmon
logsource:
    product: windows
    category: dns_query
detection:
    dns_query:
        EventID: 22
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|startswith: C:\Program Files\WindowsApps\Microsoft.DesktopAppInstaller_
        Image|endswith: \AppInstaller.exe
    condition: dns_query and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
