title: DNS Query for Anonfiles.com Domain
ruletype: Sigma
author: pH-T
date: 2022/07/15
description: Detects DNS queries for anonfiles.com, which is an anonymous file upload
    platform often used for malicious purposes
detection:
    SELECTION_1:
        EventID: 22
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        QueryName: '*.anonfiles.com*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate access to anonfiles.com
id: 065cceea-77ec-4030-9052-fc0affea7110
level: high
logsource:
    category: dns_query
    product: windows
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
status: experimental
tags:
- attack.exfiltration
- attack.t1567.002

