title: Suspicious Cobalt Strike DNS Beaconing - Sysmon
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/11/09
description: Detects a program that invoked suspicious DNS queries known from Cobalt
    Strike beacons
detection:
    SELECTION_1:
        EventID: 22
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        QueryName:
        - aaa.stage.*
        - post.1*
    SELECTION_4:
        QueryName: '*.stage.123456.*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
id: f356a9c4-effd-4608-bbf8-408afd5cd006
level: critical
logsource:
    category: dns_query
    product: windows
modified: 2023/01/16
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
- https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
related:
-   id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
    type: similar
status: test
tags:
- attack.command_and_control
- attack.t1071.004

