title: DNS Query Tor .Onion Address - Sysmon
id: 29e2035f-b91f-3c35-9a7a-087b864f6d3b
related:
    - id: 8384bd26-bde6-4da9-8e5d-4174a7a47ca2
      type: similar
    - id: a8322756-015c-42e7-afb1-436e85ed3ff5
      type: similar
    - id: b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544
      type: derived
status: test
description: Detects DNS queries to an ".onion" address related to Tor routing networks
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
    - https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/ASimDNS/imDNS_TorProxies.yaml
author: frack113
date: 2022-02-20
modified: 2025-09-12
tags:
    - attack.command-and-control
    - attack.t1090.003
    - sysmon
logsource:
    product: windows
    category: dns_query
detection:
    dns_query:
        EventID: 22
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        QueryName|endswith:
            - .hiddenservice.net
            - .onion.ca
            - .onion.cab
            - .onion.casa
            - .onion.city
            - .onion.direct
            - .onion.dog
            - .onion.glass
            - .onion.gq
            - .onion.ink
            - .onion.it
            - .onion.link
            - .onion.lt
            - .onion.lu
            - .onion.nu
            - .onion.pet
            - .onion.plus
            - .onion.rip
            - .onion.sh
            - .onion.to
            - .onion.top
            - .onion
            - .s1.tor-gateways.de
            - .s2.tor-gateways.de
            - .s3.tor-gateways.de
            - .s4.tor-gateways.de
            - .s5.tor-gateways.de
            - .t2w.pw
            - .tor2web.ae.org
            - .tor2web.blutmagie.de
            - .tor2web.com
            - .tor2web.fi
            - .tor2web.io
            - .tor2web.org
            - .tor2web.xyz
            - .torlink.co
    condition: dns_query and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
