title: DNS Query Tor Onion Address - Sysmon
ruletype: Sigma
author: frack113
date: 2022/02/20
description: Detects DNS queries to an ".onion" address related to Tor routing networks
detection:
    SELECTION_1:
        EventID: 22
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        QueryName: '*.onion*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544
level: high
logsource:
    category: dns_query
    product: windows
modified: 2023/01/16
references:
- https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
related:
-   id: 8384bd26-bde6-4da9-8e5d-4174a7a47ca2
    type: similar
status: experimental
tags:
- attack.command_and_control
- attack.t1090.003

