title: Query Tor Onion Address
ruletype: Sigma
author: frack113
date: 2022/02/20
description: Detects DNS resolution of an .onion address related to Tor routing networks
detection:
    SELECTION_1:
        EventID: 22
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        QueryName: '*.onion*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: b55ca2a3-7cff-4dda-8bdd-c7bfa63bf544
level: high
logsource:
    category: dns_query
    product: windows
references:
- https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
status: experimental
tags:
- attack.command_and_control
- attack.t1090.003
yml_filename: dns_query_win_tor_onion.yml
yml_path: rules/windows/dns_query
---

