title: Win Defender Restored Quarantine File
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/06
description: Detects the restoration of files from the defender quarantine
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Defender/Operational
    SELECTION_2:
        EventID: 1009
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate administrator activity restoring a file
id: bc92ca75-cd42-4d61-9a37-9d5aa259c88b
level: high
logsource:
    product: windows
    service: windefend
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

