title: Windows Defender Real-Time Protection Failure/Restart
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), Christopher Peacock '@securepeacock'
    (Update)
date: 2023/03/28
description: Detects issues with Windows Defender Real-Time Protection features
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Defender/Operational
    SELECTION_2:
        EventID: 3002
    SELECTION_3:
        EventID: 3007
    SELECTION_4:
        Feature_Name: '%%886'
    SELECTION_5:
        Reason:
        - '%%892'
        - '%%858'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and  not ((SELECTION_4
        and SELECTION_5)))
falsepositives:
- Some crashes can occur sometimes and the event doesn't provide enough information
    to tune out these cases. Manual exception is required
id: dd80db93-6ec2-4f4c-a017-ad40da6ffe81
level: medium
logsource:
    product: windows
    service: windefend
modified: 2023/05/05
references:
- Internal Research
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
- https://gist.github.com/nasbench/33732d6705cbdc712fae356f07666346
status: stable
tags:
- attack.defense_evasion
- attack.t1562.001

