title: Windows Defender Exclusions Added
ruletype: Sigma
author: Christian Burkard
date: 2021/07/06
description: Detects the Setting of Windows Defender Exclusions
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Defender/Operational
    SELECTION_2:
        EventID: 5007
    SELECTION_3:
        NewValue: '*\Microsoft\Windows Defender\Exclusions*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrator actions
id: 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
level: medium
logsource:
    product: windows
    service: windefend
modified: 2022/02/02
references:
- https://twitter.com/_nullbind/status/1204923340810543109
status: stable
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: win_defender_exclusions.yml
yml_path: rules/windows/builtin/windefend
---

