title: Windows Defender Threat Detected
id: 57b649ef-ff42-4fb0-8bf6-62da243a1708
status: stable
description: Detects actions taken by Windows Defender malware detection engines
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
author: "J\xE1n Tren\u010Dansk\xFD"
date: 2020/07/28
tags:
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    service: windefend
detection:
    windefend:
        Channel: Microsoft-Windows-Windows Defender/Operational
    selection:
        EventID:
            - 1006
            - 1015
            - 1116
            - 1117
    condition: windefend and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
