title: Windows Defender Real-Time Protection Failure/Restart
id: dd80db93-6ec2-4f4c-a017-ad40da6ffe81
status: stable
description: Detects issues with Windows Defender Real-Time Protection features
references:
    - Internal Research
    - https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
    - https://gist.github.com/nasbench/33732d6705cbdc712fae356f07666346
author: Nasreddine Bencherchali (Nextron Systems), Christopher Peacock '@securepeacock'
    (Update)
date: 2023/03/28
modified: 2023/05/05
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    product: windows
    service: windefend
detection:
    windefend:
        Channel: Microsoft-Windows-Windows Defender/Operational
    selection:
        EventID:
            - 3002
            - 3007
    filter_optional_network_inspection:
        Feature_Name: '%%886'
        Reason:
            - '%%892'
            - '%%858'
    condition: windefend and (selection and not 1 of filter_optional_*)
falsepositives:
    - Some crashes can occur sometimes and the event doesn't provide enough information
        to tune out these cases. Manual exception is required
level: medium
ruletype: Sigma
