title: Microsoft Defender Tamper Protection Trigger
ruletype: Sigma
author: Bhabesh Raj, Nasreddine Bencherchali
date: 2021/07/05
description: Detects blocked attempts to change any of Defender's settings such as
    "Real Time Monitoring" and "Behavior Monitoring"
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Defender/Operational
    SELECTION_2:
        EventID: 5013
    SELECTION_3:
        Value:
        - '*\Windows Defender\DisableAntiSpyware'
        - '*\Windows Defender\DisableAntiVirus'
        - '*\Windows Defender\Scan\DisableArchiveScanning'
        - '*\Windows Defender\Scan\DisableScanningNetworkFiles'
        - '*\Real-Time Protection\DisableRealtimeMonitoring'
        - '*\Real-Time Protection\DisableBehaviorMonitoring'
        - '*\Real-Time Protection\DisableIOAVProtection'
        - '*\Real-Time Protection\DisableScriptScanning'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrator might try to disable defender features during testing (must be investigated)
id: 49e5bc24-8b86-49f1-b743-535f332c2856
level: high
logsource:
    product: windows
    service: windefend
modified: 2022/12/06
references:
- https://bhabeshraj.com/post/tampering-with-microsoft-defenders-tamper-protection
- https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus?view=o365-worldwide
status: stable
tags:
- attack.defense_evasion
- attack.t1562.001

