title: Shell Context Menu Command Tampering
id: 1ce6a719-c7b0-11e7-2b9f-37facf10d1d4
related:
    - id: 868df2d1-0939-4562-83a7-27408c4a1ada
      type: derived
status: test
description: Detects changes to shell context menu commands. Use this rule to hunt for potential anomalies and suspicious shell commands.
references:
    - https://mrd0x.com/sentinelone-persistence-via-menu-context/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024-03-06
tags:
    - attack.persistence
    - detection.threat-hunting
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains|all:
            - \Software\Classes\
            - \shell\
            - \command\
    condition: registry_set and selection
falsepositives:
    - Likely from new software installation suggesting to add context menu items. Such as "PowerShell", "Everything", "Git", etc.
level: low
ruletype: Sigma
