title: Microsoft Office Trusted Location Updated
id: d4bfa0d5-6f83-cac0-c838-2d05d677611f
related:
    - id: f742bde7-9528-42e5-bd82-84f51a8387d2
      type: similar
    - id: a0bed973-45fa-4625-adb5-6ecdf9be70ac
      type: derived
status: test
description: Detects changes to the registry keys related to "Trusted Location" of Microsoft Office. Attackers might add additional trusted locations to avoid macro security restrictions.
references:
    - https://admx.help/?Category=Office2016&Policy=excel16.Office.Microsoft.Policies.Windows::L_TrustedLoc01
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-21
modified: 2023-08-17
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1112
    - detection.threat-hunting
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: Security\Trusted Locations\Location
        ObjectName|endswith: \Path
    filter_main_office_click_to_run:
        ProcessName|contains: :\Program Files\Common Files\Microsoft Shared\ClickToRun\
        ProcessName|endswith: \OfficeClickToRun.exe
    filter_main_office_apps:
        ProcessName|contains:
            - :\Program Files\Microsoft Office\
            - :\Program Files (x86)\Microsoft Office\
    condition: registry_set and (selection and not 1 of filter_main_*)
falsepositives:
    - During office installations or setup, trusted locations are added, which will trigger this rule.
level: medium
ruletype: Sigma
