title: Execution via CL_Mutexverifiers.ps1 (2 Lines)
id: 6609c444-9670-4eab-9636-fe4755a851ce
status: unsupported
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1 module
references:
    - https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
    - https://twitter.com/pabraeken/status/995111125447577600
author: oscd.community, Natalia Shornikova
date: 2020/10/14
modified: 2023/02/24
tags:
    - attack.defense_evasion
    - attack.t1216
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains:
            - CL_Mutexverifiers.ps1
            - runAfterCancelProcess
    condition: (ps_script and selection) | count(ScriptBlockText) by Computer > 2
falsepositives:
    - Unknown
level: high
ruletype: Sigma
