title: Invalid Users Failing To Authenticate From Source Using Kerberos
id: 74eaa0ee-05a7-86a5-a7a8-076952aa764d
related:
    - id: bc93dfe6-8242-411e-a2dd-d16fa0cc8564
      type: derived
status: unsupported
description: Detects failed logins with multiple invalid domain accounts from a single source system using the Kerberos protocol.
references:
    - https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
author: Mauricio Velazco, frack113
date: 2021-06-01
modified: 2023-03-13
tags:
    - attack.t1110.003
    - attack.initial-access
    - attack.privilege-escalation
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 4768
        Status: '0x6'
    filter_computer:
        TargetUserName|endswith: $
    timeframe: 24h
    condition: (security and selection and not filter_computer) | count(TargetUserName) by IpAddress > 10
falsepositives:
    - Vulnerability scanners
    - Misconfigured systems
    - Remote administration tools
    - VPN terminators
    - Multiuser systems like Citrix server farms
level: medium
ruletype: Sigma
