title: Valid Users Failing to Authenticate from Single Source Using NTLM
id: ddbbe639-21f9-7b39-ae7d-821e490d6130
related:
    - id: f88bab7f-b1f4-41bb-bdb1-4b8af35b0470
      type: derived
status: unsupported
description: Detects failed logins with multiple valid domain accounts from a single source system using the NTLM protocol.
references:
    - https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
author: Mauricio Velazco
date: 2021-06-01
modified: 2023-03-13
tags:
    - attack.t1110.003
    - attack.initial-access
    - attack.privilege-escalation
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection1:
        EventID: 4776
        Status: '*0xC000006A' #Account logon with misspelled or bad password.
    filter:
        TargetUserName: '*$'
    timeframe: 24h
    condition: (security and selection1 and not filter) | count(TargetUserName) by Workstation > 10
falsepositives:
    - Terminal servers
    - Jump servers
    - Other multiuser systems like Citrix server farms
    - Workstations with frequently changing users
level: medium
ruletype: Sigma
