title: Metasploit Or Impacket Service Installation Via SMB PsExec
ruletype: Sigma
author: Bartlomiej Czyz, Relativity
date: 2021/01/21
description: Detects usage of Metasploit SMB PsExec (exploit/windows/smb/psexec) and
    Impacket psexec.py by triggering on specific service installation
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath|re: ^%systemroot%\\[a-zA-Z]{8}\.exe$
    SELECTION_5:
        ServiceName|re: (^[a-zA-Z]{4}$)|(^[a-zA-Z]{8}$)|(^[a-zA-Z]{16}$)
    SELECTION_6:
        StartType: '3'
    SELECTION_7:
        ServiceType: '0x10'
    SELECTION_8:
        ServiceName: PSEXESVC
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7) and  not (SELECTION_8))
falsepositives:
- Possible, different agents with a 8 character binary and a 4, 8 or 16 character
    service name
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
- ServiceName
- ServiceFileName
id: 1a17ce75-ff0d-4f02-9709-2b7bb5618cf0
level: high
logsource:
    product: windows
    service: system
modified: 2022/03/21
references:
- https://bczyz1.github.io/2021/01/30/psexec.html
status: unsupported
tags:
- attack.lateral_movement
- attack.t1021.002
- attack.t1570
- attack.execution
- attack.t1569.002

