title: IIS WebServer Access Logs Deleted
id: 4677dda8-3549-b66f-f912-9869558eab0b
related:
    - id: 3eb8c339-a765-48cc-a150-4364c04652bf
      type: derived
status: test
description: Detects the deletion of IIS WebServer access logs which may indicate an attempt to destroy forensic evidence
references:
    - https://www.elastic.co/guide/en/security/current/webserver-access-logs-deleted.html
author: Tim Rauch (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-16'
modified: '2023-02-15'
tags:
    - attack.defense-evasion
    - attack.t1070
    - sysmon
logsource:
    category: file_delete
    product: windows
detection:
    file_delete:
        EventID:
            - 23
            - 26
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|contains: \inetpub\logs\LogFiles\
        TargetFilename|endswith: .log
    condition: file_delete and selection
falsepositives:
    - During uninstallation of the IIS service
    - During log rotation
level: medium
ruletype: Sigma
