title: EventLog EVTX File Deleted
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/15
description: Detects the deletion of the event log files which may indicate an attempt
    to destroy forensic evidence
detection:
    SELECTION_1:
        EventID: 23
    SELECTION_2:
        EventID: 26
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        TargetFilename: C:\Windows\System32\winevt\Logs\\*
    SELECTION_5:
        TargetFilename: '*.evtx'
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 63c779ba-f638-40a0-a593-ddd45e8b1ddc
level: medium
logsource:
    category: file_delete
    product: windows
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.t1070

