title: Tomcat WebServer Logs Deleted
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/16
description: Detects the deletion of tomcat WebServer logs which may indicate an attempt
    to destroy forensic evidence
detection:
    SELECTION_1:
        EventID: 23
    SELECTION_2:
        EventID: 26
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        TargetFilename: '*\Tomcat*'
    SELECTION_5:
        TargetFilename: '*\logs\\*'
    SELECTION_6:
        TargetFilename:
        - '*catalina.*'
        - '*_access_log.*'
        - '*localhost.*'
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- During uninstallation of the tomcat server
- During log rotation
id: 270185ff-5f50-4d6d-a27f-24c3b8c9fef8
level: medium
logsource:
    category: file_delete
    product: windows
references:
- Internal Research
- https://linuxhint.com/view-tomcat-logs-windows/
status: experimental
tags:
- attack.defense_evasion
- attack.t1070

