title: Exchange PowerShell Cmdlet History Deleted
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/10/26
description: Detects the deletion of the Exchange PowerShell cmdlet History logs which
    may indicate an attempt to destroy forensic evidence
detection:
    SELECTION_1:
        EventID: 23
    SELECTION_2:
        EventID: 26
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        FileName: \Logging\CmdletInfra\LocalPowerShell\Cmdlet\\*
    SELECTION_5:
        FileName: '*_Cmdlet_*'
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Possible FP during log rotation
id: a55349d8-9588-4c5a-8e3b-1925fe2a4ffe
level: high
logsource:
    category: file_delete
    product: windows
references:
- https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
status: experimental
tags:
- attack.defense_evasion
- attack.t1070

