title: Process Deletion of Its Own Executable
id: 766801b0-43ea-0fe5-ea5c-5a63415dceea
related:
    - id: f01d1f70-cd41-42ec-9c0b-26dd9c22bf29
      type: derived
status: test
description: |
    Detects the deletion of a process's executable by itself. This is usually not possible without workarounds and may be used by malware to hide its traces.
references:
    - https://github.com/joaoviictorti/RustRedOps/tree/ce04369a246006d399e8c61d9fe0e6b34f988a49/Self_Deletion
author: Max Altgelt (Nextron Systems)
date: 2024-09-03
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    product: windows
    category: file_delete
detection:
    file_delete:
        EventID:
            - 23
            - 26
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|fieldref: Image
    condition: file_delete and selection
falsepositives:
    - Some false positives are to be expected from uninstallers.
level: medium
ruletype: Sigma
