title: Potential PrintNightmare Exploitation Attempt
id: 51f5b8fe-feb0-4cd7-d51e-ade8025b8655
related:
    - id: 5b2bbc47-dead-4ef7-8908-0cf73fcbecbf
      type: derived
status: test
description: Detect DLL deletions from Spooler Service driver folder. This might be a potential exploitation attempt of CVE-2021-1675
references:
    - https://web.archive.org/web/20210629055600/https://github.com/hhlxf/PrintNightmare/
    - https://github.com/cube0x0/CVE-2021-1675
author: Bhabesh Raj
date: 2021-07-01
modified: 2023-02-17
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574
    - cve.2021-1675
    - sysmon
logsource:
    category: file_delete
    product: windows
detection:
    file_delete:
        EventID:
            - 23
            - 26
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \spoolsv.exe
        TargetFilename|contains: C:\Windows\System32\spool\drivers\x64\3\
    condition: file_delete and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
