title: PowerShell Console History Logs Deleted
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/15
description: Detects the deletion of the PowerShell console History logs which may
    indicate an attempt to destroy forensic evidence
detection:
    SELECTION_1:
        EventID: 23
    SELECTION_2:
        EventID: 26
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        TargetFilename: '*\PSReadLine\ConsoleHost_history.txt'
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: ff301988-c231-4bd0-834c-ac9d73b86586
level: medium
logsource:
    category: file_delete
    product: windows
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.t1070

