title: EventLog EVTX File Deleted
id: 956a26a6-af21-94d6-9fb7-0abbe37e3c7d
related:
    - id: 63c779ba-f638-40a0-a593-ddd45e8b1ddc
      type: derived
status: test
description: Detects the deletion of the event log files which may indicate an attempt to destroy forensic evidence
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-15
tags:
    - attack.defense-evasion
    - attack.t1070
    - sysmon
logsource:
    category: file_delete
    product: windows
detection:
    file_delete:
        EventID:
            - 23
            - 26
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|startswith: C:\Windows\System32\winevt\Logs\
        TargetFilename|endswith: .evtx
    condition: file_delete and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
