title: Suspicious Scheduled Task Write to System32 Tasks
ruletype: Sigma
author: Florian Roth
date: 2021/11/16
description: Detects the creation of tasks from processes executed from suspicious
    locations
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\Windows\System32\Tasks*'
    SELECTION_4:
        Image:
        - '*\AppData\\*'
        - '*C:\PerfLogs*'
        - '*\Windows\System32\config\systemprofile*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 80e1f67a-4596-4351-98f5-a9c3efabac95
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/01/12
references:
- Internal Research
status: experimental
tags:
- attack.persistence
- attack.execution
- attack.t1053
yml_filename: file_event_win_susp_task_write.yml
yml_path: rules/windows/file_event
---

