title: Malicious DLL File Dropped in the Teams or OneDrive Folder
ruletype: Sigma
author: frack113
date: 2022/08/12
description: "Detects creation of a malicious DLL file in the location where the OneDrive\
    \ or Team applications\nUpon execution of the Teams or OneDrive application, the\
    \ dropped malicious DLL file (\u201Ciphlpapi.dll\u201D) is sideloaded\n"
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*iphlpapi.dll*'
    SELECTION_4:
        TargetFilename: '*\AppData\Local\Microsoft*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 1908fcc1-1b92-4272-8214-0fbaf2fa5163
level: high
logsource:
    category: file_event
    product: windows
references:
- https://blog.cyble.com/2022/07/27/targeted-attacks-being-carried-out-via-dll-sideloading/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.002
yml_filename: file_event_win_iphlpapi_dll_sideloading.yml
yml_path: rules/windows/file_event
---

