
title: Octopus Scanner Malware
ruletype: Sigma
author: NVISO
date: 2020/06/09
description: Detects Octopus Scanner Malware.
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetFilename:
    - '*\AppData\Local\Microsoft\Cache134.dat'
    - '*\AppData\Local\Microsoft\ExplorerSync.db'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 805c55d9-31e6-4846-9878-c34c75054fe9
level: high
logsource:
  category: file_event
  product: windows
modified: 2021/11/27
references:
- https://securitylab.github.com/research/octopus-scanner-malware-open-source-supply-chain
status: test
tags:
- attack.t1195
- attack.t1195.001
