title: Windows Webshell Creation
ruletype: Sigma
author: Beyu Denis, oscd.community, Tim Shelton
date: 2019/10/22
description: Possible webshell file creation on a static web site
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_10:
        TargetFilename: '*.jsp'
    SELECTION_11:
        TargetFilename: '*\cgi-bin\\*'
    SELECTION_12:
        TargetFilename: '*.pl*'
    SELECTION_13:
        TargetFilename:
        - '*\AppData\Local\Temp\\*'
        - '*\Windows\Temp\\*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: System
    SELECTION_4:
        TargetFilename: '*\inetpub\wwwroot\\*'
    SELECTION_5:
        TargetFilename:
        - '*.asp*'
        - '*.ashx*'
        - '*.ph*'
    SELECTION_6:
        TargetFilename:
        - '*\AppData\Local\Temp\\*'
        - '*\Windows\Temp\\*'
    SELECTION_7:
        TargetFilename:
        - '*\www\\*'
        - '*\htdocs\\*'
        - '*\html\\*'
    SELECTION_8:
        TargetFilename: '*.ph*'
    SELECTION_9:
        TargetFilename:
        - '*\AppData\Local\Temp\\*'
        - '*\Windows\Temp\\*'
    condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3) and ((((SELECTION_4
        and SELECTION_5) and  not (SELECTION_6)) or ((SELECTION_7 and SELECTION_8)
        and  not (SELECTION_9))) or ((SELECTION_10 or (SELECTION_11 and SELECTION_12))
        and  not (SELECTION_13))))
falsepositives:
- Legitimate administrator or developer creating legitimate executable files in a
    web application folder
id: 39f1f9f2-9636-45de-98f6-a4046aa8e4b9
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/05/24
references:
- PT ESC rule and personal experience
status: test
tags:
- attack.persistence
- attack.t1505.003
yml_filename: file_event_win_webshell_creation_detect.yml
yml_path: rules/windows/file_event
---

