
title: Windows Shell File Write to Suspicious Folder
ruletype: Sigma
author: Florian Roth
date: 2021/11/20
description: Detects a Windows executable that writes files to suspicious folders
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\cmd.exe'
    - '*\powershell.exe'
    - '*\pwsh.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\msbuild.exe'
    - '*\certutil.exe'
  SELECTION_4:
    TargetFilename:
    - '*C:\Users\Public*'
    - '*C:\PerfLogs*'
  SELECTION_5:
    Image:
    - '*\schtasks.exe'
    - '*\wmic.exe'
    - '*\mshta.exe'
    - '*\forfiles.exe'
    - '*\scriptrunner.exe'
    - '*\certutil.exe'
  SELECTION_6:
    TargetFilename:
    - '*C:\Users\Public*'
    - '*C:\PerfLogs*'
    - '*\AppData\\*'
    - '*C:\Windows\Temp*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 1277f594-a7d1-4f28-a2d3-73af5cbeab43
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/07/14
references:
- No references
status: experimental
