title: Creation of an Executable by an Executable
ruletype: Sigma
author: frack113
date: 2022/03/09
description: Detects the creation of an executable by another executable
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_10:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_11:
        TargetFilename:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_12:
        Image: C:\ProgramData\Microsoft\Windows Defender\\*
    SELECTION_13:
        TargetFilename: '*\Microsoft\WindowsApps\\*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*.exe'
    SELECTION_4:
        TargetFilename: '*.exe'
    SELECTION_5:
        Image:
        - C:\Windows\System32\msiexec.exe
        - C:\Windows\system32\cleanmgr.exe
        - C:\Windows\explorer.exe
        - C:\WINDOWS\system32\dxgiadaptercache.exe
        - C:\WINDOWS\system32\Dism.exe
        - C:\Windows\System32\wuauclt.exe
    SELECTION_6:
        Image: C:\WINDOWS\system32\svchost.exe
    SELECTION_7:
        TargetFilename: C:\Windows\SoftwareDistribution\Download\Install\\*
    SELECTION_8:
        Image: C:\Windows\WinSxS\\*
    SELECTION_9:
        Image: '*\TiWorker.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 or SELECTION_11) or (SELECTION_12) or (SELECTION_13)))
falsepositives:
- Software installers
- Update utilities
id: 297afac9-5d02-4138-8c58-b977bac60556
level: low
logsource:
    category: file_event
    product: windows
modified: 2022/07/27
references:
- Malware Sandbox
status: experimental
tags:
- attack.resource_development
- attack.t1587.001

