
title: SCR File Write Event
ruletype: Sigma
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: 2022/04/27
description: An attacker may execute an application as a .SCR File (Screensaver) using
  rundll32.exe desk.cpl,InstallScreenSaver
detection:
  SELECTION_1:
    EventID: 11
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetFilename: '*.scr'
  SELECTION_4:
    TargetFilename:
    - C:\Windows\System32\\*
    - C:\Windows\system32\\*
    - C:\Windows\SysWOW64\\*
    - C:\Windows\SysWow64\\*
    - C:\Windows\winsxs\\*
    - C:\Windows\WinSxS\\*
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- The installation of new screen savers.
id: c048f047-7e2a-4888-b302-55f509d4a91d
level: medium
logsource:
  category: file_event
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Libraries/Desk/
status: experimental
tags:
- attack.t1218.011
- attack.defense_evasion
