title: Suspicious ASPX File Drop by Exchange
ruletype: Sigma
author: Florian Roth (rule), MSTI (query, idea)
date: 2022/10/01
description: Detects suspicious file type dropped by an Exchange component in IIS
    into a suspicious folder
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\w3wp.exe'
    SELECTION_4:
        CommandLine: '*MSExchange*'
    SELECTION_5:
        TargetFilename:
        - '*FrontEnd\HttpProxy\\*'
        - '*\inetpub\wwwroot\aspnet_client\\*'
    SELECTION_6:
        TargetFilename:
        - '*.aspx'
        - '*.asp'
        - '*.ashx'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: bd1212e5-78da-431e-95fa-c58e3237a8e6
level: high
logsource:
    category: file_event
    product: windows
references:
- https://www.microsoft.com/security/blog/2022/09/30/analyzing-attacks-using-the-exchange-vulnerabilities-cve-2022-41040-and-cve-2022-41082/
- https://www.gteltsc.vn/blog/canh-bao-chien-dich-tan-cong-su-dung-lo-hong-zero-day-tren-microsoft-exchange-server-12714.html
- https://en.gteltsc.vn/blog/cap-nhat-nhe-ve-lo-hong-bao-mat-0day-microsoft-exchange-dang-duoc-su-dung-de-tan-cong-cac-to-chuc-tai-viet-nam-9685.html
status: experimental
tags:
- attack.persistence
- attack.t1505.003

