title: Creation of a Diagcab
ruletype: Sigma
author: frack113
date: 2022/06/08
description: Detects the creation of diagcab file, which could be caused by some legitimate
    installer or is a sign of exploitation (review the filename and its location)
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*.diagcab'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate microsoft diagcab
id: 3d0ed417-3d94-4963-a562-4a92c940656a
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://threadreaderapp.com/thread/1533879688141086720.html
status: experimental
tags:
- attack.resource_development

