title: Suspicious Files in Default GPO Folder
ruletype: Sigma
author: elhoim
date: 2022/04/28
description: Detects the creation of copy of suspicious files (EXE/DLL) to the default
    GPO storage folder
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\Policies\{31B2F340-016D-11D2-945F-00C04FB984F9}\\*'
    SELECTION_4:
        TargetFilename:
        - '*.dll'
        - '*.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 5f87308a-0a5b-4623-ae15-d8fa1809bc60
level: medium
logsource:
    category: file_event
    product: windows
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: experimental
tags:
- attack.t1036.005
- attack.defense_evasion
yml_filename: file_event_win_susp_default_gpo_dir_write.yml
yml_path: rules/windows/file_event
---

