title: Dump Office Macro Files from Commandline
ruletype: Sigma
author: frack113
date: 2022/01/23
description: A office file with macro is created from a commandline or a script
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*.docm'
        - '*.dotm'
        - '*.xlsm'
        - '*.xltm'
        - '*.potm'
        - '*.pptm'
        - '*.pptx'
    SELECTION_4:
        Image:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_5:
        ParentImage:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: b1c50487-1967-4315-a026-6491686d860e
level: medium
logsource:
    category: file_event
    product: windows
modified: 2022/07/14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1566.001/T1566.001.md
- https://docs.microsoft.com/en-us/deployoffice/compat/office-file-format-reference
status: experimental
tags:
- attack.initial_access
- attack.t1566.001
yml_filename: file_event_win_macro_file.yml
yml_path: rules/windows/file_event
---

