title: Suspicious Executable File Creation
ruletype: Sigma
author: frack113
date: 2022/09/05
description: Detect creation of suspicious executable file name. Some strings look
    for suspicious file extensions, others look for filenames that exploit unquoted
    service paths.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*.bat.exe'
        - '*.sys.exe'
    SELECTION_4:
        TargetFilename:
        - C:\$Recycle.Bin.exe
        - C:\Documents and Settings.exe
        - C:\MSOCache.exe
        - C:\Recovery.exe
        - C:\PerfLogs.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: 74babdd6-a758-4549-9632-26535279e654
level: high
logsource:
    category: file_event
    product: windows
references:
- https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
- https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564

