title: Windows Webshell Creation
ruletype: Sigma
author: Beyu Denis, oscd.community, Tim Shelton
date: 2019/10/22
description: Possible webshell file creation on a static web site
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\inetpub\wwwroot\\*'
    SELECTION_4:
        TargetFilename:
        - '*.asp*'
        - '*.ashx*'
        - '*.ph*'
    SELECTION_5:
        TargetFilename:
        - '*\www\\*'
        - '*\htdocs\\*'
        - '*\html\\*'
    SELECTION_6:
        TargetFilename: '*.ph*'
    SELECTION_7:
        TargetFilename:
        - '*\AppData\Local\Temp\\*'
        - '*\Windows\Temp\\*'
    SELECTION_8:
        Image: System
    SELECTION_9:
        TargetFilename: '*\xampp*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7) or (SELECTION_8) or
        (SELECTION_9)))
falsepositives:
- Legitimate administrator or developer creating legitimate executable files in a
    web application folder
id: 39f1f9f2-9636-45de-98f6-a4046aa8e4b9
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/09/18
references:
- PT ESC rule and personal experience
status: test
tags:
- attack.persistence
- attack.t1505.003

