title: Detection of SafetyKatz
ruletype: Sigma
author: Markus Neis
date: 2018/07/24
description: Detects possible SafetyKatz Behaviour
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\Temp\debug.bin'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: e074832a-eada-4fd7-94a1-10642b130e16
level: high
logsource:
    category: file_event
    product: windows
modified: 2021/11/27
references:
- https://github.com/GhostPack/SafetyKatz
status: test
tags:
- attack.credential_access
- attack.t1003.001
yml_filename: file_event_win_ghostpack_safetykatz.yml
yml_path: rules/windows/file_event
---

