title: UAC Bypass Abusing Winsat Path Parsing - File
ruletype: Sigma
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
    (UACMe 52)
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: C:\Users\\*
    SELECTION_4:
        TargetFilename:
        - '*\AppData\Local\Temp\system32\winsat.exe'
        - '*\AppData\Local\Temp\system32\winmm.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 155dbf56-e0a4-4dd0-8905-8a98705045e8
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/10/09
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002

