title: Powershell Profile.ps1 Modification
ruletype: Sigma
author: HieuTT35
date: 2019/10/24
description: Detects a change in profile.ps1 of the Powershell profile
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\My Documents\PowerShell\\*'
    SELECTION_4:
        TargetFilename: '*\profile.ps1*'
    SELECTION_5:
        TargetFilename: '*C:\Windows\System32\WindowsPowerShell\v1.0\\*'
    SELECTION_6:
        TargetFilename: '*\profile.ps1*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- System administrator create Powershell profile manually
id: b5b78988-486d-4a80-b991-930eff3ff8bf
level: high
logsource:
    category: file_event
    product: windows
modified: 2021/11/27
references:
- https://www.welivesecurity.com/2019/05/29/turla-powershell-usage/
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.013
yml_filename: file_event_win_susp_powershell_profile_create.yml
yml_path: rules/windows/file_event
---

