title: Creation of an WerFault.exe in Unusual Folder
ruletype: Sigma
author: frack113
date: 2022/05/09
description: Detects WerFault copoed to a suspicious folder, which could be a sign
    of WerFault DLL hijacking
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename:
        - '*\WerFault.exe'
        - '*\wer.dll'
    SELECTION_4:
        TargetFilename:
        - '*\System32\\*'
        - '*\SysWOW64\\*'
        - '*\WinSxS\\*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 28a452f3-786c-4fd8-b8f2-bddbe9d616d1
level: high
logsource:
    category: file_event
    product: windows
references:
- https://www.bleepingcomputer.com/news/security/hackers-are-now-hiding-malware-in-windows-event-logs/
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1574.001

