title: Suspicious Get-Variable.exe Creation
ruletype: Sigma
author: frack113
date: 2022/04/23
description: |
    Get-Variable is a valid PowerShell cmdlet
    WindowsApps is by default in the path where PowerShell is executed.
    So when the Get-Variable command is issued on PowerShell execution, the system first looks for the Get-Variable executable in the path and executes the malicious binary instead of looking for the PowerShell cmdlet.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*Local\Microsoft\WindowsApps\Get-Variable.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 0c3fac91-5627-46e8-a6a8-a0d7b9b8ae1b
level: high
logsource:
    category: file_event
    product: windows
references:
- https://blog.malwarebytes.com/threat-intelligence/2022/04/colibri-loader-combines-task-scheduler-and-powershell-in-clever-persistence-technique/
- https://www.joesandbox.com/analysis/465533/0/html
status: experimental
tags:
- attack.persistence
- attack.t1546
- attack.defense_evasion
- attack.t1027
yml_filename: file_event_win_susp_get_variable.yml
yml_path: rules/windows/file_event
---

