title: Legitimate Application Dropped Archive
ruletype: Sigma
author: frack113, Florian Roth
date: 2022/08/21
description: Detects programs on a Windows system that should not write an archive
    to disk
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\winword.exe'
        - '*\excel.exe'
        - '*\powerpnt.exe'
        - '*\msaccess.exe'
        - '*\mspub.exe'
        - '*\eqnedt32.exe'
        - '*\visio.exe'
        - '*\wordpad.exe'
        - '*\wordview.exe'
        - '*\certutil.exe'
        - '*\certoc.exe'
        - '*\CertReq.exe'
        - '*\Desktopimgdownldr.exe'
        - '*\esentutl.exe'
        - '*\finger.exe'
        - '*\notepad.exe'
        - '*\AcroRd32.exe'
        - '*\RdrCEF.exe'
        - '*\mshta.exe'
        - '*\hh.exe'
    SELECTION_4:
        TargetFilename:
        - '*.zip'
        - '*.rar'
        - '*.7z'
        - '*.diagcab'
        - '*.appx'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 654fcc6d-840d-4844-9b07-2c3300e54a26
level: high
logsource:
    category: file_event
    product: windows
references:
- https://github.com/Neo23x0/sysmon-config/blob/3f808d9c022c507aae21a9346afba4a59dd533b9/sysmonconfig-export-block.xml#L1326
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

