title: CVE-2021-44077 POC Default Dropped File
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/06
description: Detects the creation of "msiexec.exe" in the "bin" directory of the ManageEngine
    SupportCenter Plus (Related to CVE-2021-44077) and public POC available (See references
    section)
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetFilename: '*\ManageEngine\SupportCenterPlus\bin\msiexec.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
id: 7b501acf-fa98-4272-aa39-194f82edc8a3
level: high
logsource:
    category: file_event
    product: windows
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://github.com/horizon3ai/CVE-2021-44077/blob/b7a48e25824e8ead95e028475c7fd0e107e6e6bf/exploit.py
status: experimental
tags:
- attack.execution
- cve.2021.44077
yml_filename: file_event_win_cve_2021_44077_poc_default_files.yml
yml_path: rules/windows/file_event
---

