title: Diamond Sleet APT Process Activity Indicators
id: 2e4649c0-d69b-e162-9c39-4d98600de98a
related:
    - id: b5495d8d-24ad-4a44-8caf-ceae9a07a5c2
      type: derived
status: test
description: Detects process creation activity indicators related to Diamond Sleet APT
references:
    - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-10-24
tags:
    - attack.execution
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: ' uTYNkfKxHiZrx3KJ'
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
