title: Diamond Sleet APT DLL Sideloading Indicators
id: e42fb727-e227-3018-64ac-5f1bd99177a8
related:
    - id: d1b65d98-37d7-4ff6-b139-2d87c1af3042
      type: derived
status: test
description: Detects DLL sideloading activity seen used by Diamond Sleet APT
references:
    - https://www.microsoft.com/en-us/security/blog/2023/10/18/multiple-north-korean-threat-actors-exploiting-the-teamcity-cve-2023-42793-vulnerability/
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-10-24'
tags:
    - attack.defense-evasion
    - attack.t1574.001
    - detection.emerging-threats
    - sysmon
logsource:
    product: windows
    category: image_load
detection:
    image_load:
        EventID: 7
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_1:
        Image|endswith: :\ProgramData\clip.exe
        ImageLoaded|endswith: :\ProgramData\Version.dll
    selection_2:
        Image|endswith: :\ProgramData\wsmprovhost.exe
        ImageLoaded|endswith: :\ProgramData\DSROLE.dll
    condition: image_load and (1 of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
