title: SyncAppvPublishingServer Execution to Bypass Powershell Restriction
id: 6ab29276-37b6-8501-afb8-33126a6a9918
related:
    - id: fde7929d-8beb-4a4c-b922-be9974671667
      type: derived
    - id: 9f7aa113-9da6-4a8d-907c-5f1a4b908299
      type: derived
    - id: dddfebae-c46f-439c-af7a-fdb6bde90218
      type: derived
status: test
description: Detects SyncAppvPublishingServer process execution which usually utilized by adversaries to bypass PowerShell execution restrictions.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
author: Ensar Şamil, @sblmsrsn, OSCD Community
date: 2020-10-05
modified: 2022-12-25
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains: SyncAppvPublishingServer.exe
    condition: ps_script and selection
falsepositives:
    - App-V clients
level: medium
ruletype: Sigma
