title: Unsigned AppX Installation Attempt Using Add-AppxPackage - PsScript
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/31
description: Detects usage of the "Add-AppxPackage" or it's alias "Add-AppPackage"
    to install unsigned AppX packages
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText:
        - '*Add-AppPackage *'
        - '*Add-AppxPackage *'
    SELECTION_4:
        ScriptBlockText: '* -AllowUnsigned*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Installation of unsigned packages for testing purposes
id: 975b2262-9a49-439d-92a6-0709cccdf0b2
level: medium
logsource:
    category: ps_script
    definition: Script Block Logging must be enable
    product: windows
references:
- https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
- https://twitter.com/WindowsDocs/status/1620078135080325122
related:
-   id: 37651c2a-42cd-4a69-ae0d-22a4349aa04a
    type: similar
status: experimental
tags:
- attack.persistence
- attack.defense_evasion

