title: Potential In-Memory Execution Using Reflection.Assembly
id: 4ee64eb7-79b5-d7d2-9ba7-89616409e7d0
related:
    - id: ddcd88cb-7f62-4ce5-86f9-1704190feb0a
      type: derived
status: test
description: Detects usage of "Reflection.Assembly" load functions to dynamically load assemblies in memory
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=50
author: frack113
date: 2022-12-25
tags:
    - attack.defense-evasion
    - attack.t1620
logsource:
    product: windows
    category: ps_script
    definition: Script Block Logging must be enable
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains: '[Reflection.Assembly]::load'
    condition: ps_script and selection
falsepositives:
    - Legitimate use of the library
level: medium
ruletype: Sigma
