title: Enable Windows Remote Management
id: b5223513-5e9d-2c11-1cf7-d980bfed58f5
related:
    - id: 991a9744-f2f0-44f2-bd33-9092eba17dc3
      type: derived
status: test
description: Adversaries may use Valid Accounts to interact with remote systems using Windows Remote Management (WinRM). The adversary may then perform actions as the logged-on user.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.006/T1021.006.md#atomic-test-1---enable-windows-remote-management
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.core/enable-psremoting?view=powershell-7.2
author: frack113
date: 2022-01-07
tags:
    - attack.lateral-movement
    - attack.t1021.006
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection_cmdlet:
        ScriptBlockText|contains: 'Enable-PSRemoting '
    condition: ps_script and selection_cmdlet
falsepositives:
    - Legitimate script
level: medium
ruletype: Sigma
