title: Potential AMSI Bypass Using NULL Bits - ScriptBlockLogging
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/04
description: Detects usage of special strings/null bits in order to potentially bypass
    AMSI functionalities
detection:
    SELECTION_1:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_2:
        ScriptBlockLogging:
        - '*if(0){{{0}}}'' -f $(0 -as [char]) +*'
        - '*#<NULL>*'
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: fa2559c8-1197-471d-9cdd-05a0273d4522
level: medium
logsource:
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
    service: powershell
references:
- https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-bypass-using-null-bits-satoshi
related:
-   id: 92a974db-ab84-457f-9ec0-55db83d7a825
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

