title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION - PowerShell
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/13
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText|re: (?i).*&&set.*(\{\d\}){2,}\"\s+?-f.*&&.*cmd.*/c
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: e54f5149-6ba3-49cf-b153-070d24679126
level: high
logsource:
    category: ps_script
    definition: Script block logging must be enabled
    product: windows
modified: 2022/12/02
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

