
title: Powershell Keylogging
ruletype: Sigma
author: frack113
date: 2021/07/30
description: Adversaries may log user keystrokes to intercept credentials as the user
  types them.
detection:
  SELECTION_1:
    EventID: 4104
  SELECTION_2:
    Channel: Microsoft-Windows-PowerShell/Operational
  SELECTION_3:
    ScriptBlockText: '*Get-Keystrokes*'
  SELECTION_4:
    ScriptBlockText: '*Get-ProcAddress user32.dll GetAsyncKeyState*'
  SELECTION_5:
    ScriptBlockText: '*Get-ProcAddress user32.dll GetForegroundWindow*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Unknown
id: 34f90d3c-c297-49e9-b26d-911b05a4866c
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/07/11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.001/src/Get-Keystrokes.ps1
status: experimental
tags:
- attack.collection
- attack.t1056.001
