title: Potential Invoke-Mimikatz PowerShell Script
ruletype: Sigma
author: Tim Rauch
date: 2022/09/28
description: Detects Invoke-Mimikatz PowerShell script and alike. Mimikatz is a credential
    dumper capable of obtaining plaintext Windows account logins and passwords.
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel: Microsoft-Windows-PowerShell/Operational
    SELECTION_3:
        ScriptBlockText: '*DumpCreds*'
    SELECTION_4:
        ScriptBlockText: '*DumpCerts*'
    SELECTION_5:
        ScriptBlockText: '*sekurlsa::logonpasswords*'
    SELECTION_6:
        ScriptBlockText: '*crypto::certificates*'
    SELECTION_7:
        ScriptBlockText: '*CERT_SYSTEM_STORE_LOCAL_MACHINE*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        SELECTION_5 or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Mimikatz can be useful for testing the security of networks
id: 189e3b02-82b2-4b90-9662-411eb64486d4
level: high
logsource:
    category: ps_script
    product: windows
references:
- https://www.elastic.co/guide/en/security/current/potential-invoke-mimikatz-powershell-script.html#potential-invoke-mimikatz-powershell-script
status: experimental
tags:
- attack.credential_access
- attack.t1003

