title: Live Memory Dump Using Powershell
ruletype: Sigma
author: Max Altgelt
date: 2021/09/21
description: Detects usage of a PowerShell command to dump the live memory of a Windows
    machine
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText: '*Get-StorageDiagnosticInfo*'
    SELECTION_4:
        ScriptBlockText: '*-IncludeLiveDump*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Diagnostics
id: cd185561-4760-45d6-a63e-a51325112cae
level: high
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
modified: 2022/12/25
references:
- https://docs.microsoft.com/en-us/powershell/module/storage/get-storagediagnosticinfo
status: test
tags:
- attack.t1003

