title: Potential WinAPI Calls Via PowerShell Scripts
ruletype: Sigma
author: Nikita Nazarov, oscd.community, Tim Shelton
date: 2020/10/06
description: Detects use of WinAPI Functions in PowerShell scripts
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText:
        - '*AddSecurityPackage*'
        - '*AdjustTokenPrivileges*'
        - '*Advapi32*'
        - '*CloseHandle*'
        - '*CreateProcessWithToken*'
        - '*CreateRemoteThread*'
        - '*CreateThread*'
        - '*CreateUserThread*'
        - '*DangerousGetHandle*'
        - '*DuplicateTokenEx*'
        - '*EnumerateSecurityPackages*'
        - '*FreeLibrary*'
        - '*GetDelegateForFunctionPointer*'
        - '*GetLogonSessionData*'
        - '*GetModuleHandle*'
        - '*GetProcAddress*'
        - '*GetProcessHandle*'
        - '*GetTokenInformation*'
        - '*ImpersonateLoggedOnUser*'
        - '*kernel32*'
        - '*LoadLibrary*'
        - '*memcpy*'
        - '*MiniDumpWriteDump*'
        - '*msvcrt*'
        - '*ntdll*'
        - '*OpenDesktop*'
        - '*OpenProcess*'
        - '*OpenProcessToken*'
        - '*OpenThreadToken*'
        - '*OpenWindowStation*'
        - '*QueueUserApc*'
        - '*ReadProcessMemory*'
        - '*RevertToSelf*'
        - '*RtlCreateUserThread*'
        - '*secur32*'
        - '*SetThreadToken*'
        - '*VirtualAlloc*'
        - '*VirtualFree*'
        - '*VirtualProtect*'
        - '*WaitForSingleObject*'
        - '*WriteInt32*'
        - '*WriteProcessMemory*'
        - '*ZeroFreeGlobalAllocUnicode*'
    SELECTION_4:
        ScriptBlockText: '# Copyright 2016 Amazon.com, Inc. or its affiliates.*'
    SELECTION_5:
        ScriptBlockText: '*function Import-SerialPortUtil *'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5)))
falsepositives:
- Carbon PowerShell Module (https://github.com/webmd-health-services/Carbon)
id: 03d83090-8cba-44a0-b02f-0b756a050306
level: high
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
modified: 2023/01/09
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
related:
-   id: 03d83090-8cba-44a0-b02f-0b756a050306
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.t1106

