title: PowerShell Get-Process LSASS in ScriptBlock
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/04/23
description: Detects a Get-Process command on lsass process, which is in almost all
    cases a sign of malicious activity
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText: '*Get-Process lsass*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate certificate exports invoked by administrators or users (depends on processes
    in the environment - filter if unusable)
id: 84c174ab-d3ef-481f-9c86-a50d0b8e3edb
level: high
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
modified: 2022/12/25
references:
- https://twitter.com/PythonResponder/status/1385064506049630211
status: test
tags:
- attack.credential_access
- attack.t1003.001

