title: Suspicious New-PSDrive to Admin Share
id: 9d0ff6ee-9967-a757-d8dc-cf3f3b3546b1
related:
    - id: 1c563233-030e-4a07-af8c-ee0490a66d3a
      type: derived
status: test
description: Adversaries may use to interact with a remote network share using Server Message Block (SMB). The adversary may then perform actions as the logged-on user.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.002/T1021.002.md#atomic-test-2---map-admin-share-powershell
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/new-psdrive?view=powershell-7.2
author: frack113
date: 2022-08-13
tags:
    - attack.lateral-movement
    - attack.t1021.002
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains|all:
            - New-PSDrive
            - '-psprovider '
            - filesystem
            - '-root '
            - \\\\
            - $
    condition: ps_script and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
