title: Potential PowerShell Obfuscation Using Character Join
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/09
description: Detects specific techniques often seen used inside of PowerShell scripts
    to obfscuate Alias creation
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText: '*-Alias*'
    SELECTION_4:
        ScriptBlockText: '* -Value (-join(*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: e8314f79-564d-4f79-bc13-fbc0bf2660d8
level: low
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
references:
- Internal Research
related:
-   id: 96cd126d-f970-49c4-848a-da3a09f55c55
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1027
- attack.t1059.001

