title: Potential COM Objects Download Cradles Usage - PS Script
ruletype: Sigma
author: frack113
date: 2022/12/25
description: Detects usage of COM objects that can be abused to download files in
    PowerShell by CLSID
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText: '*[Type]::GetTypeFromCLSID(*'
    SELECTION_4:
        ScriptBlockText:
        - '*0002DF01-0000-0000-C000-000000000046*'
        - '*F6D90F16-9C73-11D3-B32E-00C04F990BB4*'
        - '*F5078F35-C551-11D3-89B9-0000F81FE221*'
        - '*88d96a0a-f192-11d4-a65f-0040963251e5*'
        - '*AFBA6B42-5692-48EA-8141-DC517DCF0EF1*'
        - '*AFB40FFD-B609-40A3-9828-F88BBE11E4E3*'
        - '*88d96a0b-f192-11d4-a65f-0040963251e5*'
        - '*2087c2f4-2cef-4953-a8ab-66779b670495*'
        - '*000209FF-0000-0000-C000-000000000046*'
        - '*00024500-0000-0000-C000-000000000046*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of the library
id: 3c7d1587-3b13-439f-9941-7d14313dbdfe
level: medium
logsource:
    category: ps_script
    definition: Script Block Logging must be enable
    product: windows
references:
- https://learn.microsoft.com/en-us/dotnet/api/system.type.gettypefromclsid?view=net-7.0
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=57
related:
-   id: 02b64f1b-3f33-4e67-aede-ef3b0a5a8fcf
    type: similar
status: experimental

