title: Suspicious PowerShell Mailbox Export to Share - PS
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/26
description: Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports
    a mailbox to a remote or local share, as used in ProxyShell exploitations
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText: '*New-MailboxExportRequest*'
    SELECTION_4:
        ScriptBlockText: '* -Mailbox *'
    SELECTION_5:
        ScriptBlockText: '* -FilePath \\\\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 4a241dea-235b-4a7e-8d76-50d817b146c4
level: critical
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
references:
- https://youtu.be/5mqid-7zp8k?t=2481
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
- https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1
- https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
related:
-   id: 889719ef-dd62-43df-86c3-768fb08dc7c0
    type: derived
status: experimental
tags:
- attack.exfiltration

