title: Malicious PowerShell Keywords
id: f62176f3-8128-4faa-bf6c-83261322e5eb
status: test
description: Detects keywords from well-known PowerShell exploitation frameworks
references:
    - https://adsecurity.org/?p=2921
author: Sean Metcalf (source), Florian Roth (Nextron Systems)
date: 2017/03/05
modified: 2022/12/25
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains:
            - AdjustTokenPrivileges
            - IMAGE_NT_OPTIONAL_HDR64_MAGIC
            - Microsoft.Win32.UnsafeNativeMethods
            - ReadProcessMemory.Invoke
            - SE_PRIVILEGE_ENABLED
            - LSA_UNICODE_STRING
            - MiniDumpWriteDump
            - PAGE_EXECUTE_READ
            - SECURITY_DELEGATION
            - TOKEN_ADJUST_PRIVILEGES
            - TOKEN_ALL_ACCESS
            - TOKEN_ASSIGN_PRIMARY
            - TOKEN_DUPLICATE
            - TOKEN_ELEVATION
            - TOKEN_IMPERSONATE
            - TOKEN_INFORMATION_CLASS
            - TOKEN_PRIVILEGES
            - TOKEN_QUERY
            - Metasploit
            - Mimikatz
    condition: ps_script and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
