title: Powershell Create Scheduled Task
id: 977cdcc1-6d3a-a221-a03f-d794230e01ae
related:
    - id: 363eccc0-279a-4ccf-a3ab-24c2e63b11fb
      type: derived
status: test
description: Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-4---powershell-cmdlet-scheduled-task
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1053.005/T1053.005.md#atomic-test-6---wmi-invoke-cimmethod-scheduled-task
author: frack113
date: 2021-12-28
modified: 2025-10-07
tags:
    - attack.privilege-escalation
    - attack.execution
    - attack.persistence
    - attack.t1053.005
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection_cmdlet:
        ScriptBlockText|contains:
            - New-ScheduledTaskAction
            - New-ScheduledTaskTrigger
            - New-ScheduledTaskPrincipal
            - New-ScheduledTaskSettingsSet
            - New-ScheduledTask
            - Register-ScheduledTask
    selection_cimmethod:
        ScriptBlockText|contains|all:
            - Invoke-CimMethod
            - -ClassName
            - PS_ScheduledTask
            - -NameSpace
            - Root\Microsoft\Windows\TaskScheduler
    filter_main_legitimate_scripts:
        ScriptBlockText|contains|all:
            - Microsoft.PowerShell.Core\Export-ModuleMember
            - Microsoft.Management.Infrastructure.CimInstance
            - __cmdletization_methodParameter
    condition: ps_script and (1 of selection_* and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
