title: Execution via CL_Mutexverifiers.ps1 (2 Lines)
ruletype: Sigma
author: oscd.community, Natalia Shornikova
date: 2020/10/14
description: Detects Execution via runAfterCancelProcess in CL_Mutexverifiers.ps1
    module
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText:
        - '*CL_Mutexverifiers.ps1*'
        - '*runAfterCancelProcess*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3) | count(ScriptBlockText)
        by Computer > 2
falsepositives:
- Unknown
id: 6609c444-9670-4eab-9636-fe4755a851ce
level: high
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
modified: 2022/12/25
references:
- https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
- https://twitter.com/pabraeken/status/995111125447577600
status: test
tags:
- attack.defense_evasion
- attack.t1216

