title: Create Volume Shadow Copy with Powershell
id: 33f62d96-55cf-87d2-e9f0-0a5fff75a278
related:
    - id: afd12fed-b0ec-45c9-a13d-aa86625dac81
      type: derived
status: test
description: Adversaries may attempt to access or create a copy of the Active Directory domain database in order to steal credential information
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-wmiobject?view=powershell-5.1&viewFallbackFrom=powershell-7
author: frack113
date: 2022-01-12
tags:
    - attack.credential-access
    - attack.t1003.003
    - attack.ds0005
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains|all:
            - Win32_ShadowCopy
            - ).Create(
            - ClientAccessible
    condition: ps_script and selection
falsepositives:
    - Legitimate PowerShell scripts
level: high
ruletype: Sigma
