title: Disable Powershell Command History
id: ebdae8b0-7b83-5602-356e-b214571cee19
related:
    - id: 602f5669-6927-4688-84db-0d4b7afb2150
      type: derived
status: test
description: Detects scripts or commands that disabled the Powershell command history by removing psreadline module
references:
    - https://twitter.com/DissectMalware/status/1062879286749773824
author: Ali Alwashali
date: 2022-08-21
tags:
    - attack.defense-evasion
    - attack.t1070.003
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains|all:
            - Remove-Module
            - psreadline
    condition: ps_script and selection
falsepositives:
    - Legitimate script that disables the command history
level: high
ruletype: Sigma
