title: PowerShell Deleted Mounted Share
id: 2182e106-ae16-770c-3022-a67abacb10d0
related:
    - id: 66a4d409-451b-4151-94f4-a55d559c49b0
      type: derived
status: test
description: Detects when when a mounted share is removed. Adversaries may remove share connections that are no longer useful in order to clean up traces of their operation
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2020-10-08
modified: 2025-10-07
tags:
    - attack.defense-evasion
    - attack.t1070.005
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains:
            - Remove-SmbShare
            - Remove-FileShare
    filter_main_module_load:
        ScriptBlockText|contains|all:
            - FileShare.cdxml
            - Microsoft.PowerShell.Core\Export-ModuleMember
            - ROOT/Microsoft/Windows/Storage/MSFT_FileShare
            - ObjectModelWrapper
            - Cmdletization.MethodParameter
    condition: ps_script and (selection and not 1 of filter_main_*)
falsepositives:
    - Administrators or Power users may remove their shares via cmd line
level: medium
ruletype: Sigma
