title: User Discovery And Export Via Get-ADUser Cmdlet - PowerShell
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/11/17
description: Detects usage of the Get-ADUser cmdlet to collect user information and
    output it to a file
detection:
    SELECTION_1:
        EventID: 4104
    SELECTION_2:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_3:
        ScriptBlockText: '*Get-ADUser *'
    SELECTION_4:
        ScriptBlockText: '* -Filter \*'
    SELECTION_5:
        ScriptBlockText:
        - '* > *'
        - '* | Select *'
        - '*Out-File*'
        - '*Set-Content*'
        - '*Add-Content*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate admin scripts may use the same technique, it's better to exclude specific
    computers or users who execute these commands or scripts often
id: c2993223-6da8-4b1a-88ee-668b8bf315e9
level: medium
logsource:
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
    product: windows
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
related:
-   id: 1114e048-b69c-4f41-bc20-657245ae6e3f
    type: similar
status: experimental
tags:
- attack.discovery
- attack.t1033

