title: Malicious ShellIntel PowerShell Commandlets
id: e84977df-6377-368d-ed22-e05ee31e9947
related:
    - id: 402e1e1d-ad59-47b6-bf80-1ee44985b3a7
      type: derived
status: test
description: Detects Commandlet names from ShellIntel exploitation scripts.
references:
    - https://github.com/Shellntel/scripts/
author: Max Altgelt (Nextron Systems), Tobias Michalski (Nextron Systems)
date: 2021-08-09
modified: 2023-01-02
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains:
            - Invoke-SMBAutoBrute
            - Invoke-GPOLinks
            # - 'Out-Minidump' # Covered in 89819aa4-bbd6-46bc-88ec-c7f7fe30efa6
            - Invoke-Potato
    condition: ps_script and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
