title: Potential PowerShell Obfuscation Using Character Join
id: e8314f79-564d-4f79-bc13-fbc0bf2660d8
related:
    -   id: 96cd126d-f970-49c4-848a-da3a09f55c55
        type: derived
status: test
description: Detects specific techniques often seen used inside of PowerShell scripts
    to obfscuate Alias creation
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/09
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1027
    - attack.t1059.001
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains|all:
            - -Alias
            - ' -Value (-join('
    condition: ps_script and selection
falsepositives:
    - Unknown
level: low
ruletype: Sigma
