
title: Accessing WinAPI in PowerShell for Credentials Dumping
ruletype: Sigma
author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects Accessing to lsass.exe by Powershell
detection:
  SELECTION_1:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_2:
    EventID: 8
  SELECTION_3:
    EventID: 10
  SELECTION_4:
    SourceImage:
    - '*\powershell.exe'
    - '*\pwsh.exe'
  SELECTION_5:
    TargetImage: '*\lsass.exe'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 3f07b9d1-2082-4c56-9277-613a621983cc
level: high
logsource:
  product: windows
  service: sysmon
modified: 2022/07/14
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
