
title: Suspicious Get Local Groups Information
ruletype: Sigma
author: frack113
date: 2021/12/12
description: "Adversaries may attempt to find local system groups and permission settings.\n\
  The knowledge of local system permission groups can help adversaries determine which\
  \ groups exist and which users belong to a particular group.\nAdversaries may use\
  \ this information to determine which users have elevated permissions, such as the\
  \ users found within the local administrators group. \n"
detection:
  SELECTION_1:
    Payload:
    - '*get-localgroup*'
    - '*Get-LocalGroupMember*'
  SELECTION_2:
    ContextInfo:
    - '*get-localgroup*'
    - '*Get-LocalGroupMember*'
  SELECTION_3:
    Payload: '*Get-WMIObject*'
  SELECTION_4:
    Payload: '*Win32_Group*'
  SELECTION_5:
    ContextInfo: '*Get-WMIObject*'
  SELECTION_6:
    ContextInfo: '*Win32_Group*'
  condition: (SELECTION_1 or SELECTION_2 or (SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6))
falsepositives:
- Administrator script
id: cef24b90-dddc-4ae1-a09a-8764872f69fc
level: low
logsource:
  category: ps_module
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
status: experimental
tags:
- attack.discovery
- attack.t1069.001
