title: Registry Hide Function from User
ruletype: Sigma
author: frack113
date: 2022/03/18
description: Detects registry modifications that hide internal tools or functions
    from the user (malware like Agent Tesla, Hermetic Wiper uses this technique)
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideClock'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAHealth'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCANetwork'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAPower'
        - '*Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\HideSCAVolume'
    SELECTION_6:
        NewValue: DWORD (0x00000001)
    SELECTION_7:
        EventType: SetValue
    SELECTION_8:
        TargetObject:
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowInfoTip'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowCompColor'
    SELECTION_9:
        NewValue: DWORD (0x00000000)
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
        SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Legitimate admin script
id: 5a93eb65-dffa-4543-b761-94aa60098fb6
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

