
title: AutoLogger Sessions Tamper
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/01
description: Detects tampering of autologger trace sessions which is a technique used
  by attackers to disable logging
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    TargetObject: '*\System\CurrentControlSet\Control\WMI\Autologger\\*'
  SELECTION_5:
    EventType: SetValue
  SELECTION_6:
    TargetObject:
    - '*\EventLog-*'
    - '*\Defender*'
  SELECTION_7:
    TargetObject:
    - '*\Enabled'
    - '*\Start'
  SELECTION_8:
    NewValue: DWORD (0x00000000)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: f37b4bce-49d0-4087-9f5b-58bffda77316
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
status: experimental
tags:
- attack.defense_evasion
