title: RDP Sensitive Settings Changed to Zero
ruletype: Sigma
author: Samir Bousseaden, David ANDRE, Roberto Rodriguez @Cyb3rWard0g, Nasreddine
    Bencherchali
date: 2022/09/29
description: |
    Detects tampering to RDP Terminal Service/Server sensitive settings.
    Such as allowing unauthorized users access to a system via the 'fAllowUnsolicited' or enabling RDP via 'fDenyTSConnections'...etc
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject:
        - '*\fDenyTSConnections'
        - '*\fSingleSessionPerUser'
        - '*\UserAuthentication'
    SELECTION_5:
        NewValue: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Some of the keys mentioned here could be modified by an administrator while setting
    group policy (it should be investigated either way)
id: a2863fbc-d5cb-48d5-83fb-d976d4b1743b
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/11/26
references:
- https://blog.menasec.net/2019/02/threat-hunting-rdp-hijacking-via.html
- http://woshub.com/rds-shadow-how-to-connect-to-a-user-session-in-windows-server-2012-r2/
- https://twitter.com/SagieSec/status/1469001618863624194?t=HRf0eA0W1YYzkTSHb-Ky1A&s=03
- https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190407183310.html
- https://bazaar.abuse.ch/sample/6f3aa9362d72e806490a8abce245331030d1ab5ac77e400dd475748236a6cc81/
- http://etutorials.org/Microsoft+Products/microsoft+windows+server+2003+terminal+services/Chapter+6+Registry/Registry+Keys+for+Terminal+Services/
- https://admx.help/HKLM/SOFTWARE/Policies/Microsoft/Windows%20NT/Terminal%20Services
related:
-   id: 3f6b7b62-61aa-45db-96bd-9c31b36b653c
    type: similar
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1112

