title: Potential Persistence Via COM Search Order Hijacking
id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
status: experimental
description: Detects potential COM object hijacking leveraging the COM Search Order
references:
    - https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/
author: Maxime Thiebaut (@0xThiebaut), oscd.community, Cédric Hien
date: 2020/04/14
modified: 2023/09/28
tags:
    - attack.persistence
    - attack.t1546.015
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection: # Detect new COM servers in the user hive
        ObjectName|contains: \CLSID\
        ObjectName|endswith: \InprocServer32\(Default)
    filter_main_generic:
        NewValue|contains: # Exclude privileged directories and observed FPs
            - '%%systemroot%%\system32\'
            - '%%systemroot%%\SysWow64\'
    filter_main_onedrive:
        NewValue|contains:
            # Related To OneDrive
            - \AppData\Local\Microsoft\OneDrive\
            - \FileCoAuthLib64.dll
            - \FileSyncShell64.dll
            - \FileSyncApi64.dll
    filter_main_health_service:
        ProcessName|endswith: :\WINDOWS\system32\SecurityHealthService.exe
    filter_main_teams:
        NewValue|contains|all:
            - \AppData\Local\Microsoft\TeamsMeetingAddin\
            - \Microsoft.Teams.AddinLoader.dll
    filter_main_dropbox:
        NewValue|contains|all:
            - \AppData\Roaming\Dropbox\
            - \DropboxExt64.*.dll
    filter_main_trend_micro:
        NewValue|endswith: TmopIEPlg.dll
    filter_main_update:
        ProcessName|endswith:
            - :\WINDOWS\system32\wuauclt.exe
            - :\WINDOWS\system32\svchost.exe
    filter_main_defender:
        ProcessName|contains:
            - :\ProgramData\Microsoft\Windows Defender\Platform\
            - :\Program Files\Windows Defender\
        ProcessName|endswith: \MsMpEng.exe
    filter_main_nvidia:
        NewValue|contains: \FileRepository\nvmdi.inf
    filter_main_edge:
        ProcessName|endswith: \MicrosoftEdgeUpdateComRegisterShell64.exe
    filter_main_dx:
        ProcessName|endswith: :\WINDOWS\SYSTEM32\dxdiag.exe
    filter_main_python:
        NewValue|endswith:
            - :\Windows\pyshellext.amd64.dll
            - :\Windows\pyshellext.dll
    filter_main_bonjourlib:
        NewValue|endswith:
            - :\Windows\system32\dnssdX.dll
            - :\Windows\SysWOW64\dnssdX.dll
    filter_main_printextensionmanager:
        NewValue|endswith: :\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
    filter_main_programfiles:
        NewValue|contains:
            - :\Program Files\
            - :\Program Files (x86)\
    filter_main_programdata:
        NewValue|contains: :\ProgramData\Microsoft\
    filter_main_gameservice:
        NewValue|contains: :\WINDOWS\system32\GamingServicesProxy.dll
    filter_main_poqexec:
        ProcessName|endswith: :\Windows\System32\poqexec.exe
        NewValue|contains: :\Windows\System32\Autopilot.dll
    filter_main_sec_health_svc:
        ProcessName|endswith: :\Windows\system32\SecurityHealthService.exe
        NewValue|contains: :\Windows\System32\SecurityHealth
    filter_main_inprocserver:
        ProcessName|endswith:
            - :\Windows\System32\poqexec.exe
            - :\Windows\System32\regsvr32.exe
        ObjectName|endswith: \InProcServer32\(Default)
    condition: registry_set and (selection and not 1 of filter_main_*)
falsepositives:
    - Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level
level: medium
ruletype: Sigma
