title: Registry Modification for OCI DLL Redirection
id: 0a08ca66-94db-9391-8eb0-82e91312a056
related:
    - id: c0e0bdec-3e3d-47aa-9974-05539c999c89
      type: derived
status: experimental
description: |
    Detects registry modifications related to 'OracleOciLib' and 'OracleOciLibPath' under 'MSDTC' settings.
    Threat actors may modify these registry keys to redirect the loading of 'oci.dll' to a malicious DLL, facilitating phantom DLL hijacking via the MSDTC service.
references:
    - https://www.crowdstrike.com/en-us/blog/4-ways-adversaries-hijack-dlls/
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2026-01-24
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1112
    - attack.t1574.001
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_ocilib:
        ObjectName|endswith: \SOFTWARE\Microsoft\MSDTC\MTxOCI\OracleOciLib
    filter_main_ocilib_file:
        # it is looking when oci.dll name is changed to something else like evil.dll
        NewValue|contains: oci.dll
    selection_ocilibpath:
        ObjectName|endswith: \SOFTWARE\Microsoft\MSDTC\MTxOCI\OracleOciLibPath
    filter_main_ocilibpath:
        # it is looking when oci.dll path is changed to something else like 'C:\Windows\Temp\'
        NewValue|contains: '%SystemRoot%\System32\'
    condition: registry_set and ((selection_ocilib and not filter_main_ocilib_file) or (selection_ocilibpath and not filter_main_ocilibpath))
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
