title: Potential Persistence Via Netsh Helper DLL - Registry
id: 6191bb45-e2d4-dc12-74c9-be6994d84572
related:
    - id: 56321594-9087-49d9-bf10-524fe8479452
      type: similar
    - id: e7b18879-676e-4a0e-ae18-27039185a8e7
      type: similar
    - id: c90362e0-2df3-4e61-94fe-b37615814cb1
      type: derived
status: test
description: |
    Detects changes to the Netsh registry key to add a new DLL value. This change might be an indication of a potential persistence attempt by adding a malicious Netsh helper
references:
    - https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
    - https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
author: Anish Bogati
date: 2023-11-28
modified: 2025-10-08
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1546.007
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: \SOFTWARE\Microsoft\NetSh
        NewValue|contains: .dll
    filter_main_poqexec:
        ProcessName: C:\Windows\System32\poqexec.exe
        NewValue:
            - ipmontr.dll
            - iasmontr.dll
            - ippromon.dll
    condition: registry_set and (selection and not 1 of filter_main_*)
falsepositives:
    - Legitimate helper added by different programs and the OS
level: medium
ruletype: Sigma
