title: CurrentVersion NT Autorun Keys Modification
id: cbf93e5d-ca6c-4722-8bea-e9119007c248
related:
    - id: 17f878b8-9968-4578-b814-c4217fc5768c
      type: obsoletes
status: experimental
description: Detects modification of autostart extensibility point (ASEP) in registry.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
    - https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
    - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d # a list with registry keys
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    nt_current_version_base:
        ObjectName|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion
    nt_current_version:
        ObjectName|contains:
            - \Winlogon\VmApplet
            - \Winlogon\Userinit
            - \Winlogon\Taskman
            - \Winlogon\Shell
            - \Winlogon\GpExtensions
            - \Winlogon\AppSetup
            - \Winlogon\AlternateShells\AvailableShells
            - \Windows\IconServiceLib
            - \Windows\Appinit_Dlls
            - \Image File Execution Options
            - \Font Drivers
            - \Drivers32
            - \Windows\Run
            - \Windows\Load
    filter_empty:
        NewValue: (Empty)
    filter_legitimate_subkey:  # Legitimately used subkeys of \Image File Execution Options, which are not used for persistence (see https://pentestlab.blog/2020/01/13/persistence-image-file-execution-options-injection/)
        ObjectName|contains: \Image File Execution Options\
        ObjectName|endswith:
            - \DisableExceptionChainValidation
            - \MitigationOptions
    filter_edge:
        ProcessName|startswith: C:\Program Files (x86)\Microsoft\Temp\
        ProcessName|endswith: \MicrosoftEdgeUpdate.exe
    filter_msoffice:
        - ObjectName|contains:
              - \ClickToRunStore\\REGISTRY\MACHINE\SOFTWARE\Microsoft\Windows NT\CurrentVersion\
              - \ClickToRun\REGISTRY\MACHINE\Software\Microsoft\Windows NT\CurrentVersion\
        - ProcessName:
              - C:\Program Files\Microsoft Office\root\integration\integrator.exe
              - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    filter_officeclicktorun:
        ProcessName|startswith:
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
        ProcessName|endswith: \OfficeClickToRun.exe
    filter_security_extension_dc:
        ProcessName: C:\Windows\system32\svchost.exe
        ObjectName|contains:
            - \Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\PreviousPolicyAreas
            - \Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\MaxNoGPOListChangesInterval
        NewValue:
            - DWORD (0x00000009)
            - DWORD (0x000003c0)
    filter_ngen:
        ProcessName|startswith: C:\Windows\Microsoft.NET\Framework
        ProcessName|endswith: \ngen.exe
    filter_onedrive:
        ProcessName|endswith: \AppData\Local\Microsoft\OneDrive\StandaloneUpdater\OneDriveSetup.exe
        ObjectName|endswith: \Microsoft\Windows\CurrentVersion\RunOnce\Delete Cached Update Binary
        NewValue|startswith: C:\Windows\system32\cmd.exe /q /c del /q "C:\Users\
        NewValue|endswith: \AppData\Local\Microsoft\OneDrive\Update\OneDriveSetup.exe"
    condition: registry_set and (nt_current_version_base and nt_current_version and not 1 of filter_*)
fields:
    - SecurityID
    - ObjectName
    - OldValueType
    - NewValueType
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason
    - Legitimate administrator sets up autorun keys for legitimate reason
level: medium
ruletype: Sigma
