title: Hide Schedule Task Via Index Value Tamper
id: 8f22d1f4-6491-fcf7-858d-c2e73bcb8c48
status: test
description: |
    Detects when the "index" value of a scheduled task is modified from the registry
    Which effectively hides it from any tooling such as "schtasks /query" (Read the referenced link for more information about the effects of this technique)
references:
    - https://blog.qualys.com/vulnerabilities-threat-research/2022/06/20/defending-against-scheduled-task-attacks-in-windows-environments
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/26
modified: 2023/08/17
tags:
    - attack.defense_evasion
    - attack.t1562
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains|all:
            - \SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\
            - Index
        NewValue: DWORD (0x00000000)
    condition: registry_set and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
