
title: ScreenSaver Registry Key Set
ruletype: Sigma
author: Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)
date: 2022/05/04
description: Detects registry key established after masqueraded .scr file execution
  using Rundll32 through desk.cpl
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    NewProcessName: '*\rundll32.exe'
  SELECTION_6:
    TargetObject: '*\Control Panel\Desktop\SCRNSAVE.EXE*'
  SELECTION_7:
    NewValue: '*.scr'
  SELECTION_8:
    NewValue:
    - '*C:\Windows\System32\\*'
    - '*C:\Windows\SysWOW64\\*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7) and  not (SELECTION_8))
falsepositives:
- Legitimate use of screen saver
id: 40b6e656-4e11-4c0c-8772-c1cc6dae34ce
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/05/04
references:
- https://twitter.com/VakninHai/status/1517027824984547329
- https://twitter.com/pabraeken/status/998627081360695297
- https://jstnk9.github.io/jstnk9/research/InstallScreenSaver-SCR-files
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
