
title: Service Binary in Temp Folder
ruletype: Sigma
author: frack113
date: 2022/05/01
description: Detect the creation of a service with a service binary located in a temporary
  directory
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_10:
    TargetObject: HKLM\System\CurrentControlSet\Services\\*
  SELECTION_11:
    TargetObject: '*\ImagePath'
  SELECTION_12:
    NewValue: '*\Temp\\*'
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: HKLM\System\CurrentControlSet\Services\\*
  SELECTION_6:
    TargetObject: '*\Start'
  SELECTION_7:
    NewProcessName: '*\Temp\\*'
  SELECTION_8:
    NewValue:
    - DWORD (0x00000000)
    - DWORD (0x00000001)
    - DWORD (0x00000002)
  SELECTION_9:
    EventType: SetValue
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
    SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9 and
    SELECTION_10 and SELECTION_11 and SELECTION_12)))
falsepositives:
- Unknown
id: c0abc838-36b0-47c9-b3b3-a90c39455382
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
