title: New Netsh Helper DLL Registered From A Suspicious Location
id: 57fba93d-7938-c3fd-109b-6d1fb6037e2c
status: experimental
description: |
    Detects changes to the Netsh registry key to add a new DLL value that is located on a suspicious location. This change might be an indication of a potential persistence attempt by adding a malicious Netsh helper
references:
    - https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
    - https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/11/28
tags:
    - attack.persistence
    - attack.t1546.007
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_target:
        ObjectName|contains: \SOFTWARE\Microsoft\NetSh
    selection_folders_1:
        NewValue|contains:
            - :\Perflogs\
            - :\Users\Public\
            - :\Windows\Temp\
            - \AppData\Local\Temp\
            - \Temporary Internet
    selection_folders_2:
        - NewValue|contains|all:
              - :\Users\
              - \Favorites\
        - NewValue|contains|all:
              - :\Users\
              - \Favourites\
        - NewValue|contains|all:
              - :\Users\
              - \Contacts\
        - NewValue|contains|all:
              - :\Users\
              - \Pictures\
    condition: registry_set and (selection_target and 1 of selection_folders_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
