title: New DNS ServerLevelPluginDll Installed
id: 1c9de880-3d26-4614-f41f-a4d975e609ff
status: test
description: Detects the installation of a DNS plugin DLL via ServerLevelPluginDll parameter in registry, which can be used to execute code in context of the DNS server (restart required)
references:
    - https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
    - https://blog.3or.de/hunting-dns-server-level-plugin-dll-injection.html
author: Florian Roth (Nextron Systems)
date: 2017/05/08
modified: 2023/08/17
tags:
    - attack.defense_evasion
    - attack.t1574.002
    - attack.t1112
    - sysmon
logsource:
    product: windows
    category: registry_set
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith: \services\DNS\Parameters\ServerLevelPluginDll
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
