title: Potential WerFault ReflectDebugger Registry Value Abuse
id: effced04-aa28-c07f-9aa5-41cdded8bb61
status: experimental
description: Detects potential WerFault "ReflectDebugger" registry value abuse for persistence.
references:
    - https://cocomelonc.github.io/malware/2022/11/02/malware-pers-18.html
    - https://www.hexacorn.com/blog/2018/08/31/beyond-good-ol-run-key-part-85/
author: X__Junior
date: 2023/05/18
tags:
    - attack.defense_evasion
    - attack.t1036.003
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        OperationType: '%%1905'
        ObjectName|endswith: \Microsoft\Windows\Windows Error Reporting\Hangs\ReflectDebugger
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
