title: Potential Persistence Via LSA Extensions
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: 'Detects when an attacker modifies the "REG_MULTI_SZ" value named "Extensions"
    to include a custom DLL to achieve persistence via lsass.

    The "Extensions" list contains filenames of DLLs being automatically loaded by
    lsass.exe. Each DLL has its InitializeLsaExtension() method called after loading.

    '
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\SYSTEM\CurrentControlSet\Control\LsaExtensionConfig\LsaSrv\Extensions*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unlikely
id: 41f6531d-af6e-4c6e-918f-b946f2b85a36
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/10
references:
- https://persistence-info.github.io/Data/lsaaextension.html
- https://twitter.com/0gtweet/status/1476286368385019906
status: experimental
tags:
- attack.persistence

