title: Service Binary in Suspicious Folder
ruletype: Sigma
author: Florian Roth (Nextron Systems), frack113
date: 2022/05/02
description: Detect the creation of a service with a service binary located in a suspicious
    directory
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_10:
        TargetObject: HKLM\System\CurrentControlSet\Services\\*
    SELECTION_11:
        TargetObject: '*\ImagePath'
    SELECTION_12:
        NewValue:
        - '*\Users\Public\\*'
        - '*\Perflogs\\*'
        - '*\ADMIN$\\*'
        - '*\Temp\\*'
    SELECTION_13:
        NewProcessName: '*\Common Files\\*'
    SELECTION_14:
        NewProcessName: '*\Temp\\*'
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: HKLM\System\CurrentControlSet\Services\\*
    SELECTION_6:
        TargetObject: '*\Start'
    SELECTION_7:
        NewProcessName:
        - '*\Users\Public\\*'
        - '*\Perflogs\\*'
        - '*\ADMIN$\\*'
        - '*\Temp\\*'
    SELECTION_8:
        NewValue:
        - DWORD (0x00000000)
        - DWORD (0x00000001)
        - DWORD (0x00000002)
    SELECTION_9:
        EventType: SetValue
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10 and SELECTION_11 and SELECTION_12)) and  not ((SELECTION_13
        and SELECTION_14)))
falsepositives:
- Unknown
id: a07f0359-4c90-4dc4-a681-8ffea40b4f47
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/12/02
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
related:
-   id: c0abc838-36b0-47c9-b3b3-a90c39455382
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

