title: Custom File Open Handler Executes PowerShell
id: 790cbe25-2aac-45a7-48c4-234b2a622f06
related:
    - id: 7530b96f-ad8e-431d-a04d-ac85cc461fdc
      type: derived
status: test
description: Detects the abuse of custom file open handler, executing powershell
references:
    - https://news.sophos.com/en-us/2022/02/01/solarmarker-campaign-used-novel-registry-changes-to-establish-persistence/?cmp=30728
author: CD_R0M_
date: 2022-06-11
modified: 2023-08-17
tags:
    - attack.defense-evasion
    - attack.t1202
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: shell\open\command\
        NewValue|contains|all:
            - powershell
            - -command
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
