title: Registry Persistence via Explorer Run Key
id: b7916c2a-fa2f-4795-9477-32b731f70f11
status: test
description: Detects a possible persistence mechanism using RUN key for Windows Explorer
    and pointing to a suspicious folder
references:
    - https://researchcenter.paloaltonetworks.com/2018/07/unit42-upatre-continues-evolve-new-anti-analysis-techniques/
author: Florian Roth (Nextron Systems), oscd.community
date: 2018/07/18
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith: \Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
    selection2:
        -   NewValue|startswith:
                - C:\Windows\Temp\
                - C:\ProgramData\
                - C:\$Recycle.bin\
                - C:\Temp\
                - C:\Users\Public\
                - C:\Users\Default\
        -   NewValue|contains: \AppData\
    condition: registry_set and (selection and selection2)
fields:
    - ProcessName
    - ParentImage
falsepositives:
    - Unknown
level: high
ruletype: Sigma
