title: New File Association Using Exefile
ruletype: Sigma
author: Andreas Hunkeler (@Karneades)
date: 2021/11/19
description: Detects the abuse of the exefile handler in new file association. Used
    for bypass of security products.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject: '*Classes\.*'
    SELECTION_5:
        NewValue: exefile
    SELECTION_6:
        EventType: SetValue
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 44a22d59-b175-4f13-8c16-cbaef5b581ff
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://twitter.com/mrd0x/status/1461041276514623491
status: test
tags:
- attack.defense_evasion

