title: Windows Defender Service Disabled - Registry
id: 7f5a4070-c4d2-ba36-ab1f-378da90ddf45
related:
    - id: e1aa95de-610a-427d-b9e7-9b46cfafbe6a
      type: derived
status: test
description: Detects when an attacker or tool disables the  Windows Defender service (WinDefend) via the registry
references:
    - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
    - https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
author: Ján Trenčanský, frack113, AlertIQ, Nasreddine Bencherchali
date: 2022-08-01
modified: 2024-03-25
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    product: windows
    category: registry_set
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith: \Services\WinDefend\Start
        NewValue: DWORD (0x00000004)
    condition: registry_set and selection
falsepositives:
    - Administrator actions
level: high
ruletype: Sigma
