title: Enable Local Manifest Installation With Winget
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/17
description: Detects changes to the AppInstaller (winget) policy. Specifically the
    activation of the local manifest installation, which allows a user to install
    new packages via custom manifests.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\AppInstaller\EnableLocalManifestFiles'
    SELECTION_6:
        NewValue: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Administrators or developers might enable this for testing purposes or to install
    custom private packages
id: fa277e82-9b78-42dd-b05c-05555c7b6015
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
status: experimental
tags:
- attack.defense_evasion
- attack.persistence

