title: Hiding User Account Via SpecialAccounts Registry Key
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2022/07/12
description: Detects modifications to the registry key "HKLM\Software\Microsoft\Windows
    NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" where the value is set to
    "0" in order to hide user account from being listed on the logon screen.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList*'
    SELECTION_6:
        NewValue: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/26
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1564.002/T1564.002.md
related:
-   id: 8a58209c-7ae6-4027-afb0-307a78e4589a
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.t1564.002

