title: Internet Explorer DisableFirstRunCustomize Enabled
id: 6b3466e8-35d1-e288-b322-0873400febd7
related:
    - id: ab567429-1dfb-4674-b6d2-979fd2f9d125
      type: derived
status: test
description: |
    Detects changes to the Internet Explorer "DisableFirstRunCustomize" value, which prevents Internet Explorer from running the first run wizard the first time a user starts the browser after installing Internet Explorer or Windows.
references:
    - https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf
    - https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
    - https://admx.help/?Category=InternetExplorer&Policy=Microsoft.Policies.InternetExplorer::NoFirstRunCustomise
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-16
modified: 2025-10-07
tags:
    - attack.defense-evasion
logsource:
    product: windows
    category: registry_set
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith: \Microsoft\Internet Explorer\Main\DisableFirstRunCustomize
        NewValue:
            - DWORD (0x00000001)   # Home Page
            - DWORD (0x00000002)   # Welcome To IE
    filter_main_generic:
        ProcessName:
            - C:\Windows\explorer.exe
            - C:\Windows\System32\ie4uinit.exe
    filter_optional_avira:
        ProcessName|contains|all:
            - \Temp\
            - \.cr\avira_
        NewValue|contains: DWORD (0x00000001)
    filter_optional_foxit:
        ProcessName:
            - C:\Program Files (x86)\Foxit Software\Foxit PDF Reader\FoxitPDFReader.exe
            - C:\Program Files\Foxit Software\Foxit PDF Reader\FoxitPDFReader.exe
        NewValue|contains: DWORD (0x00000001)
    condition: registry_set and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - As this is controlled by group policy as well as user settings. Some false positives may occur.
level: medium
ruletype: Sigma
