
title: Blue Mockingbird
ruletype: Sigma
author: Trent Liffick (@tliffick)
date: 2020/05/14
description: Attempts to detect system changes made by Blue Mockingbird
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: Setvalue
  SELECTION_5:
    TargetObject: '*\CurrentControlSet\Services\wercplsupport\Parameters\ServiceDll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 92b0b372-a939-44ed-a11b-5136cf680e27
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
references:
- https://redcanary.com/blog/blue-mockingbird-cryptominer/
related:
- id: c3198a27-23a0-4c2c-af19-e5328d49680e
  type: derived
status: experimental
tags:
- attack.execution
- attack.t1112
- attack.t1047
