title: Potential GlobalFlags Registry Persistence Attempt
ruletype: Sigma
author: Karneades, Jonhnathan Ribeiro, Florian Roth
date: 2018/04/11
description: Detects registry persistence technique using the GlobalFlags and SilentProcessExit
    keys
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject: '*\Microsoft\Windows NT\CurrentVersion\\*'
    SELECTION_5:
        TargetObject: '*\Image File Execution Options\\*'
    SELECTION_6:
        TargetObject: '*\GlobalFlag*'
    SELECTION_7:
        TargetObject: '*\SilentProcessExit\\*'
    SELECTION_8:
        TargetObject:
        - '*\ReportingMode*'
        - '*\MonitorProcess*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: 36803969-5421-41ec-b92f-8500f79c23b0
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/12/19
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
- https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
related:
-   id: c81fe886-cac0-4913-a511-2822d72ff505
    type: obsoletes
status: test
tags:
- attack.privilege_escalation
- attack.persistence
- attack.defense_evasion
- attack.t1546.012
- car.2013-01-002

