
title: Scheduled TaskCache Change by Uncommon Program
ruletype: Sigma
author: Syed Hasan (@syedhasan009)
date: 2021/06/18
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled
  task is registered by a process that is not svchost.exe, which is suspicious
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_10:
    NewProcessName: C:\WINDOWS\system32\svchost.exe
  SELECTION_11:
    NewProcessName: C:\Windows\Microsoft.NET\Framework\\*
  SELECTION_12:
    NewProcessName: '*\ngen.exe'
  SELECTION_13:
    TargetObject: '*\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tasks\{B66B135D-DA06-4FC4-95F8-7458E1D10129}*'
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\\*'
  SELECTION_6:
    TargetObject:
    - '*Microsoft\Windows\UpdateOrchestrator*'
    - '*Microsoft\Windows\SoftwareProtectionPlatform\SvcRestartTask\Index*'
    - '*Microsoft\Windows\Flighting\OneSettings\RefreshCache\Index*'
  SELECTION_7:
    NewProcessName: C:\Windows\\*
  SELECTION_8:
    NewProcessName: '*\TiWorker.exe'
  SELECTION_9:
    TargetObject:
    - '*\MICROSOFT\WINDOWS NT\CURRENTVERSION\SCHEDULE\TASKCACHE\PLAIN\{1A552422-F571-4376-A7F1-5941E63D7B40}*'
    - '*\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\Microsoft\Windows\DeviceDirectoryClient\\*'
    - '*\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tasks\{04622042-F26B-4CCA-815F-E7A8375D87E6}*'
    - '*\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tasks\{C130EB11-1FDE-4953-B222-F44EEC6E1E8B}*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9) or (SELECTION_10)
    or (SELECTION_11 and SELECTION_12 and SELECTION_13)))
falsepositives:
- Unknown
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/07/29
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://labs.f-secure.com/blog/scheduled-task-tampering/
status: experimental
tags:
- attack.persistence
- attack.t1053
- attack.t1053.005
