title: Potential Attachment Manager Settings Attachments Tamper
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/01
description: Detects tampering with attachment manager settings policies attachments
    (See reference for more information)
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_10:
        TargetObject: '*\ScanWithAntiVirus'
    SELECTION_11:
        NewValue: DWORD (0x00000001)
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Attachments\\*'
    SELECTION_6:
        TargetObject: '*\HideZoneInfoOnProperties'
    SELECTION_7:
        NewValue: DWORD (0x00000001)
    SELECTION_8:
        TargetObject: '*\SaveZoneInformation'
    SELECTION_9:
        NewValue: DWORD (0x00000002)
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5) and ((SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11)))
falsepositives:
- Unlikely
id: ee77a5db-b0f3-4be2-bfd4-b58be1c6b15a
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/10
references:
- https://support.microsoft.com/en-us/topic/information-about-the-attachment-manager-in-microsoft-windows-c48a4dcd-8de5-2af5-ee9b-cd795ae42738
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
status: experimental
tags:
- attack.defense_evasion

