title: Potential Signing Bypass Via Windows Developer Features - Registry
id: eea69d1c-b62d-d58f-4ee3-82f9053a20ea
status: experimental
description: Detects when the enablement of developer features such as "Developer Mode" or "Application Sideloading". Which allows the user to install untrusted packages.
references:
    - https://twitter.com/malmoeb/status/1560536653709598721
    - https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/12
modified: 2023/08/17
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains:
            - \Microsoft\Windows\CurrentVersion\AppModelUnlock
            - \Policies\Microsoft\Windows\Appx\
        ObjectName|endswith:
            - \AllowAllTrustedApps
            - \AllowDevelopmentWithoutDevLicense
        NewValue: DWORD (0x00000001)
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
