title: Set TimeProviders DllName
ruletype: Sigma
author: frack113
date: 2022/06/19
description: 'Detects processes setting a new DLL in DllName in under HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\W32Time\TimeProvider.

    Adversaries may abuse time providers to execute DLLs when the system boots.

    The Windows Time service (W32Time) enables time synchronization across and within
    domains.

    '
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: HKLM\System\CurrentControlSet\Services\W32Time\TimeProviders*
    SELECTION_6:
        TargetObject: '*DllName'
    SELECTION_7:
        NewValue: C:\Windows\SYSTEM32\w32time.DLL
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not (SELECTION_7))
falsepositives:
- Unknown
id: e88a6ddc-74f7-463b-9b26-f69fc0d2ce85
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.003/T1547.003.md
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1547.003

