title: FileFix - Command Evidence in TypedPaths from Browser File Upload Abuse
id: 57a468ba-845c-797e-81fb-79970450803a
related:
    - id: 4fee3d51-8069-4a4c-a0f7-924fcaff2c70
      type: derived
status: experimental
description: Detects commonly-used chained commands and strings in the most recent 'url' value of the 'TypedPaths' key, which could be indicative of a user being targeted by the FileFix technique.
references:
    - https://x.com/russianpanda9xx/status/1940831134759506029
    - https://mrd0x.com/filefix-clickfix-alternative/
author: Alfie Champion (delivr.to)
date: '2025-07-05'
tags:
    - attack.execution
    - attack.t1204.004
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_base:
        ObjectName|endswith: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths\url1
        NewValue|contains: '#'
        ProcessName|endswith:
            - \brave.exe
            - \chrome.exe
            - \firefox.exe
            - \msedge.exe
    selection_cmd:
        NewValue|contains:
            - cmd
            - curl
            - powershell
            - bitsadmin
            - certutil
            - mshta
            - regsvr32
    condition: registry_set and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
