
title: Modification of Explorer Hidden Keys
ruletype: Sigma
author: frack113
date: 2022/04/02
description: Detects modifications to the hidden files keys in registry. This technique
  is abused by several malware families to hide their files from normal users.
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: Setvalue
  SELECTION_5:
    TargetObject:
    - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowSuperHidden
    - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\Hidden
  SELECTION_6:
    NewValue: DWORD (0x00000000)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 5a5152f1-463f-436b-b2f5-8eceb3964b42
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/06/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md#atomic-test-8---hide-files-through-registry
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
