
title: Windows Defender Service Disabled
ruletype: Sigma
author: Ján Trenčanský, frack113, AlertIQ, Nasreddine Bencherchali
date: 2022/08/01
description: Detects when an attacker or tool disables the  Windows Defender service
  (WinDefend) via the registry
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: HKLM\SYSTEM\CurrentControlSet\Services\WinDefend\Start
  SELECTION_6:
    NewValue: DWORD (0x00000004)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Administrator actions
id: e1aa95de-610a-427d-b9e7-9b46cfafbe6a
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://gist.github.com/anadr/7465a9fde63d41341136949f14c21105
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
