title: Execution DLL of Choice Using WAB.EXE
id: 027f1f5f-4aa7-ac2c-d8c2-084da4eaee3d
related:
    - id: fc014922-5def-4da9-a0fc-28c973f41bfb
      type: derived
status: test
description: This rule detects that the path to the DLL written in the registry is different from the default one. Launched WAB.exe tries to load the DLL from Registry.
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/8283d8d91552213ded165fd36deb6cb9534cb443/yml/OSBinaries/Wab.yml
    - https://twitter.com/Hexacorn/status/991447379864932352
    - http://www.hexacorn.com/blog/2018/05/01/wab-exe-as-a-lolbin/
author: oscd.community, Natalia Shornikova
date: 2020-10-13
modified: 2023-08-17
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith: \Software\Microsoft\WAB\DLLPath
    filter:
        NewValue: '%CommonProgramFiles%\System\wab32.dll'
    condition: registry_set and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
