
title: Modification of IE Registry Settings
ruletype: Sigma
author: frack113
date: 2022/01/22
description: Detects the modification of the registry settings used for Internet Explorer
  and other Windows components that use these settings
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*\Software\Microsoft\Windows\CurrentVersion\Internet Settings*'
  SELECTION_6:
    NewValue: DWORD*
  SELECTION_7:
    NewValue:
    - 'Cookie:'
    - 'Visited:'
    - (Empty)
  SELECTION_8:
    TargetObject:
    - '*\Cache*'
    - '*\ZoneMap*'
    - '*\WpadDecision*'
  SELECTION_9:
    NewValue: Binary Data
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6) or (SELECTION_7) or (SELECTION_8) or (SELECTION_9)))
falsepositives:
- Unknown
id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
level: low
logsource:
  category: registry_set
  product: windows
modified: 2022/03/29
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
