title: Stealthy VSTO Persistence
ruletype: Sigma
author: Bhabesh Raj
date: 2021/01/10
description: Detects persistence via Visual Studio Tools for Office (VSTO) add-ins
    in Office applications.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - '*\Software\Microsoft\Office\Outlook\Addins\\*'
        - '*\Software\Microsoft\Office\Word\Addins\\*'
        - '*\Software\Microsoft\Office\Excel\Addins\\*'
        - '*\Software\Microsoft\Office\Powerpoint\Addins\\*'
        - '*\Software\Microsoft\VSTO\Security\Inclusion\\*'
    SELECTION_6:
        NewProcessName:
        - '*\msiexec.exe'
        - '*\regsvr32.exe'
    SELECTION_7:
        NewProcessName:
        - '*\winword.exe'
        - '*\integrator.exe'
        - '*\OfficeClickToRun.exe'
    SELECTION_8:
        NewProcessName: C:\Program Files\AVG\Antivirus\RegSvr.exe
    SELECTION_9:
        TargetObject: '*\Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\\*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7) or (SELECTION_8 and
        SELECTION_9)))
falsepositives:
- Legitimate Addin Installation
id: 9d15044a-7cfe-4d23-8085-6ebc11df7685
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/06/10
references:
- https://twitter.com/_vivami/status/1347925307643355138
- https://vanmieghem.io/stealth-outlook-persistence/
status: experimental
tags:
- attack.t1137.006
- attack.persistence

