title: Potential Provisioning Registry Key Abuse For Binary Proxy Execution - REG
id: 010beef6-dccd-7edc-c751-9236ab787158
status: experimental
description: Detects potential abuse of the provisioning registry key for indirect command execution through "Provlaunch.exe".
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Swachchhanda Shrawan Poudel
date: 2023/08/02
modified: 2023/08/17
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: registry_set
    product: windows
    definition: 'Requirements: The registry key "\SOFTWARE\Microsoft\Provisioning\Commands\" and its subkey must be monitored'
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: \SOFTWARE\Microsoft\Provisioning\Commands\
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
