title: Potential Persistence Via Netsh Helper DLL - Registry
id: 6191bb45-e2d4-dc12-74c9-be6994d84572
status: experimental
description: |
    Detects changes to the Netsh registry key to add a new DLL value. This change might be an indication of a potential persistence attempt by adding a malicious Netsh helper
references:
    - https://www.ired.team/offensive-security/persistence/t1128-netsh-helper-dll
    - https://pentestlab.blog/2019/10/29/persistence-netsh-helper-dll/
author: Anish Bogati
date: 2023/11/28
tags:
    - attack.persistence
    - attack.t1546.007
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: \SOFTWARE\Microsoft\NetSh
        NewValue|contains: .dll
    condition: registry_set and selection
falsepositives:
    - Legitimate helper added by different programs and the OS
level: medium
ruletype: Sigma
