title: Suspicious New Printer Ports in Registry (CVE-2020-1048)
ruletype: Sigma
author: EagleEye Team, Florian Roth (Nextron Systems), NVISO
date: 2020/05/13
description: Detects a new and suspicious printer port creation in Registry that could
    be an attempt to exploit CVE-2020-1048
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Ports*
    SELECTION_6:
        NewValue:
        - '*.dll*'
        - '*.exe*'
        - '*.bat*'
        - '*.com*'
        - '*C:*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- New printer port install on host
id: 7ec912f2-5175-4868-b811-ec13ad0f8567
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/01/13
references:
- https://windows-internals.com/printdemon-cve-2020-1048/
status: test
tags:
- attack.persistence
- attack.execution
- attack.defense_evasion
- attack.t1112

