title: Potential Persistence Via CHM Helper DLL
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: Detects when an attacker modifies the registry key "HtmlHelp Author"
    to achieve persistence
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - '*\Software\Microsoft\HtmlHelp Author\Location*'
        - '*\Software\WOW6432Node\Microsoft\HtmlHelp Author\Location*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 976dd1f2-a484-45ec-aa1d-0e87e882262b
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/10
references:
- https://persistence-info.github.io/Data/htmlhelpauthor.html
- https://www.hexacorn.com/blog/2018/04/22/beyond-good-ol-run-key-part-76/
status: experimental
tags:
- attack.persistence

