title: Potential AutoLogger Sessions Tampering
id: c561b602-ffb8-a69c-10ef-7c35000d7bca
related:
    - id: f37b4bce-49d0-4087-9f5b-58bffda77316
      type: derived
status: test
description: Detects tampering with autologger trace sessions which is a technique used by attackers to disable logging
references:
    - https://twitter.com/MichalKoczwara/status/1553634816016498688
    - https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
    - https://i.blackhat.com/EU-21/Wednesday/EU-21-Teodorescu-Veni-No-Vidi-No-Vici-Attacks-On-ETW-Blind-EDRs.pdf
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-01
modified: 2025-10-07
tags:
    - attack.defense-evasion
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_main:
        ObjectName|contains: \System\CurrentControlSet\Control\WMI\Autologger\
    selection_values:
        ObjectName|contains:
            - \EventLog-
            - \Defender
        ObjectName|endswith:
            - \Enable
            - \Start
        NewValue: DWORD (0x00000000)
    filter_main_wevtutil:
        ProcessName: C:\Windows\system32\wevtutil.exe
    filter_main_defender:
        ProcessName|startswith:
            - C:\ProgramData\Microsoft\Windows Defender\Platform\
            - C:\Program Files\Windows Defender\
            - C:\Program Files (x86)\Windows Defender\
        ProcessName|endswith: \MsMpEng.exe
        ObjectName|contains:
            - \DefenderApiLogger\
            - \DefenderAuditLogger\
    condition: registry_set and (all of selection_* and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
