title: Winlogon AllowMultipleTSSessions Enable
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/09
description: 'Detects when the ''AllowMultipleTSSessions'' value is enabled.

    Which allows for multiple Remote Desktop connection sessions to be opened at once.

    This is often used by attacker as a way to connect to an RDP session without disconnecting
    the other users

    '
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\Microsoft\Windows NT\CurrentVersion\Winlogon\AllowMultipleTSSessions'
    SELECTION_6:
        NewValue: '*DWORD (0x00000001)'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Legitmate use of the multi session functionality
id: f7997770-92c3-4ec9-b112-774c4ef96f96
level: medium
logsource:
    category: registry_set
    product: windows
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: experimental
tags:
- attack.persistence

