title: Potential Persistence Via Outlook LoadMacroProviderOnBoot Setting
id: 2f221db9-1924-551f-ad98-7f01d47c6c7e
related:
    - id: 396ae3eb-4174-4b9b-880e-dc0364d78a19
      type: derived
status: test
description: Detects the modification of Outlook setting "LoadMacroProviderOnBoot" which if enabled allows the automatic loading of any configured VBA project/module
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53
    - https://www.linkedin.com/pulse/outlook-backdoor-using-vba-samir-b-/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2021-04-05
modified: 2023-08-17
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.command-and-control
    - attack.t1137
    - attack.t1008
    - attack.t1546
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith: \Outlook\LoadMacroProviderOnBoot
        NewValue|contains: '0x00000001'
    condition: registry_set and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
