title: Persistence Via MyComputer Key and SubKeys
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/09
description: Detects modification to the "Default" value of the "MyComputer" key and
    subkeys to point to a custom binary that will be launched whenever the associated
    action is executed (see reference section for example)
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\MyComputer*'
    SELECTION_6:
        TargetObject: '*(Default)'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unlikely but if you experience FPs add specific processes and locations you would
    like to monitor for
id: 8fbe98a8-8f9d-44f8-aa71-8c572e29ef06
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://www.hexacorn.com/blog/2017/01/18/beyond-good-ol-run-key-part-55/
status: experimental
tags:
- attack.persistence

