title: Potential Persistence Via AutodialDLL
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/10
description: Detects change the the "AutodialDLL" key which could be used as a persistence
    method to load custom DLL via the "ws2_32" library
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\Services\WinSock2\Parameters\AutodialDLL*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unlikely
id: e6fe26ee-d063-4f5b-b007-39e90aaf50e3
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/10
references:
- https://www.hexacorn.com/blog/2015/01/13/beyond-good-ol-run-key-part-24/
- https://persistence-info.github.io/Data/autodialdll.html
status: experimental
tags:
- attack.persistence

