title: Wow6432Node CurrentVersion Autorun Keys Modification
id: b29aed60-ebd1-442b-9cb5-16a1d0324adb
related:
    - id: 17f878b8-9968-4578-b814-c4217fc5768c
      type: obsoletes
status: experimental
description: Detects modification of autostart extensibility point (ASEP) in registry.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
    - https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
    - https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d # a list with registry keys
    - https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin, oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_wow_current_version_base:
        ObjectName|contains: \SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion
    selection_wow_current_version_keys:
        ObjectName|contains:
            - \ShellServiceObjectDelayLoad
            - \Run\
            - \RunOnce\
            - \RunOnceEx\
            - \RunServices\
            - \RunServicesOnce\
            - \Explorer\ShellServiceObjects
            - \Explorer\ShellIconOverlayIdentifiers
            - \Explorer\ShellExecuteHooks
            - \Explorer\SharedTaskScheduler
            - \Explorer\Browser Helper Objects
    filter_empty:
        NewValue: (Empty)
    filter_edge:
        ProcessName|contains|all:
            - C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{
            - \setup.exe
    filter_msoffice1:
        ProcessName: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\OfficeClickToRun.exe
        ObjectName|contains: \Office\ClickToRun\REGISTRY\MACHINE\Software\Wow6432Node\
    filter_msoffice2:
        ProcessName:
            - C:\Program Files\Microsoft Office\root\integration\integrator.exe
            - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
        ObjectName|contains: \Explorer\Browser Helper Objects\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}\
    filter_dropbox:
        - NewValue|endswith: -A251-47B7-93E1-CDD82E34AF8B}
        - NewValue: grpconv -o
        - NewValue|contains|all:
              - C:\Program Files
              - \Dropbox\Client\Dropbox.exe
              - ' /systemstartup'
    filter_evernote:
        ObjectName|endswith: \Explorer\Browser Helper Objects\{92EF2EAD-A7CE-4424-B0DB-499CF856608E}\NoExplorer
    filter_dotnet:
        ProcessName|contains: \windowsdesktop-runtime-
        ObjectName|endswith:
            - \WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}
            - \WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{7037b699-7382-448c-89a7-4765961d2537}
        NewValue|startswith: '"C:\ProgramData\Package Cache\'
        NewValue|endswith: .exe" /burn.runonce
    filter_office:
        ProcessName|startswith:
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
        ProcessName|endswith: \OfficeClickToRun.exe
    filter_ms_win_desktop_runtime:
        NewValue|startswith: '"C:\ProgramData\Package Cache\{d21a4f20-968a-4b0c-bf04-a38da5f06e41}\windowsdesktop-runtime-'
    filter_vcredist:
        ProcessName|endswith: \VC_redist.x64.exe
        NewValue|endswith: '}\VC_redist.x64.exe" /burn.runonce'
    filter_upgrades:
        ProcessName|startswith:
            - C:\ProgramData\Package Cache
            - C:\Windows\Temp\
        ProcessName|contains:
            - \winsdksetup.exe
            - \windowsdesktop-runtime-    # C:\WINDOWS\Temp\{751E2E78-46DC-4376-9205-99219CDC34AE}\.be\windowsdesktop-runtime-6.0.12-win-x86.exe
            - \AspNetCoreSharedFrameworkBundle-    # "C:\ProgramData\Package Cache\{b52191c1-a9c0-4b34-9a4e-930c2dd8a540}\AspNetCoreSharedFrameworkBundle-x86.exe" /burn.runonce
        NewValue|endswith: ' /burn.runonce'
    filter_uninstallers:
        # This image path is linked with different uninstallers when running as admin unfortunately
        ProcessName|startswith: C:\Windows\Installer\MSI
        ObjectName|contains: \Explorer\Browser Helper Objects
    filter_msiexec:
        ProcessName: C:\WINDOWS\system32\msiexec.exe
        ObjectName|contains: \SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion\Run\
    condition: registry_set and (all of selection_wow_current_version_* and not 1 of filter_*)
fields:
    - SecurityID
    - ObjectName
    - OldValueType
    - NewValueType
falsepositives:
    - Legitimate software automatically (mostly, during installation) sets up autorun keys for legitimate reason
    - Legitimate administrator sets up autorun keys for legitimate reason
level: medium
ruletype: Sigma
