title: DNS-over-HTTPS Enabled by Registry
id: 22adc86b-0198-3dfd-0cc2-f686d342be66
related:
    - id: 04b45a8a-d11d-49e4-9acc-4a1b524407a5
      type: derived
status: test
description: |
    Detects when a user enables DNS-over-HTTPS.
    This can be used to hide internet activity or be used to hide the process of exfiltrating data.
    With this enabled organization will lose visibility into data such as query type, response and originating IP that are used to determine bad actors.
references:
    - https://www.tenforums.com/tutorials/151318-how-enable-disable-dns-over-https-doh-microsoft-edge.html
    - https://github.com/elastic/detection-rules/issues/1371
    - https://chromeenterprise.google/policies/?policy=DnsOverHttpsMode
    - https://admx.help/HKLM/Software/Policies/Mozilla/Firefox/DNSOverHTTPS
author: Austin Songer
date: 2021-07-22
modified: 2023-08-17
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1140
    - attack.t1112
logsource:
    product: windows
    category: registry_set
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_edge:
        ObjectName|endswith: \SOFTWARE\Policies\Microsoft\Edge\BuiltInDnsClientEnabled
        NewValue: DWORD (0x00000001)
    selection_chrome:
        ObjectName|endswith: \SOFTWARE\Google\Chrome\DnsOverHttpsMode
        NewValue: secure
    selection_firefox:
        ObjectName|endswith: \SOFTWARE\Policies\Mozilla\Firefox\DNSOverHTTPS\Enabled
        NewValue: DWORD (0x00000001)
    condition: registry_set and (1 of selection_*)
falsepositives:
    - Unlikely
level: medium
ruletype: Sigma
