title: Windows Registry Persistence COM Search Order Hijacking
ruletype: Sigma
author: "Maxime Thiebaut (@0xThiebaut), oscd.community, C\xE9dric Hien"
date: 2020/04/14
description: Detects potential COM object hijacking leveraging the COM Search Order
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_10:
        NewValue: '*\AppData\Local\Microsoft\TeamsMeetingAddin\\*'
    SELECTION_11:
        NewValue: '*\Microsoft.Teams.AddinLoader.dll*'
    SELECTION_12:
        NewValue: '*\AppData\Roaming\Dropbox\\*'
    SELECTION_13:
        NewValue: '*\DropboxExt64.*.dll*'
    SELECTION_14:
        NewValue: '*TmopIEPlg.dll'
    SELECTION_15:
        NewProcessName:
        - C:\WINDOWS\system32\wuauclt.exe
        - C:\WINDOWS\system32\svchost.exe
    SELECTION_16:
        NewProcessName:
        - C:\ProgramData\Microsoft\Windows Defender\Platform\\*
        - C:\Program Files\Windows Defender\\*
    SELECTION_17:
        NewProcessName: '*\MsMpEng.exe'
    SELECTION_18:
        NewValue: '*\FileRepository\nvmdi.inf*'
    SELECTION_19:
        NewProcessName: '*\MicrosoftEdgeUpdateComRegisterShell64.exe'
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_20:
        NewProcessName: C:\WINDOWS\SYSTEM32\dxdiag.exe
    SELECTION_21:
        NewValue:
        - C:\Windows\pyshellext.amd64.dll
        - C:\Windows\pyshellext.dll
    SELECTION_22:
        NewValue:
        - C:\Windows\system32\dnssdX.dll
        - C:\Windows\SysWOW64\dnssdX.dll
    SELECTION_23:
        NewValue: C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
    SELECTION_24:
        NewValue:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_25:
        NewValue: C:\ProgramData\Microsoft\\*
    SELECTION_26:
        NewValue: '*C:\WINDOWS\system32\GamingServicesProxy.dll*'
    SELECTION_27:
        NewProcessName: C:\Windows\System32\poqexec.exe
    SELECTION_28:
        NewValue: '*C:\Windows\System32\Autopilot.dll*'
    SELECTION_29:
        NewProcessName: C:\Windows\system32\SecurityHealthService.exe
    SELECTION_3:
        Channel: Security
    SELECTION_30:
        NewValue: '*C:\Windows\System32\SecurityHealth*'
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - HKCR\CLSID\\*
        - HKCU\Software\Classes\CLSID\\*
    SELECTION_6:
        TargetObject: '*\InprocServer32\(Default)'
    SELECTION_7:
        NewValue:
        - '*%%systemroot%%\system32\\*'
        - '*%%systemroot%%\SysWow64\\*'
    SELECTION_8:
        NewValue:
        - '*\AppData\Local\Microsoft\OneDrive\\*'
        - '*\FileCoAuthLib64.dll*'
        - '*\FileSyncShell64.dll*'
        - '*\FileSyncApi64.dll*'
    SELECTION_9:
        NewProcessName: C:\WINDOWS\system32\SecurityHealthService.exe
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8) or (SELECTION_9)
        or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13) or (SELECTION_14)
        or (SELECTION_15) or (SELECTION_16 and SELECTION_17) or (SELECTION_18) or
        (SELECTION_19) or (SELECTION_20) or (SELECTION_21) or (SELECTION_22) or (SELECTION_23)
        or (SELECTION_24) or (SELECTION_25) or (SELECTION_26) or (SELECTION_27 and
        SELECTION_28) or (SELECTION_29 and SELECTION_30)))
falsepositives:
- Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level
id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/09/02
references:
- https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/
- https://attack.mitre.org/techniques/T1546/015/
status: experimental
tags:
- attack.persistence
- attack.t1546.015

