title: Potential PowerShell Execution Policy Tampering
id: 989dffb4-2561-5f0b-079e-74bfe39a050a
status: experimental
description: Detects changes to the PowerShell execution policy in order to bypass signing requirements for script execution
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/11
modified: 2023/12/14
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith:
            - \ShellIds\Microsoft.PowerShell\ExecutionPolicy
            - \Policies\Microsoft\Windows\PowerShell\ExecutionPolicy
        NewValue|contains:
            - Bypass
            - Unrestricted
    filter_main_svchost:
        # Note: We filter out "svchost" to avoid FP with changes using "gpedit" for example.
        ProcessName|contains:
            - :\Windows\System32\
            - :\Windows\SysWOW64\
    condition: registry_set and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
