
title: Lolbas OneDriveStandaloneUpdater.exe Proxy Download
ruletype: Sigma
author: frack113
date: 2022/05/28
description: |
  Detects setting a custom URL for OneDriveStandaloneUpdater.exe to download a file from the Internet without executing any
  anomalous executables with suspicious arguments. The downloaded file will be in C:\Users\redacted\AppData\Local\Microsoft\OneDrive\StandaloneUpdaterreSignInSettingsConfig.json
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*\SOFTWARE\Microsoft\OneDrive\UpdateOfficeConfig\UpdateRingSettingURLFromOC*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 3aff0be0-7802-4a7e-a4fa-c60c74bc5e1d
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/OneDriveStandaloneUpdater/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
