title: CrashControl CrashDump Disabled
id: 2ff692c2-4594-41ec-8fcb-46587de769e0
status: experimental
description: Detects disabling the CrashDump per registry (as used by HermeticWiper)
references:
    - https://www.sentinelone.com/labs/hermetic-wiper-ukraine-under-attack/
author: Tobias Michalski (Nextron Systems)
date: 2022/02/24
modified: 2022/08/23
tags:
    - attack.t1564
    - attack.t1112
logsource:
    product: windows
    category: registry_set
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        EventType: SetValue
        TargetObject|contains: SYSTEM\CurrentControlSet\Control\CrashControl
        Details: DWORD (0x00000000)
    condition: registry_set and selection
falsepositives:
    - Legitimate disabling of crashdumps
level: medium
ruletype: Sigma
