title: Wdigest Enable UseLogonCredential
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019/09/12
description: Detects potential malicious modification of the property value of UseLogonCredential
    from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable
    clear-text credentials
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*WDigest\UseLogonCredential'
    SELECTION_6:
        NewValue: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: d6a9b252-c666-4de6-8806-5561bbbd3bdc
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://threathunterplaybook.com/hunts/windows/190510-RegModWDigestDowngrade/notebook.html
- https://support.microsoft.com/en-us/topic/microsoft-security-advisory-update-to-improve-credentials-protection-and-management-may-13-2014-93434251-04ac-b7f3-52aa-9f951c14b649
- https://github.com/redcanaryco/atomic-red-team/blob/73fcfa1d4863f6a4e17f90e54401de6e30a312bb/atomics/T1112/T1112.md#atomic-test-3---modify-registry-to-store-logon-credentials
status: test
tags:
- attack.defense_evasion
- attack.t1112

