title: Suspicious Service Installed
ruletype: Sigma
author: xknow (@xknow_infosec), xorxes (@xor_xes)
date: 2019/04/08
description: 'Detects installation of NalDrv or PROCEXP152 services via registry-keys
    to non-system32 folders.

    Both services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs),
    which uses KDU (https://github.com/hfiref0x/KDU)

    '
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - HKLM\System\CurrentControlSet\Services\NalDrv\ImagePath
        - HKLM\System\CurrentControlSet\Services\PROCEXP152\ImagePath
    SELECTION_6:
        NewProcessName:
        - '*\procexp64.exe'
        - '*\procexp.exe'
        - '*\procmon64.exe'
        - '*\procmon.exe'
        - '*\handle.exe'
        - '*\handle64.exe'
    SELECTION_7:
        NewValue: '*\WINDOWS\system32\Drivers\PROCEXP152.SYS*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6 and SELECTION_7))
falsepositives:
- Other legimate tools using this service names and drivers. Note - clever attackers
    may easily bypass this detection by just renaming the services. Therefore just
    Medium-level and don't rely on it.
id: f2485272-a156-4773-82d7-1d178bc4905b
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/12/07
references:
- https://web.archive.org/web/20200419024230/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
status: test
tags:
- attack.t1562.001
- attack.defense_evasion

