title: Potential PendingFileRenameOperations Tamper
ruletype: Sigma
author: frack113
date: 2023/01/27
description: Detect changes to the "PendingFileRenameOperations" registry key from
    uncommon or suspicious images lcoations to stage currently used files for rename
    after reboot.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\CurrentControlSet\Control\Session Manager\PendingFileRenameOperations*'
    SELECTION_6:
        NewProcessName:
        - '*\AppData\Local\Temp\\*'
        - '*\Users\Public\\*'
    SELECTION_7:
        NewProcessName:
        - '*\reg.exe'
        - '*\regedit.exe'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5) and (SELECTION_6 or SELECTION_7))
falsepositives:
- Installers and updaters may set currently in use files for rename after a reboot.
id: 4eec988f-7bf0-49f1-8675-1e6a510b3a2a
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://any.run/report/3ecd4763ffc944fdc67a9027e459cd4f448b1a8d1b36147977afaf86bbf2a261/64b0ba45-e7ce-423b-9a1d-5b4ea59521e6
- https://devblogs.microsoft.com/scripting/determine-pending-reboot-statuspowershell-style-part-1/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc960241(v=technet.10)?redirectedfrom=MSDN
- https://www.trendmicro.com/en_us/research/21/j/purplefox-adds-new-backdoor-that-uses-websockets.html
- https://www.trendmicro.com/en_us/research/19/i/purple-fox-fileless-malware-with-rookit-component-delivered-by-rig-exploit-kit-now-abuses-powershell.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003

