title: Persistent Outlook Landing Today Pages
ruletype: Sigma
author: Tobias Michalski
date: 2021/06/10
description: Detects the manipulation of persistent URLs which could execute malicious
    code
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_10:
        NewProcessName:
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
    SELECTION_11:
        NewProcessName: '*\OfficeClickToRun.exe'
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*Software\Microsoft\Office\\*'
    SELECTION_6:
        TargetObject: '*\Outlook\Today\\*'
    SELECTION_7:
        TargetObject: '*Stamp'
    SELECTION_8:
        NewValue: DWORD (0x00000001)
    SELECTION_9:
        TargetObject: '*UserDefinedUrl'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
        SELECTION_5 and SELECTION_6) and ((SELECTION_7 and SELECTION_8) or SELECTION_9))
        and  not ((SELECTION_10 and SELECTION_11)))
falsepositives:
- Unknown
fields:
- Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/11/26
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
status: experimental
tags:
- attack.persistence
- attack.t1112

