title: Potential Persistence Via Outlook LoadMacroProviderOnBoot Setting
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2021/04/05
description: Detects the modification of Outlook setting "LoadMacroProviderOnBoot"
    which if enabled allows the automatic loading of any configured VBA project/module
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\Outlook\LoadMacroProviderOnBoot'
    SELECTION_6:
        NewValue: '*0x00000001*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 396ae3eb-4174-4b9b-880e-dc0364d78a19
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/02/08
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53
- https://www.linkedin.com/pulse/outlook-backdoor-using-vba-samir-b-/
status: experimental
tags:
- attack.persistence
- attack.command_and_control
- attack.t1137
- attack.t1008
- attack.t1546

