title: Potential Persistence Via Outlook Home Page
ruletype: Sigma
author: Tobias Michalski (Nextron Systems)
date: 2021/06/09
description: Detects potential persistence activity via outlook home pages.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - '*\Software\Microsoft\Office\\*'
        - '*\Outlook\WebView\\*'
    SELECTION_6:
        TargetObject: '*\URL'
    SELECTION_7:
        TargetObject:
        - '*\Calendar\\*'
        - '*\Inbox\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
fields:
- Details
id: ddd171b5-2cc6-4975-9e78-f0eccd08cc76
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/02/09
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
- https://support.microsoft.com/en-us/topic/outlook-home-page-feature-is-missing-in-folder-properties-d207edb7-aa02-46c5-b608-5d9dbed9bd04?ui=en-us&rs=en-us&ad=us
status: experimental
tags:
- attack.persistence
- attack.t1112

