title: Bypass UAC Using SilentCleanup Task
ruletype: Sigma
author: frack113
date: 2022/01/06
description: There is an auto-elevated task called SilentCleanup located in %windir%\system32\cleanmgr.exe
    This can be abused to elevate any file with Administrator privileges without prompting
    UAC
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject: '*\Environment\windir'
    SELECTION_5:
        NewValue: '*&REM*'
    SELECTION_6:
        EventType: SetValue
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 724ea201-6514-4f38-9739-e5973c34f49a
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md#atomic-test-9---bypass-uac-using-silentcleanup-task
- https://www.reddit.com/r/hacking/comments/ajtrws/bypassing_highest_uac_level_windows_810/
status: test
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002

