title: COM Hijacking via TreatAs
ruletype: Sigma
author: frack113
date: 2022/08/28
description: Detect modification of TreatAs key to enable "rundll32.exe -sta" command
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*TreatAs\(Default)'
    SELECTION_6:
        NewProcessName: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    SELECTION_7:
        NewProcessName: '*\OfficeClickToRun.exe'
    SELECTION_8:
        NewProcessName: C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    SELECTION_9:
        NewProcessName: C:\WINDOWS\system32\svchost.exe
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6 and SELECTION_7) or (SELECTION_8) or (SELECTION_9)))
falsepositives:
- Legitimate use
id: dc5c24af-6995-49b2-86eb-a9ff62199e82
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
- https://www.youtube.com/watch?v=3gz1QmiMhss&t=1251s
status: experimental
tags:
- attack.persistence
- attack.t1546.015

