
title: Suspicious Scripting in a WMI Consumer
author: Florian Roth, Jonhnathan Ribeiro
date: 2019/04/15
description: Detects suspicious scripting in WMI Event Consumers
detection:
  SELECTION_1:
    Destination: '*new-object*'
  SELECTION_2:
    Destination: '*net.webclient*'
  SELECTION_3:
    Destination: '*.downloadstring*'
  SELECTION_4:
    Destination: '*new-object*'
  SELECTION_5:
    Destination: '*net.webclient*'
  SELECTION_6:
    Destination: '*.downloadfile*'
  SELECTION_7:
    Destination:
    - '* iex(*'
    - '*WScript.shell*'
    - '* -nop *'
    - '* -noprofile *'
    - '* -decode *'
    - '* -enc *'
  SELECTION_8:
    Destination:
    - '*WScript.Shell*'
    - '*System.Security.Cryptography.FromBase64Transform*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6) or SELECTION_7 or SELECTION_8)
falsepositives:
- Administrative scripts
fields:
- User
- Operation
id: fe21810c-2a8c-478f-8dd3-5a287fb2a0e0
level: high
logsource:
  category: wmi_event
  product: windows
modified: 2021/09/01
references:
- https://in.security/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
- https://github.com/Neo23x0/signature-base/blob/master/yara/gen_susp_lnk_files.yar#L19
- https://github.com/RiccardoAncarani/LiquidSnake
status: experimental
tags:
- attack.execution
- attack.t1059.005
