title: Suspicious Epmap Connection
id: 58a2d80c-c77b-324c-640d-c97cf5fcbefa
related:
    - id: 628d7a0b-7b84-4466-8552-e6138bc03b43
      type: derived
status: deprecated
description: Detects suspicious "epmap" connection to a remote computer via remote procedure call (RPC)
references:
    - https://github.com/RiccardoAncarani/TaskShell/
author: frack113, Tim Shelton (fps)
date: 2022-07-14
modified: 2024-03-01
tags:
    - attack.lateral-movement
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Protocol: '6'
        Direction: '%%14593'
        DestPort: 135
    filter_image:
        Application|startswith:
            - \device\harddiskvolume?\Windows\
            - \device\harddiskvolume?\ProgramData\Amazon\SSM\Update\amazon-ssm-agent-updater
    filter_image_null1:
        Application: null
    filter_image_null2:
        Application: ''
    filter_image_unknown:
        Application: <unknown process>
    condition: network_connection and (selection and not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
