title: Execution via CL_Invocation.ps1 - Powershell
id: 6587075c-6239-f6e1-4717-4b7972b1c086
related:
    - id: 4cd29327-685a-460e-9dac-c3ab96e549dc
      type: derived
status: deprecated
description: Detects Execution via SyncInvoke in CL_Invocation.ps1 module
references:
    - https://lolbas-project.github.io/lolbas/Scripts/Cl_invocation/
    - https://twitter.com/bohops/status/948061991012327424
author: oscd.community, Natalia Shornikova
date: 2020/10/14
modified: 2023/08/17
tags:
    - attack.defense-evasion
    - attack.t1216
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains|all:
            - CL_Invocation.ps1
            - SyncInvoke
    condition: ps_script and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
