title: Suspicious PowerShell Invocations - Specific
ruletype: Sigma
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro
date: 2017/03/05
description: Detects suspicious PowerShell invocation command parameters
detection:
    SELECTION_1:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_10:
    - -nop
    SELECTION_11:
    - ' -c '
    SELECTION_12:
    - iex
    SELECTION_13:
    - New-Object
    SELECTION_14:
    - ' -w '
    SELECTION_15:
    - hidden
    SELECTION_16:
    - -ep
    SELECTION_17:
    - bypass
    SELECTION_18:
    - -Enc
    SELECTION_19:
    - powershell
    SELECTION_2:
    - -nop
    SELECTION_20:
    - reg
    SELECTION_21:
    - add
    SELECTION_22:
    - HKCU\software\microsoft\windows\currentversion\run
    SELECTION_23:
    - bypass
    SELECTION_24:
    - -noprofile
    SELECTION_25:
    - -windowstyle
    SELECTION_26:
    - hidden
    SELECTION_27:
    - new-object
    SELECTION_28:
    - system.net.webclient
    SELECTION_29:
    - .download
    SELECTION_3:
    - ' -w '
    SELECTION_30:
    - iex
    SELECTION_31:
    - New-Object
    SELECTION_32:
    - Net.WebClient
    SELECTION_33:
    - .Download
    SELECTION_34:
    - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
    - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
    - Write-ChocolateyWarning
    SELECTION_4:
    - hidden
    SELECTION_5:
    - ' -c '
    SELECTION_6:
    - '[Convert]::FromBase64String'
    SELECTION_7:
    - ' -w '
    SELECTION_8:
    - hidden
    SELECTION_9:
    - -noni
    condition: (SELECTION_1 and ((((((SELECTION_2 and SELECTION_3 and SELECTION_4
        and SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10 and SELECTION_11 and SELECTION_12 and SELECTION_13)) or (SELECTION_14
        and SELECTION_15 and SELECTION_16 and SELECTION_17 and SELECTION_18)) or (SELECTION_19
        and SELECTION_20 and SELECTION_21 and SELECTION_22)) or (SELECTION_23 and
        SELECTION_24 and SELECTION_25 and SELECTION_26 and SELECTION_27 and SELECTION_28
        and SELECTION_29)) or (SELECTION_30 and SELECTION_31 and SELECTION_32 and
        SELECTION_33)) and  not ((SELECTION_34)))
falsepositives:
- Unknown
id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
level: high
logsource:
    definition: Script block logging must be enabled for 4104, Module Logging must
        be enabled for 4103
    product: windows
    service: powershell
modified: 2022/04/11
status: deprecated
tags:
- attack.execution
- attack.t1059.001

