title: Suspicious PowerShell Invocations - Generic
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2017/03/12
description: Detects suspicious PowerShell invocation command parameters
detection:
    SELECTION_1:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_2:
    - ' -enc '
    - ' -EncodedCommand '
    SELECTION_3:
    - ' -w hidden '
    - ' -window hidden '
    - ' -windowstyle hidden '
    SELECTION_4:
    - ' -noni '
    - ' -noninteractive '
    condition: (SELECTION_1 and (SELECTION_2) and (SELECTION_3) and (SELECTION_4))
falsepositives:
- Very special / sneaky PowerShell scripts
id: 3d304fda-78aa-43ed-975c-d740798a49c1
level: high
logsource:
    product: windows
    service: powershell
modified: 2022/04/11
status: deprecated
tags:
- attack.execution
- attack.t1059.001

