title: Suspicious PowerShell Download
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
    SELECTION_1:
        Channel:
        - Microsoft-Windows-PowerShell/Operational
        - PowerShellCore/Operational
    SELECTION_2:
    - System.Net.WebClient
    SELECTION_3:
    - .DownloadFile(
    - .DownloadString(
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3))
falsepositives:
- PowerShell scripts that download content from the Internet
id: 65531a81-a694-4e31-ae04-f8ba5bc33759
level: medium
logsource:
    product: windows
    service: powershell
modified: 2022/04/11
status: deprecated
tags:
- attack.execution
- attack.t1059.001

