title: SyncAppvPublishingServer Execution to Bypass Powershell Restriction
ruletype: Sigma
author: "Ensar \u015Eamil, @sblmsrsn, OSCD Community"
date: 2020/10/05
description: Detects SyncAppvPublishingServer process execution which usually utilized
    by adversaries to bypass PowerShell execution restrictions.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\SyncAppvPublishingServer.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- App-V clients
id: fde7929d-8beb-4a4c-b922-be9974671667
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/04/11
references:
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
status: deprecated
tags:
- attack.defense_evasion
- attack.t1218

