title: DNS Tunnel Technique from MuddyWater
id: e22efaa2-ec7f-d290-fe53-4f72f4035c27
related:
    - id: 7454df60-1478-484b-810d-bff5d0ba6d4b
      type: derived
status: deprecated
description: Detecting DNS tunnel activity for Muddywater actor
references:
    - https://www.virustotal.com/gui/file/5ad401c3a568bd87dd13f8a9ddc4e450ece61cd9ce4d1b23f68ce0b1f3c190b7/
    - https://www.vmray.com/analyses/5ad401c3a568/report/overview.html
author: '@caliskanfurkan_'
date: 2020-06-04
modified: 2023-03-10
tags:
    - attack.command-and-control
    - attack.t1071.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: DataExchange.dll
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
        ParentProcessName|endswith: \excel.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
