title: Indirect Command Exectuion via Forfiles
id: 4bea8156-6003-3037-62a5-4be1429183b9
status: deprecated
description: Detects execition of commands and binaries from the context of "forfiles.exe". This can be used as a LOLBIN in order to bypass application whitelisting.
references:
    - https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-73d61931b2c77fde294189ce5d62323b416296a7c23ea98a608f425566538d1a
    - https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
author: Tim Rauch (rule), Elastic (idea), E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2022/10/17
modified: 2023/01/04
tags:
    - attack.defense_evasion
    - attack.t1202
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \forfiles.exe
    selection_c:
        ParentCommandLine|contains:
            - ' /c '
            - ' -c '
    selection_p:
        ParentCommandLine|contains:
            - ' /p '
            - ' -p '
    selection_m:
        ParentCommandLine|contains:
            - ' /m '
            - ' -m '
    filter:
        CommandLine|contains|all:
            - xcopy
            - cmd /c del
        NewProcessName|endswith: \cmd.exe
    condition: process_creation and (all of selection_* and not filter)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
