title: Execution via MSSQL Xp_cmdshell Stored Procedure
id: 807db7b2-c1e5-520b-2e63-7b2c400be00d
status: deprecated
description: Detects execution via MSSQL xp_cmdshell stored procedure. Malicious users may attempt to elevate their privileges by using xp_cmdshell, which is disabled by default.
references:
    - https://www.elastic.co/guide/en/security/current/execution-via-mssql-xp_cmdshell-stored-procedure.html
author: Tim Rauch
date: 2022/09/28
modified: 2023/03/06
tags:
    - attack.execution
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \cmd.exe
        - OriginalFileName: Cmd.Exe
    selection_parent:
        ParentProcessName|endswith: \sqlservr.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
