title: Winword.exe Loads Suspicious DLL
id: af42e8c8-7702-f542-d278-68bf89a26251
related:
    - id: 2621b3a6-3840-4810-ac14-a02426086171
      type: derived
status: deprecated
description: Detects Winword.exe loading a custom DLL using the /l flag
author: Victor Sergeev, oscd.community
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
date: 2020-10-09
modified: 2022-07-25
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: /l
        NewProcessName|endswith: \winword.exe
    condition: process_creation and selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: medium
tags:
    - attack.defense-evasion
    - attack.t1202
ruletype: Sigma
