title: Suspicious Execution of Sc to Delete AV Services
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/01
description: Detects when attackers use "sc.exe" to delete AV services from the system
    in order to avoid detection
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\sc.exe'
    SELECTION_4:
        OriginalFileName: sc.exe
    SELECTION_5:
        CommandLine: '* delete *'
    SELECTION_6:
        CommandLine:
        - '*AvgAdminServer*'
        - '*AVG Antivirus*'
        - '*MBEndpointAgent*'
        - '*MBAMService*'
        - '*MBCloudEA*'
        - '*avgAdminClient*'
        - '*SAVService*'
        - '*SAVAdminService*'
        - '*Sophos AutoUpdate Service*'
        - '*Sophos Clean Service*'
        - '*Sophos Device Control Service*'
        - '*Sophos File Scanner Service*'
        - '*Sophos Health Service*'
        - '*Sophos MCS Agent*'
        - '*Sophos MCS Client*'
        - '*SntpService*'
        - '*swc_service*'
        - '*swi_service*'
        - '*Sophos UI*'
        - '*swi_update*'
        - '*Sophos Web Control Service*'
        - '*Sophos System Protection Service*'
        - '*Sophos Safestore Service*'
        - '*hmpalertsvc*'
        - '*RpcEptMapper*'
        - '*Sophos Endpoint Defense Service*'
        - '*SophosFIM*'
        - '*swi_filter*'
        - '*FirebirdGuardianDefaultInstance*'
        - '*FirebirdServerDefaultInstance*'
        - '*WRSVC*'
        - '*ekrn*'
        - '*ekrnEpsw*'
        - '*klim6*'
        - '*AVP18.0.0*'
        - '*KLIF*'
        - '*klpd*'
        - '*klflt*'
        - '*klbackupdisk*'
        - '*klbackupflt*'
        - '*klkbdflt*'
        - '*klmouflt*'
        - '*klhk*'
        - '*KSDE1.0.0*'
        - '*kltap*'
        - '*ScSecSvc*'
        - '*Core Mail Protection*'
        - '*Core Scanning Server*'
        - '*Core Scanning ServerEx*'
        - '*Online Protection System*'
        - '*RepairService*'
        - '*Core Browsing Protection*'
        - '*Quick Update Service*'
        - '*McAfeeFramework*'
        - '*macmnsvc*'
        - '*masvc*'
        - '*mfemms*'
        - '*mfevtp*'
        - '*TmFilter*'
        - '*TMLWCSService*'
        - '*tmusa*'
        - '*TmPreFilter*'
        - '*TMSmartRelayService*'
        - '*TMiCRCScanService*'
        - '*VSApiNt*'
        - '*TmCCSF*'
        - '*tmlisten*'
        - '*TmProxy*'
        - '*ntrtscan*'
        - '*ofcservice*'
        - '*TmPfw*'
        - '*PccNTUpd*'
        - '*PandaAetherAgent*'
        - '*PSUAService*'
        - '*NanoServiceMain*'
        - '*EPIntegrationService*'
        - '*EPProtectedService*'
        - '*EPRedline*'
        - '*EPSecurityService*'
        - '*EPUpdateService*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Legitimate software deleting using the same method of deletion (Add it to a filter
    if you find cases as such)
id: 7fd4bb39-12d0-45ab-bb36-cebabc73dc7b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/04
references:
- https://www.virustotal.com/gui/file/38283b775552da8981452941ea74191aa0d203edd3f61fb2dee7b0aea3514955
status: deprecated
tags:
- attack.execution
- attack.defense_evasion
- attack.t1562.001

