title: Regsvr32 Anomaly
id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
status: deprecated
description: Detects various anomalies in relation to regsvr32.exe
references:
    - https://subt0x10.blogspot.de/2017/04/bypass-application-whitelisting-script.html
    - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
author: Florian Roth (Nextron Systems), oscd.community, Tim Shelton
date: 2019/01/16
modified: 2023/05/26
tags:
    - attack.defense_evasion
    - attack.t1218.010
    - car.2019-04-002
    - car.2019-04-003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        CommandLine|contains: \Temp\
        NewProcessName|endswith: \regsvr32.exe
    selection2:
        NewProcessName|endswith: \regsvr32.exe
        ParentProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \powershell_ise.exe
    selection3:
        NewProcessName|endswith: \regsvr32.exe
        ParentProcessName|endswith: \cmd.exe
    selection4a:
        CommandLine|contains|all:
            - '/i:'
            - http
        CommandLine|endswith: scrobj.dll
        NewProcessName|endswith: \regsvr32.exe
    selection4b:
        CommandLine|contains|all:
            - '/i:'
            - ftp
        CommandLine|endswith: scrobj.dll
        NewProcessName|endswith: \regsvr32.exe
    selection5:
        NewProcessName|endswith:
            - \cscript.exe
            - \wscript.exe
        ParentProcessName|endswith: \regsvr32.exe
    selection6:
        CommandLine|contains: '..\..\..\Windows\System32\regsvr32.exe '
        NewProcessName|endswith: \EXCEL.EXE
    selection7:
        ParentProcessName|endswith: \mshta.exe
        NewProcessName|endswith: \regsvr32.exe
    selection8:
        CommandLine|contains:
            - \AppData\Local
            - C:\Users\Public
        NewProcessName|endswith: \regsvr32.exe
    selection9: # suspicious extensions https://twitter.com/Max_Mal_/status/1542461200797163522/photo/3
        CommandLine|endswith:
            - .jpg
            - .jpeg
            - .png
            - .gif
            - .bin
            - .tmp
            - .temp
            - .txt
        NewProcessName|endswith: \regsvr32.exe
    filter1:
        CommandLine|contains:
            - \AppData\Local\Microsoft\Teams
            - \AppData\Local\WebEx\WebEx64\Meetings\atucfobj.dll
    filter2:
        CommandLine|contains: \Program Files\Box\Box\Temp\
        ParentProcessName: C:\Program Files\Box\Box\FS\streem.exe
    filter_legitimate:
        CommandLine|endswith: /s C:\Windows\System32\RpcProxy\RpcProxy.dll
    condition: process_creation and (1 of selection* and not 1 of filter*)
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
