title: Ryuk Ransomware Command Line Activity
ruletype: Sigma
author: Vasiliy Burov
date: 2019/08/06
description: Detects Ryuk Ransomware command lines
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_4:
        CommandLine: '*stop*'
    SELECTION_5:
        CommandLine:
        - '*samss*'
        - '*audioendpointbuilder*'
        - '*unistoresvc_*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unlikely
id: 0acaad27-9f02-4136-a243-c357202edd74
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/
related:
-   id: c37510b8-2107-4b78-aa32-72f251e7a844
    type: similar
status: deprecated
tags:
- attack.execution
- attack.t1204

