title: Service Binary in Uncommon Folder
id: 42daf60a-a738-58f7-79c2-3888e02ebc89
related:
    - id: c625c4c2-515d-407f-8bb6-456f65955669
      type: derived
status: deprecated
description: Detect the creation of a service with a service binary located in a uncommon directory
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
author: Florian Roth (Nextron Systems)
date: 2022-05-02
modified: 2024-03-25
tags:
    - attack.defense-evasion
    - attack.t1112
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_1:
        ObjectName|startswith: \REGISTRY\MACHINE\System\CurrentControlSet\Services\
        ObjectName|endswith: \Start
        ProcessName|contains:
            - \AppData\Local\
            - \AppData\Roaming\
        NewValue:
            - DWORD (0x00000000)    # boot
            - DWORD (0x00000001)    # System
            - DWORD (0x00000002)    # Automatic
            # 3 - Manual , 4 - Disabled
    selection_2:
        ObjectName|startswith: \REGISTRY\MACHINE\System\CurrentControlSet\Services\
        ObjectName|endswith: \ImagePath
        NewValue|contains:
            - \AppData\Local\
            - \AppData\Roaming\
    filter:
        - ProcessName|contains:
              - \AppData\Roaming\Zoom
              - \AppData\Local\Zoom
        - NewValue|contains:
              - \AppData\Roaming\Zoom
              - \AppData\Local\Zoom
    condition: registry_set and (1 of selection_* and not filter)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
