title: Domain Trust Discovery
id: 77815820-246c-47b8-9741-e0def3f57308
status: deprecated
description: Detects a discovery of domain trusts.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1482/T1482.md
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
modified: 2023/02/04
tags:
    - attack.discovery
    - attack.t1482
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - CommandLine|contains|all:
              - -filter
              - trustedDomain
          NewProcessName|endswith: \dsquery.exe
        - CommandLine|contains: domain_trusts
          NewProcessName|endswith: \nltest.exe
    condition: process_creation and selection
falsepositives:
    - Administration of systems.
level: medium
ruletype: Sigma
