title: WMI Event Subscription
id: 3318e98f-7614-2bef-f5b2-78af7cbba518
related:
    - id: 0f06a3a5-6a09-413f-8743-e6cf35561297
      type: derived
status: test
description: Detects creation of WMI event subscription persistence method
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-19-wmievent-wmieventfilter-activity-detected
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-20-wmievent-wmieventconsumer-activity-detected
    - https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon#event-id-21-wmievent-wmieventconsumertofilter-activity-detected
author: Tom Ueltschi (@c_APT_ure)
date: 2019-01-12
modified: 2021-11-27
tags:
    - attack.persistence
    - attack.t1546.003
logsource:
    product: windows
    category: wmi_event
detection:
    wmi_event:
        EventID: 5861
        Channel: Microsoft-Windows-WMI-Activity/Operational
    selection:
        EventID:
            - 19
            - 20
            - 21
    condition: wmi_event and selection
falsepositives:
    - Exclude legitimate (vetted) use of WMI event subscription in your network
level: medium
ruletype: Sigma
