
title: Disable Tamper Protection on Windows Defender
ruletype: Sigma
author: Austin Songer @austinsonger
date: 2021/08/04
description: Detects disabling Windows Defender Tamper Protection
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*\Microsoft\Windows Defender\Features\TamperProtection*'
  SELECTION_6:
    NewValue: DWORD (0x00000000)
  SELECTION_7:
    NewProcessName: C:\ProgramData\Microsoft\Windows Defender\Platform\\*
  SELECTION_8:
    NewProcessName: '*\MsMpEng.exe'
  SELECTION_9:
    NewProcessName: C:\Program Files\Windows Defender\MsMpEng.exe
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6) and  not ((SELECTION_7 and SELECTION_8) or (SELECTION_9)))
falsepositives:
- Unknown
id: 93d298a1-d28f-47f1-a468-d971e7796679
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/04/21
references:
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
