
title: Windows Registry Persistence COM Search Order Hijacking
ruletype: Sigma
author: Maxime Thiebaut (@0xThiebaut), oscd.community, Cédric Hien
date: 2020/04/14
description: Detects potential COM object hijacking leveraging the COM Search Order
detection:
  SELECTION_1:
    EventID: 4657
  SELECTION_10:
    NewValue: '*\Microsoft.Teams.AddinLoader.dll*'
  SELECTION_11:
    NewValue: '*\AppData\Roaming\Dropbox\\*'
  SELECTION_12:
    NewValue: '*\DropboxExt64.*.dll*'
  SELECTION_13:
    NewValue: '*TmopIEPlg.dll'
  SELECTION_14:
    NewProcessName:
    - C:\WINDOWS\system32\wuauclt.exe
    - C:\WINDOWS\system32\svchost.exe
  SELECTION_15:
    NewProcessName:
    - C:\ProgramData\Microsoft\Windows Defender\Platform\\*
    - C:\Program Files\Windows Defender\\*
  SELECTION_16:
    NewProcessName: '*\MsMpEng.exe'
  SELECTION_17:
    NewValue:
    - '*\FileRepository\nvmdi.inf*'
  SELECTION_18:
    NewProcessName: '*\MicrosoftEdgeUpdateComRegisterShell64.exe'
  SELECTION_19:
    NewProcessName: C:\WINDOWS\SYSTEM32\dxdiag.exe
  SELECTION_2:
    OperationType:
    - Existing registry value modified
  SELECTION_20:
    NewValue:
    - C:\Windows\pyshellext.amd64.dll
    - C:\Windows\pyshellext.dll
  SELECTION_21:
    NewValue:
    - C:\Windows\system32\dnssdX.dll
    - C:\Windows\SysWOW64\dnssdX.dll
  SELECTION_22:
    NewValue:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
  SELECTION_23:
    NewValue: '*C:\WINDOWS\system32\GamingServicesProxy.dll*'
  SELECTION_3:
    Channel: Security
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject:
    - HKCR\CLSID\\*
    - HKCU\Software\Classes\CLSID\\*
  SELECTION_6:
    TargetObject: '*\InprocServer32\(Default)'
  SELECTION_7:
    NewValue:
    - '*%%systemroot%%\system32\\*'
    - '*%%systemroot%%\SysWow64\\*'
  SELECTION_8:
    NewValue:
    - '*\AppData\Local\Microsoft\OneDrive\\*'
    - '*\FileCoAuthLib64.dll*'
    - '*\FileSyncShell64.dll*'
    - '*\FileSyncApi64.dll*'
  SELECTION_9:
    NewValue: '*\AppData\Local\Microsoft\TeamsMeetingAddin\\*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8) or (SELECTION_9 and
    SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13) or (SELECTION_14)
    or (SELECTION_15 and SELECTION_16) or (SELECTION_17) or (SELECTION_18) or (SELECTION_19)
    or (SELECTION_20) or (SELECTION_21) or (SELECTION_22) or (SELECTION_23)))
falsepositives:
- Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level
id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/
- https://attack.mitre.org/techniques/T1546/015/
status: experimental
tags:
- attack.persistence
- attack.t1546.015
