
title: KeePass Password Dumping
ruletype: Sigma
author: Timon Hackenjos
date: 2022/04/22
description: Detects remote thread creation in KeePass.exe indicating password dumping
  activity
detection:
  SELECTION_1:
    EventID: 8
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetImage: '*\KeePass.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 77564cc2-7382-438b-a7f6-395c2ae53b9a
level: high
logsource:
  category: create_remote_thread
  product: windows
references:
- https://www.cisa.gov/uscert/ncas/alerts/aa20-259a
- https://github.com/denandz/KeeFarce
- https://github.com/GhostPack/KeeThief
status: experimental
tags:
- attack.credential_access
- attack.t1555.005
