title: Potential COM Object Hijacking Via TreatAs Subkey - Registry
id: 9b0f8a61-91b2-464f-aceb-0527e0a45020
status: test
description: Detects COM object hijacking via TreatAs subkey
references:
    - https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
author: Kutepov Anton, oscd.community
date: 2019/10/23
modified: 2023/02/07
tags:
    - attack.persistence
    - attack.t1546.015
logsource:
    category: registry_add
    product: windows
detection:
    registry_add:
        EventID: 4657
        Channel: Security
    selection:
        OperationType: '%%1904'
        ObjectName|contains|all:
            - \REGISTRY\USER\
            - Classes\CLSID\
            - \TreatAs
    filter_svchost:
        ProcessName: C:\WINDOWS\system32\svchost.exe
    condition: registry_add and (selection and not 1 of filter_*)
falsepositives:
    - Maybe some system utilities in rare cases use linking keys for backward compatibility
level: medium
ruletype: Sigma
