title: PUA - Sysinternals Tools Execution - Registry
id: cab7e60f-55aa-b72e-1943-4d3980028a43
status: test
description: Detects the execution of some potentially unwanted tools such as PsExec, Procdump, etc. (part of the Sysinternals suite) via the creation of the "accepteula" registry key.
references:
    - https://twitter.com/Moti_B/status/1008587936735035392
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/24
modified: 2023/02/07
tags:
    - attack.resource_development
    - attack.t1588.002
    - sysmon
logsource:
    product: windows
    category: registry_add
detection:
    registry_add:
        EventID: 4657
        Channel: Security
    selection:
        OperationType: '%%1904'
        ObjectName|contains:
            - \Active Directory Explorer
            - \Handle
            - \LiveKd
            - \Process Explorer
            - \ProcDump
            - \PsExec
            - \PsLoglist
            - \PsPasswd
            - \SDelete
            - \Sysinternals
        ObjectName|endswith: \EulaAccepted
    condition: registry_add and selection
falsepositives:
    - Legitimate use of SysInternals tools. Filter the legitimate paths used in your environment
level: medium
ruletype: Sigma
