title: Potential Persistence Via Logon Scripts - Registry
ruletype: Sigma
author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation of UserInitMprLogonScript persistence method
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - New registry value created
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: CreateKey
    SELECTION_5:
        TargetObject: '*UserInitMprLogonScript*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Exclude legitimate logon scripts
id: 9ace0707-b560-49b8-b6ca-5148b42f39fb
level: high
logsource:
    category: registry_add
    product: windows
modified: 2023/02/09
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.001/T1037.001.md
status: test
tags:
- attack.t1037.001
- attack.persistence
- attack.lateral_movement

