title: Suspicious Execution Of Renamed Sysinternals Tools - Registry
id: 6a724c01-e3a5-3f08-0a26-a25aab47a2d1
status: test
description: Detects the creation of the "accepteula" key related to the Sysinternals tools being created from executables with the wrong name (e.g. a renamed Sysinternals tool)
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/24
modified: 2023/02/07
tags:
    - attack.resource_development
    - attack.t1588.002
    - sysmon
logsource:
    product: windows
    category: registry_add
detection:
    registry_add:
        EventID: 4657
        Channel: Security
    selection:
        OperationType: '%%1904'
        ObjectName|contains:
            - \Active Directory Explorer
            - \Handle
            - \LiveKd
            - \ProcDump
            - \Process Explorer
            - \PsExec
            - \PsLoggedon
            - \PsLoglist
            - \PsPasswd
            - \PsPing
            - \PsService
            - \SDelete
        ObjectName|endswith: \EulaAccepted
    filter:
        ProcessName|endswith:
            # Please add new values while respecting the alphabetical order
            - \ADExplorer.exe
            - \ADExplorer64.exe
            - \handle.exe
            - \handle64.exe
            - \livekd.exe
            - \livekd64.exe
            - \procdump.exe
            - \procdump64.exe
            - \procexp.exe
            - \procexp64.exe
            - \PsExec.exe
            - \PsExec64.exe
            - \PsLoggedon.exe
            - \PsLoggedon64.exe
            - \psloglist.exe
            - \psloglist64.exe
            - \pspasswd.exe
            - \pspasswd64.exe
            - \PsPing.exe
            - \PsPing64.exe
            - \PsService.exe
            - \PsService64.exe
            - \sdelete.exe
    condition: registry_add and (selection and not filter)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
