title: Suspicious Access To Windows Credential History File
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/17
description: 'Detects suspicious processes based on name and location that access
    the Windows Credential History File.

    Which can be a sign of credential stealing. Example case would be usage of mimikatz
    "dpapi::credhist" function

    '
detection:
    SELECTION_1:
        FileName: '*\Microsoft\Protect\CREDHIST'
    SELECTION_2:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
        - C:\Windows\system32\\*
        - C:\Windows\SysWOW64\\*
    SELECTION_3:
        Image: C:\Windows\explorer.exe
    condition: (SELECTION_1 and  not ((SELECTION_2) or (SELECTION_3)))
falsepositives:
- Unknown
id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
level: medium
logsource:
    category: file_access
    definition: file_access rules are using the Microsoft-Windows-Kernel-File ETW
        provider
    product: windows
references:
- https://tools.thehacker.recipes/mimikatz/modules/dpapi/credhist
- https://www.passcape.com/windows_password_recovery_dpapi_credhist
status: experimental
tags:
- attack.credential_access
- attack.t1555.004

