title: Suspicious Access To Windows DPAPI Master Keys
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/10/17
description: Detects suspicious processes based on name and location that access the
    Windows Data Protection API Master keys. Which can be a sign of credential stealing.
    Example case would be usage of mimikatz "dpapi::masterkey" function
detection:
    SELECTION_1:
        FileName:
        - '*\Microsoft\Protect\S-1-5-18\\*'
        - '*\Microsoft\Protect\S-1-5-21-*'
    SELECTION_2:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
        - C:\Windows\system32\\*
        - C:\Windows\SysWOW64\\*
    condition: (SELECTION_1 and  not ((SELECTION_2)))
falsepositives:
- Unknown
id: 46612ae6-86be-4802-bc07-39b59feb1309
level: medium
logsource:
    category: file_access
    definition: file_access rules are using the Microsoft-Windows-Kernel-File ETW
        provider
    product: windows
references:
- https://web.archive.org/web/20181130065817/http://www.harmj0y.net/blog/redteaming/operational-guidance-for-offensive-user-dpapi-abuse/
- https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation/dpapi-extracting-passwords
status: experimental
tags:
- attack.credential_access
- attack.t1555.004

