title: Suspicious Access To Browser Credential Files
ruletype: Sigma
author: frack113
date: 2022/04/09
description: Detects suspicious processes based on name and location that access the
    browser credential stores which can be the sign of credential stealing
detection:
    SELECTION_1:
        FileName: '*\Appdata\Local\Microsoft\Windows\WebCache\WebCacheV01.dat'
    SELECTION_10:
        ParentImage: C:\Windows\System32\msiexec.exe
    SELECTION_2:
        FileName:
        - '*\cookies.sqlite'
        - '*release\key3.db'
        - '*release\key4.db'
        - '*release\logins.json'
    SELECTION_3:
        FileName:
        - '*\AppData\Local\Google\Chrome\User Data\Default\Network\Cookies*'
        - '*\Appdata\Local\Chrome\User Data\Default\Login Data*'
        - '*\AppData\Local\Google\Chrome\User Data\Local State*'
    SELECTION_4:
        Image: System
    SELECTION_5:
        ParentImage: Idle
    SELECTION_6:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
        - C:\WINDOWS\system32\\*
        - C:\WINDOWS\SysWOW64\\*
    SELECTION_7:
        Image: C:\ProgramData\Microsoft\Windows Defender\\*
    SELECTION_8:
        Image:
        - '*\MpCopyAccelerator.exe'
        - '*\MsMpEng.exe'
    SELECTION_9:
        Image:
        - '*\thor64.exe'
        - '*\thor.exe'
    condition: (((SELECTION_1 or SELECTION_2 or SELECTION_3) and  not ((SELECTION_4
        and SELECTION_5) or (SELECTION_6))) and  not ((SELECTION_7 and SELECTION_8)
        or (SELECTION_9) or (SELECTION_10)))
falsepositives:
- Antivirus, Anti-Spyware, Anti-Malware Software
- Backup software
- Legitimate software installed on partitions other than "C:\"
- Searching software such as "everything.exe"
id: 91cb43db-302a-47e3-b3c8-7ede481e27bf
level: medium
logsource:
    category: file_access
    definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
    product: windows
modified: 2023/03/28
references:
- https://www.zscaler.com/blogs/security-research/ffdroider-stealer-targeting-social-media-platform-users
- https://github.com/lclevy/firepwd
status: experimental
tags:
- attack.t1003
- attack.credential_access

