author: Zach Mathis
date: 2022/02/05
modified: 2022/02/05

title: Execution by non-exe file type
title_jp: 
details: 'Command: %CommandLine%  :  Path: %Image%  :  User: %User%  :  Parent Command: %ParentCommandLine%'
details_jp: 'コマンド: %CommandLine%  :  パス: %Image%  :  ユーザ: %User%  :  親コマンド: %ParentCommandLine%'
description: Checks whether the image specified in a process creation event doesn't refer to an .exe file.
description_jp: 

id: 8d1487f1-7664-4bda-83b5-cb2f79491b6a
level: high
status: stable
detection:
    selection:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID: 1
    filter_exes:
        Image|endswith: .exe
    filter_system_processes:
        - Image: C:\Windows\System32\scrnsave.scr
        - Image: C:\Windows\SysWOW64\scrnsave.scr
    condition: selection and not (filter_exes or filter_system_processes)
falsepositives:
    - normal system usage
tags:
    - attack.defense_evasion
references:
    - Based on a sigma rule by Max Altgelt but re-written due to many false positives and potential for false negatives.
sample-evtx: 
logsource: sysmon
ruletype: Hayabusa