author: Zach Mathis
date: 2022/03/23
modified: 2022/05/21

title: Deleted File Archived_Sysmon Alert
details: 'Rule: %RuleName% | %TargetFilename% | Process: %Image% | User: %User% | PID: %ProcessId% | PGUID: %ProcessGuid%' 
description: |
    A file was deleted. Additionally to logging the event, the deleted file is also saved in the ArchiveDirectory (which is C:\Sysmon by default). 
    Under normal operating conditions this directory might grow to an unreasonable size - see event ID 26: FileDeleteDetected for similar behavior but without saving the deleted files.

id: a1cebd95-3566-4413-95a4-264ca6da74f4
level: medium
status: test
logsource:
    product: windows
    service: sysmon
    definition: Sysmon needs to be installed and configured.
detection:
    selection_basic:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID:  23
    filter_no_alerts:
        - RuleName: ""
        - RuleName: "-"
    condition: selection_basic and not filter_no_alerts
falsepositives:
tags:
    - SysmonAlert
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon
ruletype: Hayabusa

sample-evtx: # No evtx sample yet.