author: Zach Mathis
date: 2022/03/23
modified:  2022/03/23

title: Sysmon Error
details: '%ID%: %Description%'
description: 

id: f9a0bb41-a47a-4acb-875b-d64da687ee91
level: low
status: stable
logsource:
    product: windows
    service: sysmon
    definition: 
detection:
    selection_basic:
        Channel: Microsoft-Windows-Sysmon/Operational
        EventID:  255
    condition: selection_basic
falsepositives:
tags:
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon
ruletype: Hayabusa

sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft-Windows-Sysmon" Guid="{5770385F-C22A-43E0-BF4C-06F5698FFBD9}"/>
            <EventID>255</EventID>
            <Version>3</Version>
            <Level>2</Level>
            <Task>255</Task>
            <Opcode>0</Opcode>
            <Keywords>0x8000000000000000</Keywords>
            <TimeCreated SystemTime="2018-09-07T21:01:08.505402400Z"/>
            <EventRecordID>25775</EventRecordID>
            <Correlation/>
            <Execution ProcessID="1644" ThreadID="2700"/>
            <Channel>Microsoft-Windows-Sysmon/Operational</Channel>
            <Computer>dmz-ftp</Computer>
            <Security UserID="S-1-5-18"/>
        </System>
        <EventData>
            <Data Name="UtcTime">2018-09-07 21:01:08.505</Data>
            <Data Name="ID">GetConfigurationOptions</Data>
            <Data Name="Description">Failed to open service configuration with error 19</Data>
        </EventData>
    </Event>