title: Potential ACTINIUM Persistence Activity
id: 08d5c383-090f-b317-6fdd-e815d17f2ab6
related:
    - id: e1118a8f-82f5-44b3-bb6b-8a284e5df602
      type: derived
status: test
description: Detects specific process parameters as used by ACTINIUM scheduled task persistence creation.
references:
    - https://www.microsoft.com/security/blog/2022/02/04/actinium-targets-ukrainian-organizations
author: Andreas Hunkeler (@Karneades)
date: 2022-02-07
modified: 2023-03-18
tags:
    - attack.privilege-escalation
    - attack.execution
    - attack.persistence
    - attack.t1053
    - attack.t1053.005
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - schtasks
            - create
            - wscript
            - ' /e:vbscript'
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
