author: Joshua Wright, Zach Mathis
date: 2022/02/05
modified: 2022/02/05

title: Possible Hidden Service Attempt
title_jp: 
details: 'Service: %ObjectName%  :  User: %SubjectUserName%  :  LogonID: %SubjectLogonId%  :  AccessMask: %AccessMask%'
details_jp: 'サービス: %ObjectName%  :  ユーザ: %SubjectUserName%  :  ログオンID: %SubjectLogonId%  :  アクセスマスク: %AccessMask%'
description: User requested to modify the Dynamic Access Control (DAC) permissions of a service, possibly to hide it from view.
description_jp: 

id: 15db3cc7-30bd-47a0-bd75-66208ce8e3fe
level: medium
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4674
        ObjectType: "SERVICE OBJECT"
        AccessMask|contains: "%%1539" #WRITE_DAC access.
    selection_process_name:
        - ProcessName: C:\Windows\System32\services.exe
        - ProcessName: C:\Windows\SysWOW64\services.exe
    condition: selection and selection_process_name
falsepositives:
    - unknown
tags:
    - attack.persistence
    - attack.t1543.003
references:
    - https://www.sans.org/blog/defense-spotlight-finding-hidden-windows-services/
    - https://www.programmerall.com/article/44712133120/
sample-evtx: \hayabusa-sample-evtx\DeepBlueCLI\event-dac.evtx
logsource: default
ruletype: Hayabusa
