author: Eric Conrad, Zach Mathis
date: 2020/11/08
modified: 2021/12/22

title: User Added To Local Administrators Group
title_jp: ユーザがローカル管理者グループに追加された
details: 'SID: %MemberSid%  :  Group: %TargetUserName%  :  LogonID: %SubjectLogonId%'
details_jp: 'SID: %MemberSid%  :  グループ名: %TargetUserName%  :  ログオンID: %SubjectLogonId%'
description: A user was added to the local Administrators group. Unfortunately the user name does not get recorded in the log, only the SID, so you need to look up the username via the SID.
description_jp: ユーザがローカル管理者グループに追加された。

id: 611e2e76-a28f-4255-812c-eb8836b2f5bb
level: high
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4732
        TargetUserName: Administrators
    condition: selection
falsepositives:
    - system administrator
tags:
    - attack.persistence
    - attack.t1098
references:
    - https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=4732
sample-evtx: ./sample-evtx/EVTX-to-MITRE-Attack/TA0003-Persistence/T1098.xxx-Account manipulation/ID4732-User added to local admin groups.evtx
logsource: default
ruletype: Hayabusa