title: Defrag Deactivation - Security
ruletype: Sigma
author: Florian Roth (Nextron Systems), Bartlomiej Czyz (@bczyz1)
date: 2019/03/04
description: Detects the deactivation and disabling of the Scheduled defragmentation
    task as seen by Slingshot APT group
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4701
    SELECTION_3:
        TaskName: \Microsoft\Windows\Defrag\ScheduledDefrag
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: c5a178bf-9cfb-4340-b584-e4df39b6a3e7
level: medium
logsource:
    definition: 'Requirements: Audit Policy : Audit Other Object Access Events > Success'
    product: windows
    service: security
modified: 2022/11/27
references:
- https://securelist.com/apt-slingshot/84312/
related:
-   id: 958d81aa-8566-4cea-a565-59ccd4df27b0
    type: derived
status: test
tags:
- attack.persistence
- attack.t1053
- attack.s0111

