
title: Logon Scripts Creation in UserInitMprLogonScript Registry
ruletype: Sigma
author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation of UserInitMprLogonScript persistence method
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    TargetObject: '*UserInitMprLogonScript*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Exclude legitimate logon scripts
id: 9ace0707-b560-49b8-b6ca-5148b42f39fb
level: high
logsource:
  category: registry_add
  product: windows
modified: 2022/03/26
references:
- https://attack.mitre.org/techniques/T1037/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1037.001/T1037.001.md
status: test
tags:
- attack.t1037.001
- attack.persistence
- attack.lateral_movement
