
title: Sysinternals SDelete Registry Keys
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection to trigger for the creation or modification of .*\Software\Sysinternals\SDelete
  registry keys. Indicators of the use of Sysinternals SDelete tool.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    TargetObject: '*\Software\Sysinternals\SDelete*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 9841b233-8df8-4ad7-9133-b0b4402a9014
level: medium
logsource:
  category: registry_add
  product: windows
modified: 2022/03/26
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/9
- https://threathunterplaybook.com/evals/apt29/detections/4.B.2_59A9AC92-124D-4C4B-A6BF-3121C98677C3.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
