
title: Windows Registry Persistence COM Key Linking
ruletype: Sigma
author: Kutepov Anton, oscd.community
date: 2019/10/23
description: Detects COM object hijacking via TreatAs subkey
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventType: CreateKey
  SELECTION_3:
    TargetObject: '*HKU\\*'
  SELECTION_4:
    TargetObject: '*Classes\CLSID\\*'
  SELECTION_5:
    TargetObject: '*\TreatAs*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Maybe some system utilities in rare cases use linking keys for backward compatibility
id: 9b0f8a61-91b2-464f-aceb-0527e0a45020
level: medium
logsource:
  category: registry_add
  product: windows
modified: 2022/03/26
references:
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
status: experimental
tags:
- attack.persistence
- attack.t1546.015
