author: Zach Mathis
creation_date: 2022/02/06
updated_date: 2022/02/06

title: Event Log Service Started
title_jp: イベントログサービスが開始された
details: 
details_jp: 
description: Startup, restarting the event log service, etc...
description_jp: 

id: 11dc7d25-01c9-4b07-9d91-8e07b60d8fd3
level: informational
status: stable
detection:
    selection:
        Channel: System
        EventID: 6005
    condition: selection
falsepositives:
tags:
references:
logsource: default
ruletype: Hayabusa