author: Zach Mathis
date: 2022/02/06
modified: 2022/03/22

title: Event Log Service Stopped
title_jp: イベントログサービスが停止された
details: 
details_jp: 
description: Shutdown, reboot, event log service stopped, etc...
description_jp: 

id: b6d53116-36b2-4413-a99b-e6708f9c3027
level: informational
status: stable
logsource:
    product: windows
    service: system
detection:
    selection:
        Channel: System
        EventID: 6006
    condition: selection
falsepositives:
tags:
references:
ruletype: Hayabusa