author: Zach Mathis
creation_date: 2022/02/06
updated_date: 2022/02/06

title: New service installed
title_jp: 新しいサービスがインストールされた
details: 'Service: %ServiceName%  :  Path: %ImagePath%  :  Account: %AccountName%  :  Start Type: %StartType%'
details_jp: 'サービス: %ServiceName%  :  パス: %ImagePath%  :  アカウント: %AccountName%  :  スタートタイプ: %StartType%'
description: A new service was installed. (Possibly malware.)
description_jp: 新しいサービスがインストールされた。

id: 64c5d39d-10a7-44f4-b5d6-fd0d93d0a69f
level: informational
status: stable
detection:
    selection:
        Channel: System
        EventID: 7045
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
logsource: default
ruletype: Hayabusa