author: Zach Mathis
date: 2022/02/06
modified: 2022/03/22

title: New Service Installed
title_jp: 新しいサービスがインストールされた
details: 'Name: %ServiceName% | Path: %ImagePath% | Account: %AccountName% | Start Type: %StartType%'
details_jp: 'サービス: %ServiceName% | パス: %ImagePath% | アカウント: %AccountName% | スタートタイプ: %StartType%'
description: A new service was installed. (Possibly malware.)
description_jp: 新しいサービスがインストールされた。

id: 64c5d39d-10a7-44f4-b5d6-fd0d93d0a69f
level: informational
status: stable
logsource:
    product: windows
    service: system
detection:
    selection:
        Channel: System
        EventID: 7045
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
ruletype: Hayabusa