author: Zach Mathis
date: 2023/01/11
modified: 2023/01/11

title: 'Credential Manager Accessed'
description: 'A process has read credentials in the Credential Manager. There will be many false positives so check if the Process ID (PID) is that of known malware on the system.'

id: d478c070-8f84-4e65-9f45-cc432a000e93
level: low
status: experimental
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: 'Security'
        EventID: 5379
        ReadOperation: '%%8099' # Credentials read 
    filter:
        - CountOfCredentialsReturned: 0
        - SubjectUserName: 'LOCAL SERVICE'
        - SubjectUserName|endswith: '$' # Filter computer accounts
    condition: selection_basic and not filter
falsepositives:
    - 'High. This event will often happen legitimately.'
tags:
    - attack.credential_access
    - attack.t1555.004
references:
    - https://www.techradar.com/news/what-is-windows-credential-manager
    - https://attack.mitre.org/techniques/T1555/004/
ruletype: Hayabusa