title: Dump Ntds.dit To Suspicious Location
id: 94dc4390-6b7c-4784-8ffc-335334404650
status: test
description: Detects potential abuse of ntdsutil to dump ntds.dit database to a suspicious
    location
references:
    - https://twitter.com/mgreen27/status/1558223256704122882
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj574207(v=ws.11)
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/14
modified: 2023/10/23
tags:
    - attack.execution
logsource:
    product: windows
    service: application
detection:
    application:
        Channel: Application
    selection_root:
        Provider_Name: ESENT
        EventID: 325
        Data|contains: ntds.dit
    selection_paths:
        Data|contains:
            - :\ntds.dit
            - \Appdata\
            - \Desktop\
            - \Downloads\
            - \Perflogs\
            - \Temp\
            - \Users\Public\
    condition: application and (all of selection_*)
falsepositives:
    - Legitimate backup operation/creating shadow copies
level: medium
ruletype: Sigma
