title: VsCode Code Tunnel Execution File Indicator
id: 4286c750-1361-1760-cdab-2d12daaee5be
related:
    - id: 9661ec9d-4439-4a7a-abed-d9be4ca43b6d
      type: derived
status: test
description: |
    Detects the creation of a file with the name "code_tunnel.json" which indicate execution and usage of VsCode tunneling utility. Attackers can abuse this functionality to establish a C2 channel
references:
    - https://ipfyx.fr/post/visual-studio-code-tunnel/
    - https://badoption.eu/blog/2023/01/31/code_c2.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-10-25
tags:
    - attack.command-and-control
    - detection.threat-hunting
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|endswith: \code_tunnel.json
    condition: file_event and selection
falsepositives:
    - Legitimate usage of VsCode tunneling functionality will also trigger this
level: medium
ruletype: Sigma
