title: Modification of IE Registry Settings
id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
status: experimental
description: Detects modification of the registry settings used for Internet Explorer and other Windows components that use these settings. An attacker can abuse this registry key to add a domain to the trusted sites Zone or insert javascript for persistence
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
author: frack113
date: 2022/01/22
modified: 2023/08/17
tags:
    - attack.defense_evasion
    - attack.t1112
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection_domains:
        ObjectName|contains: \Software\Microsoft\Windows\CurrentVersion\Internet Settings
    filter_dword:
        NewValue|startswith: DWORD
    filter_office:
        NewValue:
            - 'Cookie:'
            - 'Visited:'
            - (Empty)
    filter_path:
        ObjectName|contains:
            - \Cache
            - \ZoneMap
            - \WpadDecision
    filter_binary:
        NewValue: Binary Data
    filter_accepted_documents:
        # Spotted during office installations
        ObjectName|contains: \Accepted Documents\
    condition: registry_set and (selection_domains and not 1 of filter_*)
falsepositives:
    - Unknown
level: low
ruletype: Sigma
