title: Scheduled TaskCache Change by Uncommon Program
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
status: experimental
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled task is registered by a process that is not svchost.exe, which is suspicious
references:
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
    - https://labs.f-secure.com/blog/scheduled-task-tampering/
author: Syed Hasan (@syedhasan009)
date: 2021/06/18
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.t1053
    - attack.t1053.005
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\
    filter:
        ObjectName|contains:
            - Microsoft\Windows\UpdateOrchestrator
            - Microsoft\Windows\SoftwareProtectionPlatform\SvcRestartTask\Index
            - Microsoft\Windows\Flighting\OneSettings\RefreshCache\Index
    filter_tiworker:
        ProcessName|startswith: C:\Windows\
        ProcessName|endswith: \TiWorker.exe
    filter_svchost:
        ProcessName: C:\WINDOWS\system32\svchost.exe
    filter_ngen:
        ProcessName|startswith: C:\Windows\Microsoft.NET\Framework
        ProcessName|endswith: \ngen.exe
        ObjectName|contains:
            - \Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tasks\{B66B135D-DA06-4FC4-95F8-7458E1D10129}
            - \Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\Microsoft\Windows\.NET Framework\.NET Framework NGEN
    filter_office_click_to_run:
        ProcessName:
            - C:\Program Files\Microsoft Office\root\Integration\Integrator.exe
            - C:\Program Files (x86)\Microsoft Office\root\Integration\Integrator.exe
    filter_msiexec:
        ProcessName: C:\Windows\System32\msiexec.exe
    filter_dropbox_updater:
        ProcessName:
            - C:\Program Files (x86)\Dropbox\Update\DropboxUpdate.exe
            - C:\Program Files\Dropbox\Update\DropboxUpdate.exe
    filter_explorer:
        ProcessName: C:\Windows\explorer.exe
        ObjectName|contains: \Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\Microsoft\Windows\PLA\Server Manager Performance Monitor\
    filter_system:
        ProcessName: System
    condition: registry_set and (selection and not 1 of filter*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
