title: Potential Persistence Via TypedPaths
id: 086ae989-9ca6-4fe7-895a-759c5544f247
status: experimental
description: Detects modification addition to the 'TypedPaths' key in the user or admin registry from a non standard application. Which might indicate persistence attempt
references:
    - https://twitter.com/dez_/status/1560101453150257154
    - https://forensafe.com/blogs/typedpaths.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/22
modified: 2023/08/17
tags:
    - attack.persistence
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: \Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths\
    filter:
        ProcessName:
            - C:\Windows\explorer.exe
            - C:\Windows\SysWOW64\explorer.exe
    condition: registry_set and (selection and not filter)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
