title: Defrag Deactivation
id: 958d81aa-8566-4cea-a565-59ccd4df27b0
status: test
description: Detects the deactivation and disabling of the Scheduled defragmentation task as seen by Slingshot APT group
references:
    - https://securelist.com/apt-slingshot/84312/
author: Florian Roth (Nextron Systems), Bartlomiej Czyz (@bczyz1)
date: 2019/03/04
modified: 2022/10/09
tags:
    - attack.persistence
    - attack.t1053.005
    - attack.s0111
    - detection.emerging_threats
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains:
            - /delete
            - /change
        CommandLine|contains|all:
            - /TN
            - \Microsoft\Windows\Defrag\ScheduledDefrag
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
