
title: An Application Is Uninstall
ruletype: Sigma
author: frack113
date: 2022/01/28
description: An application have been remove check if it is a critical
detection:
  SELECTION_1:
    Provider_Name: MsiInstaller
  SELECTION_2:
    EventID: 11724
  SELECTION_3:
    EventID: 1034
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: 570ae5ec-33dc-427c-b815-db86228ad43e
level: low
logsource:
  product: windows
  service: application
status: experimental
tags:
- attack.impact
- attack.t1489
