title: MSI Installation From Web
ruletype: Sigma
author: Stamatis Chatzimangou
date: 2022/10/23
description: Detects installation of a remote msi file from web.
detection:
    SELECTION_1:
        Channel: Application
    SELECTION_2:
        Provider_Name: MsiInstaller
    SELECTION_3:
        EventID: 1040
    SELECTION_4:
        EventID: 1042
    SELECTION_5:
        Data: '*://*'
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Unknown
id: 5594e67a-7f92-4a04-b65d-1a42fd824a60
level: medium
logsource:
    product: windows
    service: application
modified: 2022/10/23
references:
- https://twitter.com/_st0pp3r_/status/1583922009842802689
status: experimental
tags:
- attack.execution
- attack.t1218
- attack.t1218.007

