title: Potential Credential Dumping Via WER - Application
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/07
description: Detects windows error reporting event where the process that crashed
    is lsass. This could be the cause of an intentional crash by techniques such as
    Lsass-Shtinkering to dump credential
detection:
    SELECTION_1:
        Channel: Application
    SELECTION_2:
        Provider_Name: Application Error
    SELECTION_3:
        EventID: 1000
    SELECTION_4:
        AppName: lsass.exe
    SELECTION_5:
        ExceptionCode: c0000001
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Rare legitimate crashing of the lsass process
id: a18e0862-127b-43ca-be12-1a542c75c7c5
level: high
logsource:
    product: windows
    service: application
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-erref/596a1078-e883-4972-9bbc-49e60bebca55
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

