title: A Rule Has Been Deleted From The Windows Firewall Exception List
ruletype: Sigma
author: frack113
date: 2022/02/19
description: Detects when a single rules or all of the rules have been deleted from
    the Windows Defender Firewall
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Firewall With Advanced Security/Firewall
    SELECTION_2:
        EventID: 2006
    SELECTION_3:
        EventID: 2052
    SELECTION_4:
        ModifyingApplication:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_5:
        ModifyingApplication: C:\Windows\System32\svchost.exe
    SELECTION_6:
        ModifyingApplication: C:\ProgramData\Microsoft\Windows Defender\Platform\\*
    SELECTION_7:
        ModifyingApplication: '*\MsMpEng.exe'
    condition: (SELECTION_1 and ((SELECTION_2 or SELECTION_3) and  not ((SELECTION_4)
        or (SELECTION_5))) and  not ((SELECTION_6 and SELECTION_7)))
id: c187c075-bb3e-4c62-b4fa-beae0ffc211f
level: medium
logsource:
    product: windows
    service: firewall-as
modified: 2023/04/21
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
status: experimental

