title: Firewall Rule Modified In The Windows Firewall Exception List
ruletype: Sigma
author: frack113
date: 2022/02/19
description: Detects when a rule has been modified in the windows firewall exception
    list
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Firewall With Advanced Security/Firewall
    SELECTION_2:
        EventID: 2005
    SELECTION_3:
        EventID: 2073
    SELECTION_4:
        ModifyingApplication:
        - C:\Program Files (x86)\\*
        - C:\Program Files\\*
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and  not ((SELECTION_4)))
id: 5570c4d9-8fdd-4622-965b-403a5a101aa0
level: low
logsource:
    product: windows
    service: firewall-as
modified: 2023/04/21
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
status: experimental

