title: All Rules Have Been Deleted From The Windows Firewall Configuration
ruletype: Sigma
author: frack113, Nasreddine Bencherchali
date: 2023/01/17
description: Detects when a all the rules have been deleted from the Windows Defender
    Firewall configuration
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Windows Firewall With Advanced Security/Firewall
    SELECTION_2:
        EventID: 2033
    SELECTION_3:
        ModifyingApplication:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_4:
        ModifyingApplication: C:\Windows\System32\svchost.exe
    SELECTION_5:
        ModifyingApplication: C:\ProgramData\Microsoft\Windows Defender\Platform\\*
    SELECTION_6:
        ModifyingApplication: '*\MsMpEng.exe'
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3) or (SELECTION_4)
        or (SELECTION_5 and SELECTION_6)))
id: 79609c82-a488-426e-abcf-9f341a39365d
level: high
logsource:
    product: windows
    service: firewall-as
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
status: experimental

