
title: Deteled Rule in Windows Firewall with Advanced Security
ruletype: Sigma
author: frack113
date: 2022/02/19
description: DA rule has been deleted in the Windows Firewall exception list.
detection:
  SELECTION_1:
    EventID: 2006
  SELECTION_2:
    EventID: 2033
  SELECTION_3:
    ModifyingApplication: C:\Windows\System32\svchost.exe
  SELECTION_4:
    ModifyingApplication:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
  condition: ((SELECTION_1 or SELECTION_2) and  not (SELECTION_3 or SELECTION_4))
id: c187c075-bb3e-4c62-b4fa-beae0ffc211f
level: medium
logsource:
  product: windows
  service: firewall-as
modified: 2022/02/22
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
status: experimental
