title: Suspicious Scheduled Task Creation
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/05
description: Detects suspicious scheduled task creation events. Based on attributes
    such as paths, commands line flags, etc.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4698
    SELECTION_3:
        TaskContent:
        - '*\AppData\Local\Temp\\*'
        - '*\AppData\Roaming\\*'
        - '*\Users\Public\\*'
        - '*\WINDOWS\Temp\\*'
        - '*C:\Temp\\*'
        - '*\Desktop\\*'
        - '*\Downloads\\*'
        - '*\Temporary Internet*'
        - '*C:\ProgramData\\*'
        - '*C:\Perflogs\\*'
    SELECTION_4:
        TaskContent:
        - '*regsvr32*'
        - '*rundll32*'
        - '*cmd.exe</Command>*'
        - '*cmd</Command>*'
        - '*<Arguments>/c *'
        - '*<Arguments>/k *'
        - '*<Arguments>/r *'
        - '*powershell*'
        - '*pwsh*'
        - '*mshta*'
        - '*wscript*'
        - '*cscript*'
        - '*certutil*'
        - '*bitsadmin*'
        - '*bash.exe*'
        - '*bash *'
        - '*scrcons*'
        - '*wmic *'
        - '*wmic.exe*'
        - '*forfiles*'
        - '*scriptrunner*'
        - '*hh.exe*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 3a734d25-df5c-4b99-8034-af1ddb5883a4
level: high
logsource:
    definition: The Advanced Audit Policy setting Object Access > Audit Other Object
        Access Events has to be configured to allow this detection. We also recommend
        extracting the Command field from the embedded XML in the event data.
    product: windows
    service: security
modified: 2022/12/07
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698
status: experimental
tags:
- attack.execution
- attack.privilege_escalation
- attack.persistence
- attack.t1053.005

