title: Win Susp Computer Name Containing Samtheadmin
ruletype: Sigma
author: elhoim
date: 2022/09/09
description: Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        SamAccountName: SAMTHEADMIN-*
    SELECTION_3:
        SamAccountName: '*$'
    SELECTION_4:
        TargetUserName: SAMTHEADMIN-*
    SELECTION_5:
        TargetUserName: '*$'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5)))
falsepositives:
- Unknown
fields:
- EventID
- SamAccountName
- SubjectUserName
- TargetUserName
id: 39698b3f-da92-4bc6-bfb5-645a98386e45
level: critical
logsource:
    product: windows
    service: security
modified: 2023/01/04
references:
- https://twitter.com/malmoeb/status/1511760068743766026
- https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py
- https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py
status: experimental
tags:
- cve.2021.42278
- cve.2021.42287
- attack.persistence
- attack.privilege_escalation
- attack.t1078

