title: Remote Access Tool Services Have Been Installed - Security
id: c8b00925-926c-47e3-beea-298fd563728e
related:
    -   id: 1a31b18a-f00c-4061-9900-f735b96c99fc
        type: similar
status: experimental
description: Detects service installation of different remote access tools software.
    These software are often abused by threat actors to perform
references:
    - https://redcanary.com/blog/misbehaving-rats/
author: Connor Martin, Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/23
modified: 2023/11/15
tags:
    - attack.persistence
    - attack.t1543.003
    - attack.t1569.002
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    security:
        Channel: Security
    selection:
        EventID: 4697
        ServiceName|contains:
            - AmmyyAdmin
            - Atera
            - BASupportExpressSrvcUpdater
            - BASupportExpressStandaloneService
            - chromoting
            - GoToAssist
            - GoToMyPC
            - jumpcloud
            - LMIGuardianSvc
            - LogMeIn
            - monblanking
            - Parsec
            - RManService
            - RPCPerformanceService
            - RPCService
            - SplashtopRemoteService
            - SSUService
            - TeamViewer
            - TightVNC
            - vncserver
            - Zoho
    condition: security and selection
falsepositives:
    - The rule doesn't look for anything suspicious so false positives are expected.
        If you use one of the tools mentioned, comment it out
level: medium
ruletype: Sigma
