
title: Suspicious Computer Account Name Change CVE-2021-42287
ruletype: Sigma
author: Florian Roth
date: 2021/12/22
description: Detects the renaming of an existing computer account to a account name
  that doesn't contain a $ symbol as seen in attacks against CVE-2021-42287
detection:
  SELECTION_1:
    EventID: 4781
  SELECTION_2:
    OldTargetUserName: '*$*'
  SELECTION_3:
    NewTargetUserName: '*$*'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Unknown
fields:
- EventID
- SubjectUserName
id: 45eb2ae2-9aa2-4c3a-99a5-6e5077655466
level: critical
logsource:
  product: windows
  service: security
references:
- https://medium.com/@mvelazco/hunting-for-samaccountname-spoofing-cve-2021-42287-and-domain-controller-impersonation-f704513c8a45
status: experimental
