
title: Uncommon Scheduled Task Once 00:00
ruletype: Sigma
author: pH-T
date: 2022/07/15
description: Detects scheduled task creation events that include suspicious actions,
  and is run once at 00:00
detection:
  SELECTION_1:
    Image: '*\schtasks.exe*'
  SELECTION_2:
    CommandLine:
    - '*wscript*'
    - '*vbscript*'
    - '*cscript*'
    - '*wmic *'
    - '*wmic.exe*'
    - '*regsvr32.exe*'
    - '*powershell*'
    - '*\AppData\\*'
  SELECTION_3:
    CommandLine: '*once*'
  SELECTION_4:
    CommandLine: '*00:00*'
  SELECTION_5:
    CommandLine: '*Joke*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    SELECTION_5))
falsepositives:
- Software installation
id: 970823b7-273b-460a-8afc-3a6811998529
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
status: experimental
