title: Register new Logon Process by Rubeus
id: a5498e1f-e40d-d8b1-bceb-5931f5169dbd
related:
    - id: 12e6d621-194f-4f59-90cc-1959e21e69f7
      type: derived
status: test
description: Detects potential use of Rubeus via registered new trusted logon process
references:
    - https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
author: Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community
date: 2019-10-24
modified: 2022-10-09
tags:
    - attack.lateral-movement
    - attack.privilege-escalation
    - attack.credential-access
    - attack.t1558.003
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 4611
        LogonProcessName: User32LogonProcesss
    condition: security and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
