title: Powerview Add-DomainObjectAcl DCSync AD Extend Right
ruletype: Sigma
author: Samir Bousseaden; Roberto Rodriguez @Cyb3rWard0g; oscd.community; Tim Shelton;
    Maxence Fossat
date: 2019/04/03
description: Backdooring domain object to grant the rights associated with DCSync
    to a regular user or machine account using Powerview\Add-DomainObjectAcl DCSync
    Extended Right cmdlet, will allow to re-obtain the pwd hashes of any user/computer
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5136
    SELECTION_3:
        AttributeLDAPDisplayName: ntSecurityDescriptor
    SELECTION_4:
        AttributeValue:
        - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
        - '*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*'
        - '*89e95b76-444d-4c62-991a-0facbeda640c*'
    SELECTION_5:
        ObjectClass:
        - dnsNode
        - dnsZoneScope
        - dnsZone
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5)))
falsepositives:
- New Domain Controller computer account, check user SIDs within the value attribute
    of event 5136 and verify if it's a regular user or DC computer account.
id: 2c99737c-585d-4431-b61a-c911d86ff32f
level: high
logsource:
    definition: The "Audit Directory Service Changes" logging policy must be configured
        in order to receive events. Audit events are generated only for objects with
        configured system access control lists (SACLs). Audit events are generated
        only for objects with configured system access control lists (SACLs) and only
        when accessed in a manner that matches their SACL settings. This policy covers
        the following events ids - 5136, 5137, 5138, 5139, 5141. Note that the default
        policy does not cover User objects. For that a custom AuditRule need to be
        setup (See https://github.com/OTRF/Set-AuditRule)
    product: windows
    service: security
modified: 2022/08/16
references:
- https://twitter.com/menasec1/status/1111556090137903104
- https://www.specterops.io/assets/resources/an_ace_up_the_sleeve.pdf
status: experimental
tags:
- attack.persistence
- attack.t1098

