title: Meterpreter or Cobalt Strike Getsystem Service Installation - Security
ruletype: Sigma
author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service installation
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_10:
        ServiceFileName: '*\pipe\\*'
    SELECTION_11:
        ServiceFileName: '*cmd.exe*'
    SELECTION_12:
        ServiceFileName: '*/c*'
    SELECTION_13:
        ServiceFileName: '*echo*'
    SELECTION_14:
        ServiceFileName: '*\pipe\\*'
    SELECTION_15:
        ServiceFileName: '*rundll32*'
    SELECTION_16:
        ServiceFileName: '*.dll,a*'
    SELECTION_17:
        ServiceFileName: '*/p:*'
    SELECTION_2:
        EventID: 4697
    SELECTION_3:
        ServiceFileName: '*cmd*'
    SELECTION_4:
        ServiceFileName: '*/c*'
    SELECTION_5:
        ServiceFileName: '*echo*'
    SELECTION_6:
        ServiceFileName: '*\pipe\\*'
    SELECTION_7:
        ServiceFileName: '*%COMSPEC%*'
    SELECTION_8:
        ServiceFileName: '*/c*'
    SELECTION_9:
        ServiceFileName: '*echo*'
    condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16 and SELECTION_17)))
falsepositives:
- Highly unlikely
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
- ServiceFileName
id: ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34
level: critical
logsource:
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
    product: windows
    service: security
modified: 2022/11/29
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
related:
-   id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
    type: derived
status: test
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002

