title: Add or Remove Computer from DC
ruletype: Sigma
author: frack113
date: 2022/10/14
description: Detects the creation or removal of a computer. Can be used to detect
    attacks such as DCShadow via the creation of a new SPN.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4741
    SELECTION_3:
        EventID: 4743
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: 20d96d95-5a20-4cf1-a483-f3bda8a7c037
level: low
logsource:
    product: windows
    service: security
references:
- https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4741
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4743
status: experimental

