
title: Mimikatz DC Sync
ruletype: Sigma
author: Benjamin Delpy, Florian Roth, Scott Dermott, Sorina Ionescu
date: 2018/06/03
description: Detects Mimikatz DC sync security events
detection:
  SELECTION_1:
    EventID: 4662
  SELECTION_2:
    Properties:
    - '*Replicating Directory Changes All*'
    - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
    - '*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*'
    - '*9923a32a-3607-11d2-b9be-0000f87a36b2*'
    - '*89e95b76-444d-4c62-991a-0facbeda640c*'
  SELECTION_3:
    AccessMask: '0x100'
  SELECTION_4:
    SubjectDomainName: Window Manager
  SELECTION_5:
    SubjectUserName:
    - NT AUTHORITY*
    - MSOL_*
  SELECTION_6:
    SubjectUserName: '*$'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)
    or (SELECTION_5) or (SELECTION_6)))
falsepositives:
- Valid DC Sync that is not covered by the filters; please report
- Local Domain Admin account used for Azure AD Connect
id: 611eab06-a145-4dfa-a295-3ccc5c20f59a
level: high
logsource:
  product: windows
  service: security
modified: 2022/03/15
references:
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
- https://blog.blacklanternsecurity.com/p/detecting-dcsync?s=r
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4662
status: experimental
tags:
- attack.credential_access
- attack.s0002
- attack.t1003.006
