title: External Remote SMB Logon from Public IP
ruletype: Sigma
author: Micah Babinski, @micahbabinski
date: 2023/01/19
description: Detects successful logon from public IP address via SMB. This can indicate
    a publicly-exposed SMB port.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4624
    SELECTION_3:
        LogonType: 3
    SELECTION_4:
        SubjectUserName: '-'
    SELECTION_5:
        IpAddress|cidr:
        - 10.0.0.0/8
        - 172.16.0.0/12
        - 192.168.0.0/16
        - 224.0.0.0/4
        - 127.0.0.0/8
    SELECTION_6:
        SubjectUserName: '-'
    SELECTION_7:
        IpAddress:
        - ::1*
        - 0:0:0:0:0:0:0:1*
        - fe80:*
        - fc*
        - fd*
    SELECTION_8:
        SubjectUserName: '-'
    SELECTION_9:
        IpAddress: '-'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
        and SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Legitimate or intentional inbound connections from public IP addresses on the SMB
    port.
id: 78d5cab4-557e-454f-9fb9-a222bd0d5edc
level: high
logsource:
    product: windows
    service: security
modified: 2023/02/23
references:
- https://www.inversecos.com/2020/04/successful-4624-anonymous-logons-to.html
- https://twitter.com/Purp1eW0lf/status/1616144561965002752
related:
-   id: 259a9cdf-c4dd-4fa2-b243-2269e5ab18a2
    type: derived
status: experimental
tags:
- attack.initial_access
- attack.credential_access
- attack.t1133
- attack.t1078
- attack.t1110

