title: Password Change on Directory Service Restore Mode (DSRM) Account
id: 4592ea29-1b0e-0cc3-7735-b7f264c0a5b8
related:
    - id: 53ad8e36-f573-46bf-97e4-15ba5bf4bb51
      type: derived
status: stable
description: The Directory Service Restore Mode (DSRM) account is a local administrator account on Domain Controllers. Attackers may change the password to gain persistence.
references:
    - https://adsecurity.org/?p=1714
author: Thomas Patzke
date: 2017/02/19
modified: 2020/08/23
tags:
    - attack.persistence
    - attack.t1098
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 4794
    condition: security and selection
falsepositives:
    - Initial installation of a domain controller
level: high
ruletype: Sigma
