title: Service Installed By Unusual Client - Security
ruletype: Sigma
author: Tim Rauch
date: 2022/09/15
description: Detects a service installed by a client which has PID 0 or whose parent
    has PID 0
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4697
    SELECTION_3:
        ClientProcessId: 0
    SELECTION_4:
        ParentProcessId: 0
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: c4e92a97-a9ff-4392-9d2d-7a4c642768ca
level: high
logsource:
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
    product: windows
    service: security
modified: 2023/01/04
references:
- https://www.elastic.co/guide/en/security/current/windows-service-installed-via-an-unusual-client.html
- https://twitter.com/SBousseaden/status/1490608838701166596
related:
-   id: 71c276aa-49cd-43d2-b920-2dcd3e6962d5
    type: similar
status: experimental
tags:
- attack.privilege_escalation
- attack.t1543

