title: Failed NTLM Logins with Different Accounts from Single Source System
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2017/01/10
description: Detects suspicious failed logins with different user accounts from a
    single source system
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4776
    SELECTION_3:
        TargetUserName: '*'
    SELECTION_4:
        Workstation: '*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4) | count(TargetUserName)
        by Workstation > 3
    timeframe: 24h
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: 6309ffc4-8fa2-47cf-96b8-a2f72e58e538
level: medium
logsource:
    product: windows
    service: security
modified: 2022/11/26
related:
-   id: e98374a6-e2d9-4076-9b5c-11bdb2569995
    type: derived
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1078

