title: Security Eventlog Cleared
ruletype: Sigma
author: Florian Roth
date: 2017/01/10
description: One of the Windows Eventlogs has been cleared. e.g. caused by "wevtutil
    cl" command execution
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 517
    SELECTION_3:
        Provider_Name: Security
    SELECTION_4:
        EventID: 1102
    SELECTION_5:
        Provider_Name: Microsoft-Windows-Eventlog
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5)))
falsepositives:
- Rollout of log collection agents (the setup routine often includes a reset of the
    local Eventlog)
- System provisioning (system reset before the golden image creation)
id: d99b79d2-0a6f-4f46-ad8b-260b6e17f982
level: high
logsource:
    product: windows
    service: security
modified: 2022/02/24
references:
- https://twitter.com/deviouspolack/status/832535435960209408
- https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100
related:
-   id: f2f01843-e7b8-4f95-a35a-d23584476423
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.001
- car.2016-04-002
yml_filename: win_susp_eventlog_cleared.yml
yml_path: rules/windows/builtin/security
---

