title: HybridConnectionManager Service Installation
id: 54f9b4d2-3f4a-675f-58d6-9995ae58f988
related:
    - id: 0ee4d8a5-4e67-4faf-acfa-62a78457d1f2
      type: derived
status: test
description: Rule to detect the Hybrid Connection Manager service installation.
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021-04-12
modified: 2022-10-09
tags:
    - attack.persistence
    - attack.t1554
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled to log the EID 4697
detection:
    security:
        Channel: Security
    selection:
        EventID: 4697
        ServiceName: HybridConnectionManager
        ServiceFileName|contains: HybridConnectionManager
    condition: security and selection
falsepositives:
    - Legitimate use of Hybrid Connection Manager via Azure function apps.
level: high
ruletype: Sigma
