title: Suspicious Outbound Kerberos Connection - Security
ruletype: Sigma
author: Ilyas Ochkov, oscd.community
date: 2019/10/24
description: Detects suspicious outbound network activity via kerberos default port
    indicating possible lateral movement or first stage PrivEsc via delegation.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5156
    SELECTION_3:
        DestPort: 88
    SELECTION_4:
        Application:
        - C:\Windows\System32\lsass.exe
        - C:\Program Files\Google\Chrome\Application\chrome.exe
        - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
        - C:\Program Files\Mozilla Firefox\firefox.exe
        - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)))
falsepositives:
- Web Browsers
id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
level: high
logsource:
    product: windows
    service: security
modified: 2023/01/30
references:
- https://github.com/GhostPack/Rubeus
related:
-   id: e54979bd-c5f9-4d6c-967b-a04b19ac4c74
    type: similar
status: test
tags:
- attack.lateral_movement
- attack.t1558.003

