
title: T1047 Wmiprvse Wbemcomn DLL Hijack
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/12
description: Detects a threat actor creating a file named `wbemcomn.dll` in the `C:\Windows\System32\wbem\`
  directory over the network for a WMI DLL Hijack scenario.
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    Provider_Name: Microsoft-Windows-Security-Auditing
  SELECTION_3:
    EventID: 5145
  SELECTION_4:
    RelativeTargetName: '*\wbem\wbemcomn.dll'
  SELECTION_5:
    SubjectUserName: '*$'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- Unknown
id: f6c68d5f-e101-4b86-8c84-7d96851fd65c
level: high
logsource:
  product: windows
  service: security
modified: 2022/02/24
references:
- https://threathunterplaybook.com/notebooks/windows/08_lateral_movement/WIN-201009173318.html
status: test
tags:
- attack.execution
- attack.t1047
- attack.lateral_movement
- attack.t1021.002
