title: Transferring Files with Credential Data via Network Shares
id: 73d3720b-e4f3-d7e1-2a3f-8ca0a5e1fc1b
related:
    - id: 2e69f167-47b5-4ae7-a390-47764529eff5
      type: similar
    - id: 910ab938-668b-401b-b08c-b596e80fdca5
      type: derived
status: test
description: Transferring files with well-known filenames (sensitive files with credential data) using network shares
references:
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
modified: 2021/11/30
tags:
    - attack.credential_access
    - attack.t1003.002
    - attack.t1003.001
    - attack.t1003.003
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 5145
        RelativeTargetName|contains:
            - \mimidrv
            - \lsass
            - \windows\minidump\
            - \hiberfil
            - \sqldmpr
            - \sam
            - \ntds.dit
            - \security
    condition: security and selection
falsepositives:
    - Transferring sensitive files for legitimate administration work by legitimate administrator
level: medium
ruletype: Sigma
