title: CobaltStrike Service Installations - Security
ruletype: Sigma
author: Florian Roth (Nextron Systems), Wojciech Lesicki
date: 2021/05/26
description: Detects known malicious service installs that appear in cases in which
    a Cobalt Strike beacon elevates privileges or lateral movement
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4697
    SELECTION_3:
        ServiceFileName: '*ADMIN$*'
    SELECTION_4:
        ServiceFileName: '*.exe*'
    SELECTION_5:
        ServiceFileName: '*%COMSPEC%*'
    SELECTION_6:
        ServiceFileName: '*start*'
    SELECTION_7:
        ServiceFileName: '*powershell*'
    SELECTION_8:
        ServiceFileName: '*powershell -nop -w hidden -encodedcommand*'
    SELECTION_9:
        ServiceFileName|base64offset|contains: 'IEX (New-Object Net.Webclient).DownloadString(''http://127.0.0.1:'
    condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6 and SELECTION_7) or SELECTION_8 or SELECTION_9))
falsepositives:
- Unknown
id: d7a95147-145f-4678-b85d-d1ff4a3bb3f6
level: high
logsource:
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
    product: windows
    service: security
modified: 2022/11/27
references:
- https://www.sans.org/webcasts/119395
- https://www.crowdstrike.com/blog/getting-the-bacon-from-cobalt-strike-beacon/
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
related:
-   id: 5a105d34-05fc-401e-8553-272b45c1522d
    type: derived
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.lateral_movement
- attack.t1021.002
- attack.t1543.003
- attack.t1569.002

