title: Scanner PoC for CVE-2019-0708 RDP RCE Vuln
ruletype: Sigma
author: Florian Roth (rule), Adam Bradbury (idea)
date: 2019/06/02
description: Detects the use of a scanner by zerosum0x0 that discovers targets vulnerable
    to  CVE-2019-0708 RDP RCE aka BlueKeep
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4625
    SELECTION_3:
        TargetUserName: AAAAAAA
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
id: 8400629e-79a9-4737-b387-5db940ab2367
level: high
logsource:
    product: windows
    service: security
modified: 2022/12/25
references:
- https://twitter.com/AdamTheAnalyst/status/1134394070045003776
- https://github.com/zerosum0x0/CVE-2019-0708
status: test
tags:
- attack.lateral_movement
- attack.t1210
- car.2013-07-002

