title: Secure Deletion with SDelete
id: 70c3269a-a7f2-49bd-1e28-a0921f353db7
related:
    - id: 39a80702-d7ca-4a83-b776-525b1f86a36d
      type: derived
status: test
description: Detects renaming of file while deletion with SDelete tool.
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/sdelete.htm
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://learn.microsoft.com/en-gb/sysinternals/downloads/sdelete
author: Thomas Patzke
date: 2017/06/14
modified: 2021/11/27
tags:
    - attack.impact
    - attack.defense_evasion
    - attack.t1070.004
    - attack.t1027.005
    - attack.t1485
    - attack.t1553.002
    - attack.s0195
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID:
            - 4656
            - 4663
            - 4658
        ObjectName|endswith:
            - .AAA
            - .ZZZ
    condition: security and selection
falsepositives:
    - Legitimate usage of SDelete
level: medium
ruletype: Sigma
