title: RottenPotato Like Attack Pattern
ruletype: Sigma
author: '@SBousseaden, Florian Roth'
date: 2019/11/15
description: Detects logon events that have characteristics of events generated during
    an attack with RottenPotato and the like
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4624
    SELECTION_3:
        LogonType: 3
    SELECTION_4:
        TargetUserName: ANONYMOUS LOGON
    SELECTION_5:
        WorkstationName: '-'
    SELECTION_6:
        IpAddress:
        - 127.0.0.1
        - ::1
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 16f5d8ca-44bd-47c8-acbe-6fc95a16c12f
level: high
logsource:
    product: windows
    service: security
modified: 2022/12/22
references:
- https://twitter.com/SBousseaden/status/1195284233729777665
status: test
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.t1557.001

