title: Password Protected ZIP File Opened (Email Attachment)
ruletype: Sigma
author: Florian Roth
date: 2022/05/09
description: Detects the extraction of password protected ZIP archives. See the filename
    variable for more details on which file has been opened.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5379
    SELECTION_3:
        TargetName: '*Microsoft_Windows_Shell_ZipFolder:filename*'
    SELECTION_4:
        TargetName: '*\Temporary Internet Files\Content.Outlook*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate used of encrypted ZIP files
id: 571498c8-908e-40b4-910b-d2369159a3da
level: high
logsource:
    product: windows
    service: security
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
status: experimental

