title: Replay Attack Detected
ruletype: Sigma
author: frack113
date: 2022/10/14
description: Detects possible Kerberos Replay Attack on the domain controllers when
    "KRB_AP_ERR_REPEAT" Kerberos response is sent to the client
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4649
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 5a44727c-3b85-4713-8c44-4401d5499629
level: high
logsource:
    product: windows
    service: security
references:
- https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4649
status: experimental

