title: Remote Access Tool Services Have Been Installed - Security
ruletype: Sigma
author: Connor Martin, Nasreddine Bencherchali
date: 2022/12/23
description: Detects service installation of different remote access tools software.
    These software are often abused by threat actors to perform
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4697
    SELECTION_3:
        ServiceFileName:
        - '*SSUService*'
        - '*SplashtopRemoteService*'
        - '*Atera*'
        - '*LogMeIn*'
        - '*LMIGuardianSvc*'
        - '*TeamViewer*'
        - '*RPCService*'
        - '*RPCPerformanceService*'
        - '*BASupportExpressStandaloneService*'
        - '*BASupportExpressSrvcUpdater*'
        - '*GoToMyPC*'
        - '*monblanking*'
        - '*RManService*'
        - '*GoToAssist*'
        - '*AmmyyAdmin*'
        - '*vncserver*'
        - '*Parsec*'
        - '*chromoting*'
        - '*Zoho*'
        - '*jumpcloud*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: c8b00925-926c-47e3-beea-298fd563728e
level: medium
logsource:
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
    product: windows
    service: security
references:
- https://redcanary.com/blog/misbehaving-rats/
related:
-   id: 1a31b18a-f00c-4061-9900-f735b96c99fc
    type: similar
status: experimental
tags:
- attack.persistence
- attack.t1543.003
- attack.t1569.002

