title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION - Security
id: 4c54ba8f-73d2-4d40-8890-d9cf1dca3d30
related:
    -   id: 14bcba49-a428-42d9-b943-e2ce0f0f7ae6
        type: derived
status: test
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
author: Timur Zinniatullin, oscd.community
date: 2020/10/13
modified: 2022/11/29
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    service: security
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
detection:
    security:
        Channel: Security
    selection:
        EventID: 4697
        ServiceFileName|contains|all:
            - '&&set'
            - cmd
            - /c
            - -f
        ServiceFileName|contains:
            - '{0}'
            - '{1}'
            - '{2}'
            - '{3}'
            - '{4}'
            - '{5}'
    condition: security and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
