title: Possible DC Shadow Attack
ruletype: Sigma
author: Ilyas Ochkov, oscd.community, Chakib Gzenayi (@Chak092), Hosni Mribah
date: 2019/10/25
description: Detects DCShadow via create new SPN
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4742
    SELECTION_3:
        ServicePrincipalNames: '*GC/*'
    SELECTION_4:
        EventID: 5136
    SELECTION_5:
        AttributeLDAPDisplayName: servicePrincipalName
    SELECTION_6:
        AttributeValue: GC/*
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5 and SELECTION_6)))
falsepositives:
- Valid on domain controllers; exclude known DCs
id: 32e19d25-4aed-4860-a55a-be99cb0bf7ed
level: medium
logsource:
    definition: The "Audit Directory Service Changes" logging policy must be configured
        in order to receive events. Audit events are generated only for objects with
        configured system access control lists (SACLs). Audit events are generated
        only for objects with configured system access control lists (SACLs) and only
        when accessed in a manner that matches their SACL settings. This policy covers
        the following events ids - 5136, 5137, 5138, 5139, 5141. Note that the default
        policy does not cover User objects. For that a custom AuditRule need to be
        setup (See https://github.com/OTRF/Set-AuditRule)
    product: windows
    service: security
modified: 2022/10/17
references:
- https://github.com/Neo23x0/sigma/blob/ec5bb710499caae6667c7f7311ca9e92c03b9039/rules/windows/builtin/win_dcsync.yml
- https://twitter.com/gentilkiwi/status/1003236624925413376
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
- https://blog.alsid.eu/dcshadow-explained-4510f52fc19d
status: experimental
tags:
- attack.credential_access
- attack.t1207

