
title: DPAPI Domain Master Key Backup Attempt
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/10
description: Detects anyone attempting a backup for the DPAPI Master Key. This events
  gets generated at the source and not the Domain Controller.
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4692
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
id: 39a94fd1-8c9a-4ff6-bf22-c058762f8014
level: high
logsource:
  product: windows
  service: security
modified: 2021/11/27
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-190620024610.html
status: test
tags:
- attack.credential_access
- attack.t1003.004
