title: SCM Database Privileged Operation
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
date: 2019/08/15
description: Detects non-system users performing privileged operation os the SCM database
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4674
    SELECTION_3:
        ObjectType: SC_MANAGER OBJECT
    SELECTION_4:
        ObjectName: servicesactive
    SELECTION_5:
        PrivilegeList: SeTakeOwnershipPrivilege
    SELECTION_6:
        SubjectLogonId: '0x3e4'
    SELECTION_7:
        ProcessName: '*:\Windows\System32\services.exe'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
        and  not (SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
id: dae8171c-5ec6-4396-b210-8466585b53e9
level: medium
logsource:
    product: windows
    service: security
modified: 2022/09/18
references:
- https://threathunterplaybook.com/hunts/windows/190826-RemoteSCMHandle/notebook.html
status: test
tags:
- attack.privilege_escalation
- attack.t1548

