title: Active Directory Replication from Non Machine Account
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/07/26
description: Detects potential abuse of Active Directory Replication Service (ADRS)
    from a non machine account to request credentials.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4662
    SELECTION_3:
        AccessMask: '0x100'
    SELECTION_4:
        Properties:
        - '*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2*'
        - '*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2*'
        - '*89e95b76-444d-4c62-991a-0facbeda640c*'
    SELECTION_5:
        SubjectUserName: '*$'
    SELECTION_6:
        SubjectUserName: MSOL_*
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5 or SELECTION_6))
falsepositives:
- Unknown
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
id: 17d619c1-e020-4347-957e-1d1207455c93
level: critical
logsource:
    product: windows
    service: security
modified: 2021/11/27
references:
- https://threathunterplaybook.com/notebooks/windows/06_credential_access/WIN-180815210510.html
status: test
tags:
- attack.credential_access
- attack.t1003.006
yml_filename: win_ad_replication_non_machine_account.yml
yml_path: rules/windows/builtin/security
---

