title: New or Renamed User Account with '$' in Attribute 'SamAccountName'
ruletype: Sigma
author: Ilyas Ochkov, oscd.community
date: 2019/10/25
description: Detects possible bypass EDR and SIEM via abnormal user account name.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4720
    SELECTION_3:
        SamAccountName: '*$*'
    SELECTION_4:
        EventID: 4781
    SELECTION_5:
        NewTargetUserName: '*$*'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5)))
falsepositives:
- Unknown
fields:
- EventID
- SamAccountName
- SubjectUserName
- NewTargetUserName
id: cfeed607-6aa4-4bbd-9627-b637deb723c8
level: high
logsource:
    product: windows
    service: security
modified: 2022/11/22
status: test
tags:
- attack.defense_evasion
- attack.t1036

