
title: Possible Zerologon (CVE-2020-1472) Exploitation
ruletype: Sigma
author: Aleksandr Akhremchik, @aleqs4ndr, ocsd.community
date: 2020/10/15
description: Detects Netlogon Elevation of Privilege Vulnerability aka Zerologon (CVE-2020-1472)
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4742
  SELECTION_3:
    SubjectUserName: ANONYMOUS LOGON
  SELECTION_4:
    TargetUserName: '%DC-MACHINE-NAME%'
  SELECTION_5:
    PasswordLastSet: '-'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- automatic DC computer account password change
- Legitimate DC computer account password change
id: dd7876d8-0f09-11eb-adc1-0242ac120002
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/07
references:
- https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1472
- https://www.logpoint.com/en/blog/detecting-zerologon-vulnerability-in-logpoint/
status: experimental
tags:
- attack.t1068
- attack.privilege_escalation
