title: User Added to Local Administrators
ruletype: Sigma
author: Florian Roth
date: 2017/03/14
description: This rule triggers on user accounts that are added to the local Administrators
    group, which could be legitimate activity or a sign of privilege escalation activity
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        Provider_Name: Microsoft-Windows-Security-Auditing
    SELECTION_3:
        EventID: 4732
    SELECTION_4:
        TargetUserName: Administr*
    SELECTION_5:
        TargetSid: S-1-5-32-544
    SELECTION_6:
        SubjectUserName: '*$'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5)) and  not (SELECTION_6))
falsepositives:
- Legitimate administrative activity
id: c265cf08-3f99-46c1-8d59-328247057d57
level: medium
logsource:
    product: windows
    service: security
modified: 2021/01/17
status: stable
tags:
- attack.privilege_escalation
- attack.t1078
- attack.persistence
- attack.t1098

