title: Successful Overpass the Hash Attempt
ruletype: Sigma
author: Roberto Rodriguez (source), Dominik Schaudel (rule)
date: 2018/02/12
description: Detects successful logon with logon type 9 (NewCredentials) which matches
    the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4624
    SELECTION_3:
        LogonType: 9
    SELECTION_4:
        LogonProcessName: seclogo
    SELECTION_5:
        AuthenticationPackageName: Negotiate
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Runas command-line tool using /netonly parameter
id: 192a0330-c20b-4356-90b6-7b7049ae0b87
level: high
logsource:
    product: windows
    service: security
modified: 2021/11/27
references:
- https://cyberwardog.blogspot.de/2017/04/chronicles-of-threat-hunter-hunting-for.html
status: test
tags:
- attack.lateral_movement
- attack.s0002
- attack.t1550.002

