
title: Valid Users Failing to Authenticate from Single Source Using NTLM
ruletype: Sigma
author: Mauricio Velazco
date: 2021/06/01
description: Detects failed logins with multiple valid domain accounts from a single
  source system using the NTLM protocol.
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4776
  SELECTION_3:
    Status: '*0xC000006A'
  SELECTION_4:
    TargetUserName: '*$'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
    | count(TargetUserName) by Workstation > 10
  timeframe: 24h
falsepositives:
- Terminal servers
- Jump servers
- Other multiuser systems like Citrix server farms
- Workstations with frequently changing users
id: f88bab7f-b1f4-41bb-bdb1-4b8af35b0470
level: medium
logsource:
  product: windows
  service: security
modified: 2021/07/07
references:
- https://docs.splunk.com/Documentation/ESSOC/3.22.0/stories/UseCase#Active_directory_password_spraying
status: experimental
tags:
- attack.t1110.003
- attack.initial_access
- attack.privilege_escalation
