title: Win Susp Computer Name Containing Samtheadmin
ruletype: Sigma
author: elhoim
date: 2022/09/09
description: Detects suspicious computer name samtheadmin-{1..100}$ generated by hacktool
detection:
    SELECTION_1:
        SamAccountName: SAMTHEADMIN-*
    SELECTION_2:
        SamAccountName: '*$'
    SELECTION_3:
        TargetUserName: SAMTHEADMIN-*
    SELECTION_4:
        TargetUserName: '*$'
    condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and SELECTION_4))
falsepositives:
- Unknown
fields:
- EventID
- SamAccountName
- SubjectUserName
- TargetUserName
id: 39698b3f-da92-4bc6-bfb5-645a98386e45
level: critical
logsource:
    category: security
    product: windows
references:
- https://twitter.com/malmoeb/status/1511760068743766026
- https://github.com/WazeHell/sam-theadmin/blob/main/sam_the_admin.py
- https://github.com/helloexp/0day/blob/614227a7b9beb0e91e7e2c6a5e532e6f7a8e883c/00-CVE_EXP/CVE-2021-42287/sam-the-admin/sam_the_admin.py
status: experimental
tags:
- cve.2021.42278
- cve.2021.42287
- attack.persistence
- attack.privilege_escalation
- attack.t1078

