title: Access To ADMIN$ Network Share
id: 37b219bc-37bb-1261-f179-64307c1a1829
related:
    - id: 098d7118-55bc-4912-a836-dc6483a8d150
      type: derived
status: test
description: Detects access to ADMIN$ network share
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-5140
author: Florian Roth (Nextron Systems)
date: 2017-03-04
modified: 2024-01-16
tags:
    - attack.lateral-movement
    - attack.t1021.002
logsource:
    product: windows
    service: security
    definition: 'Requirements: The advanced audit policy setting "Object Access > Audit File Share" must be configured for Success/Failure'
detection:
    security:
        Channel: Security
    selection:
        EventID: 5140
        ShareName: Admin$
    filter_main_computer_account:
        SubjectUserName|endswith: $
    condition: security and (selection and not 1 of filter_*)
falsepositives:
    - Legitimate administrative activity
level: low
ruletype: Sigma
