title: Invoke-Obfuscation RUNDLL LAUNCHER - Security
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4697
    SELECTION_3:
        ServiceFileName: '*rundll32.exe*'
    SELECTION_4:
        ServiceFileName: '*shell32.dll*'
    SELECTION_5:
        ServiceFileName: '*shellexec_rundll*'
    SELECTION_6:
        ServiceFileName: '*powershell*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: f241cf1b-3a6b-4e1a-b4f9-133c00dd95ca
level: medium
logsource:
    definition: The 'System Security Extension' audit subcategory need to be enabled
        to log the EID 4697
    product: windows
    service: security
modified: 2022/11/29
references:
- https://github.com/Neo23x0/sigma/issues/1009
related:
-   id: 11b52f18-aaec-4d60-9143-5dd8cc4706b9
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

