title: Suspicious Remote Logon with Explicit Credentials
ruletype: Sigma
author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st,
    Tim Shelton
date: 2020/10/05
description: Detects suspicious processes logging on with explicit credentials
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4648
    SELECTION_3:
        ProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\winrs.exe'
        - '*\wmic.exe'
        - '*\net.exe'
        - '*\net1.exe'
        - '*\reg.exe'
    SELECTION_4:
        TargetServerName: localhost
    SELECTION_5:
        SubjectUserName: '*$'
    SELECTION_6:
        TargetUserName: '*$'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)
        or (SELECTION_5 and SELECTION_6)))
falsepositives:
- Administrators that use the RunAS command or scheduled tasks
id: 941e5c45-cda7-4864-8cea-bbb7458d194a
level: medium
logsource:
    product: windows
    service: security
modified: 2022/08/03
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
status: experimental
tags:
- attack.t1078
- attack.lateral_movement
yml_filename: win_susp_logon_explicit_credentials.yml
yml_path: rules/windows/builtin/security
---

