
title: Suspicious Multiple File Rename Or Delete Occurred
ruletype: Sigma
author: Vasiliy Burov, oscd.community
date: 2020/10/16
description: Detects multiple file rename or delete events occurrence within a specified
  period of time by a same user (these events may signalize about ransomware activity).
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4663
  SELECTION_3:
    ObjectType: File
  SELECTION_4:
    AccessList: '%%1537'
  SELECTION_5:
    Keywords: '0x8020000000000000'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    | count() by SubjectLogonId > 10
  timeframe: 30s
falsepositives:
- Software uninstallation
- Files restore activities
id: 97919310-06a7-482c-9639-92b67ed63cf8
level: medium
logsource:
  definition: 'Requirements: Audit Policy : Policies/Windows Settings/Security Settings/Local
    Policies/Audit Policy/Audit object access, Policies/Windows Settings/Security
    Settings/Advanced Audit Policy Configuration/Object Access'
  product: windows
  service: security
modified: 2021/11/27
references:
- https://www.manageengine.com/data-security/how-to/how-to-detect-ransomware-attacks.html
status: test
tags:
- attack.impact
- attack.t1486
