title: Possible Shadow Credentials Added
ruletype: Sigma
author: Nasreddine Bencherchali (rule), Elastic (idea)
date: 2022/10/17
description: Detects possible addition of shadow credentials to an active directory
    object.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5136
    SELECTION_3:
        AttributeLDAPDisplayName: msDS-KeyCredentialLink
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Modifications in the msDS-KeyCredentialLink attribute can be done legitimately by
    the Azure AD Connect synchronization account or the ADFS service account. These
    accounts can be added as Exceptions. (From elastic FP section)
id: f598ea0c-c25a-4f72-a219-50c44411c791
level: high
logsource:
    definition: The "Audit Directory Service Changes" logging policy must be configured
        in order to receive events. Audit events are generated only for objects with
        configured system access control lists (SACLs). Audit events are generated
        only for objects with configured system access control lists (SACLs) and only
        when accessed in a manner that matches their SACL settings. This policy covers
        the following events ids - 5136, 5137, 5138, 5139, 5141. Note that the default
        policy does not cover User objects. For that a custom AuditRule need to be
        setup (See https://github.com/OTRF/Set-AuditRule)
    product: windows
    service: security
references:
- https://www.elastic.co/guide/en/security/8.4/potential-shadow-credentials-added-to-ad-object.html
- https://cyberstoph.org/posts/2022/03/detecting-shadow-credentials/
- https://twitter.com/SBousseaden/status/1581300963650187264?
status: experimental
tags:
- attack.credential_access
- attack.t1556

