
title: New or Renamed User Account with '$' in Attribute 'SamAccountName'.
ruletype: Sigma
author: Ilyas Ochkov, oscd.community
date: 2019/10/25
description: Detects possible bypass EDR and SIEM via abnormal user account name.
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4720
  SELECTION_3:
    EventID: 4781
  SELECTION_4:
    SamAccountName: '*$*'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
fields:
- EventID
- SamAccountName
- SubjectUserName
id: cfeed607-6aa4-4bbd-9627-b637deb723c8
level: high
logsource:
  product: windows
  service: security
modified: 2021/07/07
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
