
title: KrbRelayUp Attack Pattern
ruletype: Sigma
author: '@SBousseaden, Florian Roth'
date: 2022/04/27
description: Detects logon events that have characteristics of events generated during
  an attack with KrbRelayUp and the like
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4624
  SELECTION_3:
    LogonType: 3
  SELECTION_4:
    AuthenticationPackageName: Kerberos
  SELECTION_5:
    IpAddress: 127.0.0.1
  SELECTION_6:
    TargetUserSid: S-1-5-21-*
  SELECTION_7:
    TargetUserSid: '*-500'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 749c9f5e-b353-4b90-a9c1-05243357ca4b
level: high
logsource:
  product: windows
  service: security
references:
- https://twitter.com/sbousseaden/status/1518976397364056071?s=12&t=qKO5eKHvWhAP19a50FTZ7g
- https://github.com/elastic/detection-rules/blob/fb6ee2c69864ffdfe347bf3b050cb931f53067a6/rules/windows/privilege_escalation_krbrelayup_suspicious_logon.toml
status: experimental
tags:
- attack.privilege_escalation
- attack.credential_access
