title: PowerShell Scripts Installed as Services
ruletype: Sigma
author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects powershell script installed as a Service
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4697
    SELECTION_3:
        ServiceFileName:
        - '*powershell*'
        - '*pwsh*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 2a926e6a-4b81-4011-8a96-e36cc8c04302
level: high
logsource:
    product: windows
    service: security
modified: 2022/10/09
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
related:
-   id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
    type: derived
status: test
tags:
- attack.execution
- attack.t1569.002

