title: AD Privileged Users or Groups Reconnaissance
ruletype: Sigma
author: Samir Bousseaden
date: 2019/04/03
description: Detect priv users or groups recon based on 4661 eventid and known privileged
    users or groups SIDs
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4661
    SELECTION_3:
        ObjectType:
        - SAM_USER
        - SAM_GROUP
    SELECTION_4:
        ObjectName:
        - '*-512'
        - '*-502'
        - '*-500'
        - '*-505'
        - '*-519'
        - '*-520'
        - '*-544'
        - '*-551'
        - '*-555'
    SELECTION_5:
        ObjectName: '*admin*'
    SELECTION_6:
        SubjectUserName: '*$'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5)) and  not (SELECTION_6))
falsepositives:
- If source account name is not an admin then its super suspicious
id: 35ba1d85-724d-42a3-889f-2e2362bcaf23
level: high
logsource:
    definition: 'Requirements: enable Object Access SAM on your Domain Controllers'
    product: windows
    service: security
modified: 2022/07/13
references:
- https://blog.menasec.net/2019/02/threat-hunting-5-detecting-enumeration.html
status: experimental
tags:
- attack.discovery
- attack.t1087.002
yml_filename: win_account_discovery.yml
yml_path: rules/windows/builtin/security
---

