title: Security Event Log Cleared
ruletype: Sigma
author: Saw Winn Naung
date: 2021/08/15
description: Checks for event id 1102 which indicates the security event log was cleared.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 1102
    SELECTION_3:
        Provider_Name: Microsoft-Windows-Eventlog
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate administrative activity
fields:
- SubjectLogonId
- SubjectUserName
- SubjectUserSid
- SubjectDomainName
id: a122ac13-daf8-4175-83a2-72c387be339d
level: medium
logsource:
    product: windows
    service: security
modified: 2021/10/13
references:
- https://github.com/Azure/Azure-Sentinel/blob/f99542b94afe0ad2f19a82cc08262e7ac8e1428e/Detections/SecurityEvent/SecurityEventLogCleared.yaml
status: experimental
tags:
- attack.t1070.001

