title: Device Installation Blocked
ruletype: Sigma
author: frack113
date: 2022/10/14
description: Detects an installation of a device that is forbidden by the system policy
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 6423
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: c9eb55c3-b468-40ab-9089-db2862e42137
level: medium
logsource:
    product: windows
    service: security
references:
- https://github.com/Yamato-Security/EnableWindowsLogSettings/blob/7f6d755d45ac7cc9fc35b0cbf498e6aa4ef19def/ConfiguringSecurityLogAuditPolicies.md
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-6423
status: experimental

