
title: Active Directory User Backdoors
author: '@neu5ron'
date: 2017/04/13
description: Detects scenarios where one can control another users or computers account
  without having to use their credentials.
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_10:
    EventID: 5136
  SELECTION_11:
    AttributeLDAPDisplayName: msDS-AllowedToActOnBehalfOfOtherIdentity
  SELECTION_2:
    EventID: 4738
  SELECTION_3:
    AllowedToDelegateTo: '-'
  SELECTION_4:
    AllowedToDelegateTo|re: ^$
  SELECTION_5:
    EventID: 5136
  SELECTION_6:
    AttributeLDAPDisplayName: msDS-AllowedToDelegateTo
  SELECTION_7:
    EventID: 5136
  SELECTION_8:
    ObjectClass: user
  SELECTION_9:
    AttributeLDAPDisplayName: servicePrincipalName
  condition: (SELECTION_1 and ((SELECTION_2 and  not (SELECTION_3 or SELECTION_4))
    or ((SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)
    or (SELECTION_10 and SELECTION_11))))
falsepositives:
- Unknown
id: 300bac00-e041-4ee2-9c36-e262656a6ecc
level: high
logsource:
  definition: 'Requirements: Audit Policy : Account Management > Audit User Account
    Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
    Management, DS Access > Audit Directory Service Changes, Group Policy : Computer
    Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit
    Policies\DS Access\Audit Directory Service Changes'
  product: windows
  service: security
modified: 2021/11/27
references:
- https://msdn.microsoft.com/en-us/library/cc220234.aspx
- https://adsecurity.org/?p=3466
- https://www.harmj0y.net/blog/redteaming/another-word-on-delegation/
status: test
tags:
- attack.t1098
- attack.persistence
