title: Suspicious Outbound Kerberos Connection
ruletype: Sigma
author: Ilyas Ochkov, oscd.community
date: 2019/10/24
description: Detects suspicious outbound network activity via kerberos default port
    indicating possible lateral movement or first stage PrivEsc via delegation.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5156
    SELECTION_3:
        DestPort: 88
    SELECTION_4:
        Application:
        - '*\lsass.exe'
        - '*\opera.exe'
        - '*\chrome.exe'
        - '*\firefox.exe'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Other browsers
id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
level: high
logsource:
    product: windows
    service: security
modified: 2022/08/15
references:
- https://github.com/GhostPack/Rubeus
status: test
tags:
- attack.lateral_movement
- attack.t1558.003

