title: Impacket PsExec Execution
id: 24e370e0-b9f0-5851-0261-f984742ff2a1
related:
    - id: 32d56ea1-417f-44ff-822b-882873f5f43b
      type: derived
status: test
description: Detects execution of Impacket's psexec.py.
references:
    - https://web.archive.org/web/20230329171218/https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
author: Bhabesh Raj
date: 2020-12-14
modified: 2022-09-22
tags:
    - attack.lateral-movement
    - attack.t1021.002
logsource:
    product: windows
    service: security
    definition: The advanced audit policy setting "Object Access > Audit Detailed File Share" must be configured for Success/Failure
detection:
    security:
        Channel: Security
    selection1:
        EventID: 5145
        ShareName: \\\\\*\\IPC$   # looking for the string \\*\IPC$
        RelativeTargetName|contains:
            - RemCom_stdin
            - RemCom_stdout
            - RemCom_stderr
    condition: security and selection1
falsepositives:
    - Unknown
level: high
ruletype: Sigma
