title: Password Protected ZIP File Opened (Suspicious Filenames)
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/05/09
description: Detects the extraction of password protected ZIP archives with suspicious
    file names. See the filename variable for more details on which file has been
    opened.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5379
    SELECTION_3:
        TargetName: '*Microsoft_Windows_Shell_ZipFolder:filename*'
    SELECTION_4:
        TargetName:
        - '*invoice*'
        - '*new order*'
        - '*rechnung*'
        - '*factura*'
        - '*delivery*'
        - '*purchase*'
        - '*order*'
        - '*payment*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate used of encrypted ZIP files
id: 54f0434b-726f-48a1-b2aa-067df14516e4
level: high
logsource:
    product: windows
    service: security
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
status: experimental

