title: DPAPI Domain Master Key Backup Attempt
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/10
description: Detects anyone attempting a backup for the DPAPI Master Key. This events
    gets generated at the source and not the Domain Controller.
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4692
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- If a computer is a member of a domain, DPAPI has a backup mechanism to allow unprotection
    of the data. Which will trigger this event.
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
id: 39a94fd1-8c9a-4ff6-bf22-c058762f8014
level: medium
logsource:
    product: windows
    service: security
modified: 2023/03/15
references:
- https://threathunterplaybook.com/hunts/windows/190620-DomainDPAPIBackupKeyExtraction/notebook.html
status: test
tags:
- attack.credential_access
- attack.t1003.004

