title: HackTool - EDRSilencer Execution - Filter Added
id: 4d56e133-40b5-5b28-07b5-bab0913fc338
related:
    - id: 98054878-5eab-434c-85d4-72d4e5a3361b
      type: derived
status: test
description: |
    Detects execution of EDRSilencer, a tool that abuses the Windows Filtering Platform (WFP) to block the outbound traffic of running EDR agents based on specific hardcoded filter names.
references:
    - https://github.com/netero1010/EDRSilencer
author: Thodoris Polyzos (@SmoothDeploy)
date: 2024-01-29
modified: 2024-01-30
tags:
    - attack.defense-evasion
    - attack.t1562
logsource:
    product: windows
    service: security
    definition: 'Requirements: Audit Filtering Platform Policy Change needs to be enabled'
detection:
    security:
        Channel: Security
    selection:
        EventID:
            - 5441
            - 5447
        FilterName|contains: Custom Outbound Filter
    condition: security and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
