title: Dotnet.exe Exec Dll and Execute Unsigned Code LOLBIN
id: 6a57c7c1-e602-4476-84aa-4fe3ad5ff803
related:
    - id: d80d5c81-04ba-45b4-84e4-92eba40e0ad3
      type: derived
status: test
description: dotnet.exe will execute any DLL and execute unsigned code
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dotnet/
    - https://twitter.com/_felamos/status/1204705548668555264
    - https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/
author: Beyu Denis, oscd.community
date: 2020/10/18
modified: 2023/02/04
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \dotnet.exe
        - OriginalFileName: .NET Host
    selection_cli:
        CommandLine|endswith:
            - .dll
            - .csproj
    condition: process_creation and (all of selection_*)
fields:
    - ComputerName
    - User
    - CommandLine
    - ParentCommandLine
falsepositives:
    - System administrator Usage
level: medium
ruletype: Sigma
