title: Renamed Office Binary Execution
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/12/20
description: Detects the execution of a renamed office binaries
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName:
        - Excel.exe
        - MSACCESS.EXE
        - OneNote.exe
        - POWERPNT.EXE
        - WinWord.exe
    SELECTION_4:
        Description:
        - Microsoft Access
        - Microsoft Excel
        - Microsoft OneNote
        - Microsoft PowerPoint
        - Microsoft Word
    SELECTION_5:
        Image:
        - '*\EXCEL.exe'
        - '*\MSACCESS.exe'
        - '*\ONENOTE.EXE'
        - '*\POWERPNT.EXE'
        - '*\WINWORD.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: 0b0cd537-fc77-4e6e-a973-e53495c1083d
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://infosec.exchange/@sbousseaden/109542254124022664
status: experimental
tags:
- attack.defense_evasion

