title: Execute Code with Pester.bat as Parent
ruletype: Sigma
author: frack113, Nasreddine Bencherchali
date: 2022/08/20
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
    testing)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        ParentCommandLine: '*\WindowsPowerShell\Modules\Pester\\*'
    SELECTION_5:
        ParentCommandLine:
        - '*{ Invoke-Pester -EnableExit ;*'
        - '*{ Get-Help "*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate use of Pester for writing tests for Powershell scripts and modules
id: 18988e1b-9087-4f8a-82fe-0414dce49878
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/Oddvarmoe/status/993383596244258816
- https://twitter.com/_st0pp3r_/status/1560072680887525378
related:
-   id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1216

