
title: Suspicious Curl Usage on Windows
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali (updated)
date: 2020/07/03
description: Detects a suspicious curl process start on Windows and outputs the requested
  document to a local file
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\curl.exe'
  SELECTION_4:
    Product: The curl executable
  SELECTION_5:
    CommandLine:
    - '* -O*'
    - '*--remote-name*'
    - '*--output*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/23
references:
- https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
- https://github.com/pr0xylife/Qakbot/blob/main/Qakbot_AA_23.06.2022.txt
status: test
tags:
- attack.command_and_control
- attack.t1105
