title: Suspicious Download Via Certutil.EXE
ruletype: Sigma
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community, Nasreddine
    Bencherchali (Nextron Systems)
date: 2023/02/15
description: Detects the execution of certutil with certain flags that allow the utility
    to download files.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\certutil.exe'
    SELECTION_4:
        OriginalFileName: CertUtil.exe
    SELECTION_5:
        CommandLine:
        - '*urlcache *'
        - '*verifyctl *'
    SELECTION_6:
        CommandLine: '*http*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unknown
id: 19b08b1c-861d-4e75-a1ef-ea0c1baf202b
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://forensicitguy.github.io/agenttesla-vba-certutil-download/
- https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
- https://twitter.com/egre55/status/1087685529016193025
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
related:
-   id: 13e6fe51-d478-4c7e-b0f2-6da9b400a829
    type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1027

