title: Imports Registry Key From an ADS
id: 4c929c3f-0fef-d5ed-0be9-cad87cbfb365
related:
    - id: 73bba97f-a82d-42ce-b315-9182e76c57b1
      type: similar
    - id: 0b80ade5-6997-4b1d-99a1-71701778ea61
      type: derived
status: test
description: Detects the import of a alternate datastream to the registry with regedit.exe.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020-10-12
modified: 2024-03-13
tags:
    - attack.persistence
    - attack.t1112
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \regedit.exe
        - OriginalFileName: REGEDIT.EXE
    selection_cli:
        CommandLine|contains:
            - ' /i '
            - .reg
        CommandLine|re: :[^ \\]
    filter:
        CommandLine|contains|windash:
            - ' -e '
            - ' -a '
            - ' -c '
    condition: process_creation and (all of selection_* and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
