title: Suspicious Encoded And Obfuscated Reflection Assembly Load Function Call
ruletype: Sigma
author: pH-T (Nextron Systems)
date: 2022/03/01
description: Detects suspicious base64 encoded and obfuscated "LOAD" keyword used
    in .NET "reflection.assembly"
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ*'
        - '*oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA*'
        - '*6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA*'
        - '*OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ*'
        - '*oAOgAoACIATABvACIAKwAiAGEAZAAiACkA*'
        - '*6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA*'
        - '*OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ*'
        - '*oAOgAoACIATABvAGEAIgArACIAZAAiACkA*'
        - '*6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA*'
        - '*OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ*'
        - '*oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA*'
        - '*6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA*'
        - '*OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ*'
        - '*oAOgAoACcATABvACcAKwAnAGEAZAAnACkA*'
        - '*6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA*'
        - '*OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ*'
        - '*oAOgAoACcATABvAGEAJwArACcAZAAnACkA*'
        - '*6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
fields:
- CommandLine
id: 9c0295ce-d60d-40bd-bd74-84673b7592b1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/06
references:
- https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
- https://learn.microsoft.com/en-us/dotnet/api/system.appdomain.load?view=net-7.0
related:
-   id: 62b7ccc9-23b4-471e-aa15-6da3663c4d59
    type: similar
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1059.001
- attack.t1027

