title: Arbitrary Command Execution Using WSL
id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
related:
    -   id: 2267fe65-0681-42ad-9a6d-46553d3f3480
        type: similar
status: test
description: Detects potential abuse of Windows Subsystem for Linux (WSL) binary as
    a LOLBIN to execute arbitrary Linux or Windows commands
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
    - https://twitter.com/nas_bench/status/1535431474429808642
author: oscd.community, Zach Stanford @svch0st, Nasreddine Bencherchali (Nextron Systems)
date: 2020/10/05
modified: 2023/04/12
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1218
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        -   Image|endswith: \wsl.exe
        -   OriginalFileName: wsl.exe
    selection_cli:
        CommandLine|contains:
            - ' -e '
            - ' --exec'
            - ' --system'
            - ' --shell-type '
            - ' /mnt/c'
            - ' --user root'
            - ' -u root'
            - --debug-shell
    filter_main_kill:
        ParentImage|endswith: \cmd.exe
        CommandLine|contains|all:
            - ' -d '
            - ' -e kill '
    condition: process_creation and (all of selection_* and not 1 of filter_main_*)
falsepositives:
    - Automation and orchestration scripts may use this method to execute scripts
        etc.
    - Legitimate use by Windows to kill processes opened via WSL (example VsCode WSL
        server)
level: medium
ruletype: Sigma
