title: Remote Access Tool - NetSupport Execution From Unusual Location
id: cd542b34-b282-4266-c28c-d719de857ca2
related:
    - id: 37e8d358-6408-4853-82f4-98333fca7014
      type: derived
status: test
description: Detects execution of client32.exe (NetSupport RAT) from an unusual location (outside of 'C:\Program Files')
references:
    - https://redcanary.com/blog/misbehaving-rats/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-19
modified: 2024-11-23
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \client32.exe
        - Product|contains: NetSupport Remote Control
        - OriginalFileName|contains: client32.exe
        - Hashes|contains: IMPHASH=a9d50692e95b79723f3e76fcf70d023e
    filter:
        Image|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
