title: Suspicious Elevated System Shell
ruletype: Sigma
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
description: Detects when a shell program such as the windows Command Prompt or PowerShell
    is launched with system privileges.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        Image: '*\cmd.exe'
    SELECTION_11:
        ParentImage: C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\\*
    SELECTION_12:
        ParentImage: '*\CitrixReceiverUpdater.exe'
    SELECTION_13:
        Image: '*\cmd.exe'
    SELECTION_14:
        ParentImage: '*\python.exe'
    SELECTION_15:
        CommandLine: C:\WINDOWS\system32\cmd.exe /c "ver"
    SELECTION_16:
        CurrentDirectory: '*C:\WINDOWS\Temp\asgard2-agent\\*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
        - Cmd.Exe
    SELECTION_5:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_6:
        LogonId: '0x3e7'
    SELECTION_7:
        ParentImage:
        - C:\Windows\System32\\*
        - C:\Program Files (x86)\\*
        - C:\Program Files\\*
    SELECTION_8:
        Image:
        - '*\cmd.exe'
        - '*\powershell.exe'
    SELECTION_9:
        ParentImage: C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8) or
        (SELECTION_9 and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13)
        or (SELECTION_14 and SELECTION_15 and SELECTION_16)))
falsepositives:
- Unknown
id: 178e615d-e666-498b-9630-9ed363038101
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/11
references:
- https://github.com/Wh04m1001/SysmonEoP
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.execution
- attack.t1059

