title: Arbitrary File Download Via GfxDownloadWrapper.EXE
id: 24122802-ff7f-a14a-a651-3d8be8df56fb
related:
    - id: eee00933-a761-4cd0-be70-c42fe91731e7
      type: derived
status: test
description: Detects execution of GfxDownloadWrapper.exe with a URL as an argument to download file.
references:
    - https://lolbas-project.github.io/lolbas/HonorableMentions/GfxDownloadWrapper/
author: Victor Sergeev, oscd.community
date: 2020-10-09
modified: 2023-10-18
tags:
    - attack.command-and-control
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \GfxDownloadWrapper.exe
        CommandLine|contains:
            - http://
            - https://
    filter_main_known_urls:
        CommandLine|contains: https://gameplayapi.intel.com/
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
