title: Execution of Renamed NetSupport RAT
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/19
description: Detects execution of renamed client32.exe (NetSupport RAT) via Imphash,
    Product and OriginalFileName strings
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Product: '*NetSupport Remote Control*'
    SELECTION_4:
        OriginalFileName: '*client32.exe*'
    SELECTION_5:
        Imphash: a9d50692e95b79723f3e76fcf70d023e
    SELECTION_6:
        Hashes: '*IMPHASH=A9D50692E95B79723F3E76FCF70D023E*'
    SELECTION_7:
        Image: '*\client32.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6) and  not (SELECTION_7))
falsepositives:
- Unknown
id: 0afbd410-de03-4078-8491-f132303cb67d
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://redcanary.com/blog/misbehaving-rats/
status: experimental
tags:
- attack.defense_evasion

