title: Suspicious X509Enrollment - Process Creation
ruletype: Sigma
author: frack113
date: 2022/12/23
description: Detect use of X509Enrollment
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*X509Enrollment.CBinaryConverter*'
        - '*884e2002-217d-11da-b2a4-000e7bbb2b09*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate administrative script
id: 114de787-4eb2-48cc-abdb-c0b449f93ea4
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
- https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
related:
-   id: 504d63cb-0dba-4d02-8531-e72981aace2c
    type: similar
status: experimental

