title: Netsh Allow Group Policy on Microsoft Defender Firewall
id: b4fa9628-1d16-fc5f-3e26-5dc2cd517e97
related:
    - id: 347906f3-e207-4d18-ae5b-a9403d6bcdef
      type: derived
status: test
description: Adversaries may modify system firewalls in order to bypass controls limiting network usage
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-3---allow-smb-and-rdp-on-microsoft-defender-firewall
    - https://learn.microsoft.com/en-us/troubleshoot/windows-server/networking/netsh-advfirewall-firewall-control-firewall-behavior
author: frack113
date: 2022-01-09
modified: 2023-02-14
tags:
    - attack.defense-evasion
    - attack.t1562.004
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \netsh.exe
        - OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - advfirewall
            - firewall
            - set
            - rule
            - group=
            - new
            - enable=Yes
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate administration activity
level: medium
ruletype: Sigma
