title: Indirect Inline Command Execution Via Bash.EXE
id: 287ec6f1-499d-71de-cc06-f53a8133d5e1
related:
    - id: 2d22a514-e024-4428-9dba-41505bd63a5b
      type: similar
    - id: 5edc2273-c26f-406c-83f3-f4d948e740dd
      type: derived
status: test
description: |
    Detects execution of Microsoft bash launcher with the "-c" flag.
    This can be used to potentially bypass defenses and execute Linux or Windows-based binaries directly via bash.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Bash/
author: frack113
date: '2021-11-24'
modified: '2023-08-15'
tags:
    - attack.defense-evasion
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith:
              - :\Windows\System32\bash.exe
              - :\Windows\SysWOW64\bash.exe
        - OriginalFileName: Bash.exe
    selection_cli:
        CommandLine|contains: ' -c '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
