title: Suspicious CustomShellHost Execution
id: 19ee2ba2-205f-7014-d1a7-36905d2ec5aa
related:
    - id: 84b14121-9d14-416e-800b-f3b829c5a14d
      type: derived
status: test
description: |
    Detects the execution of CustomShellHost.exe where the child isn't located in 'C:\Windows\explorer.exe'. CustomShellHost is a known LOLBin that can be abused by attackers for defense evasion techniques.
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/180
    - https://lolbas-project.github.io/lolbas/Binaries/CustomShellHost/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
modified: 2025-10-29
tags:
    - attack.defense-evasion
    - attack.t1216
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \CustomShellHost.exe
    filter_main_explorer:
        Image: C:\Windows\explorer.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - False positives are unlikely, investigate matches carefully.
level: high
ruletype: Sigma
