title: Microsoft IIS Service Account Password Dumped
ruletype: Sigma
author: Tim Rauch
date: 2022/09/28
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd,
    being used to list passwords
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\appcmd.exe'
    SELECTION_4:
        OriginalFilename: appcmd.exe
    SELECTION_5:
        CommandLine:
        - '* /list *'
        - '* list *'
    SELECTION_6:
        CommandLine: '* /text*'
    SELECTION_7:
        CommandLine: '* password*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and (SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
status: experimental
tags:
- attack.credential_access
- attack.t1003

