title: Suspicious MsiExec Directory
ruletype: Sigma
author: Florian Roth
date: 2019/11/14
description: Detects suspicious msiexec process starts in an uncommon directory
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\msiexec.exe'
    SELECTION_4:
        Image:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://twitter.com/200_okay_/status/1194765831911215104
status: test
tags:
- attack.defense_evasion
- attack.t1036.005

