title: Suspicious Schtasks Execution AppData Folder
ruletype: Sigma
author: pH-T, Nasreddine Bencherchali
date: 2022/03/15
description: Detects the creation of a schtask that executes a file from C:\Users\<USER>\AppData\Local
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        ParentImage: '*\AppData\Local\Temp\\*'
    SELECTION_11:
        ParentImage: '*TeamViewer_.exe*'
    SELECTION_12:
        Image: '*\schtasks.exe'
    SELECTION_13:
        CommandLine: '*/TN TVInstallRestore*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\schtasks.exe'
    SELECTION_4:
        CommandLine: '*/Create*'
    SELECTION_5:
        CommandLine: '*/RU*'
    SELECTION_6:
        CommandLine: '*/TR*'
    SELECTION_7:
        CommandLine: '*C:\Users\\*'
    SELECTION_8:
        CommandLine: '*\AppData\Local\\*'
    SELECTION_9:
        CommandLine:
        - '*NT AUT*'
        - '* SYSTEM *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9)
        and  not (SELECTION_10 and SELECTION_11 and SELECTION_12 and SELECTION_13))
falsepositives:
- Unknown
id: c5c00f49-b3f9-45a6-997e-cfdecc6e1967
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/28
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
- attack.t1059.001
yml_filename: proc_creation_win_schtasks_appdata_local_system.yml
yml_path: rules/windows/process_creation
---

