title: Suspicious Usage Of ShellExec_RunDLL
id: bcc59ab2-b8f3-097f-23c4-0c3f38b5fab8
related:
    - id: 36c5146c-d127-4f85-8e21-01bf62355d5a
      type: obsolete
    - id: 8823e85d-31d8-473e-b7f4-92da070f0fc6
      type: similar
    - id: d87bd452-6da1-456e-8155-7dc988157b7d
      type: derived
status: test
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other commands as seen in the the raspberry-robin attack
references:
    - https://redcanary.com/blog/raspberry-robin/
    - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
    - https://github.com/SigmaHQ/sigma/issues/1009
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-01'
modified: '2022-12-30'
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_openasrundll:
        CommandLine|contains: ShellExec_RunDLL
    selection_suspcli:
        CommandLine|contains:
            # Note: The ordinal number may differ depending on the DLL version
            - \Desktop\
            - \Temp\
            - \Users\Public\
            - comspec
            - iex
            - Invoke-
            - msiexec
            - odbcconf
            - regsvr32
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
