title: Suspicious Schtasks Schedule Types
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/09
description: Detects scheduled task creations or modification on a suspicious schedule
    type
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\schtasks.exe'
    SELECTION_4:
        OriginalFileName: schtasks.exe
    SELECTION_5:
        CommandLine:
        - '* ONLOGON *'
        - '* ONSTART *'
        - '* ONCE *'
        - '* ONIDLE *'
    SELECTION_6:
        CommandLine:
        - '*NT AUT*'
        - '* SYSTEM*'
        - '*HIGHEST*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6)))
falsepositives:
- Legitimate processes that run at logon. Filter according to your environment
id: 24c8392b-aa3c-46b7-a545-43f71657fe98
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-change
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
related:
-   id: 7a02e22e-b885-4404-b38b-1ddc7e65258a
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1053.005

