title: HackTool - Dumpert Process Dumper Execution
id: fe1dad5f-50cc-7db6-25d5-7199fa5e9e54
related:
    - id: 2704ab9e-afe2-4854-a3b1-0c0706d03578
      type: derived
status: test
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe process memory
references:
    - https://github.com/outflanknl/Dumpert
    - https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
author: Florian Roth (Nextron Systems)
date: '2020-02-04'
modified: '2025-01-22'
tags:
    - attack.credential-access
    - attack.t1003.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Hashes|contains: MD5=09D278F9DE118EF09163C6140255C690
        - CommandLine|contains: Dumpert.dll
    condition: process_creation and selection
falsepositives:
    - Very unlikely
level: critical
ruletype: Sigma
