title: Run Whoami as SYSTEM
ruletype: Sigma
author: Teymur Kheirkhabarov, Florian Roth
date: 2019/10/23
description: Detects a whoami.exe executed by LOCAL SYSTEM. This may be a sign of
    a successful local privilege escalation.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_4:
        OriginalFileName: whoami.exe
    SELECTION_5:
        Image: '*\whoami.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Possible name overlap with NT AUHTORITY substring to cover all languages
id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/05/13
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033
yml_filename: proc_creation_win_whoami_as_system.yml
yml_path: rules/windows/process_creation
---

