title: Always Install Elevated Windows Installer
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
date: 2020/10/13
description: Detects Windows Installer service (msiexec.exe) trying to install MSI
    packages with SYSTEM privilege
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*\system32\msiexec.exe /V'
    SELECTION_11:
        ParentCommandLine: '*\system32\msiexec.exe /V'
    SELECTION_12:
        ParentImage: C:\ProgramData\Sophos\\*
    SELECTION_13:
        ParentImage: C:\ProgramData\Avira\\*
    SELECTION_14:
        ParentImage:
        - C:\Program Files\Avast Software\\*
        - C:\Program Files (x86)\Avast Software\\*
    SELECTION_15:
        ParentImage:
        - C:\Program Files\Google\Update\\*
        - C:\Program Files (x86)\Google\Update\\*
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\Windows\Installer\\*'
    SELECTION_4:
        Image: '*msi*'
    SELECTION_5:
        Image: '*tmp'
    SELECTION_6:
        Image: '*\msiexec.exe'
    SELECTION_7:
        IntegrityLevel: System
    SELECTION_8:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_9:
        ParentImage: C:\Windows\System32\services.exe
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)) and SELECTION_8) and  not ((SELECTION_9)
        or (SELECTION_10 or SELECTION_11) or (SELECTION_12) or (SELECTION_13) or (SELECTION_14)
        or (SELECTION_15)))
falsepositives:
- System administrator usage
- Anti virus products
- WindowsApps located in "C:\Program Files\WindowsApps\"
id: cd951fdc-4b2f-47f5-ba99-a33bf61e3770
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/23
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-48-638.jpg
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.002

