title: HackTool - SafetyKatz Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/20
description: Detects the execution of the hacktool SafetyKatz via PE information and
    default Image name
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\SafetyKatz.exe'
    SELECTION_4:
        OriginalFileName: SafetyKatz.exe
    SELECTION_5:
        Description: SafetyKatz
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unlikely
id: b1876533-4ed5-4a83-90f3-b8645840a413
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://github.com/GhostPack/SafetyKatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

