title: Suspicious Reconnaissance Activity
ruletype: Sigma
analysis:
    recommendation: Check if the user that executed the commands is suspicious (e.g.
        service accounts, LOCAL_SYSTEM)
author: Florian Roth, omkar72, @svch0st
date: 2019/01/16
description: Detects suspicious command line activity on Windows systems
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*net group "domain admins"*'
        - '*net localgroup administrators*'
        - '*net group "enterprise admins"*'
        - '*net accounts /do*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Inventory tool runs
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: d95de845-b83c-4a9a-8a6a-4fc802ebf6c0
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/06/09
references:
- https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
status: experimental
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
yml_filename: proc_creation_win_susp_recon_activity.yml
yml_path: rules/windows/process_creation
---

