
title: SQL Client Tools PowerShell Session Detection
ruletype: Sigma
author: Agro (@agro_sev) oscd.communitly
date: 2020/10/13
description: This rule detects execution of a PowerShell code through the sqltoolsps.exe
  utility, which is included in the standard set of utilities supplied with the Microsoft
  SQL Server Management studio. Script blocks are not logged in this case, so this
  utility helps to bypass protection mechanisms based on the analysis of these logs.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\sqltoolsps.exe'
  SELECTION_4:
    ParentImage: '*\sqltoolsps.exe'
  SELECTION_5:
    OriginalFileName: \sqltoolsps.exe
  SELECTION_6:
    ParentImage: '*\smss.exe'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
    and  not (SELECTION_6))
falsepositives:
- Direct PS command execution through SQLToolsPS.exe is uncommon, childprocess sqltoolsps.exe
  spawned by smss.exe is a legitimate action.
id: a746c9b8-a2fb-4ee5-a428-92bee9e99060
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/25
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OtherMSBinaries/Sqltoolsps.yml
- https://twitter.com/pabraeken/status/993298228840992768
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1127
