title: PUA - Crassus Execution
id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
status: test
description: Detects Crassus, a Windows privilege escalation discovery tool, based on PE metadata characteristics.
references:
    - https://github.com/vu-ls/Crassus
author: pH-T (Nextron Systems)
date: 2023/04/17
tags:
    - attack.discovery
    - attack.t1590.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \Crassus.exe
        - OriginalFileName: Crassus.exe
        - Description|contains: Crassus
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
