title: Potential RDP Session Hijacking Activity
id: 09837897-8a41-2149-8846-838a2356ea6d
related:
    - id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
      type: derived
status: test
description: Detects potential RDP Session Hijacking activity on Windows systems
references:
    - https://twitter.com/Moti_B/status/909449115477659651
author: '@juju4'
date: 2022-12-27
modified: 2024-12-01
tags:
    - attack.execution
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \tscon.exe
        - OriginalFileName: tscon.exe
    selection_integrity:
        IntegrityLevel:
            - System
            - S-1-16-16384
    condition: process_creation and (all of selection_*)
falsepositives:
    - Administrative activity
level: medium
ruletype: Sigma
