title: Suspicious Key Manager Access
id: d8f4e22e-8510-18d6-04ca-814ca8c72672
related:
    - id: a4694263-59a8-4608-a3a0-6f8d3a51664c
      type: derived
status: test
description: Detects the invocation of the Stored User Names and Passwords dialogue (Key Manager)
references:
    - https://twitter.com/NinjaParanoid/status/1516442028963659777
author: Florian Roth (Nextron Systems)
date: '2022-04-21'
modified: '2023-02-09'
tags:
    - attack.credential-access
    - attack.t1555.004
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \rundll32.exe
        - OriginalFileName: RUNDLL32.EXE
    selection_cli:
        CommandLine|contains|all:
            - keymgr
            - KRShowKeyMgr
    condition: process_creation and (all of selection_*)
falsepositives:
    - Administrative activity
level: high
ruletype: Sigma
