title: Set Suspicious Files as System Files Using Attrib.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/28
description: 'Detects the usage of attrib with the "+s" option to set scripts or executables
    located in suspicious locations as system files to hide them from users and make
    them unable to be deleted with simple rights. The rule limits the search to specific
    extensions and directories to avoid FPs

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\attrib.exe'
    SELECTION_4:
        OriginalFileName: ATTRIB.EXE
    SELECTION_5:
        CommandLine: '* +s*'
    SELECTION_6:
        CommandLine:
        - '* %*'
        - '*\Users\Public\\*'
        - '*\AppData\Local\\*'
        - '*\ProgramData\\*'
        - '*\Downloads\\*'
        - '*\Windows\Temp\\*'
    SELECTION_7:
        CommandLine:
        - '*.bat*'
        - '*.dll*'
        - '*.exe*'
        - '*.hta*'
        - '*.ps1*'
        - '*.vbe*'
        - '*.vbs*'
    SELECTION_8:
        CommandLine: '*\Windows\TEMP\\*'
    SELECTION_9:
        CommandLine: '*.exe*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6 and SELECTION_7) and  not (SELECTION_8 and SELECTION_9))
falsepositives:
- Unknown
id: efec536f-72e8-4656-8960-5e85d091345b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/14
references:
- https://app.any.run/tasks/c28cabc8-a19f-40f3-a78b-cae506a5c0d4
- https://app.any.run/tasks/cfc8870b-ccd7-4210-88cf-a8087476a6d0
- https://unit42.paloaltonetworks.com/unit42-sure-ill-take-new-combojack-malware-alters-clipboards-steal-cryptocurrency/
related:
-   id: bb19e94c-59ae-4c15-8c12-c563d23fe52b
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001

