title: Renamed Rundll32 Execution Via DllRegisterServer
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/22
description: Detects when 'DllRegisterServer' is called in the commandline and the
    image is not rundll32. This could mean that the 'rundll32' utility has been renamed
    in order to avoid detection
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*DllRegisterServer*'
    SELECTION_4:
        Image: '*\rundll32.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unlikely
id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/10
references:
- https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
- https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
related:
-   id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
    type: derived
status: experimental
tags:
- attack.execution

