title: Registry Modification Via Regini.EXE
ruletype: Sigma
author: Eli Salem, Sander Wiebing, oscd.community
date: 2020/10/08
description: Detects the execution of regini.exe which can be used to modify registry
    keys, the changes are imported from one or more text files.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\regini.exe'
    SELECTION_4:
        OriginalFileName: REGINI.EXE
    SELECTION_5:
        CommandLine|re: :[^ \\]
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Legitimate modification of keys
fields:
- ParentImage
- CommandLine
id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/02/08
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regini/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini
related:
-   id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
    type: derived
status: experimental
tags:
- attack.t1112
- attack.defense_evasion

