title: Executable Used by PlugX in Uncommon Location
ruletype: Sigma
author: Florian Roth
date: 2017/06/12
description: Detects the execution of an executable that is typically used by PlugX
    for DLL side loading started from an uncommon location
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        Image: '*\Windows Media Player\\*'
    SELECTION_11:
        Image: '*\hcc.exe'
    SELECTION_12:
        Image: '*\HTML Help Workshop\\*'
    SELECTION_13:
        Image: '*\hkcmd.exe'
    SELECTION_14:
        Image:
        - '*\System32\\*'
        - '*\SysNative\\*'
        - '*\SysWow64\\*'
    SELECTION_15:
        Image: '*\Mc.exe'
    SELECTION_16:
        Image:
        - '*\Microsoft Visual Studio*'
        - '*\Microsoft SDK*'
        - '*\Windows Kit*'
    SELECTION_17:
        Image: '*\MsMpEng.exe'
    SELECTION_18:
        Image:
        - '*\Microsoft Security Client\\*'
        - '*\Windows Defender\\*'
        - '*\AntiMalware\\*'
    SELECTION_19:
        Image: '*\msseces.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        Image:
        - '*\Microsoft Security Center\\*'
        - '*\Microsoft Security Client\\*'
        - '*\Microsoft Security Essentials\\*'
    SELECTION_21:
        Image: '*\OInfoP11.exe'
    SELECTION_22:
        Image: '*\Common Files\Microsoft Shared\\*'
    SELECTION_23:
        Image: '*\OleView.exe'
    SELECTION_24:
        Image:
        - '*\Microsoft Visual Studio*'
        - '*\Microsoft SDK*'
        - '*\Windows Kit*'
        - '*\Windows Resource Kit\\*'
    SELECTION_25:
        Image: '*\rc.exe'
    SELECTION_26:
        Image:
        - '*\Microsoft Visual Studio*'
        - '*\Microsoft SDK*'
        - '*\Windows Kit*'
        - '*\Windows Resource Kit\\*'
        - '*\Microsoft.NET\\*'
    SELECTION_3:
        Image: '*\CamMute.exe'
    SELECTION_4:
        Image:
        - '*\Lenovo\Communication Utility\\*'
        - '*\Lenovo\Communications Utility\\*'
    SELECTION_5:
        Image: '*\chrome_frame_helper.exe'
    SELECTION_6:
        Image: '*\Google\Chrome\application\\*'
    SELECTION_7:
        Image: '*\dvcemumanager.exe'
    SELECTION_8:
        Image: '*\Microsoft Device Emulator\\*'
    SELECTION_9:
        Image: '*\Gadget.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((((((((((((SELECTION_3 and  not
        (SELECTION_4)) or (SELECTION_5 and  not (SELECTION_6))) or (SELECTION_7 and  not
        (SELECTION_8))) or (SELECTION_9 and  not (SELECTION_10))) or (SELECTION_11
        and  not (SELECTION_12))) or (SELECTION_13 and  not (SELECTION_14))) or (SELECTION_15
        and  not (SELECTION_16))) or (SELECTION_17 and  not (SELECTION_18))) or (SELECTION_19
        and  not (SELECTION_20))) or (SELECTION_21 and  not (SELECTION_22))) or (SELECTION_23
        and  not (SELECTION_24))) or (SELECTION_25 and  not (SELECTION_26))))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: aeab5ec5-be14-471a-80e8-e344418305c2
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/01/28
references:
- http://www.hexacorn.com/blog/2016/03/10/beyond-good-ol-run-key-part-36/
- https://countuponsecurity.com/2017/06/07/threat-hunting-in-the-enterprise-with-appcompatprocessor/
status: test
tags:
- attack.s0013
- attack.defense_evasion
- attack.t1574.002
yml_filename: proc_creation_win_plugx_susp_exe_locations.yml
yml_path: rules/windows/process_creation
---

