title: Delete Important Scheduled Task
id: e11ce78b-ef8d-926e-b3cf-669672d1620b
related:
    - id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d # TaskScheduler EventLog
      type: similar
    - id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad # Security-Audting Eventlog
      type: similar
    - id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
      type: derived
status: test
description: Detects when adversaries stop services or processes by deleting their respective scheduled tasks in order to conduct data destructive activities
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-09
tags:
    - attack.impact
    - attack.t1489
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains|all:
            - /delete
            - /tn
        CommandLine|contains:
            # Add more important tasks
            - \Windows\BitLocker
            - \Windows\ExploitGuard
            - \Windows\SystemRestore\SR
            - \Windows\UpdateOrchestrator\
            - \Windows\Windows Defender\
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
