title: Potential Defense Evasion Via Rename Of Highly Relevant Binaries
ruletype: Sigma
author: Matthew Green - @mgreen27, Florian Roth (Nextron Systems), frack113
date: 2019/06/15
description: Detects the execution of a renamed binary often used by attackers or
    malware leveraging new Sysmon OriginalFileName datapoint.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: Execute processes remotely
    SELECTION_4:
        Product: Sysinternals PsExec
    SELECTION_5:
        Description:
        - Windows PowerShell*
        - pwsh*
    SELECTION_6:
        OriginalFileName:
        - powershell.exe
        - pwsh.dll
        - powershell_ise.exe
        - psexec.exe
        - psexec.c
        - psexesvc.exe
        - cscript.exe
        - wscript.exe
        - mshta.exe
        - regsvr32.exe
        - wmic.exe
        - certutil.exe
        - rundll32.exe
        - cmstp.exe
        - msiexec.exe
        - reg.exe
    SELECTION_7:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\powershell_ise.exe'
        - '*\psexec.exe'
        - '*\psexec64.exe'
        - '*\PSEXESVC.exe'
        - '*\cscript.exe'
        - '*\wscript.exe'
        - '*\mshta.exe'
        - '*\regsvr32.exe'
        - '*\wmic.exe'
        - '*\certutil.exe'
        - '*\rundll32.exe'
        - '*\cmstp.exe'
        - '*\msiexec.exe'
        - '*\reg.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6) and  not (SELECTION_7))
falsepositives:
- Custom applications use renamed binaries adding slight change to binary name. Typically
    this is easy to spot and add to whitelist
id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/01
references:
- https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
- https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks
- https://twitter.com/christophetd/status/1164506034720952320
- https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/
related:
-   id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
    type: similar
-   id: 2569ed8c-1147-498a-9b8c-2ad3656b10ed
    type: derived
-   id: a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2
    type: obsoletes
-   id: d178a2d7-129a-4ba4-8ee6-d6e1fecd5d20
    type: obsoletes
-   id: d4d2574f-ac17-4d9e-b986-aeeae0dc8fe2
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.t1036.003
- car.2013-05-009

