title: NodeJS Execution of JavaScript File
id: 430be212-29d5-9f8b-6cc1-a45ba8b977ce
related:
    - id: ba3874b9-0fae-465f-836c-eb5d071a1789
      type: derived
status: experimental
description: |
    Detects execution of JavaScript or JSC files using NodeJs binary node.exe, that could be potentially suspicious.
    Node.js is a popular open-source JavaScript runtime that runs code outside browsers and is widely used for both frontend and backend development.
    Adversaries have been observed abusing Node.js to disguise malware as legitimate processes, evade security defenses, and maintain persistence within target systems.
    Because Node.js is commonly used, this rule may generate false positives in some environments. However, if such activity is unusual in your environment, it is highly suspicious and warrants immediate investigation.
references:
    - https://www.microsoft.com/en-us/security/blog/2025/04/15/threat-actors-misuse-node-js-to-deliver-malware-and-other-malicious-payloads/
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-04-21
tags:
    - attack.execution
    - attack.t1059.007
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \node.exe
        - OriginalFileName: node.exe
        - Product: Node.js
    selection_cmd:
        CommandLine|contains: .js
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate use of node.exe to execute JavaScript or JSC files on your environment
level: low
ruletype: Sigma
