title: Suspicious Parent of Csc.exe
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2019/02/11
description: Detects a suspicious parent of csc.exe, which could by a sign of payload
    delivery
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\csc.exe'
    SELECTION_4:
        ParentImage:
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\mshta.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: b730a276-6b63-41b8-bcf8-55930c8fc6ee
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/01/07
references:
- https://twitter.com/SBousseaden/status/1094924091256176641
status: test
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
- attack.defense_evasion
- attack.t1218.005
- attack.t1027.004

