title: Visual Studio NodejsTools PressAnyKey Renamed Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2023/04/11
description: Detects renamed execution of "Microsoft.NodejsTools.PressAnyKey.exe",
    which can be abused as a LOLBIN to execute arbitrary binaries
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: Microsoft.NodejsTools.PressAnyKey.exe
    SELECTION_4:
        Image: '*\Microsoft.NodejsTools.PressAnyKey.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- Unknown
id: 65c3ca2c-525f-4ced-968e-246a713d164f
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/mrd0x/status/1463526834918854661
- https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
related:
-   id: a20391f8-76fb-437b-abc0-dba2df1952c6
    type: similar
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218

