title: Wlrmdr Lolbin Use as Launcher
ruletype: Sigma
author: frack113, manasmbellani
date: 2022/02/16
description: Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*-a *'
    SELECTION_11:
        CommandLine: '*-u *'
    SELECTION_12:
        ParentImage: C:\Windows\System32\winlogon.exe
    SELECTION_13:
        ParentImage: '-'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\wlrmdr.exe'
    SELECTION_4:
        Image: '*\wlrmdr.exe'
    SELECTION_5:
        OriginalFileName: WLRMNDR.EXE
    SELECTION_6:
        CommandLine: '*-s *'
    SELECTION_7:
        CommandLine: '*-f *'
    SELECTION_8:
        CommandLine: '*-t *'
    SELECTION_9:
        CommandLine: '*-m *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (((SELECTION_4 or
        SELECTION_5) and (SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10 and SELECTION_11)) and  not ((SELECTION_12) or (SELECTION_13)))))
falsepositives:
- Unknown
id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/06
references:
- https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

