title: Python Function Execution Security Warning Disabled In Excel
id: b19ef1bf-9340-ccd5-8b71-efc273b924fa
related:
    - id: 17e53739-a1fc-4a62-b1b9-87711c2d5e44
      type: similar
    - id: 023c654f-8f16-44d9-bb2b-00ff36a62af9
      type: derived
status: test
description: |
    Detects changes to the registry value "PythonFunctionWarnings" that would prevent any warnings or alerts from showing when Python functions are about to be executed.
    Threat actors could run malicious code through the new Microsoft Excel feature that allows Python to run within the spreadsheet.
references:
    - https://support.microsoft.com/en-us/office/data-security-and-python-in-excel-33cc88a4-4a87-485e-9ff9-f35958278327
author: '@Kostastsale'
date: 2023-08-22
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - \Microsoft\Office\
            - \Excel\Security
            - PythonFunctionWarnings
        CommandLine|contains: ' 0'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
