title: Bitsadmin Download
ruletype: Sigma
author: Michael Haag, FPT.EagleEye
date: 2017/03/09
description: Detects usage of bitsadmin downloading a file
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*copy bitsadmin.exe*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\bitsadmin.exe'
    SELECTION_4:
        OriginalFileName: bitsadmin.exe
    SELECTION_5:
        CommandLine: '* /transfer *'
    SELECTION_6:
        Image: '*\bitsadmin.exe'
    SELECTION_7:
        OriginalFileName: bitsadmin.exe
    SELECTION_8:
        CommandLine:
        - '* /create *'
        - '* /addfile *'
    SELECTION_9:
        CommandLine: '*http*'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or SELECTION_4) and
        SELECTION_5) or ((SELECTION_6 or SELECTION_7) and (SELECTION_8 and SELECTION_9))
        or SELECTION_10))
falsepositives:
- Some legitimate apps use this, but limited.
fields:
- CommandLine
- ParentCommandLine
id: d059842b-6b9d-4ed1-b5c3-5b89143c6ede
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/11/11
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003

