title: PowerShell Web Access Feature Enabled Via DISM
id: ce98bc10-0843-6ed4-2d3b-833a4cacf948
related:
    - id: 7e8f2d3b-9c1a-4f67-b9e8-8d9006e0e51f
      type: derived
status: test
description: Detects the use of DISM to enable the PowerShell Web Access feature, which could be used for remote access and potential abuse
references:
    - https://docs.microsoft.com/en-us/powershell/module/dism/enable-windowsoptionalfeature
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
    - https://gist.github.com/MHaggis/7e67b659af9148fa593cf2402edebb41
author: Michael Haag
date: '2024-09-03'
tags:
    - attack.persistence
    - attack.t1548.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \dism.exe
        - OriginalFileName: DISM.EXE
    selection_cli:
        CommandLine|contains|all:
            - WindowsPowerShellWebAccess
            - /online
            - /enable-feature
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate PowerShell Web Access installations by administrators
level: high
ruletype: Sigma
