title: Suspicious WebDav Client Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2023/03/16
description: 'Detects "svchost.exe" spawning "rundll32.exe" with command arguments
    like C:\windows\system32\davclnt.dll,DavSetCookie. This could be an indicator
    of exfiltration or use of WebDav to launch code (hosted on WebDav Server) or potentially
    a sign of exploitation of CVE-2023-23397

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\svchost.exe'
    SELECTION_4:
        Image: '*\rundll32.exe'
    SELECTION_5:
        CommandLine: '*C:\windows\system32\davclnt.dll,DavSetCookie*'
    SELECTION_6:
        CommandLine|re: ://\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}
    SELECTION_7:
        CommandLine:
        - '*://10.*'
        - '*://192.168.*'
        - '*://172.16.*'
        - '*://172.17.*'
        - '*://172.18.*'
        - '*://172.19.*'
        - '*://172.20.*'
        - '*://172.21.*'
        - '*://172.22.*'
        - '*://172.23.*'
        - '*://172.24.*'
        - '*://172.25.*'
        - '*://172.26.*'
        - '*://172.27.*'
        - '*://172.28.*'
        - '*://172.29.*'
        - '*://172.30.*'
        - '*://172.31.*'
        - '*://127.*'
        - '*://169.254.*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7)))
falsepositives:
- Unknown
id: 982e9f2d-1a85-4d5b-aea4-31f5e97c6555
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/aceresponder/status/1636116096506818562
- https://www.mdsec.co.uk/2023/03/exploiting-cve-2023-23397-microsoft-outlook-elevation-of-privilege-vulnerability/
- https://www.pwndefend.com/2023/03/15/the-long-game-persistent-hash-theft/
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
- cve.2023.23397

