title: Download Files Using Notepad++ GUP Utility
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/10
description: Detects execution of the Notepad++ updater (gup) from a process other
    than Notepad++ to download files.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\GUP.exe'
    SELECTION_4:
        OriginalFileName: gup.exe
    SELECTION_5:
        CommandLine: '* -unzipTo *'
    SELECTION_6:
        CommandLine: '*http*'
    SELECTION_7:
        ParentImage: '*\notepad++.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not (SELECTION_7))
falsepositives:
- Other parent processes other than notepad++ using GUP that are not currently identified
id: 44143844-0631-49ab-97a0-96387d6b2d7c
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/nas_bench/status/1535322182863179776
status: experimental
tags:
- attack.command_and_control
- attack.t1105
yml_filename: proc_creation_win_susp_gup_download.yml
yml_path: rules/windows/process_creation
---

