title: HackTool - ADCSPwn Execution
id: 6b96577f-a9c7-16c5-d7fa-437001661363
related:
    - id: cd8c163e-a19b-402e-bdd5-419ff5859f12
      type: derived
status: test
description: Detects command line parameters used by ADCSPwn, a tool to escalate privileges in an active directory network by coercing authenticate from machine accounts and relaying to the certificate service
references:
    - https://github.com/bats3c/ADCSPwn
author: Florian Roth (Nextron Systems)
date: '2021-07-31'
modified: '2023-02-04'
tags:
    - attack.credential-access
    - attack.t1557.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - ' --adcs '
            - ' --port '
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
