title: HackTool - HandleKatz LSASS Dumper Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/08/18
description: Detects the use of HandleKatz, a tool that demonstrates the usage of
    cloned handles to Lsass in order to create an obfuscated memory dump of the same
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\loader.exe'
    SELECTION_4:
        CommandLine: '*--pid:*'
    SELECTION_5:
        Imphash:
        - 38d9e015591bbfd4929e0d0f47fa0055
        - 0e2216679ca6e1094d63322e3412d650
    SELECTION_6:
        Hashes:
        - IMPHASH=38D9E015591BBFD4929E0D0F47FA0055
        - IMPHASH=0E2216679CA6E1094D63322E3412D650
    SELECTION_7:
        CommandLine: '*--pid:*'
    SELECTION_8:
        CommandLine: '*--outfile:*'
    SELECTION_9:
        CommandLine:
        - '*.dmp*'
        - '*lsass*'
        - '*.obf*'
        - '*dump*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 or SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: ca621ba5-54ab-4035-9942-d378e6fcde3c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://github.com/codewhitesec/HandleKatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

