title: Registry Enumeration via WMI Stdregprov
id: 778f82a4-6e7a-88e0-1291-310b3159c609
related:
    - id: c453ab7a-1f5c-4716-a3b4-dea8135fb43a # Registry Manipulation via WMI Stdregprov
      type: similar
    - id: a0e417e2-2fa1-40da-b6d2-e094cd5e1191
      type: derived
status: experimental
description: |
    Detects the usage of wmic.exe to enumerate or read Windows registry via the WMI StdRegProv class read methods (EnumKey, EnumValues, GetStringValue, etc.).
    While registry reads are common, attackers may use this technique to perform reconnaissance and discover sensitive configuration values, credentials, or installed software.
    The use of WMI as an alternative to standard tools like reg.exe can indicate an attempt to evade detection focused on traditional registry query commands.
references:
    - https://trustedsec.com/blog/command-line-underdog-wmic-in-action
    - https://trustedsec.com/blog/wmi-for-script-kiddies
    - https://learn.microsoft.com/en-us/previous-versions/windows/desktop/regprov/stdregprov
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-07-30
modified: 2026-06-19
tags:
    - attack.execution
    - attack.t1047
    - attack.discovery
    - attack.t1012
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:   # Example command simulated:  WMIC  /NameSpace:\\root\default Class StdRegProv Call EnumKey hDefKey=&H80000002 sSubKeyName="Software\Microsoft\Windows\CurrentVersion\Uninstall"
        - Image|endswith: \wmic.exe
        - OriginalFileName: wmic.exe
    selection_cli:
        CommandLine|contains|all:
            - stdregprov
            - call
        CommandLine|contains:
            - CheckAccess
            - EnumKey
            - EnumValues
            - GetBinaryValue
            - GetDWORDValue
            - GetExpandedStringValue
            - GetMultiStringValue
            - GetQWORDValue
            - GetSecurityDescriptor
            - GetStringValue
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate administrative activity
level: medium
ruletype: Sigma
