title: Psexec Execution
id: 57c03533-d22d-7032-2b7a-b4dd7f7a5784
related:
    - id: 730fc21b-eaff-474b-ad23-90fd265d4988
      type: derived
status: test
description: Detects user accept agreement execution in psexec commandline
references:
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: omkar72
date: 2020-10-30
modified: 2023-02-28
tags:
    - attack.execution
    - attack.lateral-movement
    - attack.t1569
    - attack.t1021
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \psexec.exe
        - OriginalFileName: psexec.c
    condition: process_creation and selection
falsepositives:
    - Administrative scripts.
level: medium
ruletype: Sigma
