title: HandleKatz LSASS Dumper Usage
ruletype: Sigma
author: Florian Roth
date: 2022/08/18
description: Detects the use of HandleKatz, a tool that demonstrates the usage of
    cloned handles to Lsass in order to create an obfuscated memory dump of the same
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Imphash:
        - 38d9e015591bbfd4929e0d0f47fa0055
        - 0e2216679ca6e1094d63322e3412d650
    SELECTION_4:
        Hashes:
        - IMPHASH=38D9E015591BBFD4929E0D0F47FA0055
        - IMPHASH=0E2216679CA6E1094D63322E3412D650
    SELECTION_5:
        CommandLine: '*--pid:*'
    SELECTION_6:
        CommandLine: '*--outfile:*'
    SELECTION_7:
        CommandLine:
        - '*.dmp*'
        - '*lsass*'
        - '*.obf*'
        - '*dump*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) or
        (SELECTION_5 and SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: ca621ba5-54ab-4035-9942-d378e6fcde3c
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/codewhitesec/HandleKatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

