title: Suspicious Modification Of Scheduled Tasks
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/28
description: |
    Detects when an attacker tries to modify an already existing scheduled tasks to run from a suspicious location
    Attackers can create a simple looking task in order to avoid detection on creation as it's often the most focused on
    Instead they modify the task after creation to include their malicious payload
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\schtasks.exe'
    SELECTION_4:
        CommandLine: '* /Change *'
    SELECTION_5:
        CommandLine: '* /TN *'
    SELECTION_6:
        CommandLine:
        - '*\AppData\Local\Temp*'
        - '*\AppData\Roaming\\*'
        - '*\Users\Public\\*'
        - '*\WINDOWS\Temp\\*'
        - '*\Desktop\\*'
        - '*\Downloads\\*'
        - '*\Temporary Internet*'
        - '*C:\ProgramData\\*'
        - '*C:\Perflogs\\*'
        - '*%ProgramData%*'
        - '*%appdata%*'
        - '*%comspec%*'
        - '*%localappdata%*'
    SELECTION_7:
        CommandLine:
        - '*regsvr32*'
        - '*rundll32*'
        - '*cmd /c *'
        - '*cmd.exe /c *'
        - '*powershell*'
        - '*mshta*'
        - '*wscript*'
        - '*cscript*'
        - '*certutil*'
        - '*bitsadmin*'
        - '*bash.exe*'
        - '*bash *'
        - '*scrcons*'
        - '*wmic *'
        - '*wmic.exe*'
        - '*forfiles*'
        - '*scriptrunner*'
        - '*hh.exe*'
        - '*hh *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 1c0e41cd-21bb-4433-9acc-4a2cd6367b9b
level: high
logsource:
    category: process_creation
    product: windows
references:
- Internal Research
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
status: experimental
tags:
- attack.execution
- attack.t1053.005
yml_filename: proc_creation_win_susp_schtasks_change.yml
yml_path: rules/windows/process_creation
---

