title: Suspicious Runscripthelper.exe
id: eca49c87-8a75-4f13-9c73-a5a29e845f03
status: test
description: Detects execution of powershell scripts via Runscripthelper.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/
author: Victor Sergeev, oscd.community
date: 2020/10/09
modified: 2022/07/11
tags:
    - attack.execution
    - attack.t1059
    - attack.defense_evasion
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \Runscripthelper.exe
        CommandLine|contains: surfacecheck
    condition: process_creation and selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
