title: Arbitrary File Download Via MSEDGE_PROXY.EXE
id: 0b97f8b0-c165-377f-fe12-9f7fc943c58b
related:
    - id: e84d89c4-f544-41ca-a6af-4b92fd38b023
      type: derived
status: test
description: Detects usage of "msedge_proxy.exe" to download arbitrary files
references:
    - https://lolbas-project.github.io/lolbas/Binaries/msedge_proxy/
author: Swachchhanda Shrawan Poudel
date: 2023-11-09
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \msedge_proxy.exe
        - OriginalFileName: msedge_proxy.exe
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
