title: Renamed SysInternals DebugView Execution
id: 2c93ac7e-1cca-c540-1a03-02a177f99903
related:
    - id: cd764533-2e07-40d6-a718-cfeec7f2da7f
      type: derived
status: test
description: Detects suspicious renamed SysInternals DebugView execution
references:
    - https://www.epicturla.com/blog/sysinturla
author: Florian Roth (Nextron Systems)
date: '2020-05-28'
modified: '2023-02-14'
tags:
    - attack.resource-development
    - attack.t1588.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Product: Sysinternals DebugView
    filter:
        OriginalFileName: Dbgview.exe
        Image|endswith: \Dbgview.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
