title: Obfuscated IP Download
ruletype: Sigma
author: Florian Roth
date: 2022/08/03
description: Detects use of an encoded/obfuscated version of an IP address (hex, octal...)
    in an URL combined with a download command
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*Invoke-WebRequest*'
        - '*iwr *'
        - '*wget *'
        - '*curl *'
        - '*DownloadFile*'
        - '*DownloadString*'
    SELECTION_4:
        CommandLine:
        - '*//0x*'
        - '*.0x*'
        - '*.00x*'
    SELECTION_5:
        CommandLine: '*http://%*'
    SELECTION_6:
        CommandLine: '*%2e*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: cb5a2333-56cf-4562-8fcb-22ba1bca728d
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://h.43z.one/ipconverter/
- https://twitter.com/Yasser_Elsnbary/status/1553804135354564608
status: experimental
tags:
- attack.discovery
yml_filename: proc_creation_win_obfuscated_ip_download.yml
yml_path: rules/windows/process_creation
---

