title: DefenderCheck Usage
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/08/30
description: Detects the use of DefenderCheck, a tool to evaluate the signatures used
    in Microsoft Defender. It can be used to figure out the strings / byte chains
    used in Microsoft Defender to detect a tool and thus used for AV evasion.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\DefenderCheck.exe'
    SELECTION_4:
        Description: DefenderCheck
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
id: f0ca6c24-3225-47d5-b1f5-352bf07ecfa7
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/matterpreter/DefenderCheck
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.005

