title: Potential Download/Upload Activity Using Type Command
id: d05e404f-e59f-b860-597a-49c86249f77b
related:
    - id: aa0b3a82-eacc-4ec3-9150-b5a9a3e3f82f
      type: derived
status: test
description: Detects usage of the "type" command to download/upload data from WebDAV server
references:
    - https://mr0range.com/a-new-lolbin-using-the-windows-type-command-to-upload-download-files-81d7b6179e22
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-12-14
tags:
    - attack.command-and-control
    - attack.t1105
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_upload:
        CommandLine|contains|all:
            - 'type '
            - ' > \\\\'
    selection_download:
        CommandLine|contains|all:
            - type \\\\
            - ' > ' # Space are added to increase atom length and speed up matching. If your backend can handle this remove the space
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
