title: LOLBIN From Abnormal Drive
ruletype: Sigma
author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Angelo Violetti
    - SEC Consult '@angelo_violetti'
date: 2022/01/25
description: Detects LOLBINs executing from an abnormal drive such as a mounted ISO.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\rundll32.exe'
        - '*\calc.exe'
        - '*\mshta.exe'
        - '*\cscript.exe'
        - '*\wscript.exe'
        - '*\regsvr32.exe'
        - '*\installutil.exe'
        - '*\cmstp.exe'
    SELECTION_4:
        OriginalFileName:
        - RUNDLL32.EXE
        - CALC.EXE
        - MSHTA.EXE
        - cscript.exe
        - wscript.exe
        - REGSVR32.EXE
        - installutil.exe
        - CMSTP.EXE
    SELECTION_5:
        CurrentDirectory: '*C:\\*'
    SELECTION_6:
        CurrentDirectory: ''
    SELECTION_7:
        CurrentDirectory: null
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6) or (SELECTION_7)))
falsepositives:
- Rare false positives could occur on servers with multiple drives.
id: d4ca7c59-e9e4-42d8-bf57-91a776efcb87
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/04/12
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://www.scythe.io/library/threat-emulation-qakbot
- https://sec-consult.com/blog/detail/bumblebee-hunting-with-a-velociraptor/
status: test
tags:
- attack.defense_evasion

