title: Schtasks Creation Or Modification With SYSTEM Privileges
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/28
description: Detects the creation or update of a scheduled task to run with "NT AUTHORITY\SYSTEM"
    privileges
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*/TN TVInstallRestore*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\schtasks.exe'
    SELECTION_4:
        CommandLine:
        - '* /change *'
        - '* /create *'
    SELECTION_5:
        CommandLine: '*/ru *'
    SELECTION_6:
        CommandLine:
        - '*NT AUT*'
        - '* SYSTEM *'
    SELECTION_7:
        ParentImage: '*\AppData\Local\Temp\\*'
    SELECTION_8:
        ParentImage: '*TeamViewer_.exe*'
    SELECTION_9:
        Image: '*\schtasks.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not (SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10))
falsepositives:
- Unknown
id: 89ca78fd-b37c-4310-b3d3-81a023f83936
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.elastic.co/security-labs/exploring-the-qbot-attack-pattern
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1053.005

