title: Possible Shim Database Persistence via sdbinst.exe
id: 517490a7-115a-48c6-8862-1a481504d5a8
status: test
description: Detects installation of a new shim using sdbinst.exe. A shim can be used
    to load malicious DLLs into applications.
references:
    - https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
author: Markus Neis
date: 2019/01/16
modified: 2022/10/09
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1546.011
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \sdbinst.exe
        CommandLine|contains: .sdb
    filter:
        CommandLine|contains: iisexpressshim.sdb
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
