title: Execution of Powershell Script in Public Folder
ruletype: Sigma
author: Max Altgelt
date: 2022/04/06
description: This rule detects execution of PowerShell scripts located in the "C:\Users\Public"
    folder
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        CommandLine:
        - '*-f C:\Users\Public*'
        - '*-f "C:\Users\Public*'
        - '*-f %Public%*'
        - '*-fi C:\Users\Public*'
        - '*-fi "C:\Users\Public*'
        - '*-fi %Public%*'
        - '*-fil C:\Users\Public*'
        - '*-fil "C:\Users\Public*'
        - '*-fil %Public%*'
        - '*-file C:\Users\Public*'
        - '*-file "C:\Users\Public*'
        - '*-file %Public%*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
fields:
- CommandLine
id: fb9d3ff7-7348-46ab-af8c-b55f5fbf39b4
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://www.mandiant.com/resources/evolution-of-fin7
status: experimental

