title: Suspicious Extrac32 Alternate Data Stream Execution
id: 88256ae2-9a13-3d54-c07b-e1dec57beffa
related:
    - id: 4b13db67-0c45-40f1-aba8-66a1a7198a1e
      type: derived
status: test
description: Extract data from cab file and hide it in an alternate data stream
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
author: frack113
date: '2021-11-26'
modified: '2022-12-30'
tags:
    - attack.defense-evasion
    - attack.t1564.004
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - extrac32.exe
            - .cab
        CommandLine|re: :[^\\]
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
