title: Suspicious Process Start Locations
ruletype: Sigma
author: juju4, Jonhnathan Ribeiro, oscd.community
date: 2019/01/16
description: Detects suspicious process run from unusual locations
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*:\RECYCLER\\*'
        - '*:\SystemVolumeInformation\\*'
    SELECTION_4:
        Image:
        - C:\Windows\Tasks\\*
        - C:\Windows\debug\\*
        - C:\Windows\fonts\\*
        - C:\Windows\help\\*
        - C:\Windows\drivers\\*
        - C:\Windows\addins\\*
        - C:\Windows\cursors\\*
        - C:\Windows\system32\tasks\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
    environment
id: 15b75071-74cc-47e0-b4c6-b43744a62a2b
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/01/07
references:
- https://car.mitre.org/wiki/CAR-2013-05-002
status: test
tags:
- attack.defense_evasion
- attack.t1036
- car.2013-05-002

