title: Curl Usage on Windows
ruletype: Sigma
author: Florian Roth
date: 2022/07/05
description: Detects a curl process start on Windows, which indicates a file download
    from a remote location or a simple web request to a remote server
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\curl.exe'
    SELECTION_4:
        Product: The curl executable
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: bbeaed61-1990-4773-bf57-b81dbad7db2d
level: low
logsource:
    category: process_creation
    product: windows
references:
- https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
status: test
tags:
- attack.command_and_control
- attack.t1105
yml_filename: proc_creation_win_curl_download.yml
yml_path: rules/windows/process_creation
---

