title: HackTool - SecurityXploded Execution
id: f67fce72-53b5-b8cc-a4d3-3d3163ca9b5f
related:
    - id: 7679d464-4f74-45e2-9e01-ac66c5eb041a
      type: derived
status: stable
description: Detects the execution of SecurityXploded Tools
references:
    - https://securityxploded.com/
    - https://web.archive.org/web/20200601000524/https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/
author: Florian Roth (Nextron Systems)
date: '2018-12-19'
modified: '2023-02-04'
tags:
    - attack.credential-access
    - attack.t1555
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Company: SecurityXploded
        - Image|endswith: PasswordDump.exe
        - OriginalFileName|endswith: PasswordDump.exe
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
