title: Shells Spawned by Web Servers
ruletype: Sigma
author: Thomas Patzke, Florian Roth (Nextron Systems), Zach Stanford @svch0st, Tim
    Shelton, Nasreddine Bencherchali (Nextron Systems)
date: 2019/01/16
description: Detects web servers that spawn shell processes which could be the result
    of a successfully placed web shell or another attack
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*sc query*'
    SELECTION_11:
        CommandLine: '*ADManager Plus*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\w3wp.exe'
        - '*\php.exe'
        - '*\php-cgi.exe'
        - '*\nginx.exe'
        - '*\httpd.exe'
        - '*\caddy.exe'
        - '*\ws_TomcatService.exe'
        - '*\tomcat.exe'
        - '*\UMWorkerProcess.exe'
    SELECTION_4:
        ParentImage:
        - '*\java.exe'
        - '*\javaw.exe'
    SELECTION_5:
        ParentImage:
        - '*-tomcat-*'
        - '*\tomcat*'
    SELECTION_6:
        ParentImage:
        - '*\java.exe'
        - '*\javaw.exe'
    SELECTION_7:
        ParentCommandLine:
        - '*catalina.jar*'
        - '*CATALINA_HOME*'
        - '*catalina.home*'
    SELECTION_8:
        Image:
        - '*\cmd.exe'
        - '*\cscript.exe'
        - '*\sh.exe'
        - '*\bash.exe'
        - '*\powershell.exe'
        - '*\powershell_ise.exe'
        - '*\pwsh.exe'
        - '*\bitsadmin.exe'
        - '*\arp.exe'
        - '*\at.exe'
        - '*\certutil.exe'
        - '*\dsget.exe'
        - '*\dsquery.exe'
        - '*\find.exe'
        - '*\findstr.exe'
        - '*\fsutil.exe'
        - '*\hostname.exe'
        - '*\ipconfig.exe'
        - '*\nbtstat.exe'
        - '*\net.exe'
        - '*\net1.exe'
        - '*\netdom.exe'
        - '*\netsh.exe'
        - '*\netstat.exe'
        - '*\nltest.exe'
        - '*\nslookup.exe'
        - '*\ntdutil.exe'
        - '*\pathping.exe'
        - '*\ping.exe'
        - '*\qprocess.exe'
        - '*\query.exe'
        - '*\qwinsta.exe'
        - '*\reg.exe'
        - '*\rundll32.exe'
        - '*\sc.exe'
        - '*\schtasks.exe'
        - '*\systeminfo.exe'
        - '*\tasklist.exe'
        - '*\tracert.exe'
        - '*\ver.exe'
        - '*\vssadmin.exe'
        - '*\wevtutil.exe'
        - '*\whoami.exe'
        - '*\wmic.exe'
        - '*\wscript.exe'
        - '*\wusa.exe'
    SELECTION_9:
        CommandLine: '*Windows\system32\cmd.exe /c C:\ManageEngine\ADManager "Plus\ES\bin\elasticsearch.bat
            -Enode.name=RMP-NODE1 -pelasticsearch-pid.txt'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or (SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)) and SELECTION_8) and  not ((SELECTION_9)
        or (SELECTION_10 and SELECTION_11)))
falsepositives:
- Particular web applications may spawn a shell process legitimately
fields:
- CommandLine
- ParentCommandLine
id: 8202070f-edeb-4d31-a010-a26c72ac5600
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/19
references:
- https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF
status: test
tags:
- attack.persistence
- attack.t1505.003
- attack.t1190

