title: Process Memory Dump via RdrLeakDiag.EXE
ruletype: Sigma
author: Cedric MAURUGEON, Florian Roth (Nextron Systems), Swachchhanda Shrawan Poudel,
    Nasreddine Bencherchali (Nextron Systems)
date: 2021/09/24
description: Detects the use of the Microsoft Windows Resource Leak Diagnostic tool
    "rdrleakdiag.exe" to dump process memory
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*fullmemdmp*'
        - '*/memdmp*'
        - '*-memdmp*'
    SELECTION_4:
        CommandLine:
        - '* -o *'
        - '* /o *'
    SELECTION_5:
        CommandLine:
        - '* -p *'
        - '* /p *'
    SELECTION_6:
        Image: '*\rdrleakdiag.exe'
    SELECTION_7:
        OriginalFileName: RdrLeakDiag.exe
    SELECTION_8:
        CommandLine:
        - '*fullmemdmp*'
        - '*/memdmp*'
        - '*-memdmp*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or ((SELECTION_6 or SELECTION_7) and SELECTION_8)))
falsepositives:
- Unknown
id: edadb1e5-5919-4e4c-8462-a9e643b02c4b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/24
references:
- https://www.pureid.io/dumping-abusing-windows-credentials-part-1/
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
- https://lolbas-project.github.io/lolbas/Binaries/Rdrleakdiag/
- https://twitter.com/0gtweet/status/1299071304805560321?s=21
related:
-   id: 6355a919-2e97-4285-a673-74645566340d
    type: obsoletes
status: test
tags:
- attack.credential_access
- attack.t1003.001

