title: Suspicious Usage Of ShellExec_RunDLL
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/01
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other
    commands as seen in the the raspberry-robin attack
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*ShellExec_RunDLL*'
    SELECTION_4:
        CommandLine:
        - '*regsvr32*'
        - '*msiexec*'
        - '*\Users\Public\\*'
        - '*odbcconf*'
        - '*\Desktop\\*'
        - '*\Temp\\*'
        - '*Invoke-*'
        - '*iex*'
        - '*comspec*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: d87bd452-6da1-456e-8155-7dc988157b7d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/30
references:
- https://redcanary.com/blog/raspberry-robin/
- https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 36c5146c-d127-4f85-8e21-01bf62355d5a
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion

