title: Process Launched Without Image Name
id: 515b2f18-eda6-0f5a-c3b1-a5155290027c
related:
    - id: f208d6d8-d83a-4c2c-960d-877c37da84e5
      type: derived
status: test
description: Detect the use of processes with no name (".exe"), which can be used to evade Image-based detections.
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
author: Matt Anderson (Huntress)
date: 2024-07-23
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \.exe
    condition: process_creation and selection
falsepositives:
    - Rare legitimate software.
level: medium
ruletype: Sigma
