title: UEFI Persistence Via Wpbbin - ProcessCreation
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/18
description: Detects execution of the binary "wpbbin" which is used as part of the
    UEFI based persistence method described in the reference section
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: C:\Windows\System32\wpbbin.exe
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate usage of the file by hardware manufacturer such as lenovo (Thanks @0gtweet
    for the tip)
id: 4abc0ec4-db5a-412f-9632-26659cddf145
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://grzegorztworek.medium.com/using-uefi-to-inject-executable-files-into-bitlocker-protected-drives-8ff4ca59c94c
- https://persistence-info.github.io/Data/wpbbin.html
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1542.001

