title: PUA - Restic Backup Tool Execution
id: 6ac2b2a7-da04-1cfa-07a5-b2e4c04b8b56
related:
    - id: 6ddff2e8-ea1a-45d0-8938-93dfc1d67ae7
      type: derived
status: experimental
description: |
    Detects the execution of the Restic backup tool, which can be used for data exfiltration.
    Threat actors may leverage Restic to back up and exfiltrate sensitive data to remote storage locations, including cloud services.
    If not legitimately used in the enterprise environment, its presence may indicate malicious activity.
references:
    - https://thedfirreport.com/2024/09/30/nitrogen-campaign-drops-sliver-and-ends-with-blackcat-ransomware/#exfiltration
    - https://restic.net/
    - https://restic.readthedocs.io/en/stable/030_preparing_a_new_repo.html
author: Nounou Mbeiri, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-10-17
tags:
    - attack.exfiltration
    - attack.t1048
    - attack.t1567.002
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_specific:
        - CommandLine|contains|all:
              - --password-file
              - init
              - ' -r '
        - CommandLine|contains|all:
              - --use-fs-snapshot
              - backup
              - ' -r '
    selection_restic:
        CommandLine|contains:
            - 'sftp:'
            - rest:http
            - s3:s3.
            - s3.http
            - 'azure:'
            - ' gs:'
            - 'rclone:'
            - 'swift:'
            - ' b2:'
        CommandLine|contains|all:
            - ' init '
            - ' -r '
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Legitimate use of Restic for backup purposes within the organization.
level: high
ruletype: Sigma
