title: Suspicious Powercfg Execution To Change Lock Screen Timeout
ruletype: Sigma
author: frack113
date: 2022/11/18
description: Detects suspicious execution of 'Powercfg.exe' to change lock screen
    timeout
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*-standby-timeout-*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\powercfg.exe'
    SELECTION_4:
        OriginalFileName: PowerCfg.exe
    SELECTION_5:
        CommandLine: '*/setacvalueindex *'
    SELECTION_6:
        CommandLine: '*SCHEME_CURRENT*'
    SELECTION_7:
        CommandLine: '*SUB_VIDEO*'
    SELECTION_8:
        CommandLine: '*VIDEOCONLOCK*'
    SELECTION_9:
        CommandLine: '*-change *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        ((SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10)))
falsepositives:
- Unknown
id: f8d6a15e-4bc8-4c27-8e5d-2b10f0b73e5b
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://learn.microsoft.com/en-us/windows-hardware/design/device-experiences/powercfg-command-line-options
status: experimental
tags:
- attack.defense_evasion

