title: Suspicious Regsvr32 HTTP IP Pattern
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/11
description: Detects a certain command line flag combination used by regsvr32 when
    used to download and register a DLL from a remote address which uses HTTP (not
    HTTPS) and a IP address and not FQDN
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '* /s*'
    SELECTION_4:
        CommandLine: '* /u*'
    SELECTION_5:
        CommandLine:
        - '* /i:http://1*'
        - '* /i:http://2*'
        - '* /i:http://3*'
        - '* /i:http://4*'
        - '* /i:http://5*'
        - '* /i:http://6*'
        - '* /i:http://7*'
        - '* /i:http://8*'
        - '* /i:http://9*'
        - '* /i:https://1*'
        - '* /i:https://2*'
        - '* /i:https://3*'
        - '* /i:https://4*'
        - '* /i:https://5*'
        - '* /i:https://6*'
        - '* /i:https://7*'
        - '* /i:https://8*'
        - '* /i:https://9*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- FQDNs that start with a number
id: 2dd2c217-bf68-437a-b57c-fe9fd01d5de8
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/11
references:
- https://twitter.com/mrd0x/status/1461041276514623491c19-ps
- https://twitter.com/tccontre18/status/1480950986650832903
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010

