
title: Stop Windows Service
ruletype: Sigma
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
description: Detects a windows service to be stopped
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    OriginalFileName:
    - sc.exe
    - net.exe
    - net1.exe
  SELECTION_4:
    Image:
    - '*\sc.exe'
    - '*\net.exe'
    - '*\net1.exe'
  SELECTION_5:
    CommandLine: '*stop*'
  SELECTION_6:
    CommandLine: sc  stop KSCWebConsoleMessageQueue
  SELECTION_7:
    User:
    - '*AUTHORI*'
    - '*AUTORI*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
    SELECTION_5) and  not (SELECTION_6 and SELECTION_7))
falsepositives:
- Administrator shutting down the service due to upgrade or removal purposes
fields:
- ComputerName
- User
- CommandLine
id: eb87818d-db5d-49cc-a987-d5da331fbd90
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/06/20
status: experimental
tags:
- attack.impact
- attack.t1489
