title: Suspicious PowerShell Download and Execute Pattern
ruletype: Sigma
author: Florian Roth
date: 2022/02/28
description: Detects suspicious PowerShell download patterns that are often used in
    malicious scripts, stagers or downloaders (make sure that your backend applies
    the strings case-insensitive)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*IEX ((New-Object Net.WebClient).DownloadString*'
        - '*IEX (New-Object Net.WebClient).DownloadString*'
        - '*IEX((New-Object Net.WebClient).DownloadString*'
        - '*IEX(New-Object Net.WebClient).DownloadString*'
        - '* -command (New-Object System.Net.WebClient).DownloadFile(*'
        - '* -c (New-Object System.Net.WebClient).DownloadFile(*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Software installers that pull packages from remote systems and execute them
id: e6c54d94-498c-4562-a37c-b469d8e9a275
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/03/01
references:
- https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
- https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
related:
-   id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1059.001

