title: User Discovery And Export Via Get-ADUser Cmdlet
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/09
description: Detects usage of the Get-ADUser cmdlet to collect user information and
    output it to a file
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine: '*Get-ADUser *'
    SELECTION_6:
        CommandLine: '* -Filter \*'
    SELECTION_7:
        CommandLine:
        - '* > *'
        - '* | Select *'
        - '*Out-File*'
        - '*Set-Content*'
        - '*Add-Content*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Legitimate admin scripts may use the same technique, it's better to exclude specific
    computers or users who execute these commands or scripts often
id: 1114e048-b69c-4f41-bc20-657245ae6e3f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/11/17
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
related:
-   id: c2993223-6da8-4b1a-88ee-668b8bf315e9
    type: similar
status: experimental
tags:
- attack.discovery
- attack.t1033

