title: Potential Network Sniffing Activity Using Network Tools
ruletype: Sigma
author: Timur Zinniatullin, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: 2019/10/21
description: 'Detects potential network sniffing via use of network tools such as
    "tshark", "windump" or "netsh".

    Network sniffing refers to using the network interface on a system to monitor
    or capture information sent over a wired or wireless connection.

    An adversary may place a network interface into promiscuous mode to passively
    access data in transit over the network, or use span ports to capture a larger
    amount of data.

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*yes*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\tshark.exe'
    SELECTION_4:
        CommandLine: '*-i*'
    SELECTION_5:
        Image: '*\windump.exe'
    SELECTION_6:
        Image: '*\netsh.exe'
    SELECTION_7:
        CommandLine: '* trace *'
    SELECTION_8:
        CommandLine: '* start *'
    SELECTION_9:
        CommandLine: '* capture*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        SELECTION_5 or (SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10)))
falsepositives:
- Legitimate adminstration activity to troubleshoot network issues
id: ba1f7802-adc7-48b4-9ecb-81e227fddfd5
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/01
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
status: test
tags:
- attack.credential_access
- attack.discovery
- attack.t1040

