title: Scripting/CommandLine Process Spawned Regsvr32
id: dedbb0fb-eb02-979b-1b56-cc7c3895c9c6
related:
    - id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
      type: obsolete
    - id: ab37a6ec-6068-432b-a64e-2c7bf95b1d22
      type: derived
status: test
description: Detects various command line and scripting engines/processes such as "PowerShell", "Wscript", "Cmd", etc. spawning a "regsvr32" instance.
references:
    - https://web.archive.org/web/20171001085340/https://subt0x10.blogspot.com/2017/04/bypass-application-whitelisting-script.html
    - https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: '2023-05-26'
tags:
    - attack.defense-evasion
    - attack.t1218.010
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell_ise.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
        Image|endswith: \regsvr32.exe
    filter_main_rpcproxy:
        ParentImage: C:\Windows\System32\cmd.exe
        CommandLine|endswith: ' /s C:\Windows\System32\RpcProxy\RpcProxy.dll'
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Legitimate ".bat", ".hta", ".ps1" or ".vbs" scripts leverage legitimately often. Apply additional filter and exclusions as necessary
    - Some legitimate Windows services
level: medium
ruletype: Sigma
