title: Dism Remove Online Package
ruletype: Sigma
author: frack113
date: 2022/01/16
description: Deployment Image Servicing and Management tool. DISM is used to enumerate,
    install, uninstall, configure, and update features and packages in Windows images
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\DismHost.exe'
    SELECTION_4:
        ParentCommandLine: '*/Online*'
    SELECTION_5:
        ParentCommandLine: '*/Disable-Feature*'
    SELECTION_6:
        Image: '*\Dism.exe'
    SELECTION_7:
        CommandLine: '*/Online*'
    SELECTION_8:
        CommandLine: '*/Disable-Feature*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate script
id: 43e32da2-fdd0-4156-90de-50dfd62636f9
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-26---disable-windows-defender-with-dism
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

