title: Suspicious Netsh DLL Persistence
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2019/10/25
description: Detects persitence via netsh helper
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\netsh.exe'
    SELECTION_4:
        CommandLine: '*add*'
    SELECTION_5:
        CommandLine: '*helper*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 56321594-9087-49d9-bf10-524fe8479452
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.007/T1546.007.md
- https://attack.mitre.org/software/S0108/
status: test
tags:
- attack.privilege_escalation
- attack.t1546.007
- attack.s0108

