
title: Curl Start Combination
ruletype: Sigma
author: Sreeman
date: 2020/01/13
description: Adversaries can use curl to download payloads remotely and execute them.
  Curl is included by default in Windows 10 build 17063 and later.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\curl.exe'
  SELECTION_4:
    Product: The curl executable
  SELECTION_5:
    CommandLine:
    - '* start *'
    - '*&call *'
    - '*& call *'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Administrative scripts (installers)
fields:
- ParentImage
- CommandLine
id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/07/05
references:
- https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
status: test
tags:
- attack.execution
- attack.t1218
- attack.command_and_control
- attack.t1105
