title: Renamed NetSupport RAT Execution
id: 23225ec5-136e-b9e0-ddbb-04a18a507ae5
related:
    - id: 0afbd410-de03-4078-8491-f132303cb67d
      type: derived
status: test
description: Detects the execution of a renamed "client32.exe" (NetSupport RAT) via Imphash, Product and OriginalFileName strings
references:
    - https://redcanary.com/blog/misbehaving-rats/
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-09-19'
modified: '2024-11-23'
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Product|contains: NetSupport Remote Control
        - OriginalFileName|contains: client32.exe
        - Hashes|contains: IMPHASH=A9D50692E95B79723F3E76FCF70D023E
    filter:
        Image|endswith: \client32.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
