title: Use Icacls to Hide File to Everyone
ruletype: Sigma
author: frack113
date: 2022/07/18
description: Detect use of icacls to deny access for everyone in Users folder sometimes
    used to hide malicious files
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: iCACLS.EXE
    SELECTION_4:
        Image: '*\icacls.exe'
    SELECTION_5:
        CommandLine: '*C:\Users\\*'
    SELECTION_6:
        CommandLine: '*/deny*'
    SELECTION_7:
        CommandLine: '*S-1-1-0:*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Legitimate use
id: 4ae81040-fc1c-4249-bfa3-938d260214d9
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://app.any.run/tasks/1df999e6-1cb8-45e3-8b61-499d1b7d5a9b/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001

