title: JSC Convert Javascript To Executable
ruletype: Sigma
author: frack113
date: 2022/05/02
description: Detects the execution of the LOLBIN jsc.exe used by .NET to compile javascript
    code to .exe or .dll format
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\jsc.exe'
    SELECTION_4:
        CommandLine: '*.js*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 52788a70-f1da-40dd-8fbd-73b5865d6568
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Jsc/
status: experimental
tags:
- attack.defense_evasion
- attack.t1127
yml_filename: proc_creation_win_lolbin_jsc.yml
yml_path: rules/windows/process_creation
---

