title: Rundll32 With Suspicious Parent Process
ruletype: Sigma
author: CD_ROM_
date: 2022/05/21
description: Detects suspicious start of rundll32.exe with a parent process of Explorer.exe.
    Variant of Raspberry Robin, as first reported by Red Canary.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\rundll32.exe'
    SELECTION_4:
        ParentImage: '*\explorer.exe'
    SELECTION_5:
        CommandLine: '*\shell32.dll,OpenAs_RunDLL*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
fields:
- Image
- ParentImage
id: 1723e720-616d-4ddc-ab02-f7e3685a4713
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://redcanary.com/blog/raspberry-robin/
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
status: experimental
tags:
- attack.defense_evasion

