title: ImagingDevices Unusual Parent Or Child Processes
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/27
description: Detects unusual parent or children of the ImagingDevices.exe (Windows
    Contacts) and Wabmig.exe (Microsoft Address Book Import Tool) processes as seen
    being used with bumblebee activity
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\WmiPrvSE.exe'
        - '*\svchost.exe'
        - '*\dllhost.exe'
    SELECTION_4:
        Image: '*\ImagingDevices.exe'
    SELECTION_5:
        ParentImage: '*\ImagingDevices.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        SELECTION_5))
falsepositives:
- Unknown
id: f11f2808-adb4-46c0-802a-8660db50fa99
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
status: experimental
tags:
- attack.defense_evasion
- attack.execution

