title: Suspicious PowerShell Child Processes
ruletype: Sigma
author: Florian Roth (Nextron Systems), Tim Shelton
date: 2022/04/26
description: Detects suspicious child processes spawned by PowerShell
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\powershell_ise.exe'
    SELECTION_4:
        Image:
        - '*\sh.exe'
        - '*\bash.exe'
        - '*\schtasks.exe'
        - '*\certutil.exe'
        - '*\bitsadmin.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\scrcons.exe'
        - '*\regsvr32.exe'
        - '*\hh.exe'
        - '*\wmic.exe'
        - '*\mshta.exe'
        - '*\rundll32.exe'
        - '*\forfiles.exe'
        - '*\scriptrunner.exe'
    SELECTION_5:
        ParentCommandLine: '*\Program Files\Amazon\WorkspacesConfig\Scripts\\*'
    SELECTION_6:
        CommandLine: '*\Program Files\Amazon\WorkspacesConfig\Scripts\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: e4b6d2a7-d8a4-4f19-acbd-943c16d90647
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/05
references:
- https://twitter.com/ankit_anubhav/status/1518835408502620162
status: experimental

