title: HackTool - DInjector PowerShell Cradle Execution
id: 6cb27674-07db-0dfd-7dc3-1f42b8551d55
related:
    - id: d78b5d61-187d-44b6-bf02-93486a80de5a
      type: derived
status: test
description: Detects the use of the Dinject PowerShell cradle based on the specific flags
references:
    - https://web.archive.org/web/20211001064856/https://github.com/snovvcrash/DInjector # Original got deleted. This is a fork
author: Florian Roth (Nextron Systems)
date: 2021-12-07
modified: 2023-02-04
tags:
    - attack.defense-evasion
    - attack.t1055
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - ' /am51'
            - ' /password'
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
