title: Firewall Disabled via Netsh
ruletype: Sigma
author: Fatih Sirin
date: 2019/11/01
description: Detects netsh commands that turns off the Windows firewall
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*set*'
    SELECTION_11:
        CommandLine: '*state*'
    SELECTION_12:
        CommandLine: '*off*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*netsh*'
    SELECTION_4:
        CommandLine: '*firewall*'
    SELECTION_5:
        CommandLine: '*set*'
    SELECTION_6:
        CommandLine: '*opmode*'
    SELECTION_7:
        CommandLine: '*mode=disable*'
    SELECTION_8:
        CommandLine: '*netsh*'
    SELECTION_9:
        CommandLine: '*advfirewall*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10 and SELECTION_11 and SELECTION_12)))
falsepositives:
- Legitimate administration
id: 57c4bf16-227f-4394-8ec7-1b745ee061c3
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/01/09
references:
- https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
- https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md#atomic-test-1---disable-microsoft-defender-firewall
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
- attack.s0108
yml_filename: proc_creation_win_susp_firewall_disable.yml
yml_path: rules/windows/process_creation
---

