title: Rundll32 InstallScreenSaver Execution
ruletype: Sigma
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io, TactiKoolSec
date: 2022/04/28
description: An attacker may execute an application as a SCR File using rundll32.exe
    desk.cpl,InstallScreenSaver
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\rundll32.exe'
    SELECTION_4:
        CommandLine: '*InstallScreenSaver*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate installation of a new screensaver
id: 15bd98ea-55f4-4d37-b09a-e7caa0fa2221
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Libraries/Desk/
status: experimental
tags:
- attack.t1218.011
- attack.defense_evasion

