title: Potential Meterpreter/CobaltStrike Activity
ruletype: Sigma
author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service starting
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*/p:*'
    SELECTION_11:
        CommandLine: '*MpCmdRun*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\services.exe'
    SELECTION_4:
        CommandLine: '*/c*'
    SELECTION_5:
        CommandLine: '*echo*'
    SELECTION_6:
        CommandLine: '*\pipe\\*'
    SELECTION_7:
        CommandLine:
        - '*cmd*'
        - '*%COMSPEC%*'
    SELECTION_8:
        CommandLine: '*rundll32*'
    SELECTION_9:
        CommandLine: '*.dll,a*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and ((SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10))) and  not ((SELECTION_11)))
falsepositives:
- Commandlines containing components like cmd accidentally
- Jobs and services started with cmd
fields:
- ComputerName
- User
- CommandLine
id: 15619216-e993-4721-b590-4c520615a67d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/05
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
status: test
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002

