title: Registry Modification Via Regini.EXE
id: c73be930-421c-7d38-5cc4-5dd8c304bcb3
related:
    - id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
      type: derived
    - id: 5f60740a-f57b-4e76-82a1-15b6ff2cb134
      type: derived
status: test
description: Detects the execution of regini.exe which can be used to modify registry keys, the changes are imported from one or more text files.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regini/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/regini
author: Eli Salem, Sander Wiebing, oscd.community
date: 2020-10-08
modified: 2023-02-08
tags:
    - attack.t1112
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \regini.exe
        - OriginalFileName: REGINI.EXE
    filter:
        CommandLine|re: :[^ \\]   # Covered in 77946e79-97f1-45a2-84b4-f37b5c0d8682
    condition: process_creation and (selection and not filter)
fields:
    - ParentImage
    - CommandLine
falsepositives:
    - Legitimate modification of keys
level: low
ruletype: Sigma
