title: Potential LSASS Process Dump Via Procdump
id: 5c963902-00e9-c696-ea19-5f4ede53dfcd
related:
    - id: 5afee48e-67dd-4e03-a783-f74259dcf998
      type: derived
status: stable
description: |
    Detects suspicious uses of the SysInternals Procdump utility by using a special command line parameter in combination with the lsass.exe process.
    This way we are also able to catch cases in which the attacker has renamed the procdump executable.
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/procdump
author: Florian Roth (Nextron Systems)
date: 2018-10-30
modified: 2024-03-13
tags:
    - attack.defense-evasion
    - attack.t1036
    - attack.credential-access
    - attack.t1003.001
    - car.2013-05-009
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_flags:
        CommandLine|windash|contains: ' -ma '
    selection_process:
        CommandLine|contains: ' ls' # Short for lsass
    condition: process_creation and (all of selection*)
falsepositives:
    - Unlikely, because no one should dump an lsass process memory
    - Another tool that uses command line flags similar to ProcDump
level: high
ruletype: Sigma
