title: Potential PowerShell Execution Policy Tampering - ProcCreation
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/11
description: Detects changes to the PowerShell execution policy registry key in order
    to bypass signing requirements for script execution from the CommandLine
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*\ShellIds\Microsoft.PowerShell\ExecutionPolicy*'
        - '*\Policies\Microsoft\Windows\PowerShell\ExecutionPolicy*'
    SELECTION_4:
        CommandLine:
        - '*Bypass*'
        - '*RemoteSigned*'
        - '*Unrestricted*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: cf2e938e-9a3e-4fe8-a347-411642b28a9f
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://learn.microsoft.com/de-de/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
related:
-   id: fad91067-08c5-4d1a-8d8c-d96a21b37814
    type: similar
-   id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
    type: similar
-   id: 61d0475c-173f-4844-86f7-f3eebae1c66b
    type: similar
status: experimental
tags:
- attack.defense_evasion

