title: Insensitive Subfolder Search Via Findstr.EXE
id: 8a6a87c5-b34d-ecfb-6a0b-6244bf5a57d1
related:
    - id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
      type: obsolete
    - id: 04936b66-3915-43ad-a8e5-809eadfd1141
      type: derived
status: test
description: |
    Detects execution of findstr with the "s" and "i" flags for a "subfolder" and "insensitive" search respectively. Attackers sometimes leverage this built-in utility to search the system for interesting files or filter through results of commands.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Findstr/
    - https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative, Nasreddine Bencherchali (Nextron Systems)
date: 2020-10-05
modified: 2024-03-05
tags:
    - attack.defense-evasion
    - attack.credential-access
    - attack.command-and-control
    - attack.t1218
    - attack.t1564.004
    - attack.t1552.001
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_findstr:
        - CommandLine|contains: findstr
        - Image|endswith: findstr.exe
        - OriginalFileName: FINDSTR.EXE
    selection_cli_search_subfolder:
        CommandLine|windash|contains: ' -s '
    selection_cli_search_insensitive:
        CommandLine|windash|contains: ' -i '
    condition: process_creation and (selection_findstr and all of selection_cli_search_*)
falsepositives:
    - Administrative or software activity
level: low
ruletype: Sigma
