title: Kernel Memory Dump Via LiveKD
id: 904b5a87-1f24-f79b-3967-a71d949b332e
related:
    - id: c7746f1c-47d3-43d6-8c45-cd1e54b6b0a2
      type: derived
status: test
description: Detects execution of LiveKD with the "-m" flag to potentially dump the kernel memory
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/livekd
    - https://4sysops.com/archives/creating-a-complete-memory-dump-without-a-blue-screen/
    - https://kb.acronis.com/content/60892
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-16
modified: 2024-03-13
tags:
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith:
              - \livekd.exe
              - \livekd64.exe
        - OriginalFileName: livekd.exe
    selection_cli:
        CommandLine|windash|contains: ' -m'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely in production environment
level: high
ruletype: Sigma
