title: Wmic Uninstall Security Product
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2021/01/30
description: Detects uninstallation or termination of security products using the
    WMIC utility
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine:
        - '*Antivirus*'
        - '*AVG *'
        - '*Crowdstrike Sensor*'
        - '*DLP Endpoint*'
        - '*Endpoint Detection*'
        - '*Endpoint Protection*'
        - '*Endpoint Security*'
        - '*Endpoint Sensor*'
        - '*ESET File Security*'
        - '*Malwarebytes*'
        - '*McAfee Agent*'
        - '*Microsoft Security Client*'
        - '*Threat Protection*'
        - '*VirusScan*'
        - '*Webroot SecureAnywhere*'
        - '*Windows Defender*'
        - '*CarbonBlack*'
        - '*Carbon Black*'
        - '*Cb Defense Sensor 64-bit*'
        - '*Dell Threat Defense*'
        - '*Cylance *'
        - '*LogRhythm System Monitor Service*'
        - '*Sophos Anti-Virus*'
        - '*Sophos AutoUpdate*'
        - '*Sophos Management Console*'
        - '*Sophos Management Database*'
        - '*Sophos Credential Store*'
        - '*Sophos Update Manager*'
        - '*Sophos Management Server*'
        - '*Sophos Remote Management System*'
        - '*%Sophos%*'
        - '*%carbon%*'
        - '*%cylance%*'
        - '*%eset%*'
        - '*%symantec%*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*wmic*'
    SELECTION_4:
        CommandLine: '*product where *'
    SELECTION_5:
        CommandLine: '*call uninstall*'
    SELECTION_6:
        CommandLine: '*/nointeractive*'
    SELECTION_7:
        CommandLine: '*wmic*'
    SELECTION_8:
        CommandLine: '*caption like *'
    SELECTION_9:
        CommandLine:
        - '*call delete*'
        - '*call terminate*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9))
        and SELECTION_10)
falsepositives:
- Legitimate administration
id: 847d5ff3-8a31-4737-a970-aeae8fe21765
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/22
references:
- https://twitter.com/cglyer/status/1355171195654709249
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

