title: Invoke-Obfuscation Via Use Clip
id: e1561947-b4e3-4a74-9bdd-83baed21bdb5
status: test
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
references:
    - https://github.com/SigmaHQ/sigma/issues/1009
author: Nikita Nazarov, oscd.community
date: 2020/10/09
modified: 2022/11/16
tags:
    - attack.defense_evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - echo
            - clip
            - '&&'
        CommandLine|contains:
            - clipboard
            - invoke
            - i`
            - n`
            - v`
            - o`
            - k`
            - e`
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
