title: Renamed Whoami Execution
id: 6b8b5d1f-39e2-4385-32f6-06de18829066
related:
    - id: f1086bf7-a0c4-4a37-9102-01e573caf4a0
      type: derived
status: test
description: Detects the execution of whoami that has been renamed to a different name to avoid detection
references:
    - https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
    - https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
author: Florian Roth (Nextron Systems)
date: '2021-08-12'
modified: '2022-10-09'
tags:
    - attack.discovery
    - attack.t1033
    - car.2016-03-001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        OriginalFileName: whoami.exe
    filter:
        Image|endswith: \whoami.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
