title: Delete Services Via Reg Utility
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/01
description: Detects execution of "reg.exe" commands with the "delete" flag on services
    registry key. Often used by attacker to remove AV software services
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*reg.exe'
    SELECTION_4:
        OriginalFileName: reg.exe
    SELECTION_5:
        CommandLine: '* delete *'
    SELECTION_6:
        CommandLine: '*\SYSTEM\CurrentControlSet\services\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unlikely
id: 05b2aa93-1210-42c8-8d9a-2fcc13b284f5
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

