title: Operator Bloopers Cobalt Strike Modules
ruletype: Sigma
author: _pete_0, TheDFIRReport
date: 2022/05/06
description: Detects Cobalt Strike module/commands accidentally entered in CMD shell
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: Cmd.Exe
    SELECTION_4:
        Image: '*\cmd.exe'
    SELECTION_5:
        CommandLine:
        - '*Invoke-UserHunter*'
        - '*Invoke-ShareFinder*'
        - '*Invoke-Kerberoast*'
        - '*Invoke-SMBAutoBrute*'
        - '*Invoke-Nightmare*'
        - '*zerologon*'
        - '*av_query*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 4f154fb6-27d1-4813-a759-78b93e0b9c48
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/30
references:
- https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/
related:
-   id: 647c7b9e-d784-4fda-b9a0-45c565a7b729
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.003

