title: Suspicious Whoami.EXE Execution From Privileged Process
ruletype: Sigma
author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov
date: 2022/01/28
description: Detects the execution of "whoami.exe" by privileged accounts that are
    often abused by threat actors
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: whoami.exe
    SELECTION_4:
        Image: '*\whoami.exe'
    SELECTION_5:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
        - '*TrustedInstaller*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 79ce34ca-af29-4d0e-b832-fc1b377020db
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/28
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://nsudo.m2team.org/en-us/
related:
-   id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
    type: obsoletes
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033

