title: Potential SquiblyTwo Technique Execution
ruletype: Sigma
author: Markus Neis, Florian Roth
date: 2019/01/16
description: Detects potential SquiblyTwo attack technique with possible renamed WMIC
    via Imphash and OriginalFileName fields
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\wmic.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        Imphash:
        - 1B1A3F43BF37B5BFE60751F2EE2F326E
        - 37777A96245A3C74EB217308F3546F4C
        - 9D87C9D67CE724033C0B40CC4CA1B206
    SELECTION_6:
        Hashes:
        - '*IMPHASH=1B1A3F43BF37B5BFE60751F2EE2F326E*'
        - '*IMPHASH=37777A96245A3C74EB217308F3546F4C*'
        - '*IMPHASH=9D87C9D67CE724033C0B40CC4CA1B206*'
    SELECTION_7:
        CommandLine: '*format:*'
    SELECTION_8:
        CommandLine: '*http*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6) and (SELECTION_7 and SELECTION_8))
falsepositives:
- Unknown
id: 8d63dadf-b91b-4187-87b6-34a1114577ea
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/15
references:
- https://web.archive.org/web/20190209154607/https://subt0x11.blogspot.com/2018/04/wmicexe-whitelisting-bypass-hacking.html
- https://twitter.com/mattifestation/status/986280382042595328
status: test
tags:
- attack.defense_evasion
- attack.t1047
- attack.t1220
- attack.execution
- attack.t1059.005
- attack.t1059.007

