title: Potential DLL Injection Or Execution Using Tracker.exe
ruletype: Sigma
author: Avneet Singh @v3t0_, oscd.community
date: 2020/10/18
description: Detects potential DLL injection and execution using "Tracker.exe"
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\tracker.exe'
    SELECTION_4:
        Description: Tracker
    SELECTION_5:
        CommandLine:
        - '* /d *'
        - '* /c *'
    SELECTION_6:
        CommandLine: '* /ERRORREPORT:PROMPT *'
    SELECTION_7:
        ParentImage:
        - '*\Msbuild\Current\Bin\MSBuild.exe'
        - '*\Msbuild\Current\Bin\amd64\MSBuild.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7)))
falsepositives:
- Unknown
id: 148431ce-4b70-403d-8525-fcc2993f29ea
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/09
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/
status: test
tags:
- attack.defense_evasion
- attack.t1055.001

