title: DLL Sideloading by VMware Xfer Utility
id: 8fbedcf8-456c-dd95-fb85-a76596ae9010
related:
    - id: ebea773c-a8f1-42ad-a856-00cb221966e8
      type: derived
status: test
description: Detects execution of VMware Xfer utility (VMwareXferlogs.exe) from the non-default directory which may be an attempt to sideload arbitrary DLL
references:
    - https://www.sentinelone.com/labs/lockbit-ransomware-side-loads-cobalt-strike-beacon-with-legitimate-vmware-utility/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-02
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.defense-evasion
    - attack.t1574.001
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \VMwareXferlogs.exe
    filter: # VMware might be installed in another path so update the rule accordingly
        Image|startswith: C:\Program Files\VMware\
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
