title: Proxy Execution via Vshadow
id: d2d8de4a-2811-c2ec-f304-cdf68a0c507e
related:
    - id: d7c75059-2901-4578-b209-8837fd31c6a8
      type: derived
status: experimental
description: |
    Detects the invocation of vshadow.exe with the -exec parameter that executes a specified script or command after the shadow copies are created but before the VShadow tool exits.
    VShadow is a command-line tool that you can use to create and manage volume shadow copies. While legitimate backup or administrative scripts may use this flag,
    attackers can leverage this parameter to proxy the execution of malware.
author: David Faiss
date: '2025-05-26'
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Vshadow/
    - https://learn.microsoft.com/en-us/windows/win32/vss/vshadow-tool-and-sample
tags:
    - attack.defense-evasion
    - attack.t1202
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \vshadow.exe
        - OriginalFileName: vshadow.exe
    selection_cli:
        CommandLine|contains: -exec
    condition: process_creation and (all of selection_*)
falsepositives:
    - System backup or administrator tools
    - Legitimate administrative scripts
level: medium
ruletype: Sigma
