title: ConvertTo-SecureString Cmdlet Usage Via CommandLine
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
date: 2020/10/11
description: Detects usage of the "ConvertTo-SecureString" cmdlet via the commandline.
    Which is fairly uncommon and could indicate potential suspicious activity
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        CommandLine: '*ConvertTo-SecureString*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: 74403157-20f5-415d-89a7-c505779585cf
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/26
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

