title: Suspicious Load DLL via CertOC.exe
ruletype: Sigma
author: Austin Songer @austinsonger
date: 2021/10/23
description: Detects when a user installs certificates by using CertOC.exe to loads
    the target DLL file.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\certoc.exe'
    SELECTION_4:
        OriginalFileName: CertOC.exe
    SELECTION_5:
        CommandLine:
        - '* -LoadDLL *'
        - '* /LoadDLL *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 242301bc-f92f-4476-8718-78004a6efd9f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/24
references:
- https://twitter.com/sblmsrsn/status/1445758411803480072?s=20
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-fe98e74189873d6df72a15df2eaa0315c59ba9cdaca93ecd68afc4ea09194ef2
- https://lolbas-project.github.io/lolbas/Binaries/Certoc/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

