title: Computer Password Change Via Ksetup.EXE
id: 9a30d3e0-d3a2-5946-59fa-8e64856841a2
related:
    - id: de16d92c-c446-4d53-8938-10aeef41c8b6
      type: derived
status: test
description: Detects password change for the computer's domain account or host principal via "ksetup.exe"
references:
    - https://twitter.com/Oddvarmoe/status/1641712700605513729
    - https://learn.microsoft.com/en-gb/windows-server/administration/windows-commands/ksetup
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-04-06
tags:
    - attack.execution
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \ksetup.exe
        - OriginalFileName: ksetup.exe
    selection_cli:
        CommandLine|contains: ' /setcomputerpassword '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
