title: Shell Process Spawned by Java.EXE
id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
related:
    -   id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
        type: similar
status: test
description: Detects shell spawned from Java host process, which could be a sign of
    exploitation (e.g. log4j exploitation)
author: Andreas Hunkeler (@Karneades), Nasreddine Bencherchali
date: 2021/12/17
modified: 2023/11/09
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \java.exe
        Image|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
    filter_main_build:
        ParentImage|contains: build
        CommandLine|contains: build
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Legitimate calls to system binaries
    - Company specific internal usage
level: medium
ruletype: Sigma
