title: Suspicious WindowsTerminal Child Processes
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/25
description: Detects suspicious children spawned via the Windows Terminal application
    which could be a sign of persistence via WindowsTerminal (see references section)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*\AppData\Local\Packages\Microsoft.WindowsTerminal_*'
    SELECTION_11:
        CommandLine: '*\LocalState\settings.json*'
    SELECTION_12:
        CommandLine: '*C:\Program Files\Microsoft Visual Studio\\*'
    SELECTION_13:
        CommandLine: '*\Common7\Tools\VsDevCmd.bat*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\WindowsTerminal.exe'
    SELECTION_4:
        Image:
        - '*\rundll32.exe'
        - '*\regsvr32.exe'
        - '*\certutil.exe'
        - '*\cscript.exe'
        - '*\wscript.exe'
        - '*\csc.exe'
    SELECTION_5:
        Image:
        - '*C:\Users\Public\\*'
        - '*\Downloads\\*'
        - '*\Desktop\\*'
        - '*\AppData\Local\Temp\\*'
        - '*\Windows\TEMP\\*'
    SELECTION_6:
        CommandLine:
        - '* iex *'
        - '* icm*'
        - '*Invoke-*'
        - '*Import-Module *'
        - '*ipmo *'
        - '*DownloadString(*'
        - '* /c *'
        - '* /k *'
        - '* /r *'
    SELECTION_7:
        CommandLine: '*Import-Module*'
    SELECTION_8:
        CommandLine: '*Microsoft.VisualStudio.DevShell.dll*'
    SELECTION_9:
        CommandLine: '*Enter-VsDevShell*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and (SELECTION_4 or
        SELECTION_5 or SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13)))
falsepositives:
- Other legitimate "Windows Terminal" profiles
id: 8de89e52-f6e1-4b5b-afd1-41ecfa300d48
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/22
references:
- https://persistence-info.github.io/Data/windowsterminalprofile.html
- https://twitter.com/nas_bench/status/1550836225652686848
status: experimental
tags:
- attack.execution
- attack.persistence

