title: Suspicious Get ComputerSystem Information with WMIC
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/08
description: Detects execution of wmic utility with the "computersystem" flag in order
    to obtain information about the machine such as the domain, username, model...etc.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\wmic.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        CommandLine: '* computersystem *'
    SELECTION_6:
        CommandLine: '* get *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 9d7ca793-f6bd-471c-8d0f-11e68b2f0d2f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/11/29
references:
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
status: experimental
tags:
- attack.discovery
- attack.execution
- attack.t1047

