title: Suspicious Extexport Execution
id: 4915d733-30a4-d528-1484-73399fbd3cce
related:
    - id: fb0b815b-f5f6-4f50-970f-ffe21f253f7a
      type: derived
status: test
description: Extexport.exe loads dll and is execute from other folder the original path
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extexport/
author: frack113
date: 2021-11-26
modified: 2022-05-16
tags:
    - attack.defense-evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - CommandLine|contains: Extexport.exe
        - Image|endswith: \Extexport.exe
        - OriginalFileName: extexport.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
