title: System File Execution Location Anomaly
ruletype: Sigma
author: Florian Roth (Nextron Systems), Patrick Bareiss, Anton Kutepov, oscd.community,
    Nasreddine Bencherchali
date: 2017/11/27
description: Detects a Windows program executable started from a suspicious folder
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\svchost.exe'
        - '*\rundll32.exe'
        - '*\services.exe'
        - '*\powershell.exe'
        - '*\powershell_ise.exe'
        - '*\pwsh.exe'
        - '*\regsvr32.exe'
        - '*\spoolsv.exe'
        - '*\lsass.exe'
        - '*\smss.exe'
        - '*\csrss.exe'
        - '*\conhost.exe'
        - '*\wininit.exe'
        - '*\lsm.exe'
        - '*\winlogon.exe'
        - '*\explorer.exe'
        - '*\taskhost.exe'
        - '*\Taskmgr.exe'
        - '*\sihost.exe'
        - '*\RuntimeBroker.exe'
        - '*\smartscreen.exe'
        - '*\dllhost.exe'
        - '*\audiodg.exe'
        - '*\wlanext.exe'
        - '*\dashost.exe'
        - '*\schtasks.exe'
        - '*\cscript.exe'
        - '*\wscript.exe'
        - '*\wsl.exe'
        - '*\bitsadmin.exe'
        - '*\atbroker.exe'
        - '*\bcdedit.exe'
        - '*\certutil.exe'
        - '*\certreq.exe'
        - '*\cmstp.exe'
        - '*\consent.exe'
        - '*\defrag.exe'
        - '*\dism.exe'
        - '*\dllhst3g.exe'
        - '*\eventvwr.exe'
        - '*\msiexec.exe'
        - '*\runonce.exe'
        - '*\winver.exe'
        - '*\logonui.exe'
        - '*\userinit.exe'
        - '*\dwm.exe'
        - '*\LsaIso.exe'
        - '*\ntoskrnl.exe'
        - '*\wsmprovhost.exe'
        - '*\dfrgui.exe'
    SELECTION_4:
        Image:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
    SELECTION_5:
        Image: '*\SystemRoot\System32\\*'
    SELECTION_6:
        Image:
        - C:\Windows\explorer.exe
        - C:\Program Files\PowerShell\7\pwsh.exe
    SELECTION_7:
        Image: C:\Program Files\WindowsApps\MicrosoftCorporationII.WindowsSubsystemForLinux*
    SELECTION_8:
        Image: '*\wsl.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        or SELECTION_5 or SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Exotic software
fields:
- ComputerName
- User
- Image
id: e4a6b256-3e47-40fc-89d2-7a477edd6915
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/10
references:
- https://twitter.com/GelosSnake/status/934900723426439170
- https://asec.ahnlab.com/en/39828/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036

