title: Potential Signing Bypass Via Windows Developer Features
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/11
description: Detects when a user enable developer features such as "Developer Mode"
    or "Application Sideloading". Which allows the user to install untrusted packages.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\SystemSettingsAdminFlows.exe'
    SELECTION_4:
        OriginalFileName: SystemSettingsAdminFlows.EXE
    SELECTION_5:
        CommandLine: '*TurnOnDeveloperFeatures*'
    SELECTION_6:
        CommandLine:
        - '*DeveloperUnlock*'
        - '*EnableSideloading*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unknown
id: a383dec4-deec-4e6e-913b-ed9249670848
level: high
logsource:
    category: process_creation
    product: windows
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
related:
-   id: b110ebaf-697f-4da1-afd5-b536fa27a2c1
    type: similar
status: experimental
tags:
- attack.defense_evasion

