title: Suspicious Usage of the Manage-bde.wsf Script
ruletype: Sigma
author: oscd.community, Natalia Shornikova
date: 2020/10/13
description: Detects a usage of the manage-bde.wsf script that may indicate an attempt
    of proxy execution from script
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*cscript*'
    SELECTION_4:
        CommandLine: '*manage-bde.wsf*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: c363385c-f75d-4753-a108-c1a8e28bdbda
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://lolbas-project.github.io/lolbas/Scripts/Manage-bde/
- https://gist.github.com/bohops/735edb7494fe1bd1010d67823842b712
- https://twitter.com/bohops/status/980659399495741441
- https://twitter.com/JohnLaTwC/status/1223292479270600706
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md
status: test
tags:
- attack.defense_evasion
- attack.t1216

