title: UAC Bypass Using IEInstal - Process
id: 3a933e13-8aec-fa33-e483-bfb6c4fd636a
related:
    - id: 80fc36aa-945e-4181-89f2-2f907ab6775d
      type: derived
status: test
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384   # System
            - S-1-16-12288   # High
        ParentImage|endswith: \ieinstal.exe
        Image|contains: \AppData\Local\Temp\
        Image|endswith: consent.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
