title: Command Line Path Traversal Evasion
ruletype: Sigma
author: Christian Burkard (Nextron Systems)
date: 2021/10/26
description: Detects the attempt to evade or obfuscate the executed command on the
    CommandLine using bogus path traversal
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\Windows\\*'
    SELECTION_4:
        CommandLine:
        - '*\..\Windows\\*'
        - '*\..\System32\\*'
        - '*\..\..\\*'
    SELECTION_5:
        CommandLine: '*.exe\..\\*'
    SELECTION_6:
        CommandLine:
        - '*\Google\Drive\googledrivesync.exe\..\\*'
        - '*\Citrix\Virtual Smart Card\Citrix.Authentication.VirtualSmartcard.Launcher.exe\..\\*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        SELECTION_5) and  not (SELECTION_6))
falsepositives:
- Google Drive
- Citrix
id: 1327381e-6ab0-4f38-b583-4c1b8346a56b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/20
references:
- https://twitter.com/hexacorn/status/1448037865435320323
- https://twitter.com/Gal_B1t/status/1062971006078345217
status: experimental
tags:
- attack.defense_evasion
- attack.t1036

