title: DNS Exfiltration and Tunneling Tools Execution
id: 52c51d03-c611-67cf-c730-4a3b8e97a7f7
related:
    - id: 98a96a5a-64a0-4c42-92c5-489da3866cb0
      type: derived
status: test
description: Well-known DNS Exfiltration tools execution
references:
    - https://github.com/iagox86/dnscat2
    - https://github.com/yarrick/iodine
author: Daniil Yugoslavskiy, oscd.community
date: 2019-10-24
modified: 2021-11-27
tags:
    - attack.exfiltration
    - attack.t1048.001
    - attack.command-and-control
    - attack.t1071.004
    - attack.t1132.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \iodine.exe
        - Image|contains: \dnscat2
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
