title: Renamed Sysinternals Sdelete Usage
ruletype: Sigma
author: Florian Roth
date: 2022/09/06
description: Detects the use of a renamed SysInternals Sdelete, which is something
    an administrator shouldn't do (the renaming)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: sdelete.exe
    SELECTION_4:
        Image:
        - '*\sdelete.exe'
        - '*\sdelete64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- System administrator usage
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: c1d867fe-8d95-4487-aab4-e53f2d339f90
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/sdelete
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1485/T1485.md
status: experimental
tags:
- attack.impact
- attack.t1485

