title: Suspicious SYSTEM User Process Creation
id: 2617e7ed-adb7-40ba-b0f3-8f9945fe6c09
status: test
description: Detects a suspicious process creation as SYSTEM user (suspicious program
    or command line parameter)
references:
    - Internal Research
    - https://tools.thehacker.recipes/mimikatz/modules
author: Florian Roth (Nextron Systems), David ANDRE (additional keywords)
date: 2021/12/20
modified: 2023/12/14
tags:
    - attack.credential_access
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1134
    - attack.t1003
    - attack.t1027
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        IntegrityLevel: System
        User|contains:
            - AUTHORI
            - AUTORI
    selection_special:
        -   Image|endswith:
                - \calc.exe
                - \wscript.exe
                - \cscript.exe
                - \hh.exe
                - \mshta.exe
                - \forfiles.exe
                - \ping.exe
        -   CommandLine|contains:
                - ' -NoP '
                - ' -W Hidden '
                - ' -decode '
                - ' /decode '
                - ' /urlcache '
                - ' -urlcache '
                - ' -e* JAB'
                - ' -e* SUVYI'
                - ' -e* SQBFAFgA'
                - ' -e* aWV4I'
                - ' -e* IAB'
                - ' -e* PAA'
                - ' -e* aQBlAHgA'
                - vssadmin delete shadows
                - reg SAVE HKLM
                - ' -ma '
                - Microsoft\Windows\CurrentVersion\Run
                - .downloadstring(
                - .downloadfile(
                - ' /ticket:'
                - 'dpapi::'
                - event::clear
                - event::drop
                - id::modify
                - 'kerberos::'
                - 'lsadump::'
                - 'misc::'
                - 'privilege::'
                - 'rpc::'
                - 'sekurlsa::'
                - 'sid::'
                - 'token::'
                - vault::cred
                - vault::list
                - ' p::d '
                - ;iex(
                - MiniDump
                - 'net user '
    filter_ping:
        CommandLine: ping 127.0.0.1 -n 5
    filter_vs:
        Image|endswith: \PING.EXE
        ParentCommandLine|contains: \DismFoDInstall.cmd
    filter_config_mgr:
        ParentImage|contains: :\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\
    filter_java:
        ParentImage|contains:
            - :\Program Files (x86)\Java\
            - :\Program Files\Java\
        ParentImage|endswith: \bin\javaws.exe
        Image|contains:
            - :\Program Files (x86)\Java\
            - :\Program Files\Java\
        Image|endswith: \bin\jp2launcher.exe
        CommandLine|contains: ' -ma '
    condition: process_creation and (all of selection* and not 1 of filter_*)
falsepositives:
    - Administrative activity
    - Scripts and administrative tools used in the monitored environment
    - Monitoring activity
level: high
ruletype: Sigma
