title: File Download via CertOC.EXE
id: e9d4b74a-53f4-b8ce-6113-d473532e3e3a
related:
    - id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
      type: similar
    - id: 70ad0861-d1fe-491c-a45f-fa48148a300d
      type: derived
status: test
description: Detects when a user downloads a file by using CertOC.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-05-16
modified: 2023-10-18
tags:
    - attack.command-and-control
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \certoc.exe
        - OriginalFileName: CertOC.exe
    selection_cli:
        CommandLine|contains|all:
            - -GetCACAPS
            - http
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
