title: Snatch Ransomware
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2020/08/26
description: Detects specific process characteristics of Snatch ransomware word document
    droppers
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*shutdown /r /f /t 00*'
        - '*net stop SuperBackupMan*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Scripts that shutdown the system immediately and reboot them in safe mode are unlikely
fields:
- ComputerName
- User
- Image
id: 5325945e-f1f0-406e-97b8-65104d393fff
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
status: stable
tags:
- attack.execution
- attack.t1204

