title: HackTool - Certipy Execution
ruletype: Sigma
author: pH-T (Nextron Systems)
date: 2023/04/17
description: Detects Certipy a tool for Active Directory Certificate Services enumeration
    and abuse based on PE metadata characteristics and common command line arguments.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\Certipy.exe'
    SELECTION_4:
        OriginalFileName: Certipy.exe
    SELECTION_5:
        Description: '*Certipy*'
    SELECTION_6:
        CommandLine:
        - '* auth *'
        - '* find *'
        - '* forge *'
        - '* relay *'
        - '* req *'
        - '* shadow *'
    SELECTION_7:
        CommandLine:
        - '* -bloodhound*'
        - '* -ca-pfx *'
        - '* -dc-ip *'
        - '* -kirbi*'
        - '* -old-bloodhound*'
        - '* -pfx *'
        - '* -target*'
        - '* -username *'
        - '* -vulnerable*'
        - '*auth -pfx*'
        - '*shadow auto*'
        - '*shadow list*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4 or
        SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unlikely
id: 6938366d-8954-4ddc-baff-c830b3ba8fcd
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/ly4k/Certipy
status: experimental
tags:
- attack.discovery
- attack.credential_access
- attack.t1649

