title: Renamed FTP.EXE Execution
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects the execution of a renamed "ftp.exe" binary based on the PE metadata
    fields
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: ftp.exe
    SELECTION_4:
        Image: '*\ftp.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentImage
id: 277a4393-446c-449a-b0ed-7fdc7795244c
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ftp/
status: test
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202

