title: HackTool - Impersonate Execution
ruletype: Sigma
author: Sai Prashanth Pulisetti @pulisettis
date: 2022/12/21
description: Detects execution of the Impersonate tool. Which can be used to manipulate
    tokens on a Windows computers remotely (PsExec/WmiExec) or interactively
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*impersonate.exe*'
    SELECTION_4:
        CommandLine:
        - '* list *'
        - '* exec *'
        - '* adduser *'
    SELECTION_5:
        Hashes:
        - '*MD5=9520714AB576B0ED01D1513691377D01*'
        - '*SHA256=E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A*'
        - '*IMPHASH=0A358FFC1697B7A07D0E817AC740DF62*'
    SELECTION_6:
        md5: 9520714AB576B0ED01D1513691377D01
    SELECTION_7:
        sha256: E81CC96E2118DC4FBFE5BAD1604E0AC7681960143E2101E1A024D52264BB0A8A
    SELECTION_8:
        Imphash: 0A358FFC1697B7A07D0E817AC740DF62
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8)))
falsepositives:
- Unknown
id: cf0c254b-22f1-4b2b-8221-e137b3c0af94
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/08
references:
- https://sensepost.com/blog/2022/abusing-windows-tokens-to-compromise-active-directory-without-touching-lsass/
- https://github.com/sensepost/impersonate
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1134.001
- attack.t1134.003

