title: Execution of Suspicious File Type Extension
ruletype: Sigma
author: Max Altgelt (Nextron Systems)
date: 2021/12/09
description: Checks whether the image specified in a process creation event doesn't
    refer to an .exe file (caused by process ghosting or other unorthodox methods
    to start a process)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        Image: C:\Windows\Temp\Helper\\*
    SELECTION_11:
        Image:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
    SELECTION_12:
        Image: '*.com'
    SELECTION_13:
        Image:
        - '-'
        - ''
    SELECTION_14:
        Image: null
    SELECTION_15:
        ParentImage: C:\ProgramData\Avira\\*
    SELECTION_16:
        Image: '*NVIDIA\NvBackend\\*'
    SELECTION_17:
        Image: '*.dat'
    SELECTION_18:
        Image: '*\WinSCP.com'
    SELECTION_19:
        Image: '*C:\Users\\*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        Image: '*\AppData\\*'
    SELECTION_21:
        Image: '*.tmp*'
    SELECTION_22:
        Image: '*CodeSetup*'
    SELECTION_23:
        Image: '*\program\soffice.bin'
    SELECTION_24:
        Image:
        - C:\Program Files\EMC NetWorker\Management\GST\apache\cgi-bin\update_jnlp.cgi
        - C:\Program Files (x86)\EMC NetWorker\Management\GST\apache\cgi-bin\update_jnlp.cgi
    SELECTION_25:
        Image:
        - C:\Program Files (x86)\WINPAKPRO\\*
        - C:\Program Files\WINPAKPRO\\*
    SELECTION_26:
        Image: '*.ngn'
    SELECTION_27:
        Image:
        - C:\Program Files (x86)\MyQ\Server\pcltool.dll
        - C:\Program Files\MyQ\Server\pcltool.dll
    SELECTION_28:
        Image:
        - C:\Program Files\Microsoft Visual Studio\\*
        - C:\Program Files (x86)\Microsoft Visual Studio*
    SELECTION_29:
        Image: '*.com'
    SELECTION_3:
        Image:
        - '*.exe'
        - '*.tmp'
        - '*.scr'
    SELECTION_30:
        Image: '*\AppData\Local\Packages\\*'
    SELECTION_31:
        Image: '*\LocalState\rootfs\\*'
    SELECTION_32:
        Image: '*\LZMA_EXE'
    SELECTION_33:
        ParentImage: C:\Windows\Temp\\*
    SELECTION_34:
        ParentImage: '*\TBT_Dock_Firmware\GetDockVer32W.exe'
    SELECTION_35:
        Image: C:\Program Files\Mozilla Firefox\tobedeleted\\*
    SELECTION_36:
        ParentImage: C:\Windows\UUS\amd64\MoUsoCoreWorker.exe
    SELECTION_37:
        Image: C:\$Extend\$Deleted\\*
    SELECTION_38:
        CommandLine: '*C:\Program Files\Common Files\Microsoft Shared\ClickToRun\OfficeC2RClient.exe*'
    SELECTION_39:
        CommandLine: '*/update UPDATEORCHESTRATOR displaylevel=False*'
    SELECTION_4:
        Image:
        - System
        - Registry
        - MemCompression
        - vmmem
    SELECTION_5:
        Image: C:\Windows\Installer\MSI*
    SELECTION_6:
        Image: C:\Windows\System32\DriverStore\FileRepository\\*
    SELECTION_7:
        Image: C:\Config.Msi\\*
    SELECTION_8:
        Image:
        - '*.rbf'
        - '*.rbs'
    SELECTION_9:
        ParentImage: C:\Windows\Temp\\*
    condition: ((SELECTION_1 and SELECTION_2) and ( not (SELECTION_3) and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12))) and  not ((SELECTION_13)
        or (SELECTION_14) or (SELECTION_15) or (SELECTION_16 and SELECTION_17) or
        (SELECTION_18) or (SELECTION_19 and SELECTION_20 and SELECTION_21 and SELECTION_22)
        or (SELECTION_23) or (SELECTION_24) or (SELECTION_25 and SELECTION_26) or
        (SELECTION_27) or (SELECTION_28 and SELECTION_29) or (SELECTION_30 and SELECTION_31)
        or (SELECTION_32) or (SELECTION_33 and SELECTION_34) or (SELECTION_35) or
        (SELECTION_36 and SELECTION_37 and SELECTION_38 and SELECTION_39)))
falsepositives:
- Unknown
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/11
references:
- https://pentestlaboratories.com/2021/12/08/process-ghosting/
status: experimental
tags:
- attack.defense_evasion

