title: Security Service Disabled Via Reg.EXE
id: 4029ec9f-f657-97b3-1909-5ee62abfd58b
related:
    - id: 5e95028c-5229-4214-afae-d653d573d0ec
      type: derived
status: test
description: Detects execution of "reg.exe" to disable security services such as Windows Defender.
references:
    - https://twitter.com/JohnLaTwC/status/1415295021041979392
    - https://github.com/gordonbay/Windows-On-Reins/blob/e587ac7a0407847865926d575e3c46f68cf7c68d/wor.ps1
    - https://vms.drweb.fr/virus/?i=24144899
    - https://bidouillesecurity.com/disable-windows-defender-in-powershell/
author: Florian Roth (Nextron Systems), John Lambert (idea), elhoim
date: 2021-07-14
modified: 2023-06-05
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_reg_add:
        CommandLine|contains|all:
            - reg
            - add
    selection_cli_reg_start:
        CommandLine|contains|all:
            - d 4
            - v Start
        CommandLine|contains:
            - \AppIDSvc
            - \MsMpSvc
            - \NisSrv
            - \SecurityHealthService
            - \Sense
            - \UsoSvc
            - \WdBoot
            - \WdFilter
            - \WdNisDrv
            - \WdNisSvc
            - \WinDefend
            - \wscsvc
            - \wuauserv
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
