title: File With Suspicious Extension Downloaded Via Bitsadmin
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/06/28
description: Detects usage of bitsadmin downloading a file with a suspicious extension
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\bitsadmin.exe'
    SELECTION_4:
        OriginalFileName: bitsadmin.exe
    SELECTION_5:
        CommandLine:
        - '* /transfer *'
        - '* /create *'
        - '* /addfile *'
    SELECTION_6:
        CommandLine:
        - '*.asax*'
        - '*.ashx*'
        - '*.asmx*'
        - '*.asp*'
        - '*.aspx*'
        - '*.bat*'
        - '*.cfm*'
        - '*.cgi*'
        - '*.chm*'
        - '*.cmd*'
        - '*.gif*'
        - '*.jpeg*'
        - '*.jpg*'
        - '*.jsp*'
        - '*.jspx*'
        - '*.png*'
        - '*.ps1*'
        - '*.psm1*'
        - '*.scf*'
        - '*.sct*'
        - '*.txt*'
        - '*.vbe*'
        - '*.vbs*'
        - '*.war*'
        - '*.wsf*'
        - '*.wsh*'
        - '*.zip*'
        - '*.rar*'
        - '*.dll*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 5b80a791-ad9b-4b75-bcc1-ad4e1e89c200
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/15
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003

