title: Uncommon Child Process Of Conhost.EXE
id: 5e8bb5ac-f829-5d14-c3b8-ac4db410a387
related:
    - id: 7dc2dedd-7603-461a-bc13-15803d132355
      type: derived
status: test
description: Detects uncommon "conhost" child processes. This could be a sign of "conhost" usage as a LOLBIN or potential process injection activity.
references:
    - http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
author: omkar72
date: '2020-10-25'
modified: '2023-12-11'
tags:
    - attack.defense-evasion
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \conhost.exe
    filter_main_conhost:
        Image|endswith: :\Windows\System32\conhost.exe
    filter_main_null:
        Image: null
    filter_main_empty:
        Image: ''
    filter_optional_provider:
        Provider_Name: SystemTraceProvider-Process    # Race condition with SystemTrace doesn't provide all fields.
    condition: process_creation and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
