title: Service DACL Abuse To Hide Services Via Sc.EXE
ruletype: Sigma
author: Andreas Hunkeler (@Karneades)
date: 2021/12/20
description: Detects usage of the "sc.exe" utility adding a new service with special
    permission seen used by threat actors which makes the service hidden and unremovable.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\sc.exe'
    SELECTION_4:
        OriginalFileName: sc.exe
    SELECTION_5:
        CommandLine: '*sdset*'
    SELECTION_6:
        CommandLine: '*DCLCWPDTSD*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: a537cfc3-4297-4789-92b5-345bfd845ad0
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/08
references:
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://twitter.com/Alh4zr3d/status/1580925761996828672
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
related:
-   id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
    type: similar
-   id: 98c5aeef-32d5-492f-b174-64a691896d25
    type: similar
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.011

