
title: Suspicious ScreenSave Change by Reg.exe
ruletype: Sigma
author: frack113
date: 2021/08/19
description: |
  Adversaries may establish persistence by executing malicious content triggered by user inactivity.
  Screensavers are programs that execute after a configurable time of user inactivity and consist of Portable Executable (PE) files with a .scr file extension
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*/t REG_SZ*'
  SELECTION_11:
    CommandLine: '*/d *'
  SELECTION_12:
    CommandLine: '*/f*'
  SELECTION_13:
    CommandLine: '*/v ScreenSaverIsSecure*'
  SELECTION_14:
    CommandLine: '*/t REG_SZ*'
  SELECTION_15:
    CommandLine: '*/d 0*'
  SELECTION_16:
    CommandLine: '*/f*'
  SELECTION_17:
    CommandLine: '*/v SCRNSAVE.EXE*'
  SELECTION_18:
    CommandLine: '*/t REG_SZ*'
  SELECTION_19:
    CommandLine: '*/d *'
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_20:
    CommandLine: '*.scr*'
  SELECTION_21:
    CommandLine: '*/f*'
  SELECTION_3:
    Image: '*\reg.exe'
  SELECTION_4:
    CommandLine:
    - '*HKEY_CURRENT_USER\Control Panel\Desktop*'
    - '*HKCU\Control Panel\Desktop*'
  SELECTION_5:
    CommandLine: '*/v ScreenSaveActive*'
  SELECTION_6:
    CommandLine: '*/t REG_SZ*'
  SELECTION_7:
    CommandLine: '*/d 1*'
  SELECTION_8:
    CommandLine: '*/f*'
  SELECTION_9:
    CommandLine: '*/v ScreenSaveTimeout*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
    ((SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
    and SELECTION_10 and SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14
    and SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18 and SELECTION_19
    and SELECTION_20 and SELECTION_21)))
falsepositives:
- GPO
id: 0fc35fc3-efe6-4898-8a37-0b233339524f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/02
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1546.002/T1546.002.md
- https://www.welivesecurity.com/wp-content/uploads/2017/08/eset-gazer.pdf
status: experimental
tags:
- attack.privilege_escalation
- attack.t1546.002
