title: Custom Class Execution via Xwizard
ruletype: Sigma
author: "Ensar \u015Eamil, @sblmsrsn, @oscd_initiative"
date: 2020/10/07
description: Detects the execution of Xwizard tool with specific arguments which utilized
    to run custom class properties.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\xwizard.exe'
    SELECTION_4:
        CommandLine|re: \{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\}
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
status: test
tags:
- attack.defense_evasion
- attack.t1218

