title: Net.exe User Account Creation - Never Expire
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/12
description: Detects creation of local users via the net.exe command with the option
    "never expire"
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_4:
        CommandLine: '*user*'
    SELECTION_5:
        CommandLine: '*add*'
    SELECTION_6:
        CommandLine: '*expires:never*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unlikely
id: b9f0e6f5-09b4-4358-bae4-08408705bd5c
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
related:
-   id: cd219ff3-fa99-45d4-8380-a7d15116c6dc
    type: derived
status: test
tags:
- attack.persistence
- attack.t1136.001

