title: Netsh Port or Application Allowed
ruletype: Sigma
author: Markus Neis, Sander Wiebing
date: 2019/01/29
description: Allow Incoming Connections by Port or Application on Windows Firewall
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\netsh.exe'
    SELECTION_4:
        CommandLine: '*firewall*'
    SELECTION_5:
        CommandLine: '*add*'
    SELECTION_6:
        CommandLine:
        - '*\netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow
            "program=C:\Program Files (x86)\Dropbox\Client\Dropbox.exe" enable=yes
            profile=Any*'
        - '*\netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow
            "program=C:\Program Files\Dropbox\Client\Dropbox.exe" enable=yes profile=Any*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6)))
falsepositives:
- Legitimate administration
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/02/10
references:
- https://attack.mitre.org/software/S0246/ (Lazarus HARDRAIN)
- https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
yml_filename: proc_creation_win_netsh_fw_add.yml
yml_path: rules/windows/process_creation
---

