
title: Suspicious Tasklist Discovery Command
ruletype: Sigma
author: frack113
date: 2021/12/11
description: Adversaries may attempt to get information about running processes on
  a system. Information obtained could be used to gain an understanding of common
  software/applications running on systems within the network
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    CommandLine: '*tasklist*'
  SELECTION_4:
    Image: '*\tasklist.exe'
  SELECTION_5:
    OriginalFileName: tasklist.exe
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Administrator, hotline ask to user
id: 63332011-f057-496c-ad8d-d2b6afb27f96
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1057/T1057.md#atomic-test-2---process-discovery---tasklist
status: experimental
tags:
- attack.discovery
- attack.t1057
