title: AWL Bypass with Winrm.vbs and Malicious WsmPty.xsl/WsmTxt.xsl
ruletype: Sigma
author: Julia Fomina, oscd.community
date: 2020/10/06
description: Detects execution of attacker-controlled WsmPty.xsl or WsmTxt.xsl via
    winrm.vbs and copied cscript.exe (can be renamed)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*winrm*'
    SELECTION_4:
        CommandLine:
        - '*format:pretty*'
        - '*format:"pretty"*'
        - '*format:"text"*'
        - '*format:text*'
    SELECTION_5:
        Image:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and  not
        (SELECTION_5))
falsepositives:
- Unlikely
id: 074e0ded-6ced-4ebd-8b4d-53f55908119d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://posts.specterops.io/application-whitelisting-bypass-and-arbitrary-unsigned-code-execution-technique-in-winrm-vbs-c8c24fb40404
status: test
tags:
- attack.defense_evasion
- attack.t1216

