title: UAC Bypass Abusing Winsat Path Parsing - Process
id: 099dc8e8-399b-433f-0815-0acc26e06810
related:
    - id: 7a01183d-71a2-46ad-ad5c-acd989ac1793
      type: derived
status: test
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe (UACMe 52)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: '2021-08-30'
modified: '2024-12-01'
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        IntegrityLevel:
            - High
            - System
            - S-1-16-16384   # System
            - S-1-16-12288   # High
        ParentImage|endswith: \AppData\Local\Temp\system32\winsat.exe
        ParentCommandLine|contains: C:\Windows \system32\winsat.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
