title: Tap Installer Execution
id: 99793437-3e16-439b-be0f-078782cf953d
status: test
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunneling techniques
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
modified: 2023/02/13
tags:
    - attack.exfiltration
    - attack.t1048
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \tapinstall.exe
    filter_avast:
        Image:
            - C:\Program Files\Avast Software\SecureLine VPN\tapinstall.exe
            - C:\Program Files (x86)\Avast Software\SecureLine VPN\tapinstall.exe
    filter_openvpn:
        Image|startswith: C:\Program Files\OpenVPN Connect\drivers\tap\
    filter_protonvpn:
        Image|startswith: C:\Program Files (x86)\Proton Technologies\ProtonVPNTap\installer\
    condition: process_creation and (selection and not 1 of filter_*)
falsepositives:
    - Legitimate OpenVPN TAP insntallation
level: medium
ruletype: Sigma
