title: Read Contents From Stdin Via Cmd.EXE
ruletype: Sigma
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/07
description: Detect the use of "<" to read and potentially execute a file via cmd.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: Cmd.Exe
    SELECTION_4:
        Image: '*\cmd.exe'
    SELECTION_5:
        CommandLine: '*<*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 241e802a-b65e-484f-88cd-c2dc10f9206d
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1059.003/T1059.003.md
- https://web.archive.org/web/20220306121156/https://www.x86matthew.com/view_post?id=ntdll_pipe
related:
-   id: 00a4bacd-6db4-46d5-9258-a7d5ebff4003
    type: obsoletes
status: experimental
tags:
- attack.execution
- attack.t1059.003

