title: 7Zip Compressing Dump Files
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/27
description: Detects a suspicious 7zip execution that involves a file with a .dmp
    extension, which could be a step in a process of dump file exfiltration
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\7z.exe'
        - '*\7zr.exe'
        - '*\7za.exe'
    SELECTION_4:
        Description: '*7-Zip*'
    SELECTION_5:
        CommandLine: '*.dmp*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate use of 7-Zip with a command line in which .dmp appears accidentally
id: ec570e53-4c76-45a9-804d-dc3f355ff7a7
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
related:
-   id: 1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
    type: derived
status: experimental
tags:
- attack.collection
- attack.t1560.001

