title: HackTool - CrackMapExec Execution Patterns
id: 058f4380-962d-40a5-afce-50207d36d7e2
status: stable
description: Detects various execution patterns of the CrackMapExec pentesting framework
references:
    - https://github.com/byt3bl33d3r/CrackMapExec
author: Thomas Patzke
date: 2020/05/22
modified: 2023/11/06
tags:
    - attack.execution
    - attack.t1047
    - attack.t1053
    - attack.t1059.003
    - attack.t1059.001
    - attack.s0106
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains:
            - cmd.exe /Q /c * 1> \\\\*\\*\\* 2>&1
            - cmd.exe /C * > \\\\*\\*\\* 2>&1
            - cmd.exe /C * > *\\Temp\\* 2>&1
            - powershell.exe -exec bypass -noni -nop -w 1 -C "
            - 'powershell.exe -noni -nop -w 1 -enc '
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
