title: Suspicious Control Panel DLL Load
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2017/04/15
description: Detects suspicious Rundll32 execution from control.exe as used by Equation
    Group and Exploit Kits
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\System32\control.exe'
    SELECTION_4:
        Image: '*\rundll32.exe'
    SELECTION_5:
        OriginalFileName: RUNDLL32.EXE
    SELECTION_6:
        CommandLine: '*Shell32.dll*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and (SELECTION_4 or
        SELECTION_5)) and  not (SELECTION_6))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: d7eb979b-c2b5-4a6f-a3a7-c87ce6763819
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/09
references:
- https://twitter.com/rikvduijn/status/853251879320662017
- https://twitter.com/felixw3000/status/853354851128025088
status: test
tags:
- attack.defense_evasion
- attack.t1218.011

