title: WSL Child Process Anomaly
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/23
description: Detects uncommon or suspicious child processes spawning from a WSL process.
    This could indicate an attempt to evade parent/child relationship detections or
    persistence attempts via cron using WSL
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\wsl.exe'
        - '*\wslhost.exe'
    SELECTION_4:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
        - '*\calc.exe'
    SELECTION_5:
        Image:
        - '*\AppData\Local\Temp\\*'
        - '*C:\Users\Public\\*'
        - '*C:\Windows\Temp\\*'
        - '*C:\Temp\\*'
        - '*\Downloads\\*'
        - '*\Desktop\\*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: 2267fe65-0681-42ad-9a6d-46553d3f3480
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
- https://twitter.com/nas_bench/status/1535431474429808642
related:
-   id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
    type: derived
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202

