title: Potentially Suspicious EventLog Recon Activity Using Log Query Utilities
id: beaa66d6-aa1b-4e3c-80f5-e0145369bfaf
related:
    -   id: 9cd55b6c-430a-4fa9-96f4-7cadf5229e9f
        type: derived
status: experimental
description: 'Detects execution of different log query utilities to search and dump
    the content of specific event logs or look for specific event IDs.

    '
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
    - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-144a
    - https://www.group-ib.com/blog/apt41-world-tour-2021/
    - https://labs.withsecure.com/content/dam/labs/docs/f-secureLABS-tlp-white-lazarus-threat-intel-report2.pdf
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.diagnostics/get-winevent?view=powershell-7.3
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-eventlog?view=powershell-5.1
    - http://www.solomonson.com/posts/2010-07-09-reading-eventviewer-command-line/
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
author: Nasreddine Bencherchali (Nextron Systems), X__Junior (Nextron Systems)
date: 2022/09/09
modified: 2023/11/20
tags:
    - attack.credential_access
    - attack.discovery
    - attack.t1552
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_wmi:
        CommandLine|contains|all:
            - Select
            - Win32_NTLogEvent
    selection_wevtutil_img:
        -   Image|endswith: \wevtutil.exe
        -   OriginalFileName: wevtutil.exe
    selection_wevtutil_cli:
        CommandLine|contains:
            - ' qe '
            - ' query-events '
    selection_wmic_img:
        -   Image|endswith: \wevtutil.exe
        -   OriginalFileName: wevtutil.exe
    selection_wmic_cli:
        CommandLine|contains: ' ntevent'
    selection_cmdlet:
        CommandLine|contains:
            - 'Get-WinEvent '
            - 'get-eventlog '
    selection_logs_name:
        CommandLine|contains:
            - Microsoft-Windows-TerminalServices-LocalSessionManager/Operational
            - Microsoft-Windows-Terminal-Services-RemoteConnectionManager/Operational
            - Security
    selection_logs_eid:
        CommandLine|contains:
            - -InstanceId 4624
            - System[EventID=4624]
            - EventCode=?4624?
            - EventIdentifier=?4624?
            - -InstanceId 4778
            - System[EventID=4778]
            - EventCode=?4778?
            - EventIdentifier=?4778?
            - -InstanceId 25
            - System[EventID=25]
            - EventCode=?25?
            - EventIdentifier=?25?
    condition: process_creation and (1 of selection_logs_* and (selection_wmi or all
        of selection_wevtutil_* or all of selection_wmic_* or selection_cmdlet))
falsepositives:
    - Legitimate usage of the utility by administrators to query the event log
level: medium
ruletype: Sigma
