title: Suspicious Shells Spawned by Java
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
status: experimental
description: Detects suspicious shell spawned from Java host process (e.g. log4j exploitation)
author: Andreas Hunkeler (@Karneades), Florian Roth
date: 2021/12/17
modified: 2023/01/21
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \java.exe
        Image|endswith:
            - \sh.exe
            - \bash.exe
            - \powershell.exe
            - \pwsh.exe
            - \schtasks.exe
            - \certutil.exe
            - \whoami.exe
            - \bitsadmin.exe
            - \wscript.exe
            - \cscript.exe
            - \scrcons.exe
            - \regsvr32.exe
            - \hh.exe
            - \wmic.exe
            - \mshta.exe
            - \rundll32.exe
            - \forfiles.exe
            - \scriptrunner.exe
            - \mftrace.exe
            - \AppVLP.exe
            - \curl.exe
            - \systeminfo.exe
            - \net.exe
            - \net1.exe
            - \reg.exe
            - \query.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate calls to system binaries
    - Company specific internal usage
level: high
ruletype: Sigma
