title: Abusing IEExec To Download Payloads
id: 9801abb8-e297-4dbf-9fbd-57dde0e830ad
status: experimental
description: Detects execution of the IEExec utility to download payloads
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ieexec/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/16
tags:
    - attack.command_and_control
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    lolbas:
        -   Image|endswith: \IEExec.exe
        -   OriginalFileName: IEExec.exe
    remote:
        CommandLine|contains:
            - https://
            - http://
    condition: process_creation and (lolbas and remote)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
