title: Tor Client/Browser Execution
id: b3c95e85-b653-6507-404a-3216f7999c79
related:
    - id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
      type: derived
status: test
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
author: frack113
date: 2022-02-20
modified: 2025-10-27
tags:
    - attack.command-and-control
    - attack.t1090.003
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Description: Tor Browser
        - Product: Tor Browser
        - Image|endswith:
              - \tor.exe
              - \Tor Browser\Browser\firefox.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/windows/process_creation/proc_creation_win_browsers_tor_execution/info.yml
ruletype: Sigma
