title: Taskmgr as Parent
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2018/03/13
description: Detects the creation of a process from Windows task manager
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\taskmgr.exe'
    SELECTION_4:
        Image:
        - '*\resmon.exe'
        - '*\mmc.exe'
        - '*\taskmgr.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Administrative activity
fields:
- Image
- CommandLine
- ParentCommandLine
id: 3d7679bd-0c00-440c-97b0-3f204273e6c7
level: low
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
status: test
tags:
- attack.defense_evasion
- attack.t1036

