
title: Java Running with Remote Debugging
ruletype: Sigma
author: Florian Roth
date: 2019/01/16
description: Detects a JAVA process running with remote debugging allowing more than
  just localhost to connect
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    CommandLine: '*transport=dt_socket,address=*'
  SELECTION_4:
    CommandLine:
    - '*jre1.*'
    - '*jdk1.*'
  SELECTION_5:
    CommandLine: '*address=127.0.0.1*'
  SELECTION_6:
    CommandLine: '*address=localhost*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5 or SELECTION_6))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 8f88e3f6-2a49-48f5-a5c4-2f7eedf78710
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://dzone.com/articles/remote-debugging-java-applications-with-jdwp
status: test
tags:
- attack.t1203
- attack.execution
