title: Suspicious Rundll32 Execution With Image Extension
ruletype: Sigma
author: Hieu Tran
date: 2023/03/13
description: Detects the execution of Rundll32.exe with DLL files masquerading as
    image files
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\rundll32.exe'
    SELECTION_4:
        OriginalFileName: RUNDLL32.exe
    SELECTION_5:
        CommandLine:
        - '*.bmp*'
        - '*.cr2*'
        - '*.eps*'
        - '*.gif*'
        - '*.ico*'
        - '*.jpeg*'
        - '*.jpg*'
        - '*.nef*'
        - '*.orf*'
        - '*.png*'
        - '*.raw*'
        - '*.sr2*'
        - '*.tif*'
        - '*.tiff*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 4aa6040b-3f28-44e3-a769-9208e5feb5ec
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
related:
-   id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011

