title: Suspicious DLL Loaded via CertOC.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/15
description: Detects when a user installs certificates by using CertOC.exe to load
    the target DLL file.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\certoc.exe'
    SELECTION_4:
        OriginalFileName: CertOC.exe
    SELECTION_5:
        CommandLine:
        - '* -LoadDLL *'
        - '* /LoadDLL *'
    SELECTION_6:
        CommandLine:
        - '*\Appdata\Local\Temp\\*'
        - '*\Desktop\\*'
        - '*\Downloads\\*'
        - '*\Users\Public\\*'
        - '*C:\Windows\Tasks\\*'
        - '*C:\Windows\Temp\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unknown
id: 84232095-ecca-4015-b0d7-7726507ee793
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/sblmsrsn/status/1445758411803480072?s=20
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-fe98e74189873d6df72a15df2eaa0315c59ba9cdaca93ecd68afc4ea09194ef2
- https://lolbas-project.github.io/lolbas/Binaries/Certoc/
related:
-   id: 242301bc-f92f-4476-8718-78004a6efd9f
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

