title: Wscript Shell Run In CommandLine
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/31
description: Detects the presence of the keywords "Wscript", "Shell" and "Run" in
    the command, which could indicate a suspicious activity
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*Wscript.*'
    SELECTION_4:
        CommandLine: '*.Shell*'
    SELECTION_5:
        CommandLine: '*.Run*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Rare legitimate inline scripting by some administrators
id: 2c28c248-7f50-417a-9186-a85b223010ee
level: high
logsource:
    category: process_creation
    product: windows
references:
- http://blog.talosintelligence.com/2022/08/modernloader-delivers-multiple-stealers.html
status: experimental
tags:
- attack.execution
- attack.t1059

