title: Always Install Elevated MSI Spawned Cmd And Powershell
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
date: 2020/10/13
description: Detects Windows Installer service (msiexec.exe) spawning "cmd" or "powershell"
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - Cmd.Exe
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        ParentImage: '*\Windows\Installer\\*'
    SELECTION_6:
        ParentImage: '*msi*'
    SELECTION_7:
        ParentImage: '*tmp'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
fields:
- Image
- ParentImage
id: 1e53dd56-8d83-4eb4-a43e-b790a05510aa
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/20
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-50-638.jpg
status: test
tags:
- attack.privilege_escalation
- attack.t1548.002

