title: Exports Critical Registry Keys To a File
ruletype: Sigma
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/12
description: Detects the export of a crital Registry key to a file.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\regedit.exe'
    SELECTION_4:
        CommandLine:
        - '* /E *'
        - '* -E *'
    SELECTION_5:
        CommandLine:
        - '*hklm*'
        - '*hkey_local_machine*'
    SELECTION_6:
        CommandLine:
        - '*\system'
        - '*\sam'
        - '*\security'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Dumping hives for legitimate purpouse i.e. backup or forensic investigation
fields:
- ParentImage
- CommandLine
id: 82880171-b475-4201-b811-e9c826cd5eaa
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/07
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.exfiltration
- attack.t1012

