title: Potential Defense Evasion Via Binary Rename
ruletype: Sigma
author: Matthew Green @mgreen27, Ecco, James Pemberton @4A616D6573, oscd.community,
    Andreas Hunkeler (@Karneades)
date: 2019/06/15
description: Detects the execution of a renamed binary often used by attackers or
    malware leveraging new Sysmon OriginalFileName datapoint.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName:
        - Cmd.Exe
        - CONHOST.EXE
        - 7z.exe
        - WinRAR.exe
        - wevtutil.exe
        - net.exe
        - net1.exe
        - netsh.exe
        - InstallUtil.exe
    SELECTION_4:
        Image:
        - '*\cmd.exe'
        - '*\conhost.exe'
        - '*\7z.exe'
        - '*\WinRAR.exe'
        - '*\wevtutil.exe'
        - '*\net.exe'
        - '*\net1.exe'
        - '*\netsh.exe'
        - '*\InstallUtil.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Custom applications use renamed binaries adding slight change to binary name. Typically
    this is easy to spot and add to whitelist
id: 36480ae1-a1cb-4eaa-a0d6-29801d7e9142
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/18
references:
- https://mgreen27.github.io/posts/2019/05/12/BinaryRename.html
- https://mgreen27.github.io/posts/2019/05/29/BinaryRename2.html
related:
-   id: 0ba1da6d-b6ce-4366-828c-18826c9de23e
    type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1036.003

