title: Windows Defender Download Activity
ruletype: Sigma
author: Matthew Matchen
date: 2020/09/04
description: Detect the use of Windows Defender to download payloads
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*MpCmdRun.exe*'
    SELECTION_4:
        Description: Microsoft Malware Protection Command Line Utility
    SELECTION_5:
        CommandLine: '*DownloadFile*'
    SELECTION_6:
        CommandLine: '*url*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
fields:
- CommandLine
id: 46123129-1024-423e-9fae-43af4a0fa9a5
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://web.archive.org/web/20200903194959/https://twitter.com/djmtshepana/status/1301608169496612866
- https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.command_and_control
- attack.t1105

