title: Sysinternals PsSuspend Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/23
description: Detects usage of Sysinternals PsSuspend which can be abused to suspend
    critical processes
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: pssuspend.exe
    SELECTION_4:
        Image:
        - '*\pssuspend.exe'
        - '*\pssuspend64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: 48bbc537-b652-4b4e-bd1d-281172df448f
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
- https://twitter.com/0gtweet/status/1638069413717975046
related:
-   id: 4beb6ae0-f85b-41e2-8f18-8668abc8af78
    type: similar
status: experimental
tags:
- attack.discovery
- attack.persistence
- attack.t1543.003

