title: Suspicious Microsoft Office Child Process
ruletype: Sigma
author: Michael Haag, Florian Roth, Markus Neis, Elastic, FPT.EagleEye Team, Vadim
    Khrykov, Cyb3rEng, Michael Haag, Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: 2018/04/06
description: Detects a suspicious process spawning from one of the Microsoft Office
    suite products (Word, Excel, PowerPoint, Publisher, Visio, etc.)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\EQNEDT32.EXE'
        - '*\EXCEL.EXE'
        - '*\MSACCESS.EXE'
        - '*\MSPUB.exe'
        - '*\ONENOTE.EXE'
        - '*\POWERPNT.exe'
        - '*\VISIO.exe'
        - '*\WINWORD.EXE'
        - '*\wordpad.exe'
        - '*\wordview.exe'
    SELECTION_4:
        Image:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\sh.exe'
        - '*\bash.exe'
        - '*\scrcons.exe'
        - '*\schtasks.exe'
        - '*\regsvr32.exe'
        - '*\hh.exe'
        - '*\wmic.exe'
        - '*\mshta.exe'
        - '*\rundll32.exe'
        - '*\msiexec.exe'
        - '*\forfiles.exe'
        - '*\scriptrunner.exe'
        - '*\mftrace.exe'
        - '*\AppVLP.exe'
        - '*\svchost.exe'
        - '*\msbuild.exe'
        - '*\verclsid.exe'
        - '*\msdt.exe'
        - '*\control.exe'
        - '*\msidb.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 438025f9-5856-4663-83f7-52f878a70a50
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
- https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://doublepulsar.com/follina-a-microsoft-office-code-execution-vulnerability-1a47fce5629e
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
- https://github.com/splunk/security_content/blob/develop/detections/endpoint/office_spawning_control.yml
- https://twitter.com/andythevariable/status/1576953781581144064?s=20&t=QiJILvK4ZiBdR8RJe24u-A
- https://www.elastic.co/security-labs/exploring-the-ref2731-intrusion-set
related:
-   id: e1693bc8-7168-4eab-8718-cdcaa68a1738
    type: derived
-   id: 23daeb52-e6eb-493c-8607-c4f0246cb7d8
    type: obsoletes
-   id: 518643ba-7d9c-4fa5-9f37-baed36059f6a
    type: obsoletes
-   id: 04f5363a-6bca-42ff-be70-0d28bf629ead
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1047
- attack.t1204.002
- attack.t1218.010

