title: New Firewall Rule Added Via Netsh.EXE
ruletype: Sigma
author: Markus Neis, Sander Wiebing
date: 2019/01/29
description: Detects the addition of a new rule to the Windows firewall via netsh
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*advfirewall firewall show rule name=all*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\netsh.exe'
    SELECTION_4:
        OriginalFileName: netsh.exe
    SELECTION_5:
        CommandLine: '* firewall *'
    SELECTION_6:
        CommandLine: '* add *'
    SELECTION_7:
        CommandLine:
        - '*\netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow
            "program=C:\Program Files (x86)\Dropbox\Client\Dropbox.exe" enable=yes
            profile=Any*'
        - '*\netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow
            "program=C:\Program Files\Dropbox\Client\Dropbox.exe" enable=yes profile=Any*'
    SELECTION_8:
        ParentImage: C:\Windows\Temp\asgard2-agent\\*
    SELECTION_9:
        ParentImage: '*\thor64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7) or (SELECTION_8 and
        SELECTION_9 and SELECTION_10)))
falsepositives:
- Legitimate administration activity
- Software installations and removal
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/10
references:
- https://attack.mitre.org/software/S0246/ (Lazarus HARDRAIN)
- https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1562.004

