title: 3Proxy Usage
ruletype: Sigma
author: Florian Roth
date: 2022/09/13
description: Detects the use of 3proxy, a tiny free proxy server
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\3proxy.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrative activity
id: f38a82d2-fba3-4781-b549-525efbec8506
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/3proxy/3proxy
- https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: experimental
tags:
- attack.command_and_control
- attack.t1572

