title: Potential Execution of Sysinternals Tools
ruletype: Sigma
author: Markus Neis
date: 2017/08/28
description: Detects command lines that contain the 'accepteula' flag which could
    be a sign of execution of one of the Sysinternals tools
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '* -accepteula*'
        - '* /accepteula*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same command line flag
id: 7cccd811-7ae9-4ebe-9afd-cb5c406b824b
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/02/24
references:
- https://twitter.com/Moti_B/status/1008587936735035392
related:
-   id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
    type: derived
status: experimental
tags:
- attack.resource_development
- attack.t1588.002

