title: Potential Arbitrary DLL Load Using Winword
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects potential DLL sideloading using the Microsoft Office winword
    process via the '/l' flag.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\WINWORD.exe'
    SELECTION_4:
        OriginalFileName: WinWord.exe
    SELECTION_5:
        CommandLine: '*/l *'
    SELECTION_6:
        CommandLine: '*.dll*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: f7375e28-5c14-432f-b8d1-1db26c832df3
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/29
references:
- https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py
related:
-   id: 2621b3a6-3840-4810-ac14-a02426086171
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.t1202

