title: Installation of WSL Kali-Linux
id: 63358f35-7aa6-0832-cbd4-e51e081ab190
related:
    - id: eca8ae39-5c3c-4321-b538-9e64fe25822e
      type: derived
status: experimental
description: |
    Detects installation of Kali Linux distribution through Windows Subsystem for Linux (WSL).
    Attackers may use Kali Linux WSL to leverage its penetration testing tools and capabilities for malicious purposes.
references:
    - https://medium.com/@redfanatic7/running-kali-linux-on-windows-51ad95166e6e
    - https://learn.microsoft.com/en-us/windows/wsl/install
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-10-10
tags:
    - attack.execution
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_wsl_img:
        - Image|endswith: \wsl.exe
        - OriginalFileName: wsl
    selection_wsl_install:
        CommandLine|contains:
            - ' --install '
            - ' -i '
    selection_wsl_kali:
        CommandLine|contains: kali
    condition: process_creation and (all of selection_wsl_*)
falsepositives:
    - Legitimate installation or usage of Kali Linux WSL by administrators or security teams
level: high
ruletype: Sigma
