title: Arbitrary MSI Download Via Devinit.EXE
id: 60cc8ef9-ecec-05a2-26b2-cd64800cac86
related:
    - id: 90d50722-0483-4065-8e35-57efaadd354d
      type: derived
status: test
description: Detects a certain command line flag combination used by "devinit.exe", which can be abused as a LOLBIN to download arbitrary MSI packages on a Windows system
references:
    - https://twitter.com/mrd0x/status/1460815932402679809
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devinit/
author: Florian Roth (Nextron Systems)
date: '2022-01-11'
modified: '2023-04-06'
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - ' -t msi-install '
            - ' -i http'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
