
title: Detection of PowerShell Execution via DLL
ruletype: Sigma
author: Markus Neis
date: 2018/08/25
description: Detects PowerShell Strings applied to rundll as seen in PowerShdll.dll
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\rundll32.exe'
  SELECTION_4:
    Description: '*Windows-Hostprozess (Rundll32)*'
  SELECTION_5:
    CommandLine:
    - '*Default.GetString*'
    - '*FromBase64String*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Unknown
id: 6812a10b-60ea-420c-832f-dfcc33b646ba
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/p3nt4/PowerShdll/blob/master/README.md
status: test
tags:
- attack.defense_evasion
- attack.t1218.011
