title: Compressed File Creation Via Tar.EXE
id: dec66642-d0c6-675b-dce3-7f56242a7a67
related:
    - id: 418a3163-3247-4b7b-9933-dcfcb7c52ea9
      type: derived
status: test
description: |
    Detects execution of "tar.exe" in order to create a compressed file.
    Adversaries may abuse various utilities to compress or encrypt data before exfiltration.
references:
    - https://unit42.paloaltonetworks.com/chromeloader-malware/
    - https://lolbas-project.github.io/lolbas/Binaries/Tar/
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/cicada-apt10-japan-espionage
author: Nasreddine Bencherchali (Nextron Systems), AdmU3
date: 2023-12-19
tags:
    - attack.collection
    - attack.exfiltration
    - attack.t1560
    - attack.t1560.001
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \tar.exe
        - OriginalFileName: bsdtar
    selection_create:
        CommandLine|contains:
            - -c
            - -r
            - -u
    condition: process_creation and (all of selection_*)
falsepositives:
    - Likely
level: low
ruletype: Sigma
