title: Remote Procedure Call Service Anomaly
ruletype: Sigma
author: Florian Roth
date: 2022/04/13
description: Detects suspicious remote procedure call (RPC) service anomalies based
    on the spawned sub processes (long shot to detect the exploitation of vulnerabilities
    like CVE-2022-26809)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentCommandLine: C:\WINDOWS\system32\svchost.exe -k RPCSS*
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
- Some cases in which the service spawned a werfault.exe process
id: a7cd7306-df8b-4398-b711-6f3e4935cf16
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2022-26809
- https://www.bleepingcomputer.com/startups/RpcSs.exe-14544.html
- https://twitter.com/cyb3rops/status/1514217991034097664
status: experimental
tags:
- attack.initial_access
- attack.t1190
- attack.execution
- attack.t1569.002

