title: Sysinternals PsSuspend Suspicious Execution
id: de6f4ee4-631f-0353-3312-3db04b86c3de
related:
    - id: 48bbc537-b652-4b4e-bd1d-281172df448f # Basic Execution
      type: similar
    - id: 4beb6ae0-f85b-41e2-8f18-8668abc8af78
      type: derived
status: test
description: Detects suspicious execution of Sysinternals PsSuspend, where the utility is used to suspend critical processes such as AV or EDR to bypass defenses
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
    - https://twitter.com/0gtweet/status/1638069413717975046
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-03-23'
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - OriginalFileName: pssuspend.exe
        - Image|endswith:
              - \pssuspend.exe
              - \pssuspend64.exe
    selection_cli:
        # Add more interesting/critical processes
        CommandLine|contains: msmpeng.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
