title: Possible Privilege Escalation via Weak Service Permissions
id: 71e4d888-6bce-2d56-3af6-024d5be3554e
related:
    - id: d937b75f-a665-4480-88a5-2f20e9f9b22a
      type: derived
status: test
description: Detection of sc.exe utility spawning by user with Medium integrity level to change service ImagePath or FailureCommand
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://pentestlab.blog/2017/03/30/weak-service-permissions/
author: Teymur Kheirkhabarov
date: '2019-10-26'
modified: '2024-12-01'
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1574.011
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    scbynonadmin:
        Image|endswith: \sc.exe
        IntegrityLevel:
            - Medium
            - S-1-16-8192
    selection_binpath:
        CommandLine|contains|all:
            - config
            - binPath
    selection_failure:
        CommandLine|contains|all:
            - failure
            - command
    condition: process_creation and (scbynonadmin and 1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
