title: ConvertTo-SecureString Cmdlet Usage Via CommandLine
id: d8f03e13-c185-34ed-3e51-2b39f74808d3
related:
    - id: 74403157-20f5-415d-89a7-c505779585cf
      type: derived
status: test
description: Detects usage of the "ConvertTo-SecureString" cmdlet via the commandline. Which is fairly uncommon and could indicate potential suspicious activity
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/convertto-securestring?view=powershell-7.3#examples
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
date: 2020-10-11
modified: 2023-02-01
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith:
              - \powershell.exe
              - \pwsh.exe
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
    selection_cli:
        CommandLine|contains: ConvertTo-SecureString
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate use to pass password to different powershell commands
level: medium
ruletype: Sigma
