title: Potential Shim Database Persistence via Sdbinst.EXE
id: 517490a7-115a-48c6-8862-1a481504d5a8
related:
    -   id: 18ee686c-38a3-4f65-9f44-48a077141f42
        type: similar
status: test
description: 'Detects installation of a new shim using sdbinst.exe.

    Adversaries may establish persistence and/or elevate privileges by executing malicious
    content triggered by application shims

    '
references:
    - https://www.mandiant.com/resources/blog/fin7-shim-databases-persistence
author: Markus Neis
date: 2019/01/16
modified: 2023/12/06
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.t1546.011
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        -   Image|endswith: \sdbinst.exe
        -   OriginalFileName: sdbinst.exe
    selection_cli:
        CommandLine|contains: .sdb
    filter_optional_iis:
        ParentImage|endswith: \msiexec.exe
        CommandLine|contains:
            - :\Program Files (x86)\IIS Express\iisexpressshim.sdb
            - :\Program Files\IIS Express\iisexpressshim.sdb
    condition: process_creation and (all of selection_* and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
