title: CL_Mutexverifiers.ps1 Proxy Execution
id: 1e0e1a81-e79b-44bc-935b-ddb9c8006b3d
status: experimental
description: Detects the use of a Microsoft signed script to execute commands
references:
    - https://lolbas-project.github.io/lolbas/Scripts/CL_mutexverifiers/
author: oscd.community, Natalia Shornikova, frack113
date: 2022/05/21
modified: 2022/06/28
tags:
    - attack.defense_evasion
    - attack.t1216
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - \CL_Mutexverifiers.ps1
            - 'runAfterCancelProcess '
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
