title: MsiExec Web Install
ruletype: Sigma
author: Florian Roth
date: 2018/02/09
description: Detects suspicious msiexec process starts with web addresses as parameter
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '* msiexec*'
    SELECTION_4:
        CommandLine: '*://*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
    environment
id: f7b5f842-a6af-4da5-9e95-e32478f3cd2f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/01/07
references:
- https://blog.trendmicro.com/trendlabs-security-intelligence/attack-using-windows-installer-msiexec-exe-leads-lokibot/
status: test
tags:
- attack.defense_evasion
- attack.t1218.007
- attack.command_and_control
- attack.t1105
yml_filename: proc_creation_win_susp_msiexec_web_install.yml
yml_path: rules/windows/process_creation
---

