title: Import LDAP Data Interchange Format File Via Ldifde.EXE
ruletype: Sigma
author: '@gott_cyber'
date: 2022/09/02
description: 'Detects the execution of "Ldifde.exe" with the import flag "-i". The
    can be abused to include HTTP-based arguments which will allow the arbitrary download
    of files from a remote server.

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\ldifde.exe'
    SELECTION_4:
        OriginalFileName: ldifde.exe
    SELECTION_5:
        CommandLine: '*-i*'
    SELECTION_6:
        CommandLine: '*-f*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Since the content of the files are unknown, false positives are expected
id: 6f535e01-ca1f-40be-ab8d-45b19c0c8b7f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/14
references:
- https://twitter.com/0gtweet/status/1564968845726580736
- https://strontic.github.io/xcyclopedia/library/ldifde.exe-979DE101F5059CEC1D2C56967CA2BAC0.html
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
status: experimental
tags:
- attack.command_and_control
- attack.defense_evasion
- attack.t1218
- attack.t1105

