title: Use of Pcalua For Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), E.M. Anhaus (originally from Atomic
    Blue Detections, Endgame), oscd.community
date: 2022/06/14
description: Detects execition of commands and binaries from the context of The program
    compatibility assistant (Pcalua.exe). This can be used as a LOLBIN in order to
    bypass application whitelisting.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\pcalua.exe'
    SELECTION_4:
        CommandLine: '* -a*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use by a via a batch script or by an administrator.
id: 0955e4e1-c281-4fb9-9ee1-5ee7b4b754d2
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/04
references:
- https://lolbas-project.github.io/lolbas/Binaries/Pcalua/
- https://pentestlab.blog/2020/07/06/indirect-command-execution/
related:
-   id: fa47597e-90e9-41cd-ab72-c3b74cfb0d02
    type: obsoletes
status: experimental
tags:
- attack.execution
- attack.t1059

