title: Suspicious PowerShell Invocations - Specific - ProcessCreation
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/05
description: Detects suspicious PowerShell invocation command parameters
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*-noni*'
    SELECTION_11:
        CommandLine: '*-nop*'
    SELECTION_12:
        CommandLine: '* -c *'
    SELECTION_13:
        CommandLine: '*iex*'
    SELECTION_14:
        CommandLine: '*New-Object*'
    SELECTION_15:
        CommandLine: '* -w *'
    SELECTION_16:
        CommandLine: '*hidden*'
    SELECTION_17:
        CommandLine: '*-ep*'
    SELECTION_18:
        CommandLine: '*bypass*'
    SELECTION_19:
        CommandLine: '*-Enc*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        CommandLine: '*powershell*'
    SELECTION_21:
        CommandLine: '*reg*'
    SELECTION_22:
        CommandLine: '*add*'
    SELECTION_23:
        CommandLine: '*\software\\*'
    SELECTION_24:
        CommandLine: '*bypass*'
    SELECTION_25:
        CommandLine: '*-noprofile*'
    SELECTION_26:
        CommandLine: '*-windowstyle*'
    SELECTION_27:
        CommandLine: '*hidden*'
    SELECTION_28:
        CommandLine: '*new-object*'
    SELECTION_29:
        CommandLine: '*system.net.webclient*'
    SELECTION_3:
        CommandLine: '*-nop*'
    SELECTION_30:
        CommandLine: '*.download*'
    SELECTION_31:
        CommandLine: '*iex*'
    SELECTION_32:
        CommandLine: '*New-Object*'
    SELECTION_33:
        CommandLine: '*Net.WebClient*'
    SELECTION_34:
        CommandLine: '*.Download*'
    SELECTION_35:
        CommandLine:
        - '*(New-Object System.Net.WebClient).DownloadString(''https://community.chocolatey.org/install.ps1*'
        - '*Write-ChocolateyWarning*'
    SELECTION_4:
        CommandLine: '* -w *'
    SELECTION_5:
        CommandLine: '*hidden*'
    SELECTION_6:
        CommandLine: '* -c *'
    SELECTION_7:
        CommandLine: '*[Convert]::FromBase64String*'
    SELECTION_8:
        CommandLine: '* -w *'
    SELECTION_9:
        CommandLine: '*hidden*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10 and SELECTION_11 and SELECTION_12 and SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16 and SELECTION_17 and SELECTION_18 and SELECTION_19)
        or (SELECTION_20 and SELECTION_21 and SELECTION_22 and SELECTION_23) or (SELECTION_24
        and SELECTION_25 and SELECTION_26 and SELECTION_27 and SELECTION_28 and SELECTION_29
        and SELECTION_30) or (SELECTION_31 and SELECTION_32 and SELECTION_33 and SELECTION_34))
        and  not ((SELECTION_35)))
falsepositives:
- Unknown
id: 536e2947-3729-478c-9903-745aaffe60d2
level: medium
logsource:
    category: process_creation
    product: windows
related:
-   id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
    type: derived
-   id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
    type: similar
-   id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
    type: similar
status: experimental
tags:
- attack.defense_evasion

