title: Suspicious Execution From GUID Like Folder Names
id: 90b63c33-2b97-4631-a011-ceb0f47b77c3
status: experimental
description: Detects potential suspicious execution of a GUID like folder name located
    in a suspicious location such as %TEMP% as seen being used in IcedID attacks
references:
    - https://twitter.com/Kostastsale/status/1565257924204986369
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/01
modified: 2023/03/02
tags:
    - attack.defense_evasion
    - attack.t1027
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_folder:
        CommandLine|contains:
            - \AppData\Roaming\
            - \AppData\Local\Temp\
    selection_guid:
        CommandLine|contains|all:
            - \{
            - '}\'
    filter:
        Image|contains|all:
            - \{
            - '}\'
    filter_null:
        Image: null
    filter_driver_inst:
        Image: C:\Windows\System32\drvinst.exe
    condition: process_creation and (all of selection_* and not 1 of filter*)
falsepositives:
    - Installers are sometimes known for creating temporary folders with GUID like
        names. Add appropriate filters accordingly
level: medium
ruletype: Sigma
