title: Base64 MZ Header In CommandLine
id: b5129fd4-301e-611a-5f11-5d2fcd45b5e3
related:
    - id: 22e58743-4ac8-4a9f-bf19-00a0428d8c5f
      type: derived
status: test
description: Detects encoded base64 MZ header in the commandline
references:
    - https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
author: Nasreddine Bencherchali (Nextron Systems)
date: '2022-07-12'
tags:
    - attack.execution
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains:
            - TVqQAAMAAAAEAAAA   # MZ..........
            - TVpQAAIAAAAEAA8A
            - TVqAAAEAAAAEABAA
            - TVoAAAAAAAAAAAAA
            - TVpTAQEAAAAEAAAA
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
