title: PsExec Service Start
ruletype: Sigma
author: Florian Roth
date: 2018/03/13
description: Detects a PsExec service start
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: C:\Windows\PSEXESVC.exe
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrative activity
id: 3ede524d-21cc-472d-a3ce-d21b568d8db7
level: low
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
status: test
tags:
- attack.execution
- attack.s0029
- attack.t1569.002
yml_filename: proc_creation_win_psexesvc_start.yml
yml_path: rules/windows/process_creation
---

