title: Registry Defender Tampering
ruletype: Sigma
author: Florian Roth
date: 2022/03/22
description: Detects reg command lines that disable certain important features of
    Microsoft Defender
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\reg.exe'
    SELECTION_4:
        CommandLine:
        - '*SOFTWARE\Microsoft\Windows Defender\\*'
        - '*SOFTWARE\Policies\Microsoft\Windows Defender\\*'
    SELECTION_5:
        CommandLine: '* add *'
    SELECTION_6:
        CommandLine: '* /d 0*'
    SELECTION_7:
        CommandLine:
        - '*Real-Time Protection*'
        - '*TamperProtection*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate use
id: 452bce90-6fb0-43cc-97a5-affc283139b3
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/05
references:
- https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: proc_creation_win_reg_defender_tampering.yml
yml_path: rules/windows/process_creation
---

