title: Remote Access Tool - ScreenConnect Remote Command Execution
id: b1f73849-6329-4069-bc8f-78a604bb8b23
status: experimental
description: Detects the execution of a system command via the ScreenConnect RMM service.
references:
    - https://github.com/SigmaHQ/sigma/pull/4467
author: Ali Alwashali
date: 2023/10/10
tags:
    - attack.execution
    - attack.t1059.003
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_parent:
        ParentImage|endswith: \ScreenConnect.ClientService.exe
    selection_img:
        -   Image|endswith: \cmd.exe
        -   OriginalFileName: Cmd.Exe
    selection_cli:
        CommandLine|contains: \TEMP\ScreenConnect\
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate use of ScreenConnect. Disable this rule if ScreenConnect is heavily
        used.
level: medium
ruletype: Sigma
