title: Suspicious Kernel Dump Using Dtrace
id: d00d859f-0d37-7a5e-2908-cf2d06e3a6e6
related:
    - id: 7124aebe-4cd7-4ccb-8df0-6d6b93c96795
      type: derived
status: test
description: Detects suspicious way to dump the kernel on Windows systems using dtrace.exe, which is available on Windows systems since Windows 10 19H1
references:
    - https://twitter.com/0gtweet/status/1474899714290208777?s=12
    - https://learn.microsoft.com/en-us/windows-hardware/drivers/devtest/dtrace
author: Florian Roth (Nextron Systems)
date: 2021-12-28
tags:
    - attack.discovery
    - attack.t1082
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_plain:
        Image|endswith: \dtrace.exe
        CommandLine|contains: lkd(0)
    selection_obfuscated:
        CommandLine|contains|all:
            - syscall:::return
            - lkd(
    condition: process_creation and (1 of selection*)
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/windows/process_creation/proc_creation_win_dtrace_kernel_dump/info.yml
ruletype: Sigma
