title: Potential DLL Sideloading Via DeviceEnroller.EXE
ruletype: Sigma
author: '@gott_cyber'
date: 2022/08/29
description: 'Detects the use of the PhoneDeepLink parameter to potentially sideload
    a DLL file that does not exist. This non-existent DLL file is named "ShellChromeAPI.dll".

    Adversaries can drop their own renamed DLL and execute it via DeviceEnroller.exe
    using this parameter

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\deviceenroller.exe'
    SELECTION_4:
        OriginalFileName: deviceenroller.exe
    SELECTION_5:
        CommandLine: '*/PhoneDeepLink*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: e173ad47-4388-4012-ae62-bd13f71c18a8
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://mobile.twitter.com/0gtweet/status/1564131230941122561
- https://strontic.github.io/xcyclopedia/library/DeviceEnroller.exe-24BEF0D6B0ECED36BB41831759FDE18D.html
related:
-   id: ee4c5d06-3abc-48cc-8885-77f1c20f4451
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002

