title: Suspicious PowerShell Mailbox Export to Share
ruletype: Sigma
author: Florian Roth
date: 2021/08/07
description: Detects usage of the powerShell New-MailboxExportRequest Cmdlet to exports
    a mailbox to a remote or local share, as used in ProxyShell exploitations
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*New-MailboxExportRequest*'
    SELECTION_4:
        CommandLine: '* -Mailbox *'
    SELECTION_5:
        CommandLine: '* -FilePath \\\\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 889719ef-dd62-43df-86c3-768fb08dc7c0
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2022/10/26
references:
- https://youtu.be/5mqid-7zp8k?t=2481
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
- https://peterjson.medium.com/reproducing-the-proxyshell-pwn2own-exploit-49743a4ea9a1
- https://m365internals.com/2022/10/07/hunting-in-on-premises-exchange-server-logs/
status: experimental
tags:
- attack.exfiltration

