title: Advanced Port Scanner
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2021/12/18
description: Detects the use of Advanced Port Scanner.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\advanced_port_scanner*'
    SELECTION_4:
        OriginalFileName: '*advanced_port_scanner*'
    SELECTION_5:
        Description: '*Advanced Port Scanner*'
    SELECTION_6:
        CommandLine: '*/portable*'
    SELECTION_7:
        CommandLine: '*/lng*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4 or
        SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Legitimate administrative use
- Tools with similar commandline (very rare)
id: 54773c5f-f1cc-4703-9126-2f797d96a69d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/11/11
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20Port%20Scanner
status: experimental
tags:
- attack.discovery
- attack.t1046
- attack.t1135

