title: CobaltStrike Process Patterns
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/07/27
description: Detects process patterns found in Cobalt Strike beacon activity (see
    reference for more details) and also cases in which a China Chopper like webshell
    is used to run whoami
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*conhost.exe 0xffffffff -ForceV1*'
    SELECTION_11:
        ParentCommandLine:
        - '*/C whoami*'
        - '*cmd.exe /C echo*'
        - '* > \\\\.\\pipe*'
    SELECTION_12:
        ParentCommandLine:
        - '*C:\Program Files (x86)\Internet Download Manager\IDMMsgHost.exe*'
        - '*chrome-extension://*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*\cmd.exe /C whoami*'
    SELECTION_4:
        ParentImage: C:\Temp*
    SELECTION_5:
        CommandLine:
        - '*cmd.exe /c echo*'
        - '*> \\\\.\\pipe*'
        - '*\whoami.exe*'
    SELECTION_6:
        ParentImage: '*\dllhost.exe'
    SELECTION_7:
        Image: '*\cmd.exe'
    SELECTION_8:
        ParentImage: '*\runonce.exe'
    SELECTION_9:
        ParentCommandLine: '*\runonce.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 and SELECTION_4)
        or (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9))
        or ((SELECTION_10 and SELECTION_11) and  not (SELECTION_12))))
falsepositives:
- Other programs that cause these patterns (please report)
id: f35c5d71-b489-4e22-a115-f003df287317
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/07
references:
- https://hausec.com/2021/07/26/cobalt-strike-and-tradecraft/
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
status: experimental
tags:
- attack.execution
- attack.t1059

