title: Dotnet.exe Exec Dll and Execute Unsigned Code LOLBIN
ruletype: Sigma
author: Beyu Denis, oscd.community
date: 2020/10/18
description: dotnet.exe will execute any DLL and execute unsigned code
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\dotnet.exe'
    SELECTION_4:
        OriginalFileName: .NET Host
    SELECTION_5:
        CommandLine:
        - '*.dll'
        - '*.csproj'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- System administrator Usage
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: d80d5c81-04ba-45b4-84e4-92eba40e0ad3
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dotnet/
- https://twitter.com/_felamos/status/1204705548668555264
- https://bohops.com/2019/08/19/dotnet-core-a-vector-for-awl-bypass-defense-evasion/
status: test
tags:
- attack.execution
- attack.t1218

