title: Suspicious HH.EXE Execution
ruletype: Sigma
author: Maxim Pavlunin
date: 2020/04/01
description: Detects a suspicious execution of a Microsoft HTML Help (HH.exe)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: HH.exe
    SELECTION_4:
        Image: '*\hh.exe'
    SELECTION_5:
        CommandLine:
        - '*.application*'
        - '*\AppData\Local\Temp\\*'
        - '*\Content.Outlook\\*'
        - '*\Downloads\\*'
        - '*\Users\Public\\*'
        - '*\Windows\Temp\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: e8a95b5e-c891-46e2-b33a-93937d3abc31
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/12
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/chm-badness-delivers-a-banking-trojan/
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-27939090904026cc396b0b629c8e4314acd6f5dac40a676edbc87f4567b47eb7
- https://www.ptsecurity.com/ww-en/analytics/pt-esc-threat-intelligence/higaisa-or-winnti-apt-41-backdoors-old-and-new/
- https://www.zscaler.com/blogs/security-research/unintentional-leak-glimpse-attack-vectors-apt37
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.initial_access
- attack.t1047
- attack.t1059.001
- attack.t1059.003
- attack.t1059.005
- attack.t1059.007
- attack.t1218
- attack.t1218.001
- attack.t1218.010
- attack.t1218.011
- attack.t1566
- attack.t1566.001

