title: SharpChisel Usage
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/05
description: Detects usage of the Sharp Chisel via the commandline arguments
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\SharpChisel.exe'
    SELECTION_4:
        Product: SharpChisel
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
id: cf93e05e-d798-4d9e-b522-b0248dc61eaf
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/13
references:
- https://github.com/shantanu561993/SharpChisel
- https://www.sentinelone.com/labs/wading-through-muddy-waters-recent-activity-of-an-iranian-state-sponsored-threat-actor/
related:
-   id: 8b0e12da-d3c3-49db-bb4f-256703f380e5
    type: similar
status: experimental
tags:
- attack.command_and_control
- attack.t1090.001

