title: Visual Studio NodejsTools PressAnyKey Arbitrary Binary Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/11
description: Detects child processes of Microsoft.NodejsTools.PressAnyKey.exe that
    can be used to execute any other binary
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\Microsoft.NodejsTools.PressAnyKey.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use by developers as part of NodeJS development with Visual Studio Tools
id: a20391f8-76fb-437b-abc0-dba2df1952c6
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/04/11
references:
- https://twitter.com/mrd0x/status/1463526834918854661
- https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
related:
-   id: 65c3ca2c-525f-4ced-968e-246a713d164f
    type: similar
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218

