title: PUA - WebBrowserPassView Execution
ruletype: Sigma
author: frack113
date: 2022/08/20
description: Detects the execution of WebBrowserPassView.exe. A password recovery
    tool that reveals the passwords stored by the following Web browsers, Internet
    Explorer (Version 4.0 - 11.0), Mozilla Firefox (All Versions), Google Chrome,
    Safari, and Opera
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: Web Browser Password Viewer
    SELECTION_4:
        Image: '*\WebBrowserPassView.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use
id: d0dae994-26c6-4d2d-83b5-b3c8b79ae513
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1555.003/T1555.003.md
status: experimental
tags:
- attack.credential_access
- attack.t1555.003

