
title: Run PowerShell Script from Redirected Input Stream
ruletype: Sigma
author: Moriarty Meng (idea), Anton Kutepov (rule), oscd.community
date: 2020/10/17
description: Detects PowerShell script execution via input stream redirect
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\powershell.exe'
  SELECTION_4:
    CommandLine|re: \s-\s*<
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: c83bf4b5-cdf0-437c-90fa-43d734f7c476
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OSBinaries/Powershell.yml
- https://twitter.com/Moriarty_Meng/status/984380793383370752
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
