title: Use of Wfc.exe
id: fac615fa-9b2a-40ce-3933-68d2eb7f395e
related:
    - id: 49be8799-7b4d-4fda-ad23-cafbefdebbc5
      type: derived
status: test
description: The Workflow Command-line Compiler can be used for AWL bypass and is listed in Microsoft's recommended block rules.
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wfc/
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
date: 2022-06-01
tags:
    - attack.defense-evasion
    - attack.t1127
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \wfc.exe
        - OriginalFileName: wfc.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use by a software developer
level: medium
ruletype: Sigma
