title: Suspicious File Characteristics Due to Missing Fields
ruletype: Sigma
author: Markus Neis, Sander Wiebing
date: 2018/11/22
description: Detects Executables in the Downloads folder without FileVersion,Description,Product,Company
    likely created with py2exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: \?
    SELECTION_4:
        FileVersion: \?
    SELECTION_5:
        Description: \?
    SELECTION_6:
        Product: \?
    SELECTION_7:
        Description: \?
    SELECTION_8:
        Company: \?
    SELECTION_9:
        Image: '*\Downloads\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 and SELECTION_4)
        or (SELECTION_5 and SELECTION_6)) or (SELECTION_7 and SELECTION_8)) and SELECTION_9)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 9637e8a5-7131-4f7f-bdc7-2b05d8670c43
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/06/27
references:
- https://securelist.com/muddywater/88059/
- https://www.virustotal.com/#/file/276a765a10f98cda1a38d3a31e7483585ca3722ecad19d784441293acf1b7beb/detection
status: experimental
tags:
- attack.execution
- attack.t1059.006
yml_filename: proc_creation_win_susp_file_characteristics.yml
yml_path: rules/windows/process_creation
---

