title: HackTool - SysmonEOP Execution
id: 050469fb-974a-0174-134f-1944d59a186d
related:
    - id: 8a7e90c5-fe6e-45dc-889e-057fe4378bd9
      type: derived
status: test
description: Detects the execution of the PoC that can be used to exploit Sysmon CVE-2022-41120
references:
    - https://github.com/Wh04m1001/SysmonEoP
author: Florian Roth (Nextron Systems)
date: 2022-12-04
modified: 2024-11-23
tags:
    - cve.2022-41120
    - attack.t1068
    - attack.privilege-escalation
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        Image|endswith: \SysmonEOP.exe
    selection_hash:
        Hashes|contains:
            - IMPHASH=22F4089EB8ABA31E1BB162C6D9BF72E5
            - IMPHASH=5123FA4C4384D431CD0D893EEB49BBEC
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
