title: Suspicious Scheduled Task Creation Involving Temp Folder
id: ef1d1089-5b1b-88aa-31b4-d960444dc5c0
related:
    - id: 39019a4e-317f-4ce3-ae63-309a8c6b53c5
      type: derived
status: test
description: Detects the creation of scheduled tasks that involves a temporary folder and runs only once
references:
    - https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3
author: Florian Roth (Nextron Systems)
date: 2021-03-11
modified: 2022-10-09
tags:
    - attack.privilege-escalation
    - attack.execution
    - attack.persistence
    - attack.t1053.005
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \schtasks.exe
        CommandLine|contains|all:
            - ' /create '
            - ' /sc once '
            - \Temp\
    condition: process_creation and selection
falsepositives:
    - Administrative activity
    - Software installation
level: high
ruletype: Sigma
