title: Ryuk Ransomware
ruletype: Sigma
author: Vasiliy Burov
date: 2019/08/06
description: Detects Ryuk Ransomware command lines
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_4:
        CommandLine: '*stop*'
    SELECTION_5:
        CommandLine:
        - '*samss*'
        - '*audioendpointbuilder*'
        - '*unistoresvc_?????*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unlikely
id: 0acaad27-9f02-4136-a243-c357202edd74
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://research.checkpoint.com/ryuk-ransomware-targeted-campaign-break/
status: stable
tags:
- attack.execution
- attack.t1204
yml_filename: proc_creation_win_mal_ryuk.yml
yml_path: rules/windows/process_creation
---

