title: Esentutl Steals Browser Information
id: 6a69f62d-ce75-4b57-8dce-6351eb55b362
status: test
description: One way Qbot steals sensitive information is by extracting browser data from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe
references:
    - https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
    - https://redcanary.com/threat-detection-report/threats/qbot/
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
author: frack113
date: 2022/02/13
modified: 2022/10/31
tags:
    - attack.collection
    - attack.t1005
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \esentutl.exe
        - OriginalFileName: esentutl.exe
    selection_flag:
        CommandLine|contains:
            - /r
            - -r
    selection_webcache:
        CommandLine|contains: \Windows\WebCache
    condition: process_creation and (all of selection*)
falsepositives:
    - Legitimate use
level: medium
ruletype: Sigma
