
title: Execute Code with Pester.bat
ruletype: Sigma
author: Julia Fomina, oscd.community
date: 2020/10/08
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for
  testing)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\powershell.exe'
    - '*\pwsh.exe'
  SELECTION_4:
    CommandLine: '*Pester*'
  SELECTION_5:
    CommandLine: '*Get-Help*'
  SELECTION_6:
    Image: '*\cmd.exe'
  SELECTION_7:
    CommandLine: '*pester*'
  SELECTION_8:
    CommandLine: '*;*'
  SELECTION_9:
    CommandLine:
    - '*help*'
    - '*?*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Legitimate use of Pester for writing tests for Powershell scripts and modules
id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/14
references:
- https://twitter.com/Oddvarmoe/status/993383596244258816
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1216
