title: Potential Exploitation Attempt Of Undocumented WindowsServer RCE
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2023/01/21
description: Detects potential exploitation attempt of undocumented Windows Server
    Pre Auth Remote Code Execution (RCE)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\svchost.exe'
    SELECTION_4:
        Image: '*\svchost.exe'
    SELECTION_5:
        ParentCommandLine: '*-k DHCPServer*'
    SELECTION_6:
        CommandLine: '*-k DHCPServer*'
    SELECTION_7:
        User:
        - '*NETWORK SERVICE*'
        - '*NETZWERKDIENST*'
        - '*SERVIZIO DI RETE*'
        - '*SERVICIO DE RED*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 6d5b8176-d87d-4402-8af4-53aee9db7b5d
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/YanZiShuang/status/1616777483646533632?s=20&t=TQT9tUuPbQJai4v6HtsOQw
- https://twitter.com/hackerfantastic/status/1616455335203438592?s=20
status: experimental

