title: Potential Obfuscated Ordinal Call Via Rundll32
id: a182cc89-bd45-c9fc-d62e-88780c13c087
related:
    - id: 43fa5350-db63-4b8f-9a01-789a427074e1
      type: derived
status: test
description: Detects execution of "rundll32" with potential obfuscated ordinal calls
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/17
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \rundll32.exe
        - OriginalFileName: RUNDLL32.EXE
        - CommandLine|contains: rundll32
    selection_cli:
        CommandLine|contains:
            - '#+'
            - '#-'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
