title: Esentutl Gather Credentials
id: c695d30a-7bf2-a8d4-09b1-b0e7b8483408
related:
    - id: 7df1713a-1a5b-4a4b-a071-dc83b144a101
      type: derived
status: test
description: Conti recommendation to its affiliates to use esentutl to access NTDS dumped file. Trickbot also uses this utilities to get MSEdge info via its module pwgrab.
references:
    - https://twitter.com/vxunderground/status/1423336151860002816
    - https://thedfirreport.com/2021/08/01/bazarcall-to-conti-ransomware-via-trickbot-and-cobalt-strike/
author: sam0x90
date: 2021-08-06
modified: 2022-10-09
tags:
    - attack.credential-access
    - attack.t1003
    - attack.t1003.003
    - attack.s0404
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - esentutl
            - ' /p'
    condition: process_creation and selection
fields:
    - User
    - CommandLine
    - ParentCommandLine
    - CurrentDirectory
falsepositives:
    - To be determined
level: medium
ruletype: Sigma
