title: Suspicious CMD Shell Output Redirect
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
description: Detects inline windows shell commands redirecting output via the ">"
    symbol to a suspicious location
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\cmd.exe'
    SELECTION_4:
        OriginalFileName: Cmd.Exe
    SELECTION_5:
        CommandLine:
        - '*> %USERPROFILE%\\*'
        - '*> %APPDATA%\\*'
        - '*> \Users\Public\\*'
        - '*> C:\Users\Public\\*'
        - '*> %TEMP%\\*'
        - '*> %TMP%\\*'
        - '*> C:\Windows\Temp\\*'
        - '*> C:\Temp\\*'
    SELECTION_6:
        CommandLine:
        - '* > *'
        - '* >> *'
    SELECTION_7:
        CommandLine: '*C:\Users\\*'
    SELECTION_8:
        CommandLine: '*\AppData\Local\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate admin scripts
id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/07
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
related:
-   id: aa2efee7-34dd-446e-8a37-40790a66efd7
    type: derived
-   id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1218

