title: Suspicious Execution from Outlook
ruletype: Sigma
author: Markus Neis
date: 2018/12/27
description: Detects EnableUnsafeClientMailRules used for Script Execution from Outlook
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*EnableUnsafeClientMailRules*'
    SELECTION_4:
        ParentImage: '*\outlook.exe'
    SELECTION_5:
        CommandLine: '*\\\\\*'
    SELECTION_6:
        CommandLine: '*\\\*'
    SELECTION_7:
        CommandLine: '*.exe*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: e212d415-0e93-435f-9e1a-f29005bb4723
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/01/07
references:
- https://github.com/sensepost/ruler
- https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
status: test
tags:
- attack.execution
- attack.t1059
- attack.t1202

