title: UAC Bypass via Windows Firewall Snap-In Hijack
id: 3731e2fa-7531-f1f6-13da-fcb09c218d11
related:
    - id: e52cb31c-10ed-4aea-bcb7-593c9f4a315b
      type: derived
status: test
description: Detects attempts to bypass User Account Control (UAC) by hijacking the Microsoft Management Console (MMC) Windows Firewall snap-in
references:
    - https://www.elastic.co/guide/en/security/current/uac-bypass-via-windows-firewall-snap-in-hijack.html#uac-bypass-via-windows-firewall-snap-in-hijack
author: Tim Rauch, Elastic (idea)
date: 2022-09-27
tags:
    - attack.privilege-escalation
    - attack.t1548
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \mmc.exe
        ParentCommandLine|contains: WF.msc
    filter:
        Image|endswith: \WerFault.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
