title: Use of Scriptrunner.exe
id: 2ad29cdf-eb68-a5e9-69f3-ad54b7ca7066
related:
    - id: 64760eef-87f7-4ed3-93fd-655668ea9420
      type: derived
status: test
description: The "ScriptRunner.exe" binary can be abused to proxy execution through it and bypass possible whitelisting
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Scriptrunner/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-01
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \ScriptRunner.exe
        - OriginalFileName: ScriptRunner.exe
    selection_cli:
        CommandLine|contains: ' -appvscript '
    condition: process_creation and (all of selection*)
falsepositives:
    - Legitimate use when App-v is deployed
level: medium
ruletype: Sigma
