
title: Suspicious MsiExec Embedding Parent
ruletype: Sigma
author: frack113
date: 2022/04/16
description: Adversaries may abuse msiexec.exe to proxy the execution of malicious
  payloads
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    ParentCommandLine: '*Global\MSI0000*'
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\powershell.exe'
    - '*\cmd.exe'
  SELECTION_4:
    ParentCommandLine: '*MsiExec.exe*'
  SELECTION_5:
    ParentCommandLine: '*-Embedding *'
  SELECTION_6:
    Image: '*:\Windows\System32\cmd.exe'
  SELECTION_7:
    CommandLine: '*C:\Program Files\SplunkUniversalForwarder\bin\\*'
  SELECTION_8:
    CommandLine: '*\DismFoDInstall.cmd*'
  SELECTION_9:
    ParentCommandLine: '*\MsiExec.exe -Embedding *'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6 and SELECTION_7) or (SELECTION_8 or SELECTION_9 and SELECTION_10)))
falsepositives:
- Unknown
id: 4a2a2c3e-209f-4d01-b513-4155a540b469
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/07/07
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.t1218.007
- attack.defense_evasion
