title: Execution of Renamed Remote Utilities RAT (RURAT)
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/19
description: Detects execution of renamed Remote Utilities (RURAT) via Product PE
    header field
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Product: Remote Utilities
    SELECTION_4:
        Image:
        - '*\rutserv.exe'
        - '*\rfusclient.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 9ef27c24-4903-4192-881a-3adde7ff92a5
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://redcanary.com/blog/misbehaving-rats/
status: experimental
tags:
- attack.defense_evasion
- attack.collection
- attack.command_and_control
- attack.discovery
- attack.s0592

