title: Suspicious Regsvr32 Execution With Image Extension
ruletype: Sigma
author: frack113
date: 2021/11/29
description: Detects the execution of REGSVR32.exe with DLL files masquerading as
    image files
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\regsvr32.exe'
    SELECTION_4:
        OriginalFileName: \REGSVR32.EXE
    SELECTION_5:
        CommandLine:
        - '*.bmp'
        - '*.cr2'
        - '*.eps'
        - '*.gif'
        - '*.ico'
        - '*.jpeg'
        - '*.jpg'
        - '*.nef'
        - '*.orf'
        - '*.png'
        - '*.raw'
        - '*.sr2'
        - '*.tif'
        - '*.tiff'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 089fc3d2-71e8-4763-a8a5-c97fbb0a403e
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/31
references:
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://guides.lib.umich.edu/c.php?g=282942&p=1885348
related:
-   id: 4aa6040b-3f28-44e3-a769-9208e5feb5ec
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010

