title: Potential Product Reconnaissance Via Wmic.EXE
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/02/14
description: Detects the execution of WMIC in order to get a list of firewall and
    antivirus products
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\wmic.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        CommandLine: '*Product*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 15434e33-5027-4914-88d5-3d4145ec25a9
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2023/03/06/2022-year-in-review/
- https://www.yeahhub.com/list-installed-programs-version-path-windows/
- https://learn.microsoft.com/en-us/answers/questions/253555/software-list-inventory-wmic-product
status: experimental
tags:
- attack.execution
- attack.t1047

