title: CsExec Remote Execution Tool Usage
ruletype: Sigma
author: Florian Roth
date: 2022/08/22
description: Detects the use of the lesser known remote execution tool named CsExec
    (a PsExec alternative)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\csexec.exe'
    SELECTION_4:
        Description: csexec
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: d08a2711-ee8b-4323-bdec-b7d85e892b31
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/malcomvetter/CSExec
- https://www.microsoft.com/security/blog/2022/05/09/ransomware-as-a-service-understanding-the-cybercrime-gig-economy-and-how-to-protect-yourself/
status: experimental
tags:
- attack.develop_capabilities
- attack.t1587.001
- attack.execution
- attack.t1569.002

