title: Adwind RAT / JRAT
ruletype: Sigma
author: Florian Roth, Tom Ueltschi, Jonhnathan Ribeiro, oscd.community
date: 2017/11/10
description: Detects javaw.exe in AppData folder as used by Adwind / JRAT
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*\AppData\Roaming\Oracle*'
    SELECTION_4:
        CommandLine: '*\java*'
    SELECTION_5:
        CommandLine: '*.exe *'
    SELECTION_6:
        CommandLine: '*cscript.exe*'
    SELECTION_7:
        CommandLine: '*Retrive*'
    SELECTION_8:
        CommandLine: '*.vbs *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
id: 1fac1481-2dbc-48b2-9096-753c49b4ec71
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/09/19
references:
- https://www.hybrid-analysis.com/sample/ba86fa0d4b6af2db0656a88b1dd29f36fe362473ae8ad04255c4e52f214a541c?environmentId=100
- https://www.first.org/resources/papers/conf2017/Advanced-Incident-Detection-and-Threat-Hunting-using-Sysmon-and-Splunk.pdf
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007

