title: Use of Mftrace.exe
id: 3d48c9d3-1aa6-418d-98d3-8fd3c01a564e
status: experimental
description: The "Trace log generation tool for Media Foundation Tools" (Mftrace.exe)
    can be used to execute arbitrary binaries
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Mftrace/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/09
tags:
    - attack.defense_evasion
    - attack.t1127
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        -   Image|endswith: \mftrace.exe
        -   OriginalFileName: mftrace.exe
    selection_cli:
        CommandLine|contains: '.exe '
        CommandLine|endswith: .exe
    parent:
        ParentImage|endswith: \mftrace.exe
    condition: process_creation and (all of selection* or parent)
falsepositives:
    - Legitimate use for tracing purposes
level: medium
ruletype: Sigma
