title: Operator Bloopers Cobalt Strike Commands
ruletype: Sigma
author: _pete_0, TheDFIRReport
date: 2022/05/06
description: Detects use of Cobalt Strike commands accidentally entered in the CMD
    shell
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: Cmd.Exe
    SELECTION_4:
        Image: '*\cmd.exe'
    SELECTION_5:
        CommandLine:
        - cmd.exe*
        - c:\windows\system32\cmd.exe*
    SELECTION_6:
        CommandLine:
        - '*psinject*'
        - '*spawnas*'
        - '*make_token*'
        - '*remote-exec*'
        - '*rev2self*'
        - '*dcsync*'
        - '*logonpasswords*'
        - '*execute-assembly*'
        - '*getsystem*'
    SELECTION_7:
        ParentImage: '*\AppData\Local\Programs\Microsoft VS Code\Code.exe'
    SELECTION_8:
        CommandLine: '*/d /s /c *'
    SELECTION_9:
        CommandLine: '*checkfilenameiocs --ioc-path *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8 and
        SELECTION_9)))
falsepositives:
- Unknown
fields:
- CommandLine
id: 647c7b9e-d784-4fda-b9a0-45c565a7b729
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/11
references:
- https://hstechdocs.helpsystems.com/manuals/cobaltstrike/current/userguide/content/cobalt-4-5-user-guide.pdf
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2022/06/16/sans-ransomware-summit-2022-can-you-detect-this/
status: experimental
tags:
- attack.execution
- attack.t1059.003

