title: Parent in Public Folder Suspicious Process
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/02/25
description: This rule detects suspicious processes with parent images located in
    the C:\Users\Public folder
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: C:\Users\Public\\*
    SELECTION_4:
        CommandLine:
        - '*powershell*'
        - '*cmd.exe /c *'
        - '*cmd.exe /r *'
        - '*cmd.exe /k *'
        - '*cmd /c *'
        - '*cmd /r *'
        - '*cmd /k *'
        - '*wscript.exe*'
        - '*cscript.exe*'
        - '*bitsadmin*'
        - '*certutil*'
        - '*mshta.exe*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
id: 69bd9b97-2be2-41b6-9816-fb08757a4d1a
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/18
references:
- https://redcanary.com/blog/blackbyte-ransomware/
status: experimental

