title: Suspicious Elevated System Shell
id: 178e615d-e666-498b-9630-9ed363038101
status: experimental
description: Detects when a shell program such as the windows Command Prompt or PowerShell
    is launched with system privileges.
references:
    - https://github.com/Wh04m1001/SysmonEoP
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
modified: 2023/03/20
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_shell:
        -   Image|endswith:
                - \powershell.exe
                - \pwsh.exe
                - \cmd.exe
        -   OriginalFileName:
                - PowerShell.EXE
                - pwsh.dll
                - Cmd.Exe
    selection_user:
        User|contains:
            - AUTHORI
            - AUTORI
        LogonId: '0x3e7'
    filter_generic:
        ParentImage|startswith:
            - C:\Windows\System32\
            - C:\Program Files (x86)\
            - C:\Program Files\
        Image|endswith:
            - \cmd.exe
            - \powershell.exe
    filter_manageengine:
        ParentImage: C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
        Image|endswith: \cmd.exe
    filter_citrix:
        ParentImage|startswith: C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\
        ParentImage|endswith: \CitrixReceiverUpdater.exe
        Image|endswith: \cmd.exe
    filter_asgard:
        CommandLine|startswith: C:\WINDOWS\system32\cmd.exe /c "
        CurrentDirectory|contains: C:\WINDOWS\Temp\asgard2-agent\
    filter_dell_update:
        ParentImage|startswith: C:\Windows\Temp
        ParentImage|endswith: \invcol.exe
        ParentCommandLine|contains: C:\ProgramData\Dell\UpdateService\
        Image|endswith: \cmd.exe
    filter_compattelrunner:
        ParentImage|startswith: C:\Windows\WinSxS\
        ParentImage|endswith: \CompatTelRunner.exe
        ParentCommandLine|startswith: C:\Windows\system32\CompatTelRunner.exe -m:appraiser.dll
            -f:DoScheduledTelemetryRun
    filter_ibm_spectrumprotect:
        ParentImage|startswith: C:\IBM\SpectrumProtect\webserver\scripts\
        CommandLine|contains: C:\IBM\SpectrumProtect\webserver\scripts\
    filter_empty_parent_1:
        CommandLine: 'powershell.exe -ExecutionPolicy Restricted -Command Write-Host
            ''Final result: 1'';'
    filter_empty_parent_2:
        Image|endswith: \cmd.exe
        CommandLine|contains: /d /c C:\Windows\system32\silcollector.cmd
    filter_empty_parent_3:
        Image|endswith: \cmd.exe
        CommandLine|endswith:
            - cmd.exe /c btool server list replication_port --no-log
            - cmd.exe /c btool server list general --no-log
    filter_empty_parent_4:
        Image|endswith: \cmd.exe
        CommandLine|contains: C:\Windows\system32\reg.exe query hklm\software\microsoft\windows\softwareinventorylogging
            /v collectionstate /reg:64
    filter_empty_parent_5:
        Image: C:\Windows\System32\cmd.exe
        CommandLine: C:\Windows\system32\cmd.exe /c PAUSE
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
