title: Suspicious Execution of Hostname
ruletype: Sigma
author: frack113
date: 2022/01/01
description: Use of hostname to get information
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\HOSTNAME.EXE'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 7be5fb68-f9ef-476d-8b51-0256ebece19e
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/01/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-6---hostname-discovery-windows
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/hostname
status: test
tags:
- attack.discovery
- attack.t1082

