title: Execution in Outlook Temp Folder
ruletype: Sigma
author: Florian Roth
date: 2019/10/01
description: Detects a suspicious program execution in Outlook temp folder
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\Temporary Internet Files\Content.Outlook\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: a018fdc3-46a3-44e5-9afb-2cd4af1d4b39
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
status: test
tags:
- attack.initial_access
- attack.t1566.001

