title: Password Protected Compressed File Extraction Via 7Zip
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/10
description: Detects usage of 7zip utilities (7z.exe, 7za.exe and 7zr.exe) to extract
    password protected zip files.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: '*7-Zip*'
    SELECTION_4:
        Image:
        - '*\7z.exe'
        - '*\7zr.exe'
        - '*\7za.exe'
    SELECTION_5:
        OriginalFileName:
        - 7z.exe
        - 7za.exe
    SELECTION_6:
        CommandLine: '* -p*'
    SELECTION_7:
        CommandLine: '* x *'
    SELECTION_8:
        CommandLine: '* -o*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and (SELECTION_6 and SELECTION_7 and SELECTION_8))
falsepositives:
- Legitimate activity is expected since extracting files with a password can be common
    in some environement.
id: b717b8fd-6467-4d7d-b3d3-27f9a463af77
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://blog.cyble.com/2022/06/07/bumblebee-loader-on-the-rise/
status: experimental
tags:
- attack.collection
- attack.t1560.001

