title: Hiding Files with Attrib.exe
ruletype: Sigma
author: Sami Ruohonen
date: 2019/01/16
description: Detects usage of attrib.exe to hide files from users.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\attrib.exe'
    SELECTION_4:
        OriginalFileName: ATTRIB.EXE
    SELECTION_5:
        CommandLine: '* +h *'
    SELECTION_6:
        CommandLine: '*\desktop.ini *'
    SELECTION_7:
        ParentImage: '*\cmd.exe'
    SELECTION_8:
        CommandLine: +R +H +S +A \\\*.cui
    SELECTION_9:
        ParentCommandLine: C:\\WINDOWS\\system32\\\*.bat
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- IgfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe
    and igfxCUIService.exe is the parent of the cmd.exe)
- Msiexec.exe hiding desktop.ini
fields:
- CommandLine
- ParentCommandLine
- User
id: 4281cb20-2994-4580-aa63-c8b86d019934
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/11/11
status: test
tags:
- attack.defense_evasion
- attack.t1564.001

