title: Suspicious Speech Runtime Binary Child Process
id: d084d371-5898-b71b-5363-bb391e670afc
related:
    - id: 78f10490-f2f4-4d19-a75b-4e0683bf3b8d
      type: derived
status: experimental
description: |
    Detects suspicious Speech Runtime Binary Execution by monitoring its child processes.
    Child processes spawned by SpeechRuntime.exe could indicate an attempt for lateral movement via COM & DCOM hijacking.
references:
    - https://github.com/rtecCyberSec/SpeechRuntimeMove
author: andrewdanis
date: 2025-10-23
logsource:
    category: process_creation
    product: windows
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1021.003
    - attack.t1218
    - sysmon
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \SpeechRuntime.exe
    condition: process_creation and selection
falsepositives:
    - Unlikely.
level: high
ruletype: Sigma
