title: Potential Suspicious Registry File Imported Via Reg.EXE
ruletype: Sigma
author: frack113, Nasreddine Bencherchali
date: 2022/08/01
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe'
    utility
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\reg.exe'
    SELECTION_4:
        OriginalFileName: reg.exe
    SELECTION_5:
        CommandLine: '* import *'
    SELECTION_6:
        CommandLine:
        - '*C:\Users\\*'
        - '*%temp%*'
        - '*%tmp%*'
        - '*%appdata%*'
        - '*\AppData\Local\Temp\\*'
        - '*C:\Windows\Temp\\*'
        - '*C:\ProgramData\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Legitimate import of keys
id: 62e0298b-e994-4189-bc87-bc699aa62d97
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/05
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import
related:
-   id: 73bba97f-a82d-42ce-b315-9182e76c57b1
    type: derived
status: experimental
tags:
- attack.t1112
- attack.defense_evasion

