title: Credential Acquisition via Registry Hive Dumping
ruletype: Sigma
author: Tim Rauch
date: 2022/10/04
description: Detects Credential Acquisition via Registry Hive Dumping
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\reg.exe'
    SELECTION_4:
        CommandLine:
        - '* save *'
        - '* export *'
    SELECTION_5:
        CommandLine:
        - '*hklm\sam*'
        - '*hklm\security*'
        - '*HKEY_LOCAL_MACHINE\SAM*'
        - '*HKEY_LOCAL_MACHINE\SECURITY*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
id: 4d6c9da1-318b-4edf-bcea-b6c93fa98fd0
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.elastic.co/guide/en/security/current/credential-acquisition-via-registry-hive-dumping.html
status: experimental
tags:
- attack.credential_access
- attack.t1003

