title: Suspicious Rundll32 Invoking Inline VBScript
id: dae9779c-fe12-38e4-9c6f-efeca1022e9f
related:
    - id: 1cc50f3f-1fc8-4acf-b2e9-6f172e1fdebd
      type: derived
status: test
description: Detects suspicious process related to rundll32 based on command line that invokes inline VBScript as seen being used by UNC2452
references:
    - https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
author: Florian Roth (Nextron Systems)
date: 2021-03-05
modified: 2022-10-09
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1055
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - rundll32.exe
            - Execute
            - RegRead
            - window.close
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
