title: Wab Execution From Non Default Location
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/12
description: Detects execution of wab.exe (Windows Contacts) and Wabmig.exe (Microsoft
    Address Book Import Tool) from non default locations as seen with bumblebee activity
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\wab.exe'
        - '*\wabmig.exe'
    SELECTION_4:
        Image:
        - C:\Windows\WinSxS\\*
        - C:\Program Files\Windows Mail\\*
        - C:\Program Files (x86)\Windows Mail\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 395907ee-96e5-4666-af2e-2ca91688e151
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/27
references:
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
status: experimental
tags:
- attack.defense_evasion
- attack.execution

