title: Suspicious XOR Encoded PowerShell Command
ruletype: Sigma
author: Sami Ruohonen, Harish Segar, Tim Shelton, Teymur Kheirkhabarov, Vasiliy Burov,
    oscd.community, Nasreddine Bencherchali
date: 2018/09/05
description: Detects presence of a potentially xor encoded powershell command
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        Description: Windows PowerShell
    SELECTION_6:
        Product: PowerShell Core 6
    SELECTION_7:
        CommandLine: '*bxor*'
    SELECTION_8:
        CommandLine:
        - '*ForEach*'
        - '*for(*'
        - '*for *'
        - '*-join *'
        - '*-join''*'
        - '*-join"*'
        - '*-join`*'
        - '*::Join*'
        - '*[char]*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6) and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: bb780e0c-16cf-4383-8383-1e5471db6cf9
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/30
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
- https://redcanary.com/blog/yellow-cockatoo/
- https://zero2auto.com/2020/05/19/netwalker-re/
- https://mez0.cc/posts/cobaltstrike-powershell-exec/
related:
-   id: 5b572dcf-254b-425c-a8c5-d9af6bea35a6
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.001
- attack.t1140
- attack.t1027

