title: ProtocolHandler.exe Downloaded Suspicious File
ruletype: Sigma
author: frack113
date: 2021/07/13
description: Emulates attack via documents through protocol handler in Microsoft Office.
    On successful execution you should see Microsoft Word launch a blank file.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\protocolhandler.exe'
    SELECTION_4:
        OriginalFileName: ProtocolHandler.exe
    SELECTION_5:
        CommandLine: '*"ms-word*'
    SELECTION_6:
        CommandLine: '*.docx"*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 104cdb48-a7a8-4ca7-a453-32942c6e5dcb
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/19
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

