title: Use of Adplus.exe
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/09
description: The "AdPlus.exe" binary that is part of the Windows SDK can be used as
    a lolbin to dump process memory and execute arbitrary commands
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\adplus.exe'
    SELECTION_4:
        OriginalFileName: Adplus.exe
    SELECTION_5:
        CommandLine:
        - '* -hang *'
        - '* -pn *'
        - '* -pmn *'
        - '* -p *'
        - '* -po *'
        - '* -c *'
        - '* -sc *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate usage of Adplus
id: 2f869d59-7f6a-4931-992c-cce556ff2d53
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Adplus/
- https://twitter.com/nas_bench/status/1534916659676422152
- https://twitter.com/nas_bench/status/1534915321856917506
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1003.001

