title: NSudo Tool Execution
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2022/01/24
description: Detects the use of NSudo tool for command execution
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\NSudo.exe'
        - '*\NSudoLC.exe'
        - '*\NSudoLG.exe'
    SELECTION_4:
        OriginalFileName:
        - NSudo.exe
        - NSudoLC.exe
        - NSudoLG.exe
    SELECTION_5:
        CommandLine:
        - '*-U:S *'
        - '*-U:T *'
        - '*-U:E *'
        - '*-P:E *'
        - '*-M:S *'
        - '*-M:H *'
        - '*-U=S *'
        - '*-U=T *'
        - '*-U=E *'
        - '*-P=E *'
        - '*-M=S *'
        - '*-M=H *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate use by administrators
fields:
- CommandLine
- ParentCommandLine
id: 771d1eb5-9587-4568-95fb-9ec44153a012
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/06/07
references:
- https://nsudo.m2team.org/en-us/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
yml_filename: proc_creation_win_tool_nsudo_execution.yml
yml_path: rules/windows/process_creation
---

