title: Psexec Accepteula Condition
ruletype: Sigma
author: omkar72
date: 2020/10/30
description: Detects user accept agreement execution in psexec commandline
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\psexec.exe'
    SELECTION_4:
        CommandLine: '*accepteula*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrative scripts.
fields:
- Image
- CommandLine
id: 730fc21b-eaff-474b-ad23-90fd265d4988
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/06/23
references:
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
status: test
tags:
- attack.execution
- attack.t1569
- attack.t1021
yml_filename: proc_creation_win_susp_psexec_eula.yml
yml_path: rules/windows/process_creation
---

