title: Suspicious Active Directory Database Snapshot Via ADExplorer
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/14
description: Detects the execution of Sysinternals ADExplorer with the "-snapshot"
    flag in order to save a local copy of the active directory database to a suspicious
    directory.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\ADExplorer.exe'
    SELECTION_4:
        OriginalFileName: AdExp
    SELECTION_5:
        CommandLine: '*snapshot*'
    SELECTION_6:
        CommandLine:
        - '*\Downloads\\*'
        - '*\Users\Public\\*'
        - '*\AppData\\*'
        - '*\Windows\Temp\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unknown
id: ef61af62-bc74-4f58-b49b-626448227652
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
related:
-   id: 9212f354-7775-4e28-9c9f-8f0a4544e664
    type: derived
status: experimental
tags:
- attack.credential_access
- attack.t1552.001
- attack.t1003.003

