title: Control Panel Items
ruletype: Sigma
author: Kyaw Min Thein, Furkan Caliskan (@caliskanfurkan_)
date: 2020/06/22
description: Detects the malicious use of a control panel item
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*igfxCPL.cpl*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\reg.exe'
    SELECTION_4:
        CommandLine: '*add*'
    SELECTION_5:
        CommandLine: '*CurrentVersion\Control Panel\CPLs*'
    SELECTION_6:
        CommandLine: '*.cpl'
    SELECTION_7:
        CommandLine:
        - '*\System32\\*'
        - '*%System%*'
    SELECTION_8:
        CommandLine: '*regsvr32 *'
    SELECTION_9:
        CommandLine: '* /s *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and  not ((SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10)))))
falsepositives:
- Unknown
id: 0ba863e6-def5-4e50-9cea-4dd8c7dc46a4
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/11
references:
- https://attack.mitre.org/techniques/T1196/
- https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218.002
- attack.persistence
- attack.t1546

