title: Renamed PAExec
ruletype: Sigma
author: Florian Roth
date: 2021/05/22
description: Detects execution of renamed version of PAExec. Often used by attackers
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: PAExec Application
    SELECTION_4:
        OriginalFileName: PAExec.exe
    SELECTION_5:
        Image: '*\paexec.exe'
    SELECTION_6:
        Image: C:\Windows\PAExec-*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5 or SELECTION_6))
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PAExec with their software and rename it, so that
    it is less embarrassing
- When executed with the "-s" flag. PAExec will copy itself to the "C:\Windows\" directory
    with a different name. Usually like this "PAExec-[XXXXX]-[ComputerName]"
id: c4e49831-1496-40cf-8ce1-b53f942b02f9
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/26
references:
- https://www.poweradmin.com/paexec/
status: test
tags:
- attack.defense_evasion
- attack.t1202

