title: Possible Privilege Escalation via Weak Service Permissions
ruletype: Sigma
author: Teymur Kheirkhabarov
date: 2019/10/26
description: Detection of sc.exe utility spawning by user with Medium integrity level
    to change service ImagePath or FailureCommand
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\sc.exe'
    SELECTION_4:
        IntegrityLevel: Medium
    SELECTION_5:
        CommandLine: '*config*'
    SELECTION_6:
        CommandLine: '*binPath*'
    SELECTION_7:
        CommandLine: '*failure*'
    SELECTION_8:
        CommandLine: '*command*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: d937b75f-a665-4480-88a5-2f20e9f9b22a
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://pentestlab.blog/2017/03/30/weak-service-permissions/
status: test
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.011

