title: Proxy Execution Via Explorer.exe
id: 8d4e21c0-9bec-56e9-925f-1657e2356ac5
related:
    - id: 9eb271b9-24ae-4cd4-9465-19cfc1047f3e
      type: derived
status: test
description: Attackers can use explorer.exe for evading defense mechanisms
references:
    - https://twitter.com/CyberRaiju/status/1273597319322058752
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
date: 2020/10/05
modified: 2021/11/27
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \explorer.exe
        ParentImage|endswith: \cmd.exe
        CommandLine|contains: explorer.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate explorer.exe run from cmd.exe
level: low
ruletype: Sigma
