title: Cscript/Wscript Uncommon Script Extension Execution
id: 99b7460d-c9f1-40d7-a316-1f36f61d52ee
status: experimental
description: Detects Wscript/Cscript executing a file with an uncommon (i.e. non-script)
    extension
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/15
modified: 2023/06/19
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        -   OriginalFileName:
                - wscript.exe
                - cscript.exe
        -   Image|endswith:
                - \wscript.exe
                - \cscript.exe
    selection_extension:
        CommandLine|contains:
            - .csv
            - .dat
            - .doc
            - .gif
            - .jpeg
            - .jpg
            - .png
            - .ppt
            - .txt
            - .xls
            - .xml
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
