title: Suspicious LOLBIN AccCheckConsole
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/06
description: Detects suspicious LOLBIN AccCheckConsole execution with parameters as
    used to load an arbitrary DLL
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\AccCheckConsole.exe'
    SELECTION_4:
        OriginalFileName: AccCheckConsole.exe
    SELECTION_5:
        CommandLine: '* -window *'
    SELECTION_6:
        CommandLine: '*.dll*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Legitimate use of the UI Accessibility Checker
id: 0f6da907-5854-4be6-859a-e9958747b0aa
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://gist.github.com/bohops/2444129419c8acf837aedda5f0e7f340
- https://twitter.com/bohops/status/1477717351017680899?s=12
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/AccCheckConsole/
status: test
tags:
- attack.execution

