title: Suspicious Binary In User Directory Spawned From Office Application
ruletype: Sigma
author: Jason Lynch
date: 2019/04/02
description: Detects an executable in the users directory started from one of the
    Microsoft Office suite applications (Word, Excel, PowerPoint, Publisher, Visio)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\WINWORD.EXE'
        - '*\EXCEL.EXE'
        - '*\POWERPNT.exe'
        - '*\MSPUB.exe'
        - '*\VISIO.exe'
        - '*\MSACCESS.exe'
        - '*\EQNEDT32.exe'
    SELECTION_4:
        Image: C:\users\\*
    SELECTION_5:
        Image: '*.exe'
    SELECTION_6:
        Image: '*\Teams.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: aa3a6f94-890e-4e22-b634-ffdfd54792cc
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://blog.morphisec.com/fin7-not-finished-morphisec-spots-new-campaign
- https://www.virustotal.com/gui/file/23160972c6ae07f740800fa28e421a81d7c0ca5d5cab95bc082b4a986fbac57
status: experimental
tags:
- attack.execution
- attack.t1204.002
- attack.g0046
- car.2013-05-002

