title: Replace.exe Usage
id: 9292293b-8496-4715-9db6-37028dcda4b3
status: test
description: Detects the use of Replace.exe which can be used to replace file with another file
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Replace/
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/replace
author: frack113
date: 2022/03/06
modified: 2022/06/22
tags:
    - attack.command_and_control
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \replace.exe
    argument:
        CommandLine|contains:
            - /a
            - -a
    condition: process_creation and (selection and argument)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
