title: Maze Ransomware
ruletype: Sigma
author: Florian Roth
date: 2020/05/08
description: Detects specific process characteristics of Maze ransomware word document
    droppers
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\WINWORD.exe'
    SELECTION_4:
        Image: '*.tmp'
    SELECTION_5:
        Image: '*\wmic.exe'
    SELECTION_6:
        ParentImage: '*\Temp\\*'
    SELECTION_7:
        CommandLine: '*shadowcopy delete'
    SELECTION_8:
        CommandLine: '*shadowcopy delete'
    SELECTION_9:
        CommandLine: '*\..\..\system32*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Unlikely
fields:
- ComputerName
- User
- Image
id: 29fd07fc-9cfd-4331-b7fd-cc18dfa21052
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2021/06/27
references:
- https://www.fireeye.com/blog/threat-research/2020/05/tactics-techniques-procedures-associated-with-maze-ransomware-incidents.html
- https://app.any.run/tasks/51e7185c-52d7-4efb-ac0d-e86340053473/
- https://app.any.run/tasks/65a79440-373a-4725-8d74-77db9f2abda4/
status: test
tags:
- attack.execution
- attack.t1204.002
- attack.t1047
- attack.impact
- attack.t1490

