title: Launch DirLister Executable
ruletype: Sigma
author: frack113
date: 2022/08/20
description: Detect use of DirLister.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: DirLister.exe
    SELECTION_4:
        Image: '*\dirlister.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use
id: b4dc61f5-6cce-468e-a608-b48b469feaa2
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1083/T1083.md
status: experimental
tags:
- attack.discovery
- attack.t1083

