title: RunXCmd Tool Execution As System
ruletype: Sigma
author: Florian Roth
date: 2022/01/24
description: Detects the use of RunXCmd tool for command execution
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '* /account=system *'
    SELECTION_4:
        CommandLine: '*/exec=*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use by administrators
fields:
- CommandLine
- ParentCommandLine
id: 93199800-b52a-4dec-b762-75212c196542
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.d7xtech.com/free-software/runx/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
yml_filename: proc_creation_win_tool_runx_as_system.yml
yml_path: rules/windows/process_creation
---

