title: Email Exifiltration Via Powershell
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems),  Azure-Sentinel (idea)
date: 2022/09/09
description: Detects email exfiltration via powershell cmdlets
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        CommandLine: '*Add-PSSnapin*'
    SELECTION_5:
        CommandLine: '*Get-Recipient*'
    SELECTION_6:
        CommandLine: '*-ExpandProperty*'
    SELECTION_7:
        CommandLine: '*EmailAddresses*'
    SELECTION_8:
        CommandLine: '*SmtpAddress*'
    SELECTION_9:
        CommandLine: '*-hidetableheaders*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9)
falsepositives:
- Unknown
id: 312d0384-401c-4b8b-abdf-685ffba9a332
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.microsoft.com/security/blog/2022/09/07/profiling-dev-0270-phosphorus-ransomware-operations/
- https://github.com/Azure/Azure-Sentinel/blob/7e6aa438e254d468feec061618a7877aa528ee9f/Hunting%20Queries/Microsoft%20365%20Defender/Ransomware/DEV-0270/Email%20data%20exfiltration%20via%20PowerShell.yaml
status: experimental
tags:
- attack.exfiltration

