title: Suspicious Curl Download And Execute Combination
ruletype: Sigma
author: Sreeman, Nasreddine Bencherchali
date: 2020/01/13
description: Adversaries can use curl to download payloads remotely and execute them.
    Curl is included by default in Windows 10 build 17063 and later.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '* /c *'
    SELECTION_4:
        CommandLine: '*curl *'
    SELECTION_5:
        CommandLine: '*http*'
    SELECTION_6:
        CommandLine: '*-o*'
    SELECTION_7:
        CommandLine: '*&*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Administrative scripts (installers)
fields:
- ParentImage
- CommandLine
id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
status: test
tags:
- attack.execution
- attack.t1218
- attack.command_and_control
- attack.t1105

