title: Suspicious WMIC Execution - ProcessCallCreate
ruletype: Sigma
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali
date: 2020/10/12
description: Detects WMIC executing "process call create" with suspicious calls to
    processes such as "rundll32", "regsrv32"...etc
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*process *'
    SELECTION_4:
        CommandLine: '*call *'
    SELECTION_5:
        CommandLine: '*create *'
    SELECTION_6:
        CommandLine:
        - '*rundll32*'
        - '*bitsadmin*'
        - '*regsvr32*'
        - '*cmd.exe /c *'
        - '*cmd.exe /k *'
        - '*cmd.exe /r *'
        - '*cmd /c *'
        - '*cmd /k *'
        - '*cmd /r *'
        - '*powershell*'
        - '*pwsh*'
        - '*certutil*'
        - '*cscript*'
        - '*wscript*'
        - '*mshta*'
        - '*\Users\Public\\*'
        - '*\Windows\Temp\\*'
        - '*\AppData\Local\\*'
        - '*%temp%*'
        - '*%tmp%*'
        - '*%ProgramData%*'
        - '*%appdata%*'
        - '*%comspec%*'
        - '*%localappdata%*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/18
references:
- https://thedfirreport.com/2020/10/08/ryuks-return/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
status: test
tags:
- attack.execution
- attack.t1047

