title: Suspicious Vsls-Agent Command With AgentExtensionPath Load
id: d3e56f32-608e-6dd1-318e-f176f1505af2
related:
    - id: 43103702-5886-11ed-9b6a-0242ac120002
      type: derived
status: test
description: Detects Microsoft Visual Studio vsls-agent.exe lolbin execution with a suspicious library load using the --agentExtensionPath parameter
references:
    - https://twitter.com/bohops/status/1583916360404729857
author: bohops
date: 2022-10-30
tags:
    - attack.defense-evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \vsls-agent.exe
        CommandLine|contains: --agentExtensionPath
    filter:
        CommandLine|contains: Microsoft.VisualStudio.LiveShare.Agent.
    condition: process_creation and (selection and not filter)
falsepositives:
    - False positives depend on custom use of vsls-agent.exe
level: medium
ruletype: Sigma
