title: OilRig APT Activity
ruletype: Sigma
author: Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy,
    oscd.community
date: 2018/03/23
description: Detects OilRig activity as reported by Nyotron in their March 2018 report
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        CommandLine: '*nslookup.exe*'
    SELECTION_11:
        CommandLine: '*-q=TXT*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*SC Scheduled Scan*'
    SELECTION_4:
        CommandLine: '*\microsoft\Taskbar\autoit3.exe*'
    SELECTION_5:
        Image: '*\Windows\Temp\DB\\*'
    SELECTION_6:
        Image: '*.exe'
    SELECTION_7:
        Image: C:\Windows\system32\Service.exe
    SELECTION_8:
        CommandLine:
        - '*i*'
        - '*u*'
    SELECTION_9:
        ParentImage: '*\local\microsoft\Taskbar\autoit3.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10 and SELECTION_11)))
falsepositives:
- Unlikely
id: ce6e34ca-966d-41c9-8d93-5b06c8b97a06
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/03/08
references:
- https://web.archive.org/web/20180402134442/https://nyotron.com/wp-content/uploads/2018/03/Nyotron-OilRig-Malware-Report-March-2018C.pdf
related:
-   id: 53ba33fd-3a50-4468-a5ef-c583635cfa92
    type: similar
-   id: c0580559-a6bd-4ef6-b9b7-83703d98b561
    type: similar
-   id: 7bdf2a7c-3acc-4091-9581-0a77dad1c5b5
    type: similar
status: test
tags:
- attack.persistence
- attack.g0049
- attack.t1053.005
- attack.s0111
- attack.t1543.003
- attack.defense_evasion
- attack.t1112
- attack.command_and_control
- attack.t1071.004

