title: Use of OpenConsole
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/16
description: Detects usage of OpenConsole binary as a LOLBIN to launch other binaries
    to bypass application Whitelisting
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: OpenConsole.exe
    SELECTION_4:
        Image: '*\OpenConsole.exe'
    SELECTION_5:
        Image: C:\Program Files\WindowsApps\Microsoft.WindowsTerminal*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Legitimate use by an administrator
id: 814c95cc-8192-4378-a70a-f1aafd877af1
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/nas_bench/status/1537563834478645252
status: experimental
tags:
- attack.execution
- attack.t1059

