title: File Decryption Using Gpg4win
id: 99236f79-3f27-98b9-8e3b-098189b78b6e
related:
    - id: 037dcd71-33a8-4392-bb01-293c94663e5a
      type: derived
status: test
description: Detects usage of Gpg4win to decrypt files
references:
    - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
    - https://www.gpg4win.de/documentation.html
    - https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
author: Nasreddine Bencherchali (Nextron Systems)
date: '2023-08-09'
tags:
    - attack.execution
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_metadata:
        - Image|endswith:
              - \gpg.exe
              - \gpg2.exe
        - Description: GnuPG’s OpenPGP tool
    selection_cli:
        CommandLine|contains|all:
            - ' -d '
            - passphrase
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
