title: Suspicious DIR Execution
ruletype: Sigma
author: frack113
date: 2021/12/13
description: Detects usage of the "dir" command that's part of windows batch/cmd to
    collect information about directories
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*dir *'
    SELECTION_4:
        CommandLine: '* /s*'
    SELECTION_5:
        CommandLine: '* /b*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/07/11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
status: experimental
tags:
- attack.discovery
- attack.t1217
yml_filename: proc_creation_win_susp_dir.yml
yml_path: rules/windows/process_creation
---

