title: Suspicious Rundll32 Without Any CommandLine Params
ruletype: Sigma
author: Florian Roth
date: 2021/05/27
description: Detects suspicious start of rundll32.exe without any parameters as found
    in CobaltStrike beacon activity
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '*\rundll32.exe'
    SELECTION_4:
        ParentImage: '*\svchost.exe'
    SELECTION_5:
        ParentImage:
        - '*\AppData\Local\\*'
        - '*\Microsoft\Edge\\*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5)))
falsepositives:
- Possible but rare
fields:
- ParentImage
- ParentCommandLine
id: 1775e15e-b61b-4d14-a1a3-80981298085a
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/06
references:
- https://www.cobaltstrike.com/help-opsec
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

