title: PUA - NPS Tunneling Tool Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/10/08
description: Detects the use of NPS, a port forwarding and intranet penetration proxy
    server
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_10:
        sha1: cea49e9b9b67f3a13ad0be1c2655293ea3c18181
    SELECTION_11:
        sha256: 5a456283392ffceeeaca3d3426c306eb470304637520d72fed1cc1febbbd6856
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\npc.exe'
    SELECTION_4:
        CommandLine: '* -server=*'
    SELECTION_5:
        CommandLine: '* -vkey=*'
    SELECTION_6:
        CommandLine: '* -password=*'
    SELECTION_7:
        CommandLine: '* -config=npc*'
    SELECTION_8:
        Hashes:
        - '*MD5=AE8ACF66BFE3A44148964048B826D005*'
        - '*SHA1=CEA49E9B9B67F3A13AD0BE1C2655293EA3C18181*'
        - '*SHA256=5A456283392FFCEEEACA3D3426C306EB470304637520D72FED1CC1FEBBBD6856*'
    SELECTION_9:
        md5: ae8acf66bfe3a44148964048b826d005
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5 and SELECTION_6) or SELECTION_7 or (SELECTION_8 or SELECTION_9
        or SELECTION_10 or SELECTION_11)))
falsepositives:
- Legitimate use
id: 68d37776-61db-42f5-bf54-27e87072d17e
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://github.com/ehang-io/nps
status: experimental
tags:
- attack.command_and_control
- attack.t1090

