title: Suspicious Process Execution From Fake Recycle.Bin Folder
id: b0dc3a39-53c3-0604-1de1-84fb255eeb44
related:
    - id: cd8b36ac-8e4a-4c2f-a402-a29b8fbd5bca
      type: derived
    - id: 5ce0f04e-3efc-42af-839d-5b3a543b76c0
      type: derived
status: test
description: Detects process execution from a fake recycle bin folder, often used to avoid security solution.
references:
    - https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
    - https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
author: X__Junior (Nextron Systems)
date: '2023-07-12'
modified: '2023-12-11'
tags:
    - attack.persistence
    - attack.defense-evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|contains:
            # e.g. C:\$RECYCLER.BIN
            - RECYCLERS.BIN\
            - RECYCLER.BIN\
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
