title: Suspicious X509Enrollment - Process Creation
id: 146e1bb5-f3e9-7594-7e61-4cb291f3f72a
related:
    - id: 504d63cb-0dba-4d02-8531-e72981aace2c
      type: similar
    - id: 114de787-4eb2-48cc-abdb-c0b449f93ea4
      type: derived
status: test
description: Detect use of X509Enrollment
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
    - https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
author: frack113
date: '2022-12-23'
tags:
    - attack.defense-evasion
    - attack.t1553.004
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains:
            - X509Enrollment.CBinaryConverter
            - 884e2002-217d-11da-b2a4-000e7bbb2b09
    condition: process_creation and selection
falsepositives:
    - Legitimate administrative script
level: medium
ruletype: Sigma
