title: Run from a Zip File
ruletype: Sigma
author: frack113
date: 2021/12/26
description: Payloads may be compressed, archived, or encrypted in order to avoid
    detection
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*.zip\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 1a70042a-6622-4a2b-8958-267625349abf
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-4---execution-from-compressed-file
status: test
tags:
- attack.impact
- attack.t1485

