title: PUA - RunXCmd Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/24
description: Detects the use of the RunXCmd tool to execute commands with System or
    TrustedInstaller accounts
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '* /account=system *'
        - '* /account=ti *'
    SELECTION_4:
        CommandLine: '*/exec=*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use by administrators
fields:
- CommandLine
- ParentCommandLine
id: 93199800-b52a-4dec-b762-75212c196542
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://www.d7xtech.com/free-software/runx/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
status: test
tags:
- attack.execution
- attack.t1569.002
- attack.s0029

