title: Conhost Spawned By Uncommon Parent Process
ruletype: Sigma
author: Tim Rauch
date: 2022/09/28
description: Detects when the Console Window Host (conhost.exe) process is spawned
    by an uncommon parent process, which could be indicative of potential code injection
    activity.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\conhost.exe'
    SELECTION_4:
        ParentImage:
        - '*\svchost.exe'
        - '*\lsass.exe'
        - '*\services.exe'
        - '*\smss.exe'
        - '*\winlogon.exe'
        - '*\explorer.exe'
        - '*\rundll32.exe'
        - '*\regsvr32.exe'
        - '*\userinit.exe'
        - '*\wininit.exe'
        - '*\spoolsv.exe'
    SELECTION_5:
        ParentCommandLine:
        - '*-k apphost -s AppHostSvc*'
        - '*-k imgsvc*'
        - '*-k localService -p -s RemoteRegistry*'
        - '*-k LocalSystemNetworkRestricted -p -s NgcSvc*'
        - '*-k NetSvcs -p -s NcaSvc*'
        - '*-k netsvcs -p -s NetSetupSvc*'
        - '*-k netsvcs -p -s wlidsvc*'
        - '*-k NetworkService -p -s DoSvc*'
        - '*-k wsappx -p -s AppXSvc*'
        - '*-k wsappx -p -s ClipSVC*'
    SELECTION_6:
        ParentCommandLine:
        - '*C:\Program Files (x86)\Dropbox\Client\\*'
        - '*C:\Program Files\Dropbox\Client\\*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5))) and  not ((SELECTION_6)))
falsepositives:
- Unknown
id: cbb9e3d1-2386-4e59-912e-62f1484f7a89
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/29
references:
- https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html
status: experimental
tags:
- attack.execution
- attack.t1059

