title: PowerShell Script Run in AppData
ruletype: Sigma
author: Florian Roth, Jonhnathan Ribeiro, oscd.community
date: 2019/01/09
description: Detects a suspicious command line execution that invokes PowerShell with
    reference to an AppData folder
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*powershell.exe*'
        - '*\powershell*'
        - '*\pwsh*'
        - '*pwsh.exe*'
    SELECTION_4:
        CommandLine: '*/c *'
    SELECTION_5:
        CommandLine: '*\AppData\\*'
    SELECTION_6:
        CommandLine:
        - '*Local\\*'
        - '*Roaming\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Administrative scripts
id: ac175779-025a-4f12-98b0-acdaeb77ea85
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://twitter.com/JohnLaTwC/status/1082851155481288706
- https://app.any.run/tasks/f87f1c4e-47e2-4c46-9cf4-31454c06ce03
status: experimental
tags:
- attack.execution
- attack.t1059.001
yml_filename: proc_creation_win_susp_ps_appdata.yml
yml_path: rules/windows/process_creation
---

