title: Tap Installer Execution
ruletype: Sigma
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunneling techniques
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\tapinstall.exe'
    SELECTION_4:
        Image:
        - C:\Program Files\Avast Software\SecureLine VPN\tapinstall.exe
        - C:\Program Files (x86)\Avast Software\SecureLine VPN\tapinstall.exe
    SELECTION_5:
        Image: C:\Program Files\OpenVPN Connect\drivers\tap\\*
    SELECTION_6:
        Image: C:\Program Files (x86)\Proton Technologies\ProtonVPNTap\installer\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6)))
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 99793437-3e16-439b-be0f-078782cf953d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/13
status: test
tags:
- attack.exfiltration
- attack.t1048

