title: Suspicious IIS Module Registration
ruletype: Sigma
author: Florian Roth (rule), Microsoft (idea)
date: 2022/08/04
description: Detects a suspicious IIS module registration as described in Microsoft
    threat report on IIS backdoors
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\w3wp.exe'
    SELECTION_4:
        CommandLine: '*appcmd.exe add module*'
    SELECTION_5:
        CommandLine: '* system.enterpriseservices.internal.publish*'
    SELECTION_6:
        Image: '*\powershell.exe'
    SELECTION_7:
        CommandLine: '*gacutil*'
    SELECTION_8:
        CommandLine: '* /I*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Administrative activity
id: 043c4b8b-3a54-4780-9682-081cb6b8185c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/23
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
status: test

