title: Windows Suspicious Use Of Web Request in CommandLine
ruletype: Sigma
author: James Pemberton / @4A616D6573
date: 2019/10/24
description: Detects the use of various web request with commandline tools or Windows
    PowerShell command,methods (including aliases)
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*Invoke-WebRequest*'
        - '*iwr *'
        - '*wget *'
        - '*curl *'
        - '*Net.WebClient*'
        - '*Start-BitsTransfer*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
id: 9fc51a3c-81b3-4fa7-b35f-7c02cf10fd2d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/09/21
references:
- https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
- https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
status: experimental
tags:
- attack.execution
- attack.t1059.001
yml_filename: proc_creation_win_susp_web_request_cmd.yml
yml_path: rules/windows/process_creation
---

