title: Suspicious Invoke-WebRequest Usage
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/02
description: Detects a suspicious call to Invoke-WebRequest cmdlet where the and output
    is located in a suspicious location
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
    SELECTION_4:
        CommandLine:
        - '*Invoke-WebRequest*'
        - '*iwr *'
        - '*wget *'
        - '*curl *'
    SELECTION_5:
        CommandLine:
        - '* -ur*'
        - '* -o*'
    SELECTION_6:
        CommandLine:
        - '*\AppData\\*'
        - '*\Users\Public\\*'
        - '*\Temp\\*'
        - '*%AppData%*'
        - '*%Temp%*'
        - '*%tmp%*'
        - '*%Public%*'
        - '*\Desktop\\*'
        - '*C:\Windows\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 5e3cc4d8-3e68-43db-8656-eaaeefdec9cc
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/13
references:
- https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
related:
-   id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
    type: derived
status: experimental
tags:
- attack.command_and_control
- attack.t1105

