title: Custom Class Execution via Xwizard
id: ef87b83c-e3f0-6c96-c5ec-0c1155bd0c39
related:
    - id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
      type: derived
status: test
description: Detects the execution of Xwizard tool with specific arguments which utilized to run custom class properties.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
author: Ensar Şamil, @sblmsrsn, @oscd_initiative
date: 2020/10/07
modified: 2021/11/27
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \xwizard.exe
        CommandLine|re: \{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\}
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
