title: File Download And Execution Via IEExec.EXE
id: 4674f642-72ad-cd0f-5873-922fe4afbf9e
related:
    - id: 9801abb8-e297-4dbf-9fbd-57dde0e830ad
      type: derived
status: test
description: Detects execution of the IEExec utility to download and execute files
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ieexec/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-05-16
modified: 2023-11-09
tags:
    - attack.command-and-control
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \IEExec.exe
        - OriginalFileName: IEExec.exe
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
