title: Curl.EXE Execution With Custom UserAgent
ruletype: Sigma
author: frack113
date: 2022/01/23
description: Detects execution of curl.exe with custom useragent options
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\curl.exe'
    SELECTION_4:
        Product: The curl executable
    SELECTION_5:
        CommandLine:
        - '* -A *'
        - '* --user-agent *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: 3286d37a-00fd-41c2-a624-a672dcd34e60
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://curl.se/docs/manpage.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#atomic-test-2---malicious-user-agents---cmd
status: test
tags:
- attack.command_and_control
- attack.t1071.001

