
title: New Kernel Driver Via SC.EXE
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/14
description: Detects creation of a new service (kernel driver) with the type "kernel"
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\sc.exe'
  SELECTION_4:
    CommandLine:
    - '*create*'
    - '*config*'
  SELECTION_5:
    CommandLine: '*binPath=*'
  SELECTION_6:
    CommandLine: '*type=*'
  SELECTION_7:
    CommandLine: '*kernel*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate installation of drivers via sc.exe
id: 431a1fdb-4799-4f3b-91c3-a683b003fc49
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.aon.com/cyber-solutions/aon_cyber_labs/yours-truly-signed-av-driver-weaponizing-an-antivirus-driver/
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
