title: HackTool - SILENTTRINITY Stager Execution
ruletype: Sigma
author: Aleksey Potapov, oscd.community
date: 2019/10/22
description: Detects SILENTTRINITY stager use via PE metadata
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: '*st2stager*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 03552375-cc2c-4883-bbe4-7958d5a980be
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/13
references:
- https://github.com/byt3bl33d3r/SILENTTRINITY
status: test
tags:
- attack.command_and_control
- attack.t1071

