title: Suspicious PowerShell Invocation From Script Engines
ruletype: Sigma
author: Florian Roth
date: 2019/01/16
description: Detects suspicious powershell invocations from interpreters or unusual
    programs
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage:
        - '*\wscript.exe'
        - '*\cscript.exe'
    SELECTION_4:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_5:
        CurrentDirectory: '*\Health Service State\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5)))
falsepositives:
- Microsoft Operations Manager (MOM)
- Other scripts
id: 95eadcb2-92e4-4ed1-9031-92547773a6db
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/05
references:
- https://www.securitynewspaper.com/2017/03/20/attackers-leverage-excel-powershell-dns-latest-non-malware-attack/
status: test
tags:
- attack.execution
- attack.t1059.001

