title: Recon Activity with NLTEST
ruletype: Sigma
author: Craig Young, oscd.community, Georg Lauenstein
date: 2021/07/24
description: Detects nltest commands that can be used for information discovery
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\nltest.exe'
    SELECTION_4:
        OriginalFileName: nltestrk.exe
    SELECTION_5:
        CommandLine: '*/server*'
    SELECTION_6:
        CommandLine: '*/query*'
    SELECTION_7:
        CommandLine:
        - '*/dclist:*'
        - '*/parentdomain*'
        - '*/domain_trusts*'
        - '*/trusted_domains*'
        - '*/user*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or SELECTION_7))
falsepositives:
- Legitimate administration use but user must be check out
fields:
- Image
- User
- CommandLine
- ParentCommandLine
id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/22
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
- https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/
- https://attack.mitre.org/techniques/T1482/
- https://attack.mitre.org/techniques/T1016/
- https://book.hacktricks.xyz/windows/basic-cmd-for-pentesters
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
status: experimental
tags:
- attack.discovery
- attack.t1016
- attack.t1482

