title: Active Directory Structure Export Via Csvde.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/14
description: Detects the execution of "csvde.exe" in order to export organizational
    Active Directory structure.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\csvde.exe'
    SELECTION_4:
        OriginalFileName: csvde.exe
    SELECTION_5:
        CommandLine: '* -f*'
    SELECTION_6:
        CommandLine: '* -i*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6)))
falsepositives:
- Unknown
id: e5d36acd-acb4-4c6f-a13f-9eb203d50099
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://www.cybereason.com/blog/research/operation-ghostshell-novel-rat-targets-global-aerospace-and-telecoms-firms
- https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
- https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit
status: experimental
tags:
- attack.exfiltration

