title: PowerShell Base64 Encoded FromBase64String Cmdlet
id: fbce213c-fa8b-18cb-f700-0740a878da40
related:
    - id: fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c
      type: derived
status: test
description: Detects usage of a base64 encoded "FromBase64String" cmdlet in a process command line
references:
    - Internal Research
author: Florian Roth (Nextron Systems)
date: '2019-08-24'
modified: '2023-04-06'
tags:
    - attack.defense-evasion
    - attack.t1140
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - CommandLine|base64offset|contains: ::FromBase64String
        # UTF-16 LE
        - CommandLine|contains:
              - OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA
              - oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA
              - 6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
