title: Suspicious Recursif Takeown
ruletype: Sigma
author: frack113
date: 2022/01/30
description: Adversaries can interact with the DACLs using built-in Windows commands
    takeown which can grant adversaries higher permissions on specific files and folders
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\takeown.exe'
    SELECTION_4:
        CommandLine: '*/f *'
    SELECTION_5:
        CommandLine: '*/r*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: 554601fb-9b71-4bcc-abf4-21a611be4fde
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/takeown
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md#atomic-test-1---take-ownership-using-takeown-utility
status: experimental
tags:
- attack.defense_evasion
- attack.t1222.001
yml_filename: proc_creation_win_susp_takeown.yml
yml_path: rules/windows/process_creation
---

