title: WMIC Unquoted Services Path Lookup
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/20
description: Detects wmic known recon method to look for unquoted service paths, often
    used by pentest and attackers enum scripts
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: wmic.exe
    SELECTION_4:
        Image: '*\WMIC.exe'
    SELECTION_5:
        CommandLine: '* service *'
    SELECTION_6:
        CommandLine: '* get *'
    SELECTION_7:
        CommandLine:
        - '*name*'
        - '*displayname*'
        - '*pathname*'
        - '*startmode*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
id: 68bcd73b-37ef-49cb-95fc-edc809730be6
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
- https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
related:
-   id: 09658312-bc27-4a3b-91c5-e49ab9046d1b
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1047

