title: Suspicious Runscripthelper.exe
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects execution of powershell scripts via Runscripthelper.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\Runscripthelper.exe'
    SELECTION_4:
        CommandLine: '*surfacecheck*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- CommandLine
id: eca49c87-8a75-4f13-9c73-a5a29e845f03
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/11
references:
- https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/
status: test
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202
yml_filename: proc_creation_win_susp_runscripthelper.yml
yml_path: rules/windows/process_creation
---

