title: Elevated System Shell Spawned
id: 178e615d-e666-498b-9630-9ed363038101
status: experimental
description: Detects when a shell program such as the Windows command prompt or PowerShell
    is launched with system privileges.
references:
    - https://github.com/Wh04m1001/SysmonEoP
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
modified: 2023/10/11
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_shell:
        -   Image|endswith:
                - \powershell.exe
                - \pwsh.exe
                - \cmd.exe
        -   OriginalFileName:
                - PowerShell.EXE
                - pwsh.dll
                - Cmd.Exe
    selection_user:
        User|contains:
            - AUTHORI
            - AUTORI
        LogonId: '0x3e7'
    filter_main_generic:
        ParentImage|contains:
            - :\Windows\System32\
            - :\Program Files (x86)\
            - :\Program Files\
        Image|endswith:
            - \cmd.exe
            - \powershell.exe
    filter_optional_manageengine:
        ParentImage|endswith: :\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
        Image|endswith: \cmd.exe
    filter_optional_citrix:
        ParentImage|contains: :\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\
        ParentImage|endswith: \CitrixReceiverUpdater.exe
        Image|endswith: \cmd.exe
    filter_optional_asgard:
        CommandLine|contains: :\WINDOWS\system32\cmd.exe /c "
        CurrentDirectory|contains: :\WINDOWS\Temp\asgard2-agent\
    filter_optional_dell_update:
        ParentImage|contains: :\Windows\Temp
        ParentImage|endswith: \invcol.exe
        ParentCommandLine|contains: :\ProgramData\Dell\UpdateService\
        Image|endswith: \cmd.exe
    filter_main_compattelrunner:
        ParentImage|contains:
            - :\Windows\System32
            - :\Windows\WinSxS\
        ParentImage|endswith: \CompatTelRunner.exe
        ParentCommandLine|contains: :\Windows\system32\CompatTelRunner.exe -m:appraiser.dll
            -f:DoScheduledTelemetryRun
    filter_optional_ibm_spectrumprotect:
        ParentImage|contains: :\IBM\SpectrumProtect\webserver\scripts\
        CommandLine|contains: :\IBM\SpectrumProtect\webserver\scripts\
    filter_main_msiexec:
        ParentImage|endswith: :\Windows\SysWOW64\msiexec.exe
        ParentCommandLine|contains: :\Windows\syswow64\MsiExec.exe -Embedding
        CommandLine|contains: \RegisterMicrosoftUpdate.ps1
    filter_optional_avira_update:
        CommandLine|contains: :\Windows\system32\cmd.exe" /C copy "C:\ProgramData\Avira\SystemSpeedup\Update\avira_speedup_setup_update.exe"
    filter_main_empty_parent_1:
        CommandLine|startswith:
            - 'powershell.exe -ExecutionPolicy Restricted -Command  $res = 0; '
            - 'powershell.exe -ExecutionPolicy Restricted -Command Write-Host '
        CommandLine|endswith:
            - Write-Host 'Final result:', $Res;
            - Write-Host "Final result:", $res
            - 'Write-Host ''Final result: 1'';'
    filter_main_empty_parent_2:
        Image|endswith: \cmd.exe
        CommandLine|contains: /d /c C:\Windows\system32\silcollector.cmd
    filter_main_empty_parent_3:
        Image|endswith: \cmd.exe
        CommandLine|endswith:
            - cmd.exe /c btool server list replication_port --no-log
            - cmd.exe /c btool server list general --no-log
    filter_main_empty_parent_4:
        Image|endswith: \cmd.exe
        CommandLine|contains: :\Windows\system32\reg.exe query hklm\software\microsoft\windows\softwareinventorylogging
            /v collectionstate /reg:64
    filter_main_empty_parent_5:
        Image|endswith: :\Windows\System32\cmd.exe
        CommandLine|endswith: :\Windows\system32\cmd.exe /c PAUSE
    filter_optional_empty_parent_6:
        ParentImage: ''
        CommandLine|contains: :\IBM\SpectrumProtect\webserver\scripts\
    filter_optional_empty_parent_7:
        ParentImage: null
        CommandLine|contains: :\IBM\SpectrumProtect\webserver\scripts\
    condition: process_creation and (all of selection_* and not 1 of filter_main_*
        and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
