title: PUA - Wsudo Suspicious Execution
id: bdeeabc9-ff2a-4a51-be59-bb253aac7891
status: test
description: Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let the user execute programs with different permissions (System, Trusted Installer, Administrator...etc)
references:
    - https://github.com/M2Team/Privexec/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/02
modified: 2023/02/14
tags:
    - attack.execution
    - attack.privilege_escalation
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_metadata:
        - Image|endswith: \wsudo.exe
        - OriginalFileName: wsudo.exe
        - Description: Windows sudo utility
        - ParentImage|endswith: \wsudo-bridge.exe
    selection_cli:
        CommandLine|contains:
            - -u System
            - -uSystem
            - -u TrustedInstaller
            - -uTrustedInstaller
            - ' --ti '
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
