title: Recon Information for Export with Command Prompt
ruletype: Sigma
author: frack113
date: 2021/07/30
description: Once established within a system or network, an adversary may use automated
    techniques for collecting internal data.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\tree.com'
        - '*\WMIC.exe'
        - '*\doskey.exe'
        - '*\sc.exe'
    SELECTION_4:
        OriginalFileName:
        - wmic.exe
        - DOSKEY.EXE
        - sc.exe
    SELECTION_5:
        ParentCommandLine: '* > %TEMP%\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: aa2efee7-34dd-446e-8a37-40790a66efd7
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
status: experimental
tags:
- attack.collection
- attack.t1119

