title: Uncommon Svchost Parent Process
id: 4c75b5e0-ca9b-e3c1-ce16-2c6d241bab69
related:
    - id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
      type: derived
status: test
description: Detects an uncommon svchost parent process
references:
    - Internal Research
author: Florian Roth (Nextron Systems)
date: '2017-08-15'
modified: '2022-06-28'
tags:
    - attack.defense-evasion
    - attack.t1036.005
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \svchost.exe
    filter_main_generic:
        ParentImage|endswith:
            - \Mrt.exe
            - \MsMpEng.exe
            - \ngen.exe
            - \rpcnet.exe
            - \services.exe
            - \TiWorker.exe
    filter_main_parent_null:
        ParentImage: null
    filter_main_parent_empty:
        ParentImage:
            - '-'
            - ''
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
