title: Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE
id: 514d3d58-2903-ffab-363d-6f287c80d0f0
related:
    - id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
      type: derived
status: test
description: Detects usage of cmdkey to look for cached credentials on the system
references:
    - https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
    - https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
    - https://github.com/redcanaryco/atomic-red-team/blob/b27a3cb25025161d49ac861cb216db68c46a3537/atomics/T1003.005/T1003.005.md#atomic-test-1---cached-credential-dump-via-cmdkey
author: jmallette, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2019-01-16
modified: 2024-03-05
tags:
    - attack.credential-access
    - attack.t1003.005
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        - Image|endswith: \cmdkey.exe
        - OriginalFileName: cmdkey.exe
    selection_cli:
        CommandLine|contains|windash: ' -l'
    condition: process_creation and (all of selection*)
falsepositives:
    - Legitimate administrative tasks
level: high
regression_tests_path: regression_data/windows/process_creation/proc_creation_win_cmdkey_recon/info.yml
simulation:
    - type: atomic-red-team
      name: Cached Credential Dump via Cmdkey
      technique: T1003.005
      atomic_guid: 56506854-89d6-46a3-9804-b7fde90791f9
ruletype: Sigma
