title: Suspicious NTLM Authentication on the Printer Spooler Service
ruletype: Sigma
author: Elastic (idea), Tobias Michalski
date: 2022/05/04
description: Detects a privilege elevation attempt by coercing NTLM authentication
    on the Printer Spooler service
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\rundll32.exe'
    SELECTION_4:
        CommandLine: '*C:\windows\system32\davclnt.dll,DavSetCookie*'
    SELECTION_5:
        CommandLine: '*http*'
    SELECTION_6:
        CommandLine:
        - '*spoolss*'
        - '*srvsvc*'
        - '*/print/pipe/*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: bb76d96b-821c-47cf-944b-7ce377864492
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/02
references:
- https://twitter.com/med0x2e/status/1520402518685200384
- https://github.com/elastic/detection-rules/blob/dd224fb3f81d0b4bf8593c5f02a029d647ba2b2d/rules/windows/credential_access_relay_ntlm_auth_via_http_spoolss.toml
status: experimental
tags:
- attack.privilege_escalation
- attack.credential_access
- attack.t1212

