title: PowerShell Base64 Encoded WMI Classes
ruletype: Sigma
author: Christian Burkard, Nasreddine Bencherchali
date: 2023/01/30
description: Detects calls to base64 encoded WMI class such as "Win32_Shadowcopy",
    ""...etc.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine:
        - '*VwBpAG4AMwAyAF8AUwBoAGEAZABvAHcAYwBvAHAAeQ*'
        - '*cAaQBuADMAMgBfAFMAaABhAGQAbwB3AGMAbwBwAHkA*'
        - '*XAGkAbgAzADIAXwBTAGgAYQBkAG8AdwBjAG8AcAB5A*'
        - '*V2luMzJfU2hhZG93Y29we*'
        - '*dpbjMyX1NoYWRvd2NvcH*'
        - '*XaW4zMl9TaGFkb3djb3B5*'
    SELECTION_6:
        CommandLine:
        - '*VwBpAG4AMwAyAF8AUwBjAGgAZQBkAHUAbABlAGQASgBvAGIA*'
        - '*cAaQBuADMAMgBfAFMAYwBoAGUAZAB1AGwAZQBkAEoAbwBiA*'
        - '*XAGkAbgAzADIAXwBTAGMAaABlAGQAdQBsAGUAZABKAG8AYg*'
        - '*V2luMzJfU2NoZWR1bGVkSm9i*'
        - '*dpbjMyX1NjaGVkdWxlZEpvY*'
        - '*XaW4zMl9TY2hlZHVsZWRKb2*'
    SELECTION_7:
        CommandLine:
        - '*VwBpAG4AMwAyAF8AUAByAG8AYwBlAHMAcw*'
        - '*cAaQBuADMAMgBfAFAAcgBvAGMAZQBzAHMA*'
        - '*XAGkAbgAzADIAXwBQAHIAbwBjAGUAcwBzA*'
        - '*V2luMzJfUHJvY2Vzc*'
        - '*dpbjMyX1Byb2Nlc3*'
        - '*XaW4zMl9Qcm9jZXNz*'
    SELECTION_8:
        CommandLine:
        - '*VwBpAG4AMwAyAF8AVQBzAGUAcgBBAGMAYwBvAHUAbgB0A*'
        - '*cAaQBuADMAMgBfAFUAcwBlAHIAQQBjAGMAbwB1AG4AdA*'
        - '*XAGkAbgAzADIAXwBVAHMAZQByAEEAYwBjAG8AdQBuAHQA*'
        - '*V2luMzJfVXNlckFjY291bn*'
        - '*dpbjMyX1VzZXJBY2NvdW50*'
        - '*XaW4zMl9Vc2VyQWNjb3Vud*'
    SELECTION_9:
        CommandLine:
        - '*VwBpAG4AMwAyAF8ATABvAGcAZwBlAGQATwBuAFUAcwBlAHIA*'
        - '*cAaQBuADMAMgBfAEwAbwBnAGcAZQBkAE8AbgBVAHMAZQByA*'
        - '*XAGkAbgAzADIAXwBMAG8AZwBnAGUAZABPAG4AVQBzAGUAcg*'
        - '*V2luMzJfTG9nZ2VkT25Vc2Vy*'
        - '*dpbjMyX0xvZ2dlZE9uVXNlc*'
        - '*XaW4zMl9Mb2dnZWRPblVzZX*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9))
falsepositives:
- Unknown
id: 1816994b-42e1-4fb1-afd2-134d88184f71
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
related:
-   id: 47688f1b-9f51-4656-b013-3cc49a166a36
    type: obsoletes
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1027

