title: Potential DLL File Download Via PowerShell Invoke-WebRequest
ruletype: Sigma
author: Florian Roth (Nextron Systems), Hieu Tran
date: 2023/03/13
description: Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest
    cmdlet
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*Invoke-WebRequest *'
        - '*IWR *'
    SELECTION_4:
        CommandLine: '*http*'
    SELECTION_5:
        CommandLine: '*OutFile*'
    SELECTION_6:
        CommandLine: '*.dll*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 0f0450f3-8b47-441e-a31b-15a91dc243e2
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
status: experimental

