title: BlackByte Ransomware Patterns
ruletype: Sigma
author: Florian Roth
date: 2022/02/25
description: This command line patterns found in BlackByte Ransomware operations
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: C:\Users\Public\\*
    SELECTION_4:
        CommandLine: '* -single *'
    SELECTION_5:
        CommandLine:
        - '*del C:\Windows\System32\Taskmgr.exe*'
        - '*;Set-Service -StartupType Disabled $*'
        - '*powershell -command "$x =[System.Text.Encoding]::Unicode.GetString([System.Convert]::FromBase64String(*'
        - '* do start wordpad.exe /p *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        SELECTION_5))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
id: 999e8307-a775-4d5f-addc-4855632335be
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://redcanary.com/blog/blackbyte-ransomware/
status: test

