title: Suspicious Download From Direct IP Via Bitsadmin
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/06/28
description: Detects usage of bitsadmin downloading a file using an URL that contains
    an IP
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\bitsadmin.exe'
    SELECTION_4:
        OriginalFileName: bitsadmin.exe
    SELECTION_5:
        CommandLine:
        - '* /transfer *'
        - '* /create *'
        - '* /addfile *'
    SELECTION_6:
        CommandLine:
        - '*://1*'
        - '*://2*'
        - '*://3*'
        - '*://4*'
        - '*://5*'
        - '*://6*'
        - '*://7*'
        - '*://8*'
        - '*://9*'
    SELECTION_7:
        CommandLine: '*://7-*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7)))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 99c840f2-2012-46fd-9141-c761987550ef
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/15
references:
- https://blog.netspi.com/15-ways-to-download-a-file/#bitsadmin
- https://isc.sans.edu/diary/22264
- https://lolbas-project.github.io/lolbas/Binaries/Bitsadmin/
- https://blog.talosintelligence.com/breaking-the-silence-recent-truebot-activity/
related:
-   id: 90f138c1-f578-4ac3-8c49-eecfd847c8b7
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
- attack.t1036.003

