title: Port Forwarding Activity Via SSH.EXE
id: cfe38fcd-ca5b-67d6-847b-f21fe9efdb26
related:
    - id: 327f48c1-a6db-4eb8-875a-f6981f1b0183
      type: derived
status: test
description: Detects port forwarding activity via SSH.exe
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-12
modified: 2024-03-05
tags:
    - attack.command-and-control
    - attack.lateral-movement
    - attack.t1572
    - attack.t1021.001
    - attack.t1021.004
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \ssh.exe
        CommandLine|contains|windash: ' -R '
    condition: process_creation and selection
falsepositives:
    - Administrative activity using a remote port forwarding to a local port
level: medium
ruletype: Sigma
