title: Windows Shell/Scripting Processes Spawning Suspicious Programs
id: 3a6586ad-127a-4d3b-a677-1e6eacdf8fde
status: test
description: Detects suspicious child processes of a Windows shell and scripting processes
    such as wscript, rundll32, powershell, mshta...etc.
references:
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: Florian Roth (Nextron Systems), Tim Shelton
date: 2018/04/06
modified: 2023/01/19
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1059.005
    - attack.t1059.001
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith:
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \rundll32.exe
            - \cscript.exe
            - \wscript.exe
            - \wmiprvse.exe
            - \regsvr32.exe
        Image|endswith:
            - \schtasks.exe
            - \nslookup.exe
            - \certutil.exe
            - \bitsadmin.exe
            - \mshta.exe
    filter_ccmcache:
        CurrentDirectory|contains: \ccmcache\
    filter_amazon:
        ParentCommandLine|contains:
            - \Program Files\Amazon\WorkSpacesConfig\Scripts\setup-scheduledtask.ps1
            - \Program Files\Amazon\WorkSpacesConfig\Scripts\set-selfhealing.ps1
            - \Program Files\Amazon\WorkSpacesConfig\Scripts\check-workspacehealth.ps1
            - \nessus_
    filter_nessus:
        CommandLine|contains: \nessus_
    condition: process_creation and (selection and not 1 of filter_*)
fields:
    - CommandLine
    - ParentCommandLine
    - CurrentDirectory
    - Image
    - ParentImage
falsepositives:
    - Administrative scripts
    - Microsoft SCCM
level: high
ruletype: Sigma
