title: Suspicious Vsls-Agent Command With AgentExtensionPath Load
ruletype: Sigma
author: bohops
date: 2022/10/30
description: Detects Microsoft Visual Studio vsls-agent.exe lolbin execution with
    a suspicious library load using the --agentExtensionPath parameter
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\vsls-agent.exe'
    SELECTION_4:
        CommandLine: '*--agentExtensionPath*'
    SELECTION_5:
        CommandLine: '*Microsoft.VisualStudio.LiveShare.Agent.*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- False positives depend on custom use of vsls-agent.exe
fields:
- CommandLine
- ParentCommandLine
id: 43103702-5886-11ed-9b6a-0242ac120002
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/bohops/status/1583916360404729857
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

