title: 7Zip Compressing Dump Files
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/27
description: Detects a suspicious 7zip execution that involves a file with a ".dmp"/".dump"
    extension, which could be a step in a process of dump file exfiltration
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: '*7-Zip*'
    SELECTION_4:
        Image:
        - '*\7z.exe'
        - '*\7zr.exe'
        - '*\7za.exe'
    SELECTION_5:
        OriginalFileName:
        - 7z.exe
        - 7za.exe
    SELECTION_6:
        CommandLine:
        - '*.dmp*'
        - '*.dump*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and SELECTION_6)
falsepositives:
- Unknown
id: ec570e53-4c76-45a9-804d-dc3f355ff7a7
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/10
references:
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
related:
-   id: 1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
    type: derived
status: experimental
tags:
- attack.collection
- attack.t1560.001

