title: Renamed PsExec Service Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/07/21
description: Detects suspicious launch of a renamed version of the PSEXESVC service
    with, which is not often used by legitimate administrators
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: psexesvc.exe
    SELECTION_4:
        Image: C:\Windows\PSEXESVC.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Legitimate administrative tasks
id: 51ae86a2-e2e1-4097-ad85-c46cb6851de4
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.youtube.com/watch?v=ro2QuZTIMBM
status: experimental
tags:
- attack.execution

