title: Procdump Evasion
ruletype: Sigma
author: Florian Roth
date: 2022/01/11
description: Detects uses of the SysInternals Procdump utility in which procdump or
    its output get renamed or a dump file is moved ot copied to a different name
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*copy procdump*'
        - '*move procdump*'
    SELECTION_4:
        CommandLine: '*copy *'
    SELECTION_5:
        CommandLine: '*.dmp *'
    SELECTION_6:
        CommandLine:
        - '*2.dmp*'
        - '*lsass*'
        - '*out.dmp*'
    SELECTION_7:
        CommandLine:
        - '*copy lsass.exe_*'
        - '*move lsass.exe_*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5 and SELECTION_6) or SELECTION_7))
falsepositives:
- Cases in which procdump just gets copied to a different directory without any renaming
id: 79b06761-465f-4f88-9ef2-150e24d3d737
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/mrd0x/status/1480785527901204481
status: test
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001

