title: Password Provided In Command Line Of Net.exe
ruletype: Sigma
author: Tim Shelton (HAWK.IO)
date: 2021/12/09
description: Detects a when net.exe is called with a password in the command line
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: C:\Windows\System32\net.exe
    SELECTION_4:
        CommandLine: '*net*'
    SELECTION_5:
        CommandLine: '* use *'
    SELECTION_6:
        CommandLine: '*:*\\\*'
    SELECTION_7:
        CommandLine: '*/USER:* *'
    SELECTION_8:
        CommandLine: '* '
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7) and  not ((SELECTION_8)))
falsepositives:
- Unknown
id: d4498716-1d52-438f-8084-4a603157d131
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/25
references:
- Internal Research
status: test

