title: Use of PktMon.exe
id: f956c7c1-0f60-4bc5-b7d7-b39ab3c08908
status: test
description: Tools to capture network packets on Windows 10 with October 2018 update
    or later.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Pktmon/
author: frack113
date: 2022/03/17
modified: 2023/01/31
tags:
    - attack.credential_access
    - attack.t1040
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        -   Image|endswith: \pktmon.exe
        -   OriginalFileName: PktMon.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use
level: medium
ruletype: Sigma
