title: Suspicious PowerShell Encoded Command Patterns
ruletype: Sigma
author: Florian Roth
date: 2022/05/24
description: Detects PowerShell command line patterns in combincation with encoded
    commands that often appear in malware infection chains
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.Exe
        - pwsh.dll
    SELECTION_5:
        CommandLine:
        - '* -e *'
        - '* -en *'
        - '* -enc *'
        - '* -enco*'
    SELECTION_6:
        CommandLine:
        - '* JAB*'
        - '* SUVYI*'
        - '* SQBFAFgA*'
        - '* aWV4I*'
        - '* IAB*'
        - '* PAA*'
        - '* aQBlAHgA*'
    SELECTION_7:
        ParentImage:
        - '*C:\Packages\Plugins\Microsoft.GuestConfiguration.ConfigurationforWindows\\*'
        - '*\gc_worker.exe*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7)))
falsepositives:
- Other tools that work with encoded scripts in the command line instead of script
    files
id: b9d9cc83-380b-4ba3-8d8f-60c0e7e2930c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/05
references:
- https://app.any.run/tasks/b9040c63-c140-479b-ad59-f1bb56ce7a97/
status: experimental
tags:
- attack.execution
- attack.t1059.001

