title: File Download Via Curl.EXE
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/07/05
description: Detects file download using curl.exe
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\curl.exe'
    SELECTION_4:
        Product: The curl executable
    SELECTION_5:
        CommandLine:
        - '* -O*'
        - '*--remote-name*'
        - '*--output*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Scripts created by developers and admins
- Administrative activity
- The "\Git\usr\bin\sh.exe" process uses the "--output" flag to download a specific
    file in the temp directory with the pattern "gfw-httpget-xxxxxxxx.txt "
fields:
- CommandLine
- ParentCommandLine
id: 9a517fca-4ba3-4629-9278-a68694697b81
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
related:
-   id: bbeaed61-1990-4773-bf57-b81dbad7db2d
    type: derived
-   id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
    type: derived
status: experimental
tags:
- attack.command_and_control
- attack.t1105

