title: WMI Backdoor Exchange Transport Agent
ruletype: Sigma
author: Florian Roth
date: 2019/10/11
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\EdgeTransport.exe'
    SELECTION_4:
        Image: C:\Windows\System32\conhost.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2022/03/18
references:
- https://twitter.com/cglyer/status/1182389676876980224
- https://twitter.com/cglyer/status/1182391019633029120
status: test
tags:
- attack.persistence
- attack.t1546.003
yml_filename: proc_creation_win_wmi_backdoor_exchange_transport_agent.yml
yml_path: rules/windows/process_creation
---

