title: Download Arbitrary Files Via PresentationHost.exe
id: b124ddf4-778d-418e-907f-6dd3fc0d31cd
status: experimental
description: Detects usage of "PresentationHost" which is a utility that runs ".xbap"
    (Browser Applications) files to download arbitrary files
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/239/files
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/19
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        -   Image|endswith: \presentationhost.exe
        -   OriginalFileName: PresentationHost.exe
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
            - ftp://
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
