title: Run Whoami as Privileged User
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/28
description: Detects a whoami.exe executed by privileged accounts that are often misused
    by threat actors
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        User: '*TrustedInstaller*'
    SELECTION_4:
        OriginalFileName: whoami.exe
    SELECTION_5:
        Image: '*\whoami.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: 79ce34ca-af29-4d0e-b832-fc1b377020db
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/05/13
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://nsudo.m2team.org/en-us/
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033

