title: Windows Kernel Debugger Execution
id: 0ef219a6-e0db-6d26-9a4f-837e86b5c3a0
related:
    - id: 27ee9438-90dc-4bef-904b-d3ef927f5e7e
      type: derived
status: test
description: Detects execution of the Windows Kernel Debugger "kd.exe".
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-15
modified: 2024-04-24
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        - Image|endswith: \kd.exe
        - OriginalFileName: kd.exe
    condition: process_creation and selection
falsepositives:
    - Rare occasions of legitimate cases where kernel debugging is necessary in production. Investigation is required
level: medium
ruletype: Sigma
