title: WMIExec VBS Script
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2017/04/07
description: Detects wmiexec vbs version execution by wscript or cscript
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\cscript.exe'
        - '*\wscript.exe'
    SELECTION_4:
        OriginalFileName:
        - cscript.exe
        - wscript.exe
    SELECTION_5:
        CommandLine: '*.vbs*'
    SELECTION_6:
        CommandLine: '*/shell*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unlikely
fields:
- CommandLine
- ParentCommandLine
id: 966e4016-627f-44f7-8341-f394905c361f
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/11
references:
- https://web.archive.org/web/20180725233601/https://www.pwc.co.uk/cyber-security/pdf/cloud-hopper-annex-b-final.pdf
status: test
tags:
- attack.execution
- attack.g0045
- attack.t1059.005

