author: Zach Mathis
date: 2022/12/07
modified: 2022/12/07

title: RDS Sess Logon
details: 'User: %UserDataUser% ¦ SessID: %UserDataSessionID% ¦ SrcIP: %UserDataAddress%'
description:

id: b107551c-409d-44b8-bb0d-3b007c269881
level: informational
status: stable
logsource:
    product: windows
detection:
    selection:
        Channel: 'Microsoft-Windows-TerminalServices-LocalSessionManager/Operational'
        EventID: 21
    condition: selection
falsepositives:
    - administrator
tags:
    - RDP
    - attack.lateral_movement
references:
ruletype: Hayabusa

sample-message: |
    Remote Desktop Services: Session logon succeeded:

    User: WIN-QW3OXGRISMS\Administrator
    Session ID: 2
    Source Network Address: 122.6.150.75
sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft-Windows-TerminalServices-LocalSessionManager" Guid="{5d896912-022d-40aa-a3a8-4fa5515c76d7}" /> 
            <EventID>21</EventID> 
            <Version>0</Version> 
            <Level>4</Level> 
            <Task>0</Task> 
            <Opcode>0</Opcode> 
            <Keywords>0x1000000000000000</Keywords> 
            <TimeCreated SystemTime="2022-12-06T05:41:46.964691000Z" /> 
            <EventRecordID>3318</EventRecordID> 
            <Correlation /> 
            <Execution ProcessID="692" ThreadID="2588" /> 
            <Channel>Microsoft-Windows-TerminalServices-LocalSessionManager/Operational</Channel> 
            <Computer>WIN-QW3OXGRISMS</Computer> 
            <Security UserID="S-1-5-18" /> 
        </System>
        <UserData>
            <EventXML xmlns:auto-ns3="http://schemas.microsoft.com/win/2004/08/events" xmlns="Event_NS">
                <User>WIN-QW3OXGRISMS\Administrator</User> 
                <SessionID>2</SessionID> 
                <Address>122.6.150.75</Address> 
            </EventXML>
        </UserData>
    </Event>