title: New Windows Firewall Rule Added Via New-NetFirewallRule Cmdlet - ScriptBlock
id: 40fd8a4e-3820-0edf-530e-53785ee863e9
related:
    - id: 51483085-0cba-46a8-837e-4416496d6971
      type: similar
    - id: 8d31dd2e-b582-48ca-826e-dcaa2c1ca264
      type: derived
status: test
description: |
    Detects when a powershell script contains calls to the "New-NetFirewallRule" cmdlet in order to add a new firewall rule with an "Allow" action.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md#atomic-test-24---set-a-firewall-rule-using-new-netfirewallrule
    - https://malware.news/t/the-rhysida-ransomware-activity-analysis-and-ties-to-vice-society/72170
    - https://cybersecuritynews.com/rhysida-ransomware-attacking-windows/
author: frack113
date: 2024-05-10
tags:
    - attack.defense-evasion
    - attack.t1562.004
    - detection.threat-hunting
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ScriptBlockText|contains: New-NetFirewallRule*-Action*Allow
    condition: ps_script and selection
falsepositives:
    - Administrator script
level: low
ruletype: Sigma
