title: Mail Forwarding/Redirecting Activity Via ExchangePowerShell Cmdlet
id: cdb585a5-4a75-4c21-26d3-0bab43ffbde1
related:
    - id: c726e007-2cd0-4a55-abfb-79730fbedee5
      type: similar
    - id: 15b7abbb-8b40-4d01-9ee2-b51994b1d474
      type: obsolete
    - id: 0c7686d5-c74e-4292-b224-2a08e956ebc4
      type: derived
status: experimental
description: Detects email forwarding or redirecting activity via ExchangePowerShell Cmdlet
references:
    - https://redcanary.com/blog/email-forwarding-rules/
    - https://github.com/PwC-IR/Business-Email-Compromise-Guide/blob/fe29ce06aef842efe4eb448c26bbe822bf5b895d/PwC-Business_Email_Compromise-Guide.pdf
author: Nasreddine Bencherchali (Nextron Systems), Marco Pedrinazzi (@pedrinazziM) (InTheCyber)
date: 2026-03-01
tags:
    - attack.collection
    - attack.t1114.003
    - attack.defense-evasion
    - attack.t1564.008
    - attack.exfiltration
    - attack.t1020
    - detection.threat-hunting
logsource:
    product: windows
    category: ps_script
    definition: 'Requirements: Script Block Logging must be enabled'
detection:
    ps_script:
        EventID: 4104
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection_cmdlet:
        ScriptBlockText|contains:
            - New-InboxRule
            - Set-InboxRule
            - Set-Mailbox
    selection_params:
        ScriptBlockText|contains:
            - ForwardAsAttachmentTo
            - ForwardingAddress
            - ForwardingSmtpAddress
            - ForwardTo
            - RedirectTo   # Also covers "RedirectToRecipients"
    condition: ps_script and (all of selection_*)
falsepositives:
    - Legitimate mail forwarding rules created by users or administrators to forward email to designated internal or external recipients for business or operational purposes.
level: medium
ruletype: Sigma
