
title: Python Initiated Connection
author: frack113
date: 2021/12/10
description: Adversaries may attempt to get a listing of services running on remote
  hosts, including those that may be vulnerable to remote software exploitation
detection:
  SELECTION_1:
    Initiated: 'true'
  SELECTION_2:
    Image: '*python*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate python script
id: bef0bc5a-b9ae-425d-85c6-7b2d705980c6
level: high
logsource:
  category: network_connection
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1046/T1046.md#atomic-test-4---port-scan-using-python
- https://pypi.org/project/scapy/
status: experimental
tags:
- attack.discovery
- attack.t1046
