
title: Microsoft Sync Center Suspicious Network Connections
ruletype: Sigma
author: elhoim
date: 2022/04/28
description: Detects suspicious connections from Microsoft Sync Center to non-private
  IPs.
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\mobsync.exe'
  SELECTION_4:
    DestinationIp:
    - 10.*
    - 192.168.*
    - 172.16.*
    - 172.17.*
    - 172.18.*
    - 172.19.*
    - 172.20.*
    - 172.21.*
    - 172.22.*
    - 172.23.*
    - 172.24.*
    - 172.25.*
    - 172.26.*
    - 172.27.*
    - 172.28.*
    - 172.29.*
    - 172.30.*
    - 172.31.*
  SELECTION_5:
    DestinationIsIpv6: 'false'
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4
    and SELECTION_5))
falsepositives:
- Unknown
id: 9f2cc74d-78af-4eb2-bb64-9cd1d292b87b
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2022/06/02
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: experimental
tags:
- attack.t1055
- attack.t1218
- attack.execution
- attack.defense_evasion
