
title: Suspicious Outbound SMTP Connections
author: frack113
date: 2022/01/07
description: "Adversaries may steal data by exfiltrating it over an un-encrypted network\
  \ protocol other than that of the existing command and control channel.\nThe data\
  \ may also be sent to an alternate network location from the main command and control\
  \ server. \n"
detection:
  SELECTION_1:
    DestinationPort: 25
  SELECTION_2:
    DestinationPort: 587
  SELECTION_3:
    DestinationPort: 465
  SELECTION_4:
    DestinationPort: 2525
  SELECTION_5:
    Initiated: 'true'
  SELECTION_6:
    Image:
    - '*\thunderbird.exe'
    - '*\outlook.exe'
  SELECTION_7:
    Image: C:\Program Files\Microsoft\Exchange Server\\*
  condition: (((SELECTION_1 or SELECTION_2 or SELECTION_3 or SELECTION_4) and SELECTION_5)
    and  not ((SELECTION_6) or (SELECTION_7)))
falsepositives:
- Other SMTP tools
id: 9976fa64-2804-423c-8a5b-646ade840773
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2022/02/16
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1048.003/T1048.003.md#atomic-test-5---exfiltration-over-alternative-protocol---smtp
- https://www.ietf.org/rfc/rfc2821.txt
status: experimental
tags:
- attack.exfiltration
- attack.t1048.003
