
title: Microsoft Binary Suspicious Communication Endpoint
author: Florian Roth
date: 2018/08/30
description: Detects an executable in the Windows folder accessing suspicious domains
detection:
  SELECTION_1:
    Initiated: 'true'
  SELECTION_2:
    DestinationHostname:
    - '*dl.dropboxusercontent.com'
    - '*.pastebin.com'
    - '*.githubusercontent.com'
  SELECTION_3:
    Image: C:\Windows\\*
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
level: high
logsource:
  category: network_connection
  product: windows
modified: 2021/11/27
references:
- https://twitter.com/M_haggis/status/900741347035889665
- https://twitter.com/M_haggis/status/1032799638213066752
status: test
tags:
- attack.lateral_movement
- attack.t1105
