
title: Equation Editor Network Connection
ruletype: Sigma
author: Max Altgelt
date: 2022/04/14
description: Detects network connections from Equation Editor
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    Image: '*\eqnedt32.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: a66bc059-c370-472c-a0d7-f8fd1bf9d583
level: high
logsource:
  category: network_connection
  product: windows
references:
- https://twitter.com/forensicitguy/status/1513538712986079238
- https://news.sophos.com/en-us/2019/07/18/a-new-equation-editor-exploit-goes-commercial-as-maldoc-attacks-using-it-spike/
status: experimental
tags:
- attack.execution
- attack.t1203
