title: Standard User In High Privileged Group
ruletype: Sigma
author: frack113
date: 2023/01/13
description: Detect standard users login that are part of high privileged groups such
    as the Administrator group
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-LSA/Operational
    SELECTION_2:
        EventID: 300
    SELECTION_3:
        TargetUserSid: S-1-5-21-*
    SELECTION_4:
        SidList:
        - '*S-1-5-32-544*'
        - '*-500}*'
        - '*-518}*'
        - '*-519}*'
    SELECTION_5:
        TargetUserSid:
        - '*-500'
        - '*-518'
        - '*-519'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Standard domain users who are part of the administrator group. These users shouldn't
    have these right. But in the case where it's necessary. They should be filtered
    out using the "TargetUserName" field
id: 7ac407cc-0f48-4328-aede-de1d2e6fef41
level: high
logsource:
    definition: 'Requirements: Microsoft-Windows-LSA/Operational ({199FE037-2B82-40A9-82AC-E1D46C792B99})
        Event Log must be collected in order to receive the events.'
    product: windows
    service: lsa-server
references:
- https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-identifiers
- https://learn.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
- https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWProvidersManifests/Windows11/22H2/W11_22H2_Pro_20221220_22621.963/WEPExplorer/LsaSrv.xml
status: experimental
tags:
- attack.credential_access
- attack.privilege_escalation

