title: OpenSSH Server Listening On Socket
ruletype: Sigma
author: mdecrevoisier
date: 2022/10/25
description: Detects scenarios where an attacker enables the OpenSSH server and server
    starts to listening on SSH socket.
detection:
    SELECTION_1:
        Provider_Name: OpenSSH/Operational
    SELECTION_2:
        EventID: 4
    SELECTION_3:
        process: sshd
    SELECTION_4:
        payload: Server listening on *
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate administrator activity
id: 3ce8e9a4-bc61-4c9b-8e69-d7e2492a8781
level: medium
logsource:
    product: windows
    service: openssh
references:
- https://github.com/mdecrevoisier/EVTX-to-MITRE-Attack/tree/master/TA0008-Lateral%20Movement/T1021.004-Remote%20Service%20SSH
- https://winaero.com/enable-openssh-server-windows-10/
- https://docs.microsoft.com/en-us/windows-server/administration/openssh/openssh_install_firstuse
- https://virtualizationreview.com/articles/2020/05/21/ssh-server-on-windows-10.aspx
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.004

