title: KDC RC4-HMAC Downgrade CVE-2022-37966
id: 87515290-bf9f-09a4-af0e-bac22cb017f6
related:
    - id: e6f81941-b1cd-4766-87db-9fc156f658ee
      type: derived
status: test
description: Detects the exploitation of a security bypass and elevation of privilege vulnerability with Authentication Negotiation by using weak RC4-HMAC negotiation
references:
    - https://support.microsoft.com/en-us/topic/kb5021131-how-to-manage-the-kerberos-protocol-changes-related-to-cve-2022-37966-fd837ac3-cdec-4e76-a6ec-86e67501407d
author: Florian Roth (Nextron Systems)
date: 2022-11-09
tags:
    - attack.privilege-escalation
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        EventID: 42
        Provider_Name: Kerberos-Key-Distribution-Center
        Level: 2  # Error
    condition: system and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
