
title: Suspicious PowerShell Invocations - Specific
author: Florian Roth (rule), Jonhnathan Ribeiro
date: 2017/03/05
description: Detects suspicious PowerShell invocation command parameters
detection:
  SELECTION_1:
    Channel: Microsoft-Windows-PowerShell/Operational
  SELECTION_10:
  - -ep
  SELECTION_11:
  - bypass
  SELECTION_12:
  - -Enc
  SELECTION_13:
  - powershell
  SELECTION_14:
  - reg
  SELECTION_15:
  - add
  SELECTION_16:
  - HKCU\software\microsoft\windows\currentversion\run
  SELECTION_17:
  - bypass
  SELECTION_18:
  - -noprofile
  SELECTION_19:
  - -windowstyle
  SELECTION_2:
  - ' -w '
  SELECTION_20:
  - hidden
  SELECTION_21:
  - new-object
  SELECTION_22:
  - system.net.webclient
  SELECTION_23:
  - .download
  SELECTION_24:
  - iex
  SELECTION_25:
  - New-Object
  SELECTION_26:
  - Net.WebClient
  SELECTION_27:
  - .Download
  SELECTION_28:
  - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
  - (New-Object System.Net.WebClient).DownloadString('https://chocolatey.org/install.ps1')
  - Write-ChocolateyWarning
  SELECTION_3:
  - hidden
  SELECTION_4:
  - -nop
  SELECTION_5:
  - ' -c '
  SELECTION_6:
  - '[Convert]::FromBase64String'
  SELECTION_7:
  - -noni
  SELECTION_8:
  - iex
  SELECTION_9:
  - New-Object
  condition: (SELECTION_1 and ((((SELECTION_2 and SELECTION_3 and ((SELECTION_4 and
    SELECTION_5 and ((SELECTION_7 and SELECTION_8 and SELECTION_9) or SELECTION_6))
    or (SELECTION_10 and SELECTION_11 and SELECTION_12))) or (SELECTION_13 and SELECTION_14
    and SELECTION_15 and SELECTION_16)) or (SELECTION_17 and SELECTION_18 and SELECTION_19
    and SELECTION_20 and SELECTION_21 and SELECTION_22 and SELECTION_23)) or (SELECTION_24
    and SELECTION_25 and SELECTION_26 and SELECTION_27)) and  not ((SELECTION_28)))
falsepositives:
- Penetration tests
id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
level: high
logsource:
  definition: Script block logging must be enabled for 4104, Module Logging must be
    enabled for 4103
  product: windows
  service: powershell
modified: 2022/02/21
status: deprecated
tags:
- attack.execution
- attack.t1059.001
