
title: Mimikatz Detection LSASS Access
author: Sherif Eldeeb
date: 2017/10/18
description: Detects process access to LSASS which is typical for Mimikatz (0x1000
  PROCESS_QUERY_ LIMITED_INFORMATION, 0x0400 PROCESS_QUERY_ INFORMATION "only old
  versions", 0x0010 PROCESS_VM_READ)
detection:
  SELECTION_1:
    TargetImage: '*\lsass.exe'
  SELECTION_2:
    GrantedAccess:
    - '0x1410'
    - '0x1010'
    - '0x410'
  SELECTION_3:
    SourceImage:
    - C:\Program Files\WindowsApps\\*
    - C:\Windows\System32\\*
  SELECTION_4:
    SourceImage: '*\GamingServices.exe'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3 and SELECTION_4))
falsepositives:
- Some security products access LSASS in this way.
fields:
- ComputerName
- User
- SourceImage
id: 0d894093-71bc-43c3-8c4d-ecfc28dcf5d9
level: high
logsource:
  category: process_access
  product: windows
modified: 2022/01/28
references:
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
status: deprecated
tags:
- attack.t1003
- attack.s0002
- attack.credential_access
- car.2019-04-004
