title: Invoke-Obfuscation Via Stdin
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/12
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath|re: (?i).*(set).*&&\s?set.*(environment|invoke|\$?\{?input).*&&.*"
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 82b66143-53ee-4369-ab02-de2c70cd6352
level: high
logsource:
    category: driver_load
    product: windows
modified: 2023/04/23
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 487c7524-f892-4054-b263-8a0ace63fc25
    type: derived
status: unsupported
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

