title: Invoke-Obfuscation COMPRESS OBFUSCATION
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath: '*new-object*'
    SELECTION_4:
        ImagePath: '*text.encoding]::ascii*'
    SELECTION_5:
        ImagePath:
        - '*system.io.compression.deflatestream*'
        - '*system.io.streamreader*'
    SELECTION_6:
        ImagePath: '*readtoend'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: c70731dd-0097-40ff-b112-f7032f29c16c
level: medium
logsource:
    category: driver_load
    product: windows
modified: 2023/03/04
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 175997c5-803c-4b08-8bb0-70b099f47595
    type: derived
status: unsupported
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

