title: File Creation by Office Applications
ruletype: Sigma
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: This rule will monitor executable and script file creation by office
    applications. Please add more file extensions or magic bytes to the logic of your
    choice.
detection:
    SELECTION_1:
        EventID: 11
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\winword.exe'
        - '*\excel.exe'
        - '*\powerpnt.exe'
        - '*\outlook.exe'
    SELECTION_4:
        FileName:
        - '*.exe'
        - '*.dll'
        - '*.ocx'
        - '*.com'
        - '*.ps1'
        - '*.vbs'
        - '*.sys'
        - '*.bat'
        - '*.scr'
        - '*.proj'
    SELECTION_5:
        FileMagicBytes:
        - 4D5A*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: 8c6fd6fc-28fc-4597-a86a-fc1de20b039d
level: high
logsource:
    category: file_event
    product: windows
modified: 2022/06/02
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion

