title: Detection of Possible Rotten Potato
ruletype: Sigma
author: Teymur Kheirkhabarov
date: 2019/10/26
description: Detection of child processes spawned with SYSTEM privileges by parents
    with LOCAL SERVICE or NETWORK SERVICE privileges
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentUser:
        - NT AUTHORITY\NETWORK SERVICE
        - NT AUTHORITY\LOCAL SERVICE
    SELECTION_4:
        User: NT AUTHORITY\SYSTEM
    SELECTION_5:
        Image: '*\rundll32.exe'
    SELECTION_6:
        CommandLine: '*DavSetCookie*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5 and SELECTION_6))
enrichment:
- EN_0001_cache_sysmon_event_id_1_info
- EN_0002_enrich_sysmon_event_id_1_with_parent_info
falsepositives:
- Unknown
id: 6c5808ee-85a2-4e56-8137-72e5876a5096
level: high
logsource:
    category: process_creation
    definition: Works only if  Enrich Sysmon events with additional information about
        process in ParentUser check enrichment section
    product: windows
modified: 2020/09/01
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
status: unsupported
tags:
- attack.privilege_escalation
- attack.t1134
- attack.t1134.002

