author: Zach Mathis
date: 2021/12/16
modified: 2022/03/22

title: Network Share File Access
title_jp: ネットワーク共有へのファイルアクセス
details: 'User: %SubjectUserName% | Share Name: %ShareName% | Share Path: %ShareLocalPath% | Path: %RelativeTargetName% | IP Addr: %IpAddress% | LID: %SubjectLogonId%'
details_jp: 'ユーザ: %SubjectUserName% | 共有名: %ShareName% | 共有パス: %ShareLocalPath% | パス: %RelativeTargetName% | IPアドレス: %IpAddress% | ログオンID: %SubjectLogonId%'
description: 
description_jp: 

id: 8c6ec2b2-8dad-4996-9aba-d659afc1b919
level: informational
status: stable
logsource:
    product: windows
    service: security
    description: Logging needs to be turned on.
detection:
    selection:
        Channel: Security
        EventID: 5145
    filter:
        - ShareLocalPath: ""
        - ShareLocalPath: "null"
        - ShareName: "\\\\*\\IPC$"
        - RelativeTargetName: "\\"
    condition: selection and not filter
falsepositives:
    - normal system usage
tags:
    - attack.t1039 # Data from network shared drive
    - attack.collection
references:
sample-evtx: ./EVTX-to-MITRE-Attack/TA0007-Discovery/T1135.xxx-Network Share Discovery/ID5140-5145-Bloodhound-SharpHound enumeration via SMB.evtx
ruletype: Hayabusa