title: Potential NT API Stub Patching
ruletype: Sigma
author: frack113
date: 2023/01/07
description: Detects potential NT API stub patching as seen used by the project PatchingAPI
detection:
    SELECTION_1:
        EventID: 10
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        GrantedAccess: '0x1FFFFF'
    SELECTION_4:
        CallTrace: C:\Windows\SYSTEM32\ntdll.dll+*
    SELECTION_5:
        CallTrace: '*|UNKNOWN(*'
    SELECTION_6:
        CallTrace: '*)'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: b916cba1-b38a-42da-9223-17114d846fd6
level: medium
logsource:
    category: process_access
    product: windows
references:
- https://github.com/D1rkMtr/UnhookingPatch
- https://twitter.com/D1rkMtr/status/1611471891193298944?s=20
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002

