title: Potential Shellcode Injection
id: 250ae82f-736e-4844-a68b-0b5e8cc887da
status: test
description: Detects potential shellcode injection used by tools such as Metasploit's
    migrate and Empire's psinject
author: Bhabesh Raj
date: 2022/03/11
modified: 2023/10/17
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1055
    - sysmon
logsource:
    category: process_access
    product: windows
detection:
    process_access:
        EventID: 10
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        GrantedAccess:
            - '0x147a'
            - '0x1f3fff'
        CallTrace|contains: UNKNOWN
    filter_dell_folders:
        SourceImage|startswith:
            - C:\Program Files\Dell\
            - C:\Program Files (x86)\Dell\
        TargetImage|startswith:
            - C:\Program Files\Dell\
            - C:\Program Files (x86)\Dell\
        GrantedAccess: '0x1F3FFF'
        CallTrace|startswith: C:\Windows\System32\ntdll.dll
    filter_dell_specifc:
        SourceImage: C:\Program Files (x86)\Dell\UpdateService\ServiceShell.exe
        TargetImage: C:\Windows\Explorer.EXE
        GrantedAccess: '0x1F3FFF'
        CallTrace|startswith: C:\Windows\System32\ntdll.dll
    filter_visual_studio:
        SourceImage:
            - C:\Program Files\Microsoft Visual Studio\2022\Community\Common7\IDE\PerfWatson2.exe
            - C:\Program Files (x86)\Microsoft Visual Studio\2019\Community\Common7\IDE\PerfWatson2.exe
        TargetImage:
            - C:\Program Files\Microsoft Visual Studio\2022\Community\Common7\IDE\devenv.exe
            - C:\Program Files (x86)\Microsoft Visual Studio\2019\Community\Common7\IDE\devenv.exe
        CallTrace|startswith: C:\Windows\System32\ntdll.dll
    filter_ddvdatacollector:
        SourceImage|startswith: C:\Program Files\Microsoft Visual Studio\
        SourceImage|endswith: \MSBuild\Current\Bin\MSBuild.exe
        TargetImage: C:\Program Files\Dell\DellDataVault\DDVDataCollector.exe
    filter_wmiprvese:
        SourceImage: C:\Windows\System32\Wbem\Wmiprvse.exe
        TargetImage: C:\Windows\system32\lsass.exe
        CallTrace|startswith: C:\Windows\SYSTEM32\ntdll.dll
    condition: process_access and (selection and not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
