title: HandleKatz Duplicating LSASS Handle
id: b1bd3a59-c1fd-4860-9f40-4dd161a7d1f5
status: test
description: Detects HandleKatz opening LSASS to duplicate its handle to later dump
    the memory without opening any new handles
references:
    - https://github.com/codewhitesec/HandleKatz
author: Bhabesh Raj (rule), @thefLinkk
date: 2022/06/27
tags:
    - attack.execution
    - attack.t1106
    - attack.defense_evasion
    - attack.t1003.001
    - sysmon
logsource:
    category: process_access
    product: windows
detection:
    process_access:
        EventID: 10
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetImage|endswith: \lsass.exe
        GrantedAccess: '0x1440'
    call_trace:
        CallTrace|startswith: C:\Windows\System32\ntdll.dll+
        CallTrace|contains: '|UNKNOWN('
        CallTrace|endswith: )
    condition: process_access and (selection and call_trace)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
