title: Direct Syscall of NtOpenProcess
ruletype: Sigma
author: Christian Burkard, Tim Shelton
date: 2021/07/28
description: Detects the usage of the direct syscall of NtOpenProcess which might
    be done from a CobaltStrike BOF.
detection:
    SELECTION_1:
        EventID: 10
    SELECTION_10:
        SourceImage: '*vcredist_x64.exe'
    SELECTION_11:
        TargetImage: C:\Windows\system32\systeminfo.exe
    SELECTION_12:
        SourceImage: '*setup64.exe'
    SELECTION_13:
        TargetImage: '*AmazonSSMAgentSetup.exe'
    SELECTION_14:
        SourceImage: '*AmazonSSMAgentSetup.exe'
    SELECTION_15:
        TargetImage: '*C:\Program Files\Mozilla Firefox\firefox.exe'
    SELECTION_16:
        SourceImage: '*C:\Program Files\Mozilla Firefox\firefox.exe'
    SELECTION_17:
        TargetImage: '*\AppData\Local\Programs\Microsoft VS Code\Code.exe'
    SELECTION_18:
        SourceImage: '*\AppData\Local\Programs\Microsoft VS Code\Code.exe'
    SELECTION_19:
        TargetImage: '*C:\Program Files\Google\Chrome\Application\chrome.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        SourceImage: '*C:\Program Files\Google\Chrome\Application\chrome.exe'
    SELECTION_21:
        TargetImage: '*C:\Program Files (x86)\Google\Update\GoogleUpdate.exe'
    SELECTION_22:
        SourceImage: '*C:\Program Files (x86)\Google\Update\GoogleUpdate.exe'
    SELECTION_23:
        TargetImage: '*\AppData\Local\Microsoft\Teams\current\Teams.exe'
    SELECTION_24:
        SourceImage: '*\AppData\Local\Microsoft\Teams\current\Teams.exe'
    SELECTION_25:
        TargetImage: C:\Windows\System32\backgroundTaskHost.exe
    SELECTION_26:
        SourceImage: C:\Windows\System32\backgroundTaskHost.exe
    SELECTION_27:
        TargetImage: C:\Program Files (x86)\CCleaner Browser\Application\CCleanerBrowser.exe
    SELECTION_28:
        SourceImage: C:\Program Files (x86)\CCleaner Browser\Application\CCleanerBrowser.exe
    SELECTION_29:
        Provider_Name: Microsoft-Windows-Kernel-Audit-API-Calls
    SELECTION_3:
        CallTrace: UNKNOWN*
    SELECTION_4:
        TargetImage: C:\Program Files\Cylance\Desktop\CylanceUI.exe
    SELECTION_5:
        SourceImage: C:\Windows\Explorer.EXE
    SELECTION_6:
        TargetImage: C:\Program Files (x86)\Microsoft\EdgeUpdate\MicrosoftEdgeUpdate.exe
    SELECTION_7:
        SourceImage: C:\Program Files (x86)\Microsoft\Temp\\*
    SELECTION_8:
        SourceImage: '*\MicrosoftEdgeUpdate.exe'
    SELECTION_9:
        TargetImage: '*vcredist_x64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13 and
        SELECTION_14) or (SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18)
        or (SELECTION_19 and SELECTION_20) or (SELECTION_21 and SELECTION_22) or (SELECTION_23
        and SELECTION_24) or (SELECTION_25 and SELECTION_26) or (SELECTION_27 and
        SELECTION_28) or (SELECTION_29)))
falsepositives:
- Unknown
id: 3f3f3506-1895-401b-9cc3-e86b16e630d0
level: high
logsource:
    category: process_access
    product: windows
modified: 2022/09/20
references:
- https://medium.com/falconforce/falconfriday-direct-system-calls-and-cobalt-strike-bofs-0xff14-741fa8e1bdd6
status: experimental
tags:
- attack.execution
- attack.t1106

