title: Credentials Dumping Tools Accessing LSASS Memory
ruletype: Sigma
author: Florian Roth, Roberto Rodriguez, Dimitrios Slamaris, Mark Russinovich, Thomas
    Patzke, Teymur Kheirkhabarov, Sherif Eldeeb, James Dickenson, Aleksey Potapov,
    oscd.community (update)
date: 2017/02/16
description: Detects process access LSASS memory which is typical for credentials
    dumping tools
detection:
    SELECTION_1:
        EventID: 10
    SELECTION_10:
        CallTrace: '*}\mpengine.dll+*'
    SELECTION_11:
        GrantedAccess: '0x1418'
    SELECTION_12:
        SourceImage: C:\Program Files\WindowsApps\\*
    SELECTION_13:
        SourceImage: '*\GamingServices.exe'
    SELECTION_14:
        GrantedAccess:
        - '0x1410'
        - '0x410'
    SELECTION_15:
        SourceImage:
        - '*\PROCEXP64.EXE'
        - '*\PROCEXP.EXE'
        - '*C:\WINDOWS\system32\taskhostw.exe'
        - '*\MBAMInstallerService.exe'
    SELECTION_16:
        GrantedAccess:
        - '0x1410'
        - '0x410'
        - '0x40'
    SELECTION_17:
        SourceImage: C:\ProgramData\VMware\VMware Tools\\*
    SELECTION_18:
        SourceImage: '*\vmtoolsd.exe'
    SELECTION_19:
        SourceImage: C:\WINDOWS\system32\svchost.exe
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        GrantedAccess: '0x100000'
    SELECTION_21:
        SourceImage:
        - C:\WINDOWS\system32\wbem\wmiprvse.exe
        - C:\Windows\syswow64\MsiExec.exe
        - C:\Windows\System32\msiexec.exe
    SELECTION_22:
        GrantedAccess:
        - '0x1410'
        - '0x410'
    SELECTION_23:
        SourceImage:
        - '*\thor.exe'
        - '*\thor64.exe'
        - '*\aurora-agent.exe'
        - '*\aurora-agent-64.exe'
    SELECTION_24:
        GrantedAccess:
        - '0x40'
        - '0x1010'
    SELECTION_25:
        SourceImage: '*\explorer.exe'
    SELECTION_26:
        GrantedAccess: '0x401'
    SELECTION_27:
        SourceImage:
        - C:\Windows\system32\wininit.exe
        - C:\Windows\System32\lsass.exe
    SELECTION_28:
        GrantedAccess: '0x1000000'
    SELECTION_29:
        SourceImage: C:\Windows\system32\MRT.exe
    SELECTION_3:
        TargetImage: '*\lsass.exe'
    SELECTION_30:
        GrantedAccess:
        - '0x1410'
        - '0x1418'
    SELECTION_31:
        GrantedAccess: '0x40'
    SELECTION_32:
        SourceImage:
        - '*\handle.exe'
        - '*\handle64.exe'
    SELECTION_33:
        SourceImage:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_34:
        GrantedAccess:
        - '0x1410'
        - '0x410'
    SELECTION_35:
        SourceImage: C:\Program Files (x86)\Microsoft\Edge\Application\\*
    SELECTION_36:
        SourceImage: '*\Installer\setup.exe'
    SELECTION_37:
        SourceImage: '*\AppData\Local\WebEx\WebexHost.exe'
    SELECTION_38:
        GrantedAccess: '0x401'
    SELECTION_39:
        SourceImage: C:\PROGRAMDATA\MALWAREBYTES\MBAMSERVICE\ctlrupdate\mbupdatr.exe
    SELECTION_4:
        GrantedAccess:
        - 0x40*
        - 0x100000*
        - 0x1410*
        - 0x1438*
        - 0x143a*
        - 0x1418*
        - 0x1f0fff*
        - 0x1f1fff*
        - 0x1f2fff*
        - 0x1f3fff*
    SELECTION_40:
        GrantedAccess: '0x1410'
    SELECTION_5:
        SourceImage:
        - C:\WINDOWS\system32\taskmgr.exe
        - C:\Windows\System32\perfmon.exe
    SELECTION_6:
        SourceImage: C:\ProgramData\Microsoft\Windows Defender\\*
    SELECTION_7:
        SourceImage: '*\MsMpEng.exe'
    SELECTION_8:
        SourceImage: C:\Windows\System32\svchost.exe
    SELECTION_9:
        CallTrace: '*|C:\ProgramData\Microsoft\Windows Defender\Definition Updates\{*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18) or (SELECTION_19
        and SELECTION_20) or (SELECTION_21 and SELECTION_22) or (SELECTION_23 and
        SELECTION_24) or (SELECTION_25 and SELECTION_26) or (SELECTION_27 and SELECTION_28)
        or (SELECTION_29 and SELECTION_30) or (SELECTION_31 and SELECTION_32) or (SELECTION_33
        and SELECTION_34) or (SELECTION_35 and SELECTION_36) or (SELECTION_37 and
        SELECTION_38) or (SELECTION_39 and SELECTION_40)))
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason; please add more
    filters
fields:
- ComputerName
- User
- SourceImage
id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
level: high
logsource:
    category: process_access
    product: windows
modified: 2022/09/13
references:
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
- car.2019-04-004

