author: rukawa
date: 2022/02/08
modified: 2022/03/22

title: Possible RDP Hijacking
title_jp: 'RDPハイジャックの可能性がある'
details: 'Command Line: %CommandLine%  :  Path: %NewProcessName%  :  Process ID: %NewProcessId%  :  User: %SubjectUserName%  :  LogonID: %SubjectLogonId%'
details_jp: 'コマンドライン: %CommandLine%  :  パス: %NewProcessName%  :  プロセスID: %NewProcessId%  :  ユーザ: %SubjectUserName%  :  ログオンID: %SubjectLogonId%'
description: Detects a suspicious RDP session redirect using tscon.exe

id: 6be7f3fc-8917-11ec-a8a3-0242ac120002
level: medium
status: test
detection:
  selection:
    Channel: Security
    EventID: 4688
    CommandLine: "*/dest*rdp-tcp*"
  condition: selection
falsepositives:
  - Unknown
tags:
  - attack.lateral_movement
  - attack.t1563.002
  - attack.t1021.001
references:
  - https://attack.mitre.org/techniques/T1563/002/
  - https://www.ired.team/offensive-security/lateral-movement/t1076-rdp-hijacking-for-lateral-movement
logsource: non-default
ruletype: Hayabusa