author: Zach Mathis
date: 2022/02/05
modified: 2022/02/05

title: 'Suspicious Command Line: Possible Meterpreter getsystem'
title_jp: '不審なコマンドライン: Meterpreterのgetsystemコマンドの可能性がある'
details: 'Command Line: %CommandLine%  :  Path: %NewProcessName%  :  Process ID: %NewProcessId%  :  User: %SubjectUserName%  :  LogonID: %SubjectLogonId%'
details_jp: 'コマンドライン: %CommandLine%  :  パス: %NewProcessName%  :  プロセスID: %NewProcessId%  :  ユーザ: %SubjectUserName%  :  ログオンID: %SubjectLogonId%'
description: 
description_jp: 

id: 75744b7f-7e4a-47fe-afbe-1ee74ec2448e
level: medium
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4688
        NewProcessName|endswith: cmd.exe
        CommandLine|contains: .\pipe
    condition: selection
falsepositives:
    - normal system usage
tags:
references: Original rule is from DeepBlueCLI
sample-evtx: 
logsource: non-default
ruletype: Hayabusa