title: Unusual File Download from Direct IP Address
ruletype: Sigma
author: Nasreddine Bencherchali, Florian Roth
date: 2022/09/07
description: Detects the download of suspicious file type from URLs with IP
detection:
    SELECTION_1:
        EventID: 15
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Contents|re: http[s]?://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    SELECTION_4:
        TargetFilename:
        - '*.ps1:Zone*'
        - '*.bat:Zone*'
        - '*.exe:Zone*'
        - '*.vbe:Zone*'
        - '*.vbs:Zone*'
        - '*.dll:Zone*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 025bd229-fd1f-4fdb-97ab-20006e1a5368
level: high
logsource:
    category: create_stream_hash
    product: windows
modified: 2022/12/05
references:
- https://github.com/trustedsec/SysmonCommunityGuide/blob/adcdfee20999f422b974c8d4149bf4c361237db7/chapters/file-stream-creation-hash.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004

