title: Creation Of a Suspicious ADS File Outside a Browser Download
ruletype: Sigma
author: frack113
date: 2022/10/22
description: Detects the creation of a suspicious ADS (Alternate Data Stream) file
    by software other than browsers
detection:
    SELECTION_1:
        EventID: 15
    SELECTION_10:
        Image: '*\maxthon.exe'
    SELECTION_11:
        Image: C:\Program Files (x86)\Microsoft\EdgeWebView\Application\\*
    SELECTION_12:
        Image: '*\WindowsApps\MicrosoftEdge.exe'
    SELECTION_13:
        Image:
        - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
        - C:\Program Files\Microsoft\Edge\Application\msedge.exe
    SELECTION_14:
        Image:
        - C:\Program Files (x86)\Microsoft\EdgeCore\\*
        - C:\Program Files\Microsoft\EdgeCore\\*
    SELECTION_15:
        Image:
        - '*\msedge.exe'
        - '*\msedgewebview2.exe'
    SELECTION_16:
        Image: '*\opera.exe'
    SELECTION_17:
        Image: '*\safari.exe'
    SELECTION_18:
        Image: '*\seamonkey.exe'
    SELECTION_19:
        Image: '*\vivaldi.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        Image: '*\whale.exe'
    SELECTION_3:
        Contents: '[ZoneTransfer]  ZoneId=3*'
    SELECTION_4:
        TargetFilename: '*:Zone.Identifier'
    SELECTION_5:
        TargetFilename:
        - '*.exe*'
        - '*.scr*'
        - '*.bat*'
        - '*.cmd*'
        - '*.docx*'
        - '*.hta*'
        - '*.jse*'
        - '*.lnk*'
        - '*.pptx*'
        - '*.ps*'
        - '*.reg*'
        - '*.sct*'
        - '*.vb*'
        - '*.wsc*'
        - '*.wsf*'
        - '*.xlsx*'
    SELECTION_6:
        Image: '*\brave.exe'
    SELECTION_7:
        Image:
        - C:\Program Files\Google\Chrome\Application\chrome.exe
        - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
    SELECTION_8:
        Image:
        - C:\Program Files\Mozilla Firefox\firefox.exe
        - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    SELECTION_9:
        Image:
        - C:\Program Files (x86)\Internet Explorer\iexplore.exe
        - C:\Program Files\Internet Explorer\iexplore.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7) or (SELECTION_8) or
        (SELECTION_9) or (SELECTION_10) or (SELECTION_11 or SELECTION_12 or SELECTION_13)
        or (SELECTION_14 and SELECTION_15) or (SELECTION_16) or (SELECTION_17) or
        (SELECTION_18) or (SELECTION_19) or (SELECTION_20)))
falsepositives:
- Other legitimate browsers not currently included in the filter (please add them)
- Legitimate downloads via scripting or command-line tools (Investigate to determine
    if it's legitimate)
id: 573df571-a223-43bc-846e-3f98da481eca
level: medium
logsource:
    category: create_stream_hash
    product: windows
modified: 2023/04/18
references:
- https://www.bleepingcomputer.com/news/security/exploited-windows-zero-day-lets-javascript-files-bypass-security-warnings/
status: experimental
tags:
- attack.defense_evasion

