title: Suspicious File Download from File Sharing Domain
ruletype: Sigma
author: Florian Roth
date: 2022/08/24
description: Detects the download of suspicious file type from a well-known file and
    paste sharing domain
detection:
    SELECTION_1:
        EventID: 15
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Contents:
        - '*https://transfer.sh/*'
        - '*raw.githubusercontent.com*'
        - '*gist.githubusercontent.com*'
        - '*pastebin.com*'
        - '*cdn.discordapp.com/attachments/*'
        - '*mediafire.com*'
        - '*mega.nz*'
        - '*ddns.net*'
        - '*.paste.ee*'
        - '*.hastebin.com*'
        - '*.ghostbin.co/*'
        - '*ufile.io*'
        - '*storage.googleapis.com*'
        - '*anonfiles.com*'
        - '*send.exploit.in*'
        - '*privatlab.net*'
        - '*privatlab.com*'
        - '*sendspace.com*'
    SELECTION_4:
        TargetFilename:
        - '*.exe:Zone*'
        - '*.vbs:Zone*'
        - '*.dll:Zone*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- TargetFilename
- Image
id: 52182dfb-afb7-41db-b4bc-5336cb29b464
level: high
logsource:
    category: create_stream_hash
    definition: 'Requirements: Sysmon config with Imphash logging activated'
    product: windows
modified: 2022/12/02
references:
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventid=90015
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
status: experimental
tags:
- attack.defense_evasion
- attack.s0139
- attack.t1564.004

