title: Suspicious Rejected SMB Guest Logon From IP
id: 610c6a10-ca67-69c5-0f6d-761487fb3b37
related:
    - id: 71886b70-d7b4-4dbf-acce-87d2ca135262
      type: derived
status: test
description: Detect Attempt PrintNightmare (CVE-2021-1675) Remote code execution in Windows Spooler Service
references:
    - https://twitter.com/KevTheHermit/status/1410203844064301056
    - https://web.archive.org/web/20210629055600/https://github.com/hhlxf/PrintNightmare/
    - https://web.archive.org/web/20210701042336/https://github.com/afwu/PrintNightmare
author: Florian Roth (Nextron Systems), KevTheHermit, fuzzyf10w
date: 2021-06-30
modified: 2023-01-02
tags:
    - attack.credential-access
    - attack.t1110.001
logsource:
    product: windows
    service: smbclient-security
detection:
    smbclient_security:
        Channel: Microsoft-Windows-SmbClient/Security
    selection:
        EventID: 31017
        UserName: ''
        ServerName|startswith: \1
    condition: smbclient_security and selection
falsepositives:
    - Account fallback reasons (after failed login with specific account)
level: medium
ruletype: Sigma
