title: Lace Tempest Cobalt Strike Download
id: 9cf64f9c-ca0e-07b8-3d01-106dac73ef8b
related:
    - id: aa5b0a40-ed88-46aa-9fdc-0337b379ca9d
      type: derived
status: test
description: Detects specific command line execution used by Lace Tempest to download Cobalt Strike as reported by SysAid Team
references:
    - https://www.sysaid.com/blog/service-desk/on-premise-software-security-vulnerability-notification
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-11-09
tags:
    - attack.execution
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - -nop -w hidden -c IEX ((new-object net.webclient).downloadstring(
            - /a')
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
