title: Rare Scheduled Task Creations
ruletype: Sigma
author: Florian Roth
date: 2017/03/17
description: This rule detects rare scheduled task creations. Typically software gets
    installed on multiple systems and not only on a few. The aggregation and count
    function selects tasks with rare names.
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-TaskScheduler/Operational
    SELECTION_2:
        EventID: 106
    SELECTION_3:
        TaskName: \Microsoft\Windows\Windows Defender\Windows Defender Scheduled Scan
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3))) | count() by
        TaskName < 5
    timeframe: 7d
falsepositives:
- Software installation
id: b20f6158-9438-41be-83da-a5a16ac90c2b
level: low
logsource:
    product: windows
    service: taskscheduler
modified: 2021/12/28
status: test
tags:
- attack.persistence
- attack.s0111
- attack.t1053.005

