title: Scheduled Task Executed From A Suspicious Location
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/05
description: Detects the execution of Scheduled Tasks where the Program being run
    is located in a suspicious location or it's an unusale program to be run from
    a Scheduled Task
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-TaskScheduler/Operational
    SELECTION_2:
        EventID: 129
    SELECTION_3:
        Path:
        - '*C:\Windows\Temp\\*'
        - '*\AppData\Local\Temp\\*'
        - '*\Desktop\\*'
        - '*\Downloads\\*'
        - '*\Users\Public\\*'
        - '*C:\Temp\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 424273ea-7cf8-43a6-b712-375f925e481f
level: medium
logsource:
    definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
        disabled by default and needs to be enabled in order for this detection to
        trigger'
    product: windows
    service: taskscheduler
modified: 2023/02/07
references:
- Internal Research
status: experimental
tags:
- attack.persistence
- attack.t1053.005

