title: Deployment AppX Package Was Blocked By AppLocker
ruletype: Sigma
author: frack113
date: 2023/01/11
description: Detects an appx package deployment that was blocked by AppLocker policy
detection:
    SELECTION_1:
        Provider_Name: Microsoft-Windows-AppXDeploymentServer/Operational
    SELECTION_2:
        EventID: 412
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 6ae53108-c3a0-4bee-8f45-c7591a2c337f
level: medium
logsource:
    product: windows
    service: appxdeployment-server
references:
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWEventsList/CSV/Windows11/22H2/W11_22H2_Pro_20220920_22621.382/Providers/Microsoft-Windows-AppXDeployment-Server.csv
status: experimental
tags:
- attack.defense_evasion

