title: Suspicious Remote AppX Package Locations
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/11
description: Detects an appx package added the pipeline of the "to be processed" packages
    which is downloaded from a suspicious domain
detection:
    SELECTION_1:
        Provider_Name: Microsoft-Windows-AppXDeploymentServer/Operational
    SELECTION_2:
        EventID: 854
    SELECTION_3:
        Path:
        - '*transfer.sh*'
        - '*raw.githubusercontent.com*'
        - '*gist.githubusercontent.com*'
        - '*pastebin.com*'
        - '*cdn.discordapp.com/attachments/*'
        - '*mediafire.com*'
        - '*mega.nz*'
        - '*ddns.net*'
        - '*.paste.ee*'
        - '*.hastebin.com*'
        - '*.ghostbin.co/*'
        - '*ufile.io*'
        - '*storage.googleapis.com*'
        - '*anonfiles.com*'
        - '*send.exploit.in*'
        - '*privatlab.net*'
        - '*privatlab.com*'
        - '*sendspace.com*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 8b48ad89-10d8-4382-a546-50588c410f0d
level: high
logsource:
    product: windows
    service: appxdeployment-server
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
status: experimental
tags:
- attack.defense_evasion

