title: Potential Malicious AppX Package Installation Attempts
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/11
description: Detects potential installation or installation attempts of known malicious
    appx packages
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-AppXDeploymentServer/Operational
    SELECTION_2:
        EventID: 400
    SELECTION_3:
        EventID: 401
    SELECTION_4:
        PackageFullName: '*3669e262-ec02-4e9d-bcb4-3d008b4afac9*'
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Rare occasions where a malicious package uses the exact same name and version as
    a legtimate application
id: 09d3b48b-be17-47f5-bf4e-94e7e75d09ce
level: medium
logsource:
    product: windows
    service: appxdeployment-server
modified: 2023/01/12
references:
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
- https://news.sophos.com/en-us/2021/11/11/bazarloader-call-me-back-attack-abuses-windows-10-apps-mechanism/
- https://forensicitguy.github.io/analyzing-magnitude-magniber-appx/
status: experimental
tags:
- attack.defense_evasion

