title: Deployment Of The AppX Package Was Blocked By The Policy
ruletype: Sigma
author: frack113
date: 2023/01/11
description: Detects an appx package deployment that was blocked by the local computer
    policy
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-AppXDeploymentServer/Operational
    SELECTION_2:
        EventID: 441
    SELECTION_3:
        EventID: 442
    SELECTION_4:
        EventID: 453
    SELECTION_5:
        EventID: 454
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
id: e021bbb5-407f-41f5-9dc9-1864c45a7a51
level: medium
logsource:
    product: windows
    service: appxdeployment-server
references:
- https://learn.microsoft.com/en-us/windows/win32/appxpkg/troubleshooting
- https://github.com/nasbench/EVTX-ETW-Resources/blob/7a806a148b3d9d381193d4a80356016e6e8b1ee8/ETWEventsList/CSV/Windows11/22H2/W11_22H2_Pro_20220920_22621.382/Providers/Microsoft-Windows-AppXDeployment-Server.csv
status: experimental
tags:
- attack.defense_evasion

