author: Zach Mathis
date: 2022/02/06
modified: 2022/02/06

title: Unexpected Shutdown
title_jp: 予期しないシャットダウンが発生した
details: 
details_jp: 
description: 
description_jp: 

id: 517c0b15-d2bf-48a3-926c-f7b4a96dcec3
level: low
status: stable
detection:
    selection:
        Channel: System
        EventID: 6008
    condition: selection
falsepositives:
tags:
    - attack.impact
    - attack.t1499
references:
logsource: default
ruletype: Hayabusa