author: Zach Mathis
date: 2022/02/06
modified: 2022/03/22

title: Unexpected Shutdown
title_jp: 予期しないシャットダウンが発生した
details: 
details_jp: 
description: The shutdown operation is initiated automatically by a program that uses the InitiateSystemShutdownEx function with the force flag.
description_jp: 

id: 517c0b15-d2bf-48a3-926c-f7b4a96dcec3
level: low
status: stable
logsource:
    product: windows
    service: system
detection:
    selection:
        Channel: System
        EventID: 6008
    condition: selection
falsepositives:
tags:
    - attack.impact
    - attack.t1499
references:
ruletype: Hayabusa
