author: Eric Conrad, Zach Mathis
date: 2022/02/06
modified: 2022/02/06

title: Possible Metasploit Service Installed
title_jp: 
details: 'Service: %ServiceName%  :  Path: %ImagePath%'
details_jp: 'サービス: %ServiceName%  :  パス: %ImagePath%'
description: 
description_jp: 

id: 76355548-fa5a-4310-9610-0de4b11f4688
level: medium
status: test
detection:
    selection:
        Channel: System
        EventID: 7045
        ImagePath|re: ^%SYSTEMROOT%\\[a-zA-Z]{8}\.exe$
    condition: selection
falsepositives:
    - normal system usage
tags:
    - attack.persistence
    - attack.t1543.003
references:
    - https://attack.mitre.org/techniques/T1543/003/
logsource: default
ruletype: Hayabusa