author: Eric Conrad, Zach Mathis
creation_date: 2020/11/08
updated_date: 2022/02/07

title: Possibly Malicious Service Installed
title_jp: 悪意のあるサービスがインストールされた
details: 'Service: %ServiceName%  :  Path: %ImagePath%'
details_jp: 'サービス: %ServiceName%  :  パス: %ImagePath%'
description: Malicious service was installed based on suspicious entries in ./config/regex/regexes_suspicous_service.txt
description_jp: Malicious service was installed based on suspicious entries in ./config/regex/regexes_suspicous_service.txt

id: dbbfd9f3-9508-478b-887e-03ddb9236909
level: high
status: test
detection:
    selection:
        Channel: System
        EventID: 7045
        ImagePath:
            allowlist: ./config/regex/allowlist_legitimate_services.txt
    selection_SuspiciousServiceNames:
        ServiceName:
            - regexes: ./config/regex/detectlist_suspicous_services.txt
            - min_length: 100
    selection_SuspiciousPathNames:
        ImagePath:
            - regexes: ./config/regex/detectlist_suspicous_services.txt
            - min_length: 300
    condition: selection and (selection_SuspiciousServiceNames or selection_SuspiciousPathNames)
falsepositives:
    - normal system usage
tags:
    - attack.persistence
    - attack.t1543.003
references:
    - https://attack.mitre.org/techniques/T1543/003/
logsource: default
ruletype: Hayabusa