title: DNS Query To MEGA Hosting Website - DNS Client
id: 14b17417-8ae7-ff8e-fe36-28aaa337ccd5
related:
    - id: 613c03ba-0779-4a53-8a1f-47f914a4ded3
      type: similar
    - id: 66474410-b883-415f-9f8d-75345a0a66a6
      type: derived
status: test
description: Detects DNS queries for subdomains related to MEGA sharing website
references:
    - https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-16
tags:
    - attack.exfiltration
    - attack.t1567.002
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event Log must be enabled/collected in order to receive the events.'
detection:
    dns_client:
        Channel: Microsoft-Windows-DNS Client Events/Operational
    selection:
        EventID: 3008
        QueryName|contains: userstorage.mega.co.nz
    condition: dns_client and selection
falsepositives:
    - Legitimate DNS queries and usage of Mega
level: medium
ruletype: Sigma
