title: DNS Query To Put.io - DNS Client
id: 9b3ffe56-a479-9b35-d590-9b94c2f7fa35
related:
    - id: 8b69fd42-9dad-4674-abef-7fdef43ef92a
      type: derived
status: test
description: Detects DNS queries for subdomains related to "Put.io" sharing website.
references:
    - https://darkatlas.io/blog/medusa-ransomware-group-opsec-failure
author: Omar Khaled (@beacon_exe)
date: 2024-08-23
tags:
    - attack.command-and-control
logsource:
    product: windows
    service: dns-client
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event Log must be enabled/collected in order to receive the events.'
detection:
    dns_client:
        Channel: Microsoft-Windows-DNS Client Events/Operational
    selection:
        EventID: 3008
        QueryName|contains:
            - api.put.io
            - upload.put.io
    condition: dns_client and selection
falsepositives:
    - Legitimate DNS queries and usage of Put.io
level: medium
ruletype: Sigma
