title: DNS Query for Ufile.io Upload Domain - DNS Client
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects DNS queries to "ufile.io". Which is often abused by malware for
    upload and exfiltration
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-DNS Client Events/Operational
    SELECTION_2:
        EventID: 3008
    SELECTION_3:
        QueryName: '*ufile.io*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate DNS queries and usage of Ufile
id: 090ffaad-c01a-4879-850c-6d57da98452d
level: high
logsource:
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
    product: windows
    service: dns-client
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
related:
-   id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
    type: similar
status: experimental
tags:
- attack.exfiltration
- attack.t1567.002

