title: DNS Query for MEGA.io Upload Domain - DNS Client
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects DNS queries for subdomains used for upload to MEGA.io
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-DNS Client Events/Operational
    SELECTION_2:
        EventID: 3008
    SELECTION_3:
        QueryName: '*userstorage.mega.co.nz*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate DNS queries and usage of Mega
id: 66474410-b883-415f-9f8d-75345a0a66a6
level: high
logsource:
    definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
        Log must be enabled/collected in order to receive the events.'
    product: windows
    service: dns-client
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
related:
-   id: 613c03ba-0779-4a53-8a1f-47f914a4ded3
    type: similar
status: test
tags:
- attack.exfiltration
- attack.t1567.002

