
title: Query to Ammyy Remote Access Software Domain
ruletype: Sigma
author: frack113
date: 2022/04/04
description: "An adversary may use legitimate desktop support and remote access software,\
  \ such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive\
  \ command and control channel to target systems within networks.\nThese services\
  \ are commonly used as legitimate technical support software, and may be allowed\
  \ by application control within a target environment.\nRemote access tools like\
  \ VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate\
  \ software commonly used by adversaries. (Citation: Symantec Living off the Land)\
  \ \n"
detection:
  SELECTION_1:
    EventID: 22
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    QueryName: '*.ammyy.com'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 71ba22cb-8a01-42e2-a6dd-5bf9b547498f
level: medium
logsource:
  category: dns_query
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1219/T1219.md#atomic-test-6---ammyy-admin-software-execution
status: experimental
tags:
- attack.command_and_control
- attack.t1219
