
title: Query to GoToAssist Remote Access Software Domain
ruletype: Sigma
author: frack113
date: 2022/02/13
description: "An adversary may use legitimate desktop support and remote access software,\
  \ such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive\
  \ command and control channel to target systems within networks.\nThese services\
  \ are commonly used as legitimate technical support software, and may be allowed\
  \ by application control within a target environment.\nRemote access tools like\
  \ VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate\
  \ software commonly used by adversaries. (Citation: Symantec Living off the Land)\
  \ \n"
detection:
  SELECTION_1:
    EventID: 22
  SELECTION_2:
    QueryName: '*.getgo.com'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 7c4cf8e0-1362-48b2-a512-b606d2065d7d
level: medium
logsource:
  category: dns_query
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1219/T1219.md#atomic-test-4---gotoassist-files-detected-test-on-windows
status: experimental
