
title: Suspicious TeamViewer Domain Access
ruletype: Sigma
author: Florian Roth
date: 2022/01/30
description: Detects DNS queries to a TeamViewer domain only resolved by a TeamViewer
  client by an image that isn't named TeamViewer (sometimes used by threat actors
  for obfuscation)
detection:
  SELECTION_1:
    EventID: 22
  SELECTION_2:
    QueryName:
    - taf.teamviewer.com
    - udp.ping.teamviewer.com
  SELECTION_3:
    Image: '*TeamViewer*'
  condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- Unknown binary names of TeamViewer
- Other programs that also lookup the observed domain
id: 778ba9a8-45e4-4b80-8e3e-34a419f0b85e
level: medium
logsource:
  category: dns_query
  product: windows
modified: 2022/02/08
references:
- https://www.teamviewer.com/en-us/
status: experimental
tags:
- attack.command_and_control
- attack.t1219
