
title: Removal Amsi Provider Reg Key
ruletype: Sigma
author: frack113
date: 2021/06/07
description: Remove the AMSI Provider registry key in HKLM\Software\Microsoft\AMSI
  to disable AMSI inspection
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventType: DeleteKey
  SELECTION_3:
    TargetObject:
    - '*{2781761E-28E0-4109-99FE-B9D127C57AFE}'
    - '*{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 41d1058a-aea7-4952-9293-29eaaf516465
level: high
logsource:
  category: registry_delete
  definition: key must be add to the sysmon configuration to works
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
- https://seclists.org/fulldisclosure/2020/Mar/45
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
