
title: Removal of Potential COM Hijacking Registry Keys
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection to trigger for processes removing .*\shell\open\command
  registry keys. Registry keys that might have been used for COM hijacking activities.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventType: DeleteKey
  SELECTION_3:
    TargetObject: '*\shell\open\command'
  SELECTION_4:
    Image: C:\Windows\system32\svchost.exe
  SELECTION_5:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_6:
    Image: '*\OfficeClickToRun.exe'
  SELECTION_7:
    Image: C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  SELECTION_8:
    Image: '*\Dropbox.exe'
  SELECTION_9:
    TargetObject: HKCR\Dropbox.*
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)
    or (SELECTION_5 and SELECTION_6) or (SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: 96f697b0-b499-4e5d-9908-a67bec11cdb6
level: medium
logsource:
  category: registry_delete
  product: windows
modified: 2022/03/26
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/7
- https://threathunterplaybook.com/evals/apt29/detections/3.C.1_22A46621-7A92-48C1-81BF-B3937EB4FDC3.html
- https://docs.microsoft.com/en-us/windows/win32/shell/launch
- https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand
- https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code
status: test
tags:
- attack.defense_evasion
- attack.t1112
