title: Potential Credential Dumping Attempt Via PowerShell
id: 05592793-60ba-a781-f058-0218e4f38976
related:
    - id: 3f07b9d1-2082-4c56-9277-613a621983cc
      type: obsolete
    - id: fb656378-f909-47c1-8747-278bf09f4f4f
      type: similar
    - id: 0f920ebe-7aea-4c54-b202-9aa0c609cfe5
      type: derived
status: test
description: Detects a PowerShell process requesting access to "lsass.exe", which can be indicative of potential credential dumping attempts
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
author: oscd.community, Natalia Shornikova
date: '2020-10-06'
modified: '2023-11-28'
tags:
    - attack.credential-access
    - attack.t1003.001
    - detection.threat-hunting
    - sysmon
logsource:
    product: windows
    category: process_access
detection:
    process_access:
        EventID: 10
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        SourceImage|endswith:
            - \powershell.exe
            - \pwsh.exe
        TargetImage|endswith: \lsass.exe
    condition: process_access and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
