title: Vulnerable Lenovo Driver Load
ruletype: Sigma
author: Florian Roth
date: 2022/11/10
description: Detects the load of the vulnerable Lenovo driver as reported in CVE-2022-3699
    which can be used to escalate privileges
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Hashes:
        - '*SHA256=F05B1EE9E2F6AB704B8919D5071BECBCE6F9D0F9D0BA32A460C41D5272134ABE*'
        - '*SHA1=B89A8EEF5AEAE806AF5BA212A8068845CAFDAB6F*'
        - '*MD5=B941C8364308990EE4CC6EADF7214E0F*'
    SELECTION_4:
        sha256: f05b1ee9e2f6ab704b8919d5071becbce6f9d0f9d0ba32a460c41d5272134abe
    SELECTION_5:
        sha1: b89a8eef5aeae806af5ba212a8068845cafdab6f
    SELECTION_6:
        md5: b941c8364308990ee4cc6eadf7214e0f
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6))
falsepositives:
- Legitimate driver loads (old driver that didn't receive an update)
id: ac683a42-877b-4ff8-91ac-69e94b0f70b4
level: high
logsource:
    category: driver_load
    product: windows
modified: 2022/12/30
references:
- https://support.lenovo.com/de/en/product_security/ps500533-lenovo-diagnostics-vulnerabilities
- https://github.com/alfarom256/CVE-2022-3699/
status: experimental
tags:
- attack.privilege_escalation
- cve.2021.21551
- attack.t1543

