title: Vulnerable AVAST Anti Rootkit Driver Load
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/28
description: Detects the load of a signed and vulnerable AVAST Anti Rootkit driver
    often used by threat actors or malware for stopping and disabling AV and EDR products
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Hashes:
        - '*MD5=a179c4093d05a3e1ee73f6ff07f994aa*'
        - '*SHA1=5d6b9e80e12bfc595d4d26f6afb099b3cb471dd4*'
        - '*SHA256=4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1*'
    SELECTION_4:
        md5: a179c4093d05a3e1ee73f6ff07f994aa
    SELECTION_5:
        sha1: 5d6b9e80e12bfc595d4d26f6afb099b3cb471dd4
    SELECTION_6:
        sha256: 4b5229b3250c8c08b98cb710d6c056144271de099a57ae09f5d2097fc41bd4f1
    SELECTION_7:
        ImageLoaded: '*\aswArPot.sys'
    SELECTION_8:
        Signed: 'false'
    SELECTION_9:
        SignatureStatus: Expired
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4 or
        SELECTION_5 or SELECTION_6) or (SELECTION_7 and (SELECTION_8 or SELECTION_9))))
falsepositives:
- Unknown
id: 7c676970-af4f-43c8-80af-ec9b49952852
level: high
logsource:
    category: driver_load
    product: windows
modified: 2022/12/30
references:
- https://www.aon.com/cyber-solutions/aon_cyber_labs/yours-truly-signed-av-driver-weaponizing-an-antivirus-driver/
status: experimental
tags:
- attack.privilege_escalation
- attack.t1543.003

