title: Vulnerable HackSys Extreme Vulnerable Driver Load
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/18
description: Detects the load of HackSys Extreme Vulnerable Driver which is an intentionally
    vulnerable Windows driver developed for security enthusiasts to learn and polish
    their exploitation skills at Kernel level and often abused by threat actors
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\HEVD.sys'
    SELECTION_4:
        Hashes:
        - '*IMPHASH=f26d0b110873a1c7d8c4f08fbeab89c5*'
        - '*IMPHASH=c46ea2e651fd5f7f716c8867c6d13594*'
    SELECTION_5:
        IMPHASH:
        - f26d0b110873a1c7d8c4f08fbeab89c5
        - c46ea2e651fd5f7f716c8867c6d13594
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unlikely
id: 295c9289-acee-4503-a571-8eacaef36b28
level: high
logsource:
    category: driver_load
    product: windows
references:
- https://github.com/hacksysteam/HackSysExtremeVulnerableDriver
status: experimental
tags:
- attack.privilege_escalation
- attack.t1543.003

