title: Suspicious Driver Load from Temp
ruletype: Sigma
author: Florian Roth
date: 2017/02/12
description: Detects a driver load from a temporary directory
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\Temp\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- There is a relevant set of false positives depending on applications in the environment
id: 2c4523d5-d481-4ed0-8ec3-7fbf0cb41a75
level: high
logsource:
    category: driver_load
    product: windows
modified: 2021/11/27
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
yml_filename: driver_load_susp_temp_use.yml
yml_path: rules/windows/driver_load
---

