title: Mint Sandstorm - Log4J Wstomcat Process Execution
id: bc808841-697e-7b11-dc93-e0c729b17e87
related:
    - id: 7c97c625-0350-4f0a-8943-f6cadc88125e
      type: derived
status: test
description: Detects Log4J Wstomcat process execution as seen in Mint Sandstorm activity
references:
    - https://www.microsoft.com/en-us/security/blog/2023/04/18/nation-state-threat-actor-mint-sandstorm-refines-tradecraft-to-attack-high-value-targets/
author: Nasreddine Bencherchali (Nextron Systems), MSTIC (idea)
date: 2023-04-20
modified: 2023-11-29
tags:
    - attack.execution
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \ws_tomcatservice.exe
    filter_main_repadmin:
        NewProcessName|endswith: \repadmin.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
