
title: NetNTLM Downgrade Attack
author: Florian Roth, wagga
date: 2018/03/20
description: Detects NetNTLM downgrade attack
detection:
  SELECTION_1:
    TargetObject: '*SYSTEM\\*'
  SELECTION_2:
    TargetObject: '*ControlSet*'
  SELECTION_3:
    TargetObject: '*\Control\Lsa*'
  SELECTION_4:
    TargetObject:
    - '*\lmcompatibilitylevel'
    - '*\NtlmMinClientSec'
    - '*\RestrictSendingNTLMTraffic'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: d67572a0-e2ec-45d6-b8db-c100d14b8ef2
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2021/09/21
references:
- https://www.optiv.com/blog/post-exploitation-using-netntlm-downgrade-attacks
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
- attack.t1112
