
title: Registry Persistence Mechanism via Windows Telemetry
author: Lednyov Alexey, oscd.community
date: 2020/10/16
description: Detects persistence method using windows telemetry
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\TelemetryController\\*'
  SELECTION_3:
    TargetObject: '*\Command*'
  SELECTION_4:
    Details: '*.exe*'
  SELECTION_5:
    Details:
    - '*\system32\CompatTelRunner.exe*'
    - '*\system32\DeviceCensus.exe*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- unknown
id: 73a883d0-0348-4be4-a8d8-51031c2564f8
level: critical
logsource:
  category: registry_event
  definition: 'Requirements: Sysmon config that monitors \SOFTWARE\Microsoft\Windows
    NT\CurrentVersion\AppCompatFlags\TelemetryController subkey of the HKLU hives'
  product: windows
modified: 2022/01/13
references:
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/
status: test
tags:
- attack.persistence
- attack.t1053.005
