
title: Changing RDP Port to Non Standard Number
author: frack113
date: 2022/01/01
description: |
  Remote desktop is a common feature in operating systems.
  It allows a user to log into an interactive session with a system desktop graphical user interface on a remote system.
  Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as Remote Desktop Services (RDS).
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: HKLM\System\CurrentControlSet\Control\Terminal Server\WinStations\RDP-Tcp\PortNumber
  SELECTION_3:
    Details: DWORD (0x00000d3d)
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Unknown
id: 509e84b9-a71a-40e0-834f-05470369bd1e
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1021.001/T1021.001.md#atomic-test-1---rdp-to-domaincontroller
status: experimental
tags:
- attack.persistence
- attack.t1547.010
