
title: HybridConnectionManager Service Installation
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
description: Detects the installation of the Azure Hybrid Connection Manager service
  to allow remote code execution from Azure function.
detection:
  SELECTION_1:
    TargetObject: '*\Services\HybridConnectionManager*'
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    Details: '*Microsoft.HybridConnectionManager.Listener.exe*'
  condition: (SELECTION_1 or (SELECTION_2 and SELECTION_3))
falsepositives:
- Unknown
id: ac8866c7-ce44-46fd-8c17-b24acff96ca8
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/01/13
references:
- https://twitter.com/Cyb3rWard0g/status/1381642789369286662
status: experimental
tags:
- attack.resource_development
- attack.t1608
