
title: UAC Bypass Using Windows Media Player - Registry
author: Christian Burkard
date: 2021/08/23
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
  (UACMe 32)
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Compatibility
      Assistant\Store\C:\Program Files\Windows Media Player\osk.exe'
  SELECTION_3:
    Details: Binary Data
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 5f9db380-ea57-4d1e-beab-8a2d33397e93
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/01/13
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
