
title: New File Association Using Exefile
author: Andreas Hunkeler (@Karneades)
date: 2021/11/19
description: Detects the abuse of the exefile handler in new file association. Used
  for bypass of security products.
detection:
  SELECTION_1:
    TargetObject: '*Classes\.*'
  SELECTION_2:
    Details: exefile
  SELECTION_3:
    EventType: SetValue
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 44a22d59-b175-4f13-8c16-cbaef5b581ff
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://twitter.com/mrd0x/status/1461041276514623491
status: experimental
tags:
- attack.defense_evasion
