
title: Add Port Monitor Persistence in Registry
author: frack113
date: 2021/12/30
description: |
  Adversaries may use port monitors to run an attacker supplied DLL during system boot for persistence or privilege escalation.
  A port monitor can be set through the AddMonitor API call to set a DLL to be loaded at startup.
detection:
  SELECTION_1:
    TargetObject: HKLM\System\CurrentControlSet\Control\Print\Monitors\\*
  SELECTION_2:
    Details: '*.dll'
  SELECTION_3:
    EventType: SetValue
  SELECTION_4:
    Image: C:\Windows\System32\spoolsv.exe
  SELECTION_5:
    TargetObject: '*\System\CurrentControlSet\Control\Print\Monitors\CutePDF Writer
      Monitor v4.0\Driver*'
  SELECTION_6:
    Details: cpwmon64_v40.dll
  SELECTION_7:
    User:
    - '*AUTHORI*'
    - '*AUTORI*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
    and SELECTION_5 and SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 944e8941-f6f6-4ee8-ac05-1c224e923c0e
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/02/09
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.010/T1547.010.md
status: experimental
tags:
- attack.persistence
- attack.t1547.010
