
title: PowerShell as a Service in Registry
author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects that a powershell code is written to the registry as a service.
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*\Services\\*'
  SELECTION_3:
    TargetObject: '*\ImagePath'
  SELECTION_4:
    Details:
    - '*powershell*'
    - '*pwsh*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 4a5f5a5e-ac01-474b-9b4e-d61298c9df1d
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/01/13
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: experimental
tags:
- attack.execution
- attack.t1569.002
