
title: WinSock2 Autorun Keys Modification
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*\System\CurrentControlSet\Services\WinSock2\Parameters*'
  SELECTION_3:
    TargetObject:
    - '*\Protocol_Catalog9\Catalog_Entries*'
    - '*\NameSpace_Catalog5\Catalog_Entries*'
  SELECTION_4:
    Details: (Empty)
  SELECTION_5:
    Image: C:\Windows\System32\MsiExec.exe
  SELECTION_6:
    Image: C:\Windows\syswow64\MsiExec.exe
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and  not (SELECTION_4
    or SELECTION_5 or SELECTION_6))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: d6c2ce7e-afb5-4337-9ca4-4b5254ed0565
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2022/02/16
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
