
title: Persistent Outlook Landing Pages
author: Tobias Michalski
date: 2021/06/10
description: Detects the manipulation of persistent URLs which could execute malicious
  code
detection:
  SELECTION_1:
    TargetObject:
    - '*Software\Microsoft\Office\\*'
    - '*\Outlook\Today\\*'
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*Stamp'
  SELECTION_4:
    Details: DWORD (0x00000001)
  SELECTION_5:
    TargetObject: '*UserDefinedUrl'
  SELECTION_6:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_7:
    Image: '*\OfficeClickToRun.exe'
  condition: ((SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4) or SELECTION_5))
    and  not ((SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
fields:
- Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/03/05
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
status: experimental
tags:
- attack.persistence
- attack.t1112
