
title: Registry Persistence Mechanisms
author: Karneades, Jonhnathan Ribeiro
date: 2018/04/11
description: Detects persistence registry keys
detection:
  SELECTION_1:
    TargetObject:
    - '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion*'
  SELECTION_2:
    TargetObject: '*\Image File Execution Options\\*'
  SELECTION_3:
    TargetObject: '*\GlobalFlag*'
  SELECTION_4:
    TargetObject: '*SilentProcessExit\\*'
  SELECTION_5:
    TargetObject: '*\ReportingMode*'
  SELECTION_6:
    TargetObject: '*SilentProcessExit\\*'
  SELECTION_7:
    TargetObject: '*\MonitorProcess*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)))
falsepositives:
- unknown
id: 36803969-5421-41ec-b92f-8500f79c23b0
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2021/11/27
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
status: test
tags:
- attack.privilege_escalation
- attack.persistence
- attack.defense_evasion
- attack.t1546.012
- car.2013-01-002
