
title: Shell Open Registry Keys Manipulation
author: Christian Burkard
date: 2021/08/30
description: Detects the shell open key manipulation (exefile and ms-settings) used
  for persistence and the pattern of UAC Bypass using fodhelper.exe, computerdefaults.exe,
  slui.exe via registry keys (e.g. UACMe 33 or 62)
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*Classes\ms-settings\shell\open\command\SymbolicLinkValue'
  SELECTION_3:
    Details: '*\Software\Classes\{*'
  SELECTION_4:
    TargetObject: '*Classes\ms-settings\shell\open\command\DelegateExecute'
  SELECTION_5:
    EventType: SetValue
  SELECTION_6:
    TargetObject:
    - '*Classes\ms-settings\shell\open\command\(Default)'
    - '*Classes\exefile\shell\open\command\(Default)'
  SELECTION_7:
    Details: (Empty)
  condition: (((SELECTION_1 and SELECTION_2 and SELECTION_3) or SELECTION_4) or ((SELECTION_5
    and SELECTION_6) and  not (SELECTION_7)))
falsepositives:
- Unknown
id: 152f3630-77c1-4284-bcc0-4cc68ab2f6e7
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/01/13
references:
- https://github.com/hfiref0x/UACME
- https://winscripting.blog/2017/05/12/first-entry-welcome-and-uac-bypass/
- https://github.com/RhinoSecurityLabs/Aggressor-Scripts/tree/master/UACBypass
- https://tria.ge/211119-gs7rtshcfr/behavioral2 [Lokibot sample from Nov 2021]
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- attack.t1546.001
