
title: IE Change Domain Zone
author: frack113
date: 2022/01/22
description: Hides the file extension through modification of the registry
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains\\*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Administrative scripts
id: 45e112d0-7759-4c2a-aa36-9f8fb79d3393
level: medium
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://docs.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
status: experimental
tags:
- attack.persistence
- attack.t1137
