
title: Run Once Task Configuration in Registry
author: Avneet Singh @v3t0_, oscd.community
date: 2020/11/15
description: Rule to detect the configuration of Run Once registry key. Configured
  payload can be run by runonce.exe /AlternateShellStartup
detection:
  SELECTION_1:
    TargetObject: HKLM\SOFTWARE\Microsoft\Active Setup\Installed Components*
  SELECTION_2:
    TargetObject: '*\StubPath'
  SELECTION_3:
    Details: '"C:\Program Files\Google\Chrome\Application\\*'
  SELECTION_4:
    Details: '*\Installer\chrmstp.exe" --configure-user-settings --verbose-logging
      --system-level'
  condition: ((SELECTION_1 and SELECTION_2) and  not ((SELECTION_3 and SELECTION_4)))
falsepositives:
- Legitimate modification of the registry key by legitimate program
id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2022/02/15
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runonce.yml
status: test
tags:
- attack.defense_evasion
- attack.t1112
