
title: Use IE Registry for Persistence
author: frack113
date: 2022/01/22
description: Use IE registry to hide a scripts
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*\Software\Microsoft\Windows\CurrentVersion\Internet Settings*'
  SELECTION_3:
    Details: DWORD*
  SELECTION_4:
    Details:
    - 'Cookie:'
    - 'Visited:'
    - (Empty)
  SELECTION_5:
    Details: Binary Data
  condition: ((SELECTION_1 and SELECTION_2) and  not ((SELECTION_3) or (SELECTION_4)
    or (SELECTION_5)))
falsepositives:
- Unknown
id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
level: low
logsource:
  category: registry_event
  product: windows
modified: 2022/02/20
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
