
title: Disable Tamper Protection on Windows Defender
author: Austin Songer @austinsonger
date: 2021/08/04
description: Detects disabling Windows Defender Tamper Protection
detection:
  SELECTION_1:
    EventType: SetValue
  SELECTION_2:
    TargetObject: '*HKLM\SOFTWARE\Microsoft\Windows Defender\Features\TamperProtection*'
  SELECTION_3:
    Details: DWORD (0)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 93d298a1-d28f-47f1-a468-d971e7796679
level: medium
logsource:
  category: registry_event
  product: windows
references:
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
