
title: CurrentVersion NT Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_10:
    TargetObject:
    - '*\ClickToRunStore\HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\\*'
    - '*\ClickToRun\REGISTRY\MACHINE\Software\Microsoft\Windows NT\CurrentVersion\\*'
  SELECTION_11:
    Image:
    - C:\Program Files\Microsoft Office\root\integration\integrator.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  SELECTION_12:
    TargetObject:
    - '*\Image File Execution Options\OSPPREARM.EXE\DisableExceptionChainValidation'
    - '*\Image File Execution Options\LICLUA.EXE\DisableExceptionChainValidation'
  SELECTION_13:
    Image: '*\DropboxUpdate.exe'
  SELECTION_14:
    TargetObject: '*\Image File Execution Options\DropboxUpdate.exe\DisableExceptionChainValidation'
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion*'
  SELECTION_6:
    TargetObject:
    - '*\Winlogon\VmApplet*'
    - '*\Winlogon\Userinit*'
    - '*\Winlogon\Taskman*'
    - '*\Winlogon\Shell*'
    - '*\Winlogon\GpExtensions*'
    - '*\Winlogon\AppSetup*'
    - '*\Winlogon\AlternateShells\AvailableShells*'
    - '*\Windows\IconServiceLib*'
    - '*\Windows\Appinit_Dlls*'
    - '*\Image File Execution Options*'
    - '*\Font Drivers*'
    - '*\Drivers32*'
    - '*\Windows\Run*'
    - '*\Windows\Load*'
  SELECTION_7:
    Details: (Empty)
  SELECTION_8:
    Image: C:\Program Files (x86)\Microsoft\Temp\\*
  SELECTION_9:
    Image: '*\MicrosoftEdgeUpdate.exe'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8 and SELECTION_9) or (SELECTION_10
    or SELECTION_11 or SELECTION_12) or (SELECTION_13 and SELECTION_14)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: cbf93e5d-ca6c-4722-8bea-e9119007c248
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2022/02/16
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
