
title: VBScript Payload Stored in Registry
ruletype: Sigma
author: Florian Roth
date: 2021/03/05
description: Detects VBScript content stored into registry keys as seen being used
  by UNC2452 group
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_10:
    Details:
    - '*\Microsoft.NET\Primary Interop Assemblies\Microsoft.mshtml.dll*'
    - '*<\Microsoft.mshtml,fileVersion=*'
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*Software\Microsoft\Windows\CurrentVersion*'
  SELECTION_6:
    Details:
    - '*vbscript*'
    - '*jscript*'
    - '*mshtml*'
    - '*RunHTMLApplication*'
    - '*Execute(*'
    - '*CreateObject*'
    - '*RegRead*'
    - '*window.close*'
  SELECTION_7:
    TargetObject: '*Software\Microsoft\Windows\CurrentVersion\Run*'
  SELECTION_8:
    Image: '*\msiexec.exe'
  SELECTION_9:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\\*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8 and SELECTION_9 and SELECTION_10)))
falsepositives:
- Unknown
id: 46490193-1b22-4c29-bdd6-5bf63907216f
level: high
logsource:
  category: registry_event
  product: windows
modified: 2022/02/09
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.persistence
- attack.t1547.001
