
title: New TaskCache Entry
ruletype: Sigma
author: Syed Hasan (@syedhasan009)
date: 2021/06/18
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled
  task is registered
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\\*'
  SELECTION_6:
    TargetObject:
    - '*Microsoft\Windows\UpdateOrchestrator*'
    - '*Microsoft\Windows\SoftwareProtectionPlatform\SvcRestartTask\Index*'
    - '*Microsoft\Windows\Flighting\OneSettings\RefreshCache\Index*'
  SELECTION_7:
    Image: C:\WINDOWS\system32\svchost.exe
  SELECTION_8:
    TargetObject:
    - '*Microsoft\Windows\WindowsUpdate\Scheduled Start\Index*'
    - '*Microsoft\Windows\PushToInstall\Registration\Index*'
    - '*Microsoft\Windows\GroupPolicy\{*}\Index*'
    - '*\TaskCache\Tree\Opera scheduled Autoupdate*'
    - '*\TaskCache\Tree\Opera scheduled assistant Autoupdate*'
    - '*\TaskCache\Tree\OneDrive Reporting*'
    - '*\TaskCache\Tree\OneDrive Standalone Update Task*'
    - '*\TaskCache\Tree\Mozilla\SD*'
    - '*\TaskCache\Tree\Microsoft\Windows\.NET Framework\.NET Framework *'
    - '*\TaskCache\Tree\Microsoft\Office\OfficeOsfInstaller\\*'
    - '*\TaskCache\Tree\Microsoft\Office\OfficeBackgroundTaskHandler*'
    - '*\TaskCache\Tree\GoogleUpdateTaskMachine*'
    - '*\TaskCache\Tree\DropboxUpdateTaskMachine*'
    - '*\TaskCache\Tree\Mozilla\Firefox Default Browser Agent *'
    - '*\TaskCache\Tree\Mozilla\Firefox Background Update *'
    - '*\TaskCache\Tree\Microsoft\Windows\WOF\WIM-Hash-Validation\Index*'
    - '*\TaskCache\Tree\Microsoft\Office\SD*'
    - '*\TaskCache\Tree\Microsoft\Office\OfficeTelemetry*'
    - '*\TaskCache\Tree\Microsoft\Office\Office ClickToRun Service Monitor\\*'
    - '*\TaskCache\Tree\Microsoft\Office\Office Automatic Updates 2.0\\*'
    - '*\TaskCache\Tree\klcp_update\\*'
    - '*\TaskCache\Tree\Apple\SD*'
    - '*\TaskCache\Tree\Apple\AppleSoftwareUpdate\\*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2022/02/10
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
status: experimental
tags:
- attack.persistence
- attack.t1053
- attack.t1053.005
