
title: Wow6432Node CurrentVersion Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: '*\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion*'
  SELECTION_5:
    TargetObject:
    - '*\ShellServiceObjectDelayLoad*'
    - '*\Run*'
    - '*\Explorer\ShellServiceObjects*'
    - '*\Explorer\ShellIconOverlayIdentifiers*'
    - '*\Explorer\ShellExecuteHooks*'
    - '*\Explorer\SharedTaskScheduler*'
    - '*\Explorer\Browser Helper Objects*'
  SELECTION_6:
    Details: (Empty)
  SELECTION_7:
    Image: '*C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{*'
  SELECTION_8:
    Image: '*\setup.exe*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: b29aed60-ebd1-442b-9cb5-16a1d0324adb
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2021/12/19
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
