
title: Windows Registry Persistence COM Search Order Hijacking
ruletype: Sigma
author: Maxime Thiebaut (@0xThiebaut), oscd.community, Cédric Hien
date: 2020/04/14
description: Detects potential COM object hijacking leveraging the COM Search Order
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_10:
    Details: '*\Microsoft.Teams.AddinLoader.dll*'
  SELECTION_11:
    Details: '*\AppData\Roaming\Dropbox\\*'
  SELECTION_12:
    Details: '*\DropboxExt64.*.dll*'
  SELECTION_13:
    Details: '*TmopIEPlg.dll'
  SELECTION_14:
    Image:
    - C:\WINDOWS\system32\wuauclt.exe
    - C:\WINDOWS\system32\svchost.exe
  SELECTION_15:
    Image: '*C:\ProgramData\Microsoft\Windows Defender\Platform\\*'
  SELECTION_16:
    Image: '*\MsMpEng.exe*'
  SELECTION_17:
    Details:
    - '*\FileRepository\nvmdi.inf*'
  SELECTION_18:
    Image: '*C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{*'
  SELECTION_19:
    Image: '*\setup.exe*'
  SELECTION_2:
    EventID: 13
  SELECTION_20:
    Image: '*\MicrosoftEdgeUpdateComRegisterShell64.exe'
  SELECTION_21:
    Image: C:\WINDOWS\SYSTEM32\dxdiag.exe
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject:
    - HKCR\CLSID\\*
    - HKCU\Software\Classes\CLSID\\*
  SELECTION_6:
    TargetObject: '*\InprocServer32\(Default)'
  SELECTION_7:
    Details:
    - '*%%systemroot%%\system32\\*'
    - '*%%systemroot%%\SysWow64\\*'
  SELECTION_8:
    Details:
    - '*\AppData\Local\Microsoft\OneDrive\\*'
    - '*\FileCoAuthLib64.dll*'
    - '*\FileSyncShell64.dll*'
    - '*\FileSyncApi64.dll*'
  SELECTION_9:
    Details: '*\AppData\Local\Microsoft\TeamsMeetingAddin\\*'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and (SELECTION_4 and SELECTION_5
    and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8) or (SELECTION_9 and
    SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13) or (SELECTION_14)
    or (SELECTION_15 and SELECTION_16) or (SELECTION_17) or (SELECTION_18 and SELECTION_19
    or SELECTION_20) or (SELECTION_21)))
falsepositives:
- Some installed utilities (i.e. OneDrive) may serve new COM objects at user-level
id: a0ff33d8-79e4-4cef-b4f3-9dc4133ccd12
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2022/01/19
references:
- https://www.cyberbit.com/blog/endpoint-security/com-hijacking-windows-overlooked-security-vulnerability/
- https://attack.mitre.org/techniques/T1546/015/
status: experimental
tags:
- attack.persistence
- attack.t1546.015
