
title: Winlogon Notify Key Logon Persistence
ruletype: Sigma
author: frack113
date: 2021/12/30
description: |
  Adversaries may abuse features of Winlogon to execute DLLs and/or executables when a user logs in.
  Winlogon.exe is a Windows component responsible for actions at logon/logoff as well as the secure attention sequence (SAS) triggered by Ctrl-Alt-Delete.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\Notify\logon'
  SELECTION_5:
    Details: '*.dll'
  SELECTION_6:
    EventType: SetValue
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: bbf59793-6efb-4fa1-95ca-a7d288e52c88
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.004/T1547.004.md#atomic-test-3---winlogon-notify-key-logon-persistence---powershell
status: experimental
tags:
- attack.persistence
- attack.t1547.004
