
title: Bypass UAC Using DelegateExecute
ruletype: Sigma
author: frack113
date: 2022/01/05
description: Bypasses User Account Control using a fileless method
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*\open\command\DelegateExecute'
  SELECTION_6:
    Details: (Empty)
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 46dd5308-4572-4d12-aa43-8938f0184d4f
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand
- https://devblogs.microsoft.com/oldnewthing/20100312-01/?p=14623
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1548.002/T1548.002.md#atomic-test-7---bypass-uac-using-sdclt-delegateexecute
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
