
title: Add Port Monitor Persistence in Registry
ruletype: Sigma
author: frack113
date: 2021/12/30
description: |
  Adversaries may use port monitors to run an attacker supplied DLL during system boot for persistence or privilege escalation.
  A port monitor can be set through the AddMonitor API call to set a DLL to be loaded at startup.
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    TargetObject: HKLM\System\CurrentControlSet\Control\Print\Monitors\\*
  SELECTION_5:
    Details: '*.dll'
  SELECTION_6:
    EventType: SetValue
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 944e8941-f6f6-4ee8-ac05-1c224e923c0e
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.010/T1547.010.md
status: experimental
tags:
- attack.persistence
- attack.t1547.010
