
title: Disable Administrative Share Creation at Startup
ruletype: Sigma
author: frack113
date: 2022/01/16
description: Administrative shares are hidden network shares created by Microsoft’s
  Windows NT operating systems that grant system administrators remote access to every
  disk volume on a network-connected system
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: HKLM\System\CurrentControlSet\Services\LanmanServer\Parameters\\*
  SELECTION_6:
    TargetObject:
    - '*AutoShareWks'
    - '*AutoShareServer'
  SELECTION_7:
    Details: DWORD (0x00000000)
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: c7dcacd0-cc59-4004-b0a4-1d6cdebe6f3e
level: medium
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.005/T1070.005.md#atomic-test-4---disable-administrative-share-creation-at-startup
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.005
