
title: Blackbyte Ransomware Registry
ruletype: Sigma
author: frack113
date: 2022/01/24
description: BlackByte set three different registry values to escalate privileges
  and begin setting the stage for lateral movement and encryption
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject:
    - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LocalAccountTokenFilterPolicy
    - HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLinkedConnections
    - HKLM\SYSTEM\CurrentControlSet\Control\FileSystem\LongPathsEnabled
  SELECTION_6:
    Details: DWORD (0x00000001)
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 83314318-052a-4c90-a1ad-660ece38d276
level: high
logsource:
  category: registry_event
  product: windows
references:
- https://redcanary.com/blog/blackbyte-ransomware/?utm_source=twitter&utm_medium=social
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/blackbyte-ransomware-pt-1-in-depth-analysis/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
