
title: ServiceDll Modification
ruletype: Sigma
author: frack113
date: 2022/02/04
description: Detects the modification of a ServiceDLL value in the service settings
detection:
  SELECTION_1:
    EventID: 12
  SELECTION_2:
    EventID: 13
  SELECTION_3:
    EventID: 14
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: HKLM\System\CurrentControlSet\Services\\*
  SELECTION_6:
    TargetObject: '*\Parameters\ServiceDll'
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Administrative scripts
- Installation of a service
id: 612e47e9-8a59-43a6-b404-f48683f45bd6
level: medium
logsource:
  category: registry_event
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
