title: Suspicious Application Installed
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/14
description: Detects suspicious application installed by looking at the added shortcut
    to the app resolver cache
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Shell-Core/Operational
    SELECTION_2:
        EventID: 28115
    SELECTION_3:
        Name:
        - '*Zenmap*'
        - '*AnyDesk*'
        - '*wireshark*'
        - '*openvpn*'
    SELECTION_4:
        EventID: 28115
    SELECTION_5:
        AppID:
        - '*zenmap.exe*'
        - '*prokzult ad*'
        - '*wireshark*'
        - '*openvpn*'
    condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
        SELECTION_5)))
falsepositives:
- Packages or applications being legitimately used by users or administrators
id: 83c161b6-ca67-4f33-8ad0-644a0737cf07
level: medium
logsource:
    product: windows
    service: shell-core
references:
- https://nasbench.medium.com/finding-forensic-goodness-in-obscure-windows-event-logs-60e978ea45a3
status: experimental
tags:
- attack.execution

