title: Remote Access Tool - ScreenConnect Remote Command Execution - Hunting
id: fc780b12-2819-3958-745b-4cd4c6b66435
status: experimental
description: |
    Detects remote binary or command execution via the ScreenConnect Service.
    Use this rule in order to hunt for potentially anomalous executions originating from ScreenConnect
references:
    - https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/23
modified: 2024/02/26
tags:
    - attack.execution
    - detection.threat_hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \ScreenConnect.ClientService.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate commands launched from ScreenConnect will also trigger this rule. Look for anomalies.
level: medium
ruletype: Sigma
