title: Curl.EXE Execution With Custom UserAgent
id: e0489e47-4c09-f300-bf19-14475e09c953
related:
    - id: 3286d37a-00fd-41c2-a624-a672dcd34e60
      type: derived
status: test
description: Detects execution of curl.exe with custom useragent options
references:
    - https://curl.se/docs/manpage.html
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#atomic-test-2---malicious-user-agents---cmd
author: frack113
date: 2022-01-23
modified: 2023-02-21
tags:
    - attack.command-and-control
    - attack.t1071.001
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_curl:
        - NewProcessName|endswith: \curl.exe
        - Product: The curl executable
    selection_opt:
        CommandLine|contains:
            - ' -A '
            - ' --user-agent '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Scripts created by developers and admins
    - Administrative activity
level: medium
ruletype: Sigma
