title: Potential Password Reconnaissance Via Findstr.EXE
id: 377979aa-f6e3-79ac-c29c-43d82f8e48a7
related:
    - id: 1a0f6f16-2099-4753-9a02-43b6ac7a1fa5
      type: derived
status: test
description: Detects command line usage of "findstr" to search for the "passwords" keyword in a variety of different languages
references:
    - https://steflan-security.com/windows-privilege-escalation-credential-harvesting/
    - https://adsecurity.org/?p=2288
author: Josh Nickels
date: 2023-05-18
tags:
    - attack.credential-access
    - attack.t1552.001
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \findstr.exe
        - OriginalFileName: FINDSTR.EXE
    selection_cli:
        CommandLine|contains:
            - contraseña   # Spanish
            - hasło   # Polish
            - heslo   # Czech
            - parola   # Italian
            - passe   # French
            - passw   # German, English
            - senha   # Portuguese
            - senord   # Swedish
            - 密碼   # Cantonese
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
