title: Potentially Suspicious Compression Tool Parameters
id: 17ce724d-58b5-3ac7-6918-9e7c4483fe0b
related:
    - id: 27a72a60-7e5e-47b1-9d17-909c9abafdcd
      type: derived
status: test
description: Detects potentially suspicious command line arguments of common data compression tools
references:
    - https://twitter.com/SBousseaden/status/1184067445612535811
author: Florian Roth (Nextron Systems), Samir Bousseaden
date: 2019/10/15
modified: 2023/08/29
tags:
    - attack.collection
    - attack.t1560.001
    - detection.threat_hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        OriginalFileName:
            - 7z*.exe
            - '*rar.exe'
            - '*Command*Line*RAR*'
        CommandLine|contains:
            - ' -p'
            - ' -ta'
            - ' -tb'
            - ' -sdel'
            - ' -dw'
            - ' -hp'
    filter_main_generic:
        ParentProcessName|contains:
            - :\Program Files\
            - :\Program Files (x86)\
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
