title: Diskshadow Child Process Spawned
id: 65955846-8a6d-8beb-af3d-ad2cdaf58f82
status: experimental
description: Detects any child process spawning from "Diskshadow.exe". This could be due to executing Diskshadow in interpreter mode or script mode and using the "exec" flag to launch other applications.
references:
    - https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
    - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
    - https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
author: Harjot Singh @cyb3rjy0t
date: 2023/09/15
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.execution
    - detection.threat_hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \diskshadow.exe
    filter_main_werfault:
        NewProcessName|endswith: :\Windows\System32\WerFault.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Likely from legitimate usage of Diskshadow in Interpreter mode.
level: medium
ruletype: Sigma
