title: Execution From Webserver Root Folder
id: 612adf3c-4f2f-852b-487d-3930de4337ed
related:
    - id: 35efb964-e6a5-47ad-bbcd-19661854018d
      type: derived
status: test
description: |
    Detects a program executing from a web server root folder. Use this rule to hunt for potential interesting activity such as webshell or backdoors
references:
    - Internal Research
author: Florian Roth (Nextron Systems)
date: 2019-01-16
modified: 2024-01-18
tags:
    - attack.persistence
    - attack.t1505.003
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|contains:
            - \wwwroot\
            - \wmpub\
            - \htdocs\
    filter_main_generic:
        NewProcessName|contains:
            - bin\
            - \Tools\
            - \SMSComponent\
        ParentProcessName|endswith: \services.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Various applications
    - Tools that include ping or nslookup command invocations
level: medium
ruletype: Sigma
