title: SMB over QUIC Via Net.EXE
id: 1907e117-0636-2197-9e4a-c6f58a1f30e7
related:
    - id: 6df07c3b-8456-4f8b-87bb-fe31ec964cae
      type: similar
    - id: 2238d337-42fb-4971-9a68-63570f2aede4
      type: derived
status: test
description: Detects the mounting of Windows SMB shares over QUIC, which can be an unexpected event in some enterprise environments.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1570/T1570.md
    - https://www.trustedsec.com/blog/making-smb-accessible-with-ntlmquic/
author: frack113
date: 2023-07-21
tags:
    - attack.lateral-movement
    - attack.t1570
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \net.exe
              - \net1.exe
        - OriginalFileName:
              - net.exe
              - net1.exe
    selection_cli:
        CommandLine|contains: /TRANSPORT:QUIC
    condition: process_creation and (all of selection_*)
falsepositives:
    - Administrative activity
level: medium
ruletype: Sigma
