title: Diskshadow Script Mode Execution
id: 0d73093a-d5b0-8bc8-7a92-c4be8f638bf7
status: test
description: |
    Detects execution of "Diskshadow.exe" in script mode using the "/s" flag. Attackers often abuse "diskshadow" to execute scripts that deleted the shadow copies on the systems. Investigate the content of the scripts and its location.
references:
    - https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
    - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
    - https://medium.com/@cyberjyot/lolbin-execution-via-diskshadow-f6ff681a27a4
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/diskshadow
author: Ivan Dyachkov, oscd.community
date: 2020/10/07
modified: 2024/03/13
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.execution
    - detection.threat_hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName: diskshadow.exe
        - NewProcessName|endswith: \diskshadow.exe
    selection_cli:
        CommandLine|contains|windash: '-s '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Likely from legitimate backup scripts
level: medium
ruletype: Sigma
