title: Remote Access Tool - Ammy Admin Agent Execution
id: b7469b0d-0e65-e130-f73c-9b9ccd3b363b
related:
    - id: 7da7809e-f3d5-47a3-9d5d-fc9d019caf14
      type: derived
status: test
description: Detects the execution of the Ammy Admin RMM agent for remote management.
references:
    - https://www.ammyy.com/en/admin_features.html
author: '@kostastsale'
date: 2024-08-05
tags:
    - attack.execution
    - attack.persistence
    - detection.threat-hunting
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: AMMYY\aa_nts.dll",run
        NewProcessName|endswith: \rundll32.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use of Ammy Admin RMM agent for remote management by admins.
level: medium
ruletype: Sigma
