title: WSF/JSE/JS/VBA/VBE File Execution Via Cscript/Wscript
id: 5742c4d7-6bb8-d4c7-1abf-eedde7c178df
status: test
description: Detects script file execution (.js, .jse, .vba, .vbe, .vbs, .wsf) by Wscript/Cscript
references:
    - https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
    - https://redcanary.com/blog/gootloader/
author: Michael Haag
date: 2019/01/16
modified: 2023/05/15
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.007
    - detection.threat_hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName:
              - wscript.exe
              - cscript.exe
        - NewProcessName|endswith:
              - \wscript.exe
              - \cscript.exe
    selection_cli:
        CommandLine|contains:
            - .js
            - .jse
            - .vba
            - .vbe
            - .vbs
            - .wsf
    condition: process_creation and (all of selection_*)
falsepositives:
    - Some additional tuning is required. It is recommended to add the user profile path in CommandLine if it is getting too noisy.
level: medium
ruletype: Sigma
