title: File Download Via Curl.EXE
id: 8a760077-f6df-d8ae-baaa-b183b988ac04
status: test
description: Detects file download using curl.exe
references:
    - https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
author: Florian Roth (Nextron Systems)
date: 2022/07/05
modified: 2023/02/21
tags:
    - attack.command_and_control
    - attack.t1105
    - detection.threat_hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \curl.exe
        - Product: The curl executable
    selection_remote:
        CommandLine|contains:
            - ' -O'  # covers the alias for --remote-name and --output
            - --remote-name
            - --output
    condition: process_creation and (all of selection_*)
falsepositives:
    - Scripts created by developers and admins
    - Administrative activity
    - The "\Git\usr\bin\sh.exe" process uses the "--output" flag to download a specific file in the temp directory with the pattern "gfw-httpget-xxxxxxxx.txt "
level: medium
ruletype: Sigma
