title: VMMap Signed Dbghelp.DLL Potential Sideloading
id: ff996301-4cf1-53e7-aa39-271fcd5a34d9
related:
    - id: 273a8dd8-3742-4302-bcc7-7df5a80fe425
      type: similar
    - id: 98ffaed4-aec2-4e04-9b07-31492fe68b3d
      type: derived
status: test
description: Detects potential DLL sideloading of a signed dbghelp.dll by the Sysinternals VMMap.
references:
    - https://techcommunity.microsoft.com/t5/sysinternals-blog/zoomit-v7-1-procdump-2-0-for-linux-process-explorer-v17-05/ba-p/3884766
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-09-05
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1574.001
    - sysmon
logsource:
    category: image_load
    product: windows
detection:
    image_load:
        EventID: 7
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ImageLoaded|contains: C:\Debuggers\dbghelp.dll
        Image|endswith:
            - \vmmap.exe
            - \vmmap64.exe
        Signed: 'true'
    condition: image_load and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
