title: Antivirus Software DLL Sideloading
ruletype: Sigma
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of antivirus software suchas
    McAfee, Symantec...etc
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_10:
        ImageLoaded:
        - '*\ashldres.dll'
        - '*\lockdown.dll'
        - '*\vsodscpl.dll'
    SELECTION_11:
        ImageLoaded:
        - C:\Program Files\McAfee\\*
        - C:\Program Files (x86)\McAfee\\*
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\log.dll'
    SELECTION_4:
        ImageLoaded:
        - C:\Program Files\Bitdefender Antivirus Free\\*
        - C:\Program Files (x86)\Bitdefender Antivirus Free\\*
    SELECTION_5:
        Image: C:\Program Files\Dell\SARemediation\audit\TelemetryUtility.exe
    SELECTION_6:
        ImageLoaded:
        - C:\Program Files\Dell\SARemediation\plugin\log.dll
        - C:\Program Files\Dell\SARemediation\audit\log.dll
    SELECTION_7:
        ImageLoaded: C:\Program Files\Canon\MyPrinter\\*
    SELECTION_8:
        ImageLoaded: '*\qrt.dll'
    SELECTION_9:
        ImageLoaded:
        - C:\Program Files\F-Secure\Anti-Virus\\*
        - C:\Program Files (x86)\F-Secure\Anti-Virus\\*
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5 and SELECTION_6) or (SELECTION_7))) or (SELECTION_8 and  not
        (SELECTION_9))) or (SELECTION_10 and  not (SELECTION_11))))
falsepositives:
- Applications that load the same dlls mentioned in the detection section. Investigate
    them and filter them out if a lot FPs are caused.
- Dell SARemediation plugin folder (C:\Program Files\Dell\SARemediation\plugin\log.dll)
    is known to contain the 'log.dll' file.
- The Canon MyPrinter folder 'C:\Program Files\Canon\MyPrinter\' is known to contain
    the 'log.dll' file
id: 552b6b65-df37-4d3e-a258-f2fc4771ae54
level: medium
logsource:
    category: image_load
    product: windows
modified: 2022/10/13
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

