title: Potential DLL Sideloading Of Libcurl.DLL Via GUP.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/05
description: Detects potential DLL sideloading of "libcurl.dll" by the "gup.exe" process
    from an uncommon location
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\gup.exe'
    SELECTION_4:
        ImageLoaded: '*\libcurl.dll'
    SELECTION_5:
        Image: '*\Notepad++\updater\GUP.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5)))
falsepositives:
- Unknown
id: e49b5745-1064-4ac1-9a2e-f687bc2dd37e
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

