title: Potential Rcdll.DLL Sideloading
ruletype: Sigma
author: X__Junior (Nextron Systems)
date: 2023/03/13
description: Detects potential DLL sideloading of rcdll.dll
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\rcdll.dll'
    SELECTION_4:
        ImageLoaded:
        - C:\Program Files (x86)\Microsoft Visual Studio\\*
        - C:\Program Files (x86)\Windows Kits\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 6e78b74f-c762-4800-82ad-f66787f10c8a
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/03/15
references:
- https://www.trendmicro.com/en_us/research/23/c/iron-tiger-sysupdate-adds-linux-targeting.html
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

