title: DLL Load By System Process From Suspicious Locations
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/17
description: Detects when a system process (ie located in system32, syswow64...etc)
    loads a DLL from a suspicious location such as %temp%
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_10:
        Image: C:\Windows\System32\cleanmgr.exe
    SELECTION_11:
        ImageLoaded: '*\ssshim.dll'
    SELECTION_12:
        Image: C:\Windows\Microsoft.NET\Framework\v*
    SELECTION_13:
        Image: '*\mscorsvw.exe'
    SELECTION_14:
        ImageLoaded: '*\AppData\Local\Temp\\*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: C:\Windows\\*
    SELECTION_4:
        ImageLoaded:
        - '*\Users\Public\\*'
        - '*\Downloads\\*'
        - '*\AppData\Local\Temp\\*'
        - '*C:\PerfLogs\\*'
    SELECTION_5:
        Image: '*\msiexec.exe'
    SELECTION_6:
        ImageLoaded:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_7:
        Image:
        - C:\Windows\SysWOW64\rundll32.exe
        - C:\Windows\System32\rundll32.exe
    SELECTION_8:
        CommandLine: '*\AppData\Local\Temp\\*'
    SELECTION_9:
        CommandLine: '*\setup.exe*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5 or SELECTION_6 or SELECTION_7 or SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13 and SELECTION_14)))
falsepositives:
- Unknown
id: 9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c
level: high
logsource:
    category: image_load
    product: windows
modified: 2022/12/02
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)
status: experimental
tags:
- attack.defense_evasion
- attack.t1070

