title: System Drawing DLL Load
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: Detects processes loading "System.Drawing.ni.dll". This could be an indicator
    of potential Screen Capture.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\System.Drawing.ni.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- False positives are very common from system and third party applications, activity
    needs to be investigated. This rule is best correlated with other events to increase
    the level of suspiciousness
id: 666ecfc7-229d-42b8-821e-1a8f8cb7057c
level: low
logsource:
    category: image_load
    product: windows
modified: 2023/02/22
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/7.A.1_3B4E5808-3C71-406A-B181-17B0CE3178C9.md
status: experimental
tags:
- attack.collection
- attack.t1113

