title: Suspicious Volume Shadow Copy Vssapi.dll Load
id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
related:
    -   id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
        type: similar
    -   id: 48bfd177-7cf2-412b-ad77-baf923489e82
        type: similar
status: experimental
description: Detects the image load of VSS DLL by uncommon executables
references:
    - https://github.com/ORCx41/DeleteShadowCopies
author: frack113
date: 2022/10/31
modified: 2023/05/03
tags:
    - attack.defense_evasion
    - attack.impact
    - attack.t1490
    - sysmon
logsource:
    category: image_load
    product: windows
detection:
    image_load:
        EventID: 7
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ImageLoaded|endswith: \vssapi.dll
    filter_windows:
        -   Image:
                - C:\Windows\explorer.exe
                - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
        -   Image|startswith:
                - C:\Windows\System32\
                - C:\Windows\SysWOW64\
                - C:\Windows\Temp\{
                - C:\Windows\WinSxS\
    filter_program_files:
        Image|startswith:
            - C:\Program Files\
            - C:\Program Files (x86)\
    filter_programdata_packagecache:
        Image|startswith: C:\ProgramData\Package Cache\
    condition: image_load and (selection and not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
