title: Potential DLL Sideloading Via comctl32.dll
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/12/16
description: Detects potential DLL sideloading using comctl32.dll via "wermgr.exe"
    to obtain system privileges
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: C:\windows\system32\wermgr.exe.local\\*
    SELECTION_4:
        ImageLoaded: '*\comctl32.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: 6360757a-d460-456c-8b13-74cf0e60cceb
level: high
logsource:
    category: image_load
    product: windows
references:
- https://github.com/binderlabs/DirCreate2System
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

