title: Potential DLL Sideloading Via comctl32.dll
ruletype: Sigma
author: Nasreddine Bencherchali, Subhash Popuri (@pbssubhash)
date: 2022/12/16
description: Detects potential DLL sideloading using comctl32.dll to obtain system
    privileges
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded:
        - C:\Windows\System32\logonUI.exe.local\\*
        - C:\Windows\System32\werFault.exe.local\\*
        - C:\Windows\System32\consent.exe.local\\*
        - C:\Windows\System32\narrator.exe.local\\*
        - C:\windows\system32\wermgr.exe.local\\*
    SELECTION_4:
        ImageLoaded: '*\comctl32.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: 6360757a-d460-456c-8b13-74cf0e60cceb
level: high
logsource:
    category: image_load
    product: windows
modified: 2022/12/19
references:
- https://github.com/binderlabs/DirCreate2System
- https://github.com/sailay1996/awesome_windows_logical_bugs/blob/60cbb23a801f4c3195deac1cc46df27c225c3d07/dir_create2system.txt
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

