title: Microsoft Office DLL Sideload
ruletype: Sigma
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of Microsoft Office from
    non standard location
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\outllib.dll'
    SELECTION_4:
        ImageLoaded:
        - C:\Program Files\Microsoft Office\OFFICE*
        - C:\Program Files (x86)\Microsoft Office\OFFICE*
        - C:\Program Files\Microsoft Office\Root\OFFICE*
        - C:\Program Files (x86)\Microsoft Office\Root\OFFICE*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unlikely
id: 829a3bdf-34da-4051-9cf4-8ed221a8ae4f
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

