title: VMGuestLib DLL Sideload
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/12/01
description: Detects DLL sideloading of VMGuestLib.dll by the WmiApSrv service.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\VMware\VMware Tools\vmStatsProvider\win32*'
    SELECTION_4:
        ImageLoaded: '*\vmGuestLib.dll*'
    SELECTION_5:
        Image: '*\Windows\System32\wbem\WmiApSrv.exe'
    SELECTION_6:
        Signed: 'true'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6))
falsepositives:
- FP could occure if the legitimate version of vmGuestLib already exists on the system
id: 70e8e9b4-6a93-4cb7-8cde-da69502e7aff
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://decoded.avast.io/martinchlumecky/png-steganography/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

