title: Pingback Backdoor
ruletype: Sigma
author: Bhabesh Raj
date: 2021/05/05
description: Detects the use of Pingback backdoor that creates ICMP tunnel for C2
    as described in the trustwave report
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\msdtc.exe'
    SELECTION_4:
        ImageLoaded: C:\Windows\oci.dll
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Very unlikely
id: 35a7dc42-bc6f-46e0-9f83-81f8e56c8d4b
level: high
logsource:
    category: image_load
    product: windows
modified: 2022/08/14
references:
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/backdoor-at-the-end-of-the-icmp-tunnel
- https://app.any.run/tasks/4a54c651-b70b-4b72-84d7-f34d301d6406
status: experimental
tags:
- attack.persistence
- attack.t1574.001

