title: Potential DLL Sideloading Using Coregen.exe
ruletype: Sigma
author: frack113
date: 2022/12/31
description: Detect usage of DLL "coregen.exe" (Microsoft CoreCLR Native Image Generator)
    binary to sideload arbitrary DLLs.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\coregen.exe'
    SELECTION_4:
        ImageLoaded:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Program Files\Microsoft Silverlight\\*
        - C:\Program Files (x86)\Microsoft Silverlight\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 0fa66f66-e3f6-4a9c-93f8-4f2610b00171
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Coregen/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1055

