title: Web Browsers DLL Sideloading
ruletype: Sigma
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of web browsers
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\chrome_frame_helper.dll'
    SELECTION_4:
        ImageLoaded: '*\AppData\local\Google\Chrome\Application\\*'
    SELECTION_5:
        ImageLoaded:
        - C:\Program Files\Google\Chrome\Application\\*
        - C:\Program Files (x86)\Google\Chrome\Application\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4
        or SELECTION_5))
falsepositives:
- Unknown
id: 72ca7c75-bf85-45cd-aca7-255d360e423c
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

