title: Third Party Software DLL Sideloading
ruletype: Sigma
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/08/17
description: Detects DLL sideloading of DLLs that are part of third party software
    (zoom, discord....etc)
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\commfunc.dll'
    SELECTION_4:
        ImageLoaded: '*\AppData\local\Google\Chrome\Application\\*'
    SELECTION_5:
        ImageLoaded:
        - C:\Program Files\Lenovo\Communications Utility\\*
        - C:\Program Files (x86)\Lenovo\Communications Utility\\*
    SELECTION_6:
        ImageLoaded: '*\tosbtkbd.dll'
    SELECTION_7:
        ImageLoaded:
        - C:\Program Files\Toshiba\Bluetooth Toshiba Stack\\*
        - C:\Program Files (x86)\Toshiba\Bluetooth Toshiba Stack\\*
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and  not (SELECTION_4
        or SELECTION_5)) or (SELECTION_6 and  not (SELECTION_7))))
falsepositives:
- Unknown
id: f9df325d-d7bc-4a32-8a1a-2cc61dcefc63
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

