title: HackTool - SharpEvtMute DLL Load
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/09/07
description: Detects the load of EvtMuteHook.dll, a key component of SharpEvtHook,
    a tool that tampers with the Windows event logs
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Hashes: '*IMPHASH=330768A4F172E10ACB6287B87289D83B*'
    SELECTION_4:
        Imphash: 330768a4f172e10acb6287b87289d83b
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Other DLLs with the same Imphash
id: 49329257-089d-46e6-af37-4afce4290685
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/02/17
references:
- https://github.com/bats3c/EvtMute
related:
-   id: bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002

