title: Aruba Network Service Potential DLL Sideloading
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/22
description: Detects potential DLL sideloading activity via the Aruba Networks Virtual
    Intranet Access "arubanetsvc.exe" process using DLL Search Order Hijacking
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\arubanetsvc.exe'
    SELECTION_4:
        ImageLoaded:
        - '*\wtsapi32.dll'
        - '*\msvcr100.dll'
        - '*\msvcp100.dll'
        - '*\dbghelp.dll'
        - '*\dbgcore.dll'
        - '*\wininet.dll'
        - '*\iphlpapi.dll'
        - '*\version.dll'
        - '*\cryptsp.dll'
        - '*\cryptbase.dll'
        - '*\wldp.dll'
        - '*\profapi.dll'
        - '*\sspicli.dll'
        - '*\winsta.dll'
        - '*\dpapi.dll'
    SELECTION_5:
        ImageLoaded:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: 90ae0469-0cee-4509-b67f-e5efcef040f7
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/03/15
references:
- https://twitter.com/wdormann/status/1616581559892545537?t=XLCBO9BziGzD7Bmbt8oMEQ&s=09
status: experimental
tags:
- attack.privilege_escalation
- attack.persistence
- attack.t1574.001
- attack.t1574.002

