title: Image Load of VSS Dll by Uncommon Executable
ruletype: Sigma
author: frack113
date: 2022/10/31
description: Detects the image load of VSS DLL by uncommon executables
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded:
        - '*\vsstrace.dll'
        - '*\vssapi.dll'
    SELECTION_4:
        Image:
        - C:\Windows\\*
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
        - C:\ProgramData\Package Cache\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- Unknown
id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
level: high
logsource:
    category: image_load
    product: windows
modified: 2022/12/14
references:
- https://github.com/ORCx41/DeleteShadowCopies
status: experimental
tags:
- attack.defense_evasion
- attack.impact
- attack.t1490

