title: dotNET DLL Loaded Via Office Applications
ruletype: Sigma
author: Antonlovesdnb
date: 2020/02/19
description: Detects any assembly DLL being loaded by an Office Product
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\winword.exe'
        - '*\powerpnt.exe'
        - '*\excel.exe'
        - '*\outlook.exe'
    SELECTION_4:
        ImageLoaded: C:\Windows\assembly\\*
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: ff0f2b05-09db-4095-b96d-1b75ca24894a
level: high
logsource:
    category: image_load
    product: windows
modified: 2021/11/27
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: test
tags:
- attack.execution
- attack.t1204.002
yml_filename: image_load_susp_office_dotnet_assembly_dll_load.yml
yml_path: rules/windows/image_load
---

