title: Image Load of VSS_PS.dll by Uncommon Executable
ruletype: Sigma
author: Markus Neis, @markus_neis
date: 2021/07/07
description: Detects the image load of vss_ps.dll by uncommon executables
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\vss_ps.dll'
    SELECTION_4:
        Image:
        - '*\svchost.exe'
        - '*\msiexec.exe'
        - '*\vssvc.exe'
        - '*\srtasks.exe'
        - '*\tiworker.exe'
        - '*\dllhost.exe'
        - '*\searchindexer.exe'
        - '*\dismhost.exe'
        - '*\taskhostw.exe'
        - '*\clussvc.exe'
        - '*\thor64.exe'
        - '*\thor.exe'
        - '*\rundll32.exe'
        - '*\inetsrv\iissetup.exe'
        - '*\inetsrv\appcmd.exe'
        - '*\WmiPrvSE.exe'
    SELECTION_5:
        Image: C:\Windows\\*
    SELECTION_6:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_7:
        CommandLine: C:\$WinREAgent\Scratch\\*
    SELECTION_8:
        CommandLine: '*\dismhost.exe {*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5) or (SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
level: high
logsource:
    category: image_load
    product: windows
modified: 2022/10/31
references:
- https://www.virustotal.com/gui/file/ba88ca45589fae0139a40ca27738a8fc2dfbe1be5a64a9558f4e0f52b35c5add
- https://twitter.com/am0nsec/status/1412232114980982787
status: experimental
tags:
- attack.defense_evasion
- attack.impact
- attack.t1490

