title: UIPromptForCredentials DLLs
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/20
description: Detects potential use of UIPromptForCredentials functions by looking
    for some of the DLLs needed for it.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_10:
        Image: C:\Users\\*
    SELECTION_11:
        Image: '*\AppData\Local\Microsoft\OneDrive\\*'
    SELECTION_12:
        Image: C:\Windows\regedit.exe
    SELECTION_13:
        Provider_Name: Microsoft-Windows-Kernel-Process
    SELECTION_14:
        CommandLine: '*C:\Program Files\WindowsApps\SpotifyAB.SpotifyMusic_*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded:
        - '*\credui.dll'
        - '*\wincredui.dll'
    SELECTION_4:
        OriginalFileName:
        - credui.dll
        - wincredui.dll
    SELECTION_5:
        Image:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_6:
        Image:
        - '*\opera_autoupdate.exe'
        - '*\procexp64.exe'
        - '*\procexp.exe'
    SELECTION_7:
        Image:
        - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
        - C:\Windows\explorer.exe
    SELECTION_8:
        Image: C:\Users\\*
    SELECTION_9:
        Image:
        - '*\AppData\Roaming\Spotify\Spotify.exe'
        - '*\AppData\Local\Microsoft\Teams\current\Teams.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11) or (SELECTION_12) or (SELECTION_13 and
        SELECTION_14)))
falsepositives:
- Other legitimate processes loading those DLLs in your environment.
id: 9ae01559-cf7e-4f8e-8e14-4c290a1b4784
level: medium
logsource:
    category: image_load
    product: windows
modified: 2022/10/24
references:
- https://securitydatasets.com/notebooks/small/windows/06_credential_access/SDWIN-201020013208.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
- https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
status: experimental
tags:
- attack.credential_access
- attack.collection
- attack.t1056.002

