
title: UAC Bypass Using Iscsicpl - ImageLoad
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/17
description: Detects the "iscsicpl.exe" UAC bypass technique that leverages a DLL
  Search Order hijacking technique to load a custom DLL's from temp or a any user
  controlled location in the users %PATH%
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: C:\Windows\SysWOW64\iscsicpl.exe
  SELECTION_4:
    ImageLoaded: '*\iscsiexe.dll'
  SELECTION_5:
    ImageLoaded: '*C:\Windows\\*'
  SELECTION_6:
    ImageLoaded: '*iscsiexe.dll*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 9ed5959a-c43c-4c59-84e3-d28628429456
level: high
logsource:
  category: image_load
  product: windows
modified: 2022/07/25
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC
- https://twitter.com/wdormann/status/1547583317410607110
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
