title: Suspicious System.Drawing Load
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: A General detection for processes loading System.Drawing.ni.dll. This
    could be an indicator of potential Screen Capture.
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\System.Drawing.ni.dll'
    SELECTION_4:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
        - C:\Windows\System32\\*
        - C:\Windows\Microsoft.NET\\*
        - C:\Windows\ImmersiveControlPanel\\*
    SELECTION_5:
        Image: C:\Windows\System32\NhNotifSys.exe
    SELECTION_6:
        Image: C:\Users\\*
    SELECTION_7:
        Image:
        - '*\AppData\Local\NhNotifSys\nahimic\nahimicNotifSys.exe'
        - '*\GitHubDesktop\Update.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 666ecfc7-229d-42b8-821e-1a8f8cb7057c
level: low
logsource:
    category: image_load
    product: windows
modified: 2022/08/13
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/16
- https://threathunterplaybook.com/evals/apt29/detections/7.A.1_3B4E5808-3C71-406A-B181-17B0CE3178C9.html
status: experimental
tags:
- attack.collection
- attack.t1113

