title: MSDT.exe Loading Diagnostic Library
ruletype: Sigma
author: Greg (rule)
date: 2022/06/17
description: Detects both of CVE-2022-30190 / Follina and DogWalk vulnerability exploiting
    msdt.exe binary to load sdiageng.dll binary
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\msdt.exe'
    SELECTION_4:
        ImageLoaded: '*\sdiageng.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: ec8c4047-fad9-416a-8c81-0f479353d7f6
level: high
logsource:
    category: image_load
    product: windows
references:
- https://www.securonix.com/blog/detecting-microsoft-msdt-dogwalk/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
- cve.2022.30190
yml_filename: image_load_msdt_sdiageng.yml
yml_path: rules/windows/image_load
---

