title: DLL Loaded From Suspicious Location Via Cmspt.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/30
description: Detects cmstp loading "dll" or "ocx" files from suspicious locations
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\cmstp.exe'
    SELECTION_4:
        ImageLoaded:
        - '*\PerfLogs\\*'
        - '*\ProgramData\\*'
        - '*\Users\\*'
        - '*\Windows\Temp\\*'
        - '*C:\Temp\\*'
    SELECTION_5:
        ImageLoaded:
        - '*.dll'
        - '*.ocx'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unikely
id: 75e508f7-932d-4ebc-af77-269237a84ce1
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/02/17
references:
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/TTPs/Defense%20Evasion/T1218%20-%20Signed%20Binary%20Proxy%20Execution/T1218.003%20-%20CMSTP/Procedures.yaml
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.003

