title: CLR DLL Loaded Via Scripting Applications
ruletype: Sigma
author: omkar72, oscd.community
date: 2020/10/14
description: Detects .NET CLR DLLs being loaded by scripting applications such as
    wscript or cscript
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\mshta.exe'
        - '*\cmstp.exe'
        - '*\msxsl.exe'
    SELECTION_4:
        ImageLoaded:
        - '*\clr.dll'
        - '*\mscoree.dll'
        - '*\mscorlib.dll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 4508a70e-97ef-4300-b62b-ff27992990ea
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/01/06
references:
- https://github.com/tyranid/DotNetToJScript
- https://thewover.github.io/Introducing-Donut/
- https://blog.menasec.net/2019/07/interesting-difr-traces-of-net-clr.html
- https://web.archive.org/web/20221026202428/https://gist.github.com/code-scrap/d7f152ffcdb3e0b02f7f394f5187f008
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1055

