title: DLL Load By System Process From Suspicious Locations
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/17
description: Detects when a system process (ie located in system32, syswow64...etc)
    loads a DLL from a suspicious location such as %temp%
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: C:\Windows\\*
    SELECTION_4:
        ImageLoaded:
        - '*\Users\Public\\*'
        - '*\Downloads\\*'
        - '*\AppData\Local\Temp\\*'
        - '*C:\PerfLogs\\*'
    SELECTION_5:
        Image: '*\msiexec.exe'
    SELECTION_6:
        ImageLoaded:
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    SELECTION_7:
        Image: C:\Windows\System32\cleanmgr.exe
    SELECTION_8:
        ImageLoaded: '*\ssshim.dll'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5 or SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 9e9a9002-56c4-40fd-9eff-e4b09bfa5f6c
level: high
logsource:
    category: image_load
    product: windows
modified: 2022/09/29
references:
- https://github.com/hackerhouse-opensource/iscsicpl_bypassUAC (Idea)
status: experimental
tags:
- attack.defense_evasion
- attack.t1070

