title: DLL Sideloading Of DBGCORE.DLL
ruletype: Sigma
author: Nasreddine Bencherchali, Wietze Beukema (project and research)
date: 2022/10/25
description: Detects DLL sideloading of "dbgcore.dll"
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_10:
        ImageLoaded:
        - C:\Program Files\Microsoft Office\Office*
        - C:\Program Files\Microsoft Office\Root\Office*
        - C:\Program Files (x86)\Microsoft Office\Office*
        - C:\Program Files (x86)\Microsoft Office\Root\Office*
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\dbgcore.dll'
    SELECTION_4:
        ImageLoaded:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
        - C:\Windows\SoftwareDistribution\\*
        - C:\Windows\SystemTemp\\*
    SELECTION_5:
        ImageLoaded:
        - C:\Program Files (x86)\Microsoft Visual Studio\\*
        - C:\Program Files\Microsoft Visual Studio\\*
    SELECTION_6:
        ImageLoaded: C:\Program Files (x86)\Windows Kits\10\Debuggers\\*
    SELECTION_7:
        ImageLoaded: C:\Program Files\WindowsApps\Microsoft.WinDbg_*
    SELECTION_8:
        ImageLoaded: '*\Steam\bin\cef\cef.win7x64\dbgcore.dll'
    SELECTION_9:
        ImageLoaded: C:\Program Files\Dell\DTP\InstrumentationSubAgent\dbgcore.dll
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8) or (SELECTION_9)
        or (SELECTION_10)))
falsepositives:
- Legitimate applications loading their own versions of the DLL mentioned in this
    rule
id: 9ca2bf31-0570-44d8-a543-534c47c33ed7
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

