title: MMC Loading Script Engines DLLs
id: c5826207-ecc1-793f-8e4b-bc783e07c8be
related:
    - id: a9c73e8b-3b2d-4c45-8ef2-5f9a9c9998ad
      type: derived
status: experimental
description: |
    Detects when the Microsoft Management Console (MMC) loads the DLL libraries like vbscript, jscript etc which might indicate an attempt
    to execute malicious scripts within a trusted system process for bypassing application whitelisting or defense evasion.
references:
    - https://tria.ge/241015-l98snsyeje/behavioral2
    - https://www.elastic.co/security-labs/grimresource
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-02-05
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.005
    - attack.t1218.014
    - sysmon
logsource:
    category: image_load
    product: windows
detection:
    image_load:
        EventID: 7
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \mmc.exe
        ImageLoaded|endswith:
            - \vbscript.dll
            - \jscript.dll
            - \jscript9.dll
    condition: image_load and selection
falsepositives:
    - Legitimate MMC operations or extensions loading these libraries
level: medium
ruletype: Sigma
