title: Load Of Dbghelp/Dbgcore DLL From Suspicious Process
ruletype: Sigma
author: Perez Diego (@darkquassar), oscd.community, Ecco
date: 2019/10/27
description: 'Detects the load of dbghelp/dbgcore DLL (used to make memory dumps)
    by suspicious processes.

    Tools like ProcessHacker and some attacker tradecraft use MiniDumpWriteDump API
    found in dbghelp.dll or dbgcore.dll.

    As an example, SilentTrynity C2 Framework has a module that leverages this API
    to dump the contents of Lsass.exe and transfer it over the network back to the
    attacker''s machine.

    '
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded:
        - '*\dbghelp.dll'
        - '*\dbgcore.dll'
    SELECTION_4:
        Image:
        - '*\msbuild.exe'
        - '*\cmd.exe'
        - '*\rundll32.exe'
        - '*\winword.exe'
        - '*\excel.exe'
        - '*\powerpnt.exe'
        - '*\outlook.exe'
        - '*\monitoringhost.exe'
        - '*\wmic.exe'
        - '*\bash.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\mshta.exe'
        - '*\dnx.exe'
        - '*\regsvcs.exe'
        - '*\sc.exe'
        - '*\scriptrunner.exe'
    SELECTION_5:
        CommandLine: C:\WINDOWS\winsxs\\*
    SELECTION_6:
        CommandLine: '*\TiWorker.exe -Embedding'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: 0e277796-5f23-4e49-a490-483131d4f6e1
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/03/09
references:
- https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
- https://www.pinvoke.net/default.aspx/dbghelp/MiniDumpWriteDump.html
- https://medium.com/@fsx30/bypass-edrs-memory-protection-introduction-to-hooking-2efb21acffd6
related:
-   id: bdc64095-d59a-42a2-8588-71fd9c9d9abc
    type: similar
status: test
tags:
- attack.credential_access
- attack.t1003.001

