title: Potential SolidPDFCreator.DLL Sideloading
ruletype: Sigma
author: X__Junior (Nextron Systems)
date: 2023/05/07
description: Detects potential DLL sideloading of "SolidPDFCreator.dll"
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\SolidPDFCreator.dll'
    SELECTION_4:
        Image: '*\SolidPDFCreator.exe'
    SELECTION_5:
        ImageLoaded:
        - C:\Program Files (x86)\SolidDocuments\SolidPDFCreator\\*
        - C:\Program Files\SolidDocuments\SolidPDFCreator\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5)))
falsepositives:
- Unknown
id: a2edbce1-95c8-4291-8676-0d45146862b3
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://lab52.io/blog/new-mustang-pandas-campaing-against-australia/
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

