title: Active Directory Parsing DLL Loaded Via Office Applications
ruletype: Sigma
author: Antonlovesdnb
date: 2020/02/19
description: Detects DSParse DLL being loaded by an Office Product
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\excel.exe'
        - '*\mspub.exe'
        - '*\outlook.exe'
        - '*\powerpnt.exe'
        - '*\winword.exe'
    SELECTION_4:
        ImageLoaded: '*\dsparse.dll*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate macro usage. Add the appropriate filter according to your environment
id: a2a3b925-7bb0-433b-b508-db9003263cc4
level: high
logsource:
    category: image_load
    product: windows
modified: 2023/02/08
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: test
tags:
- attack.execution
- attack.t1204.002

