title: Potential DLL Sideloading Of DBGHELP.DLL
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), Wietze Beukema (project and research)
date: 2022/10/25
description: Detects DLL sideloading of "dbghelp.dll"
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\dbghelp.dll'
    SELECTION_4:
        ImageLoaded:
        - C:\Program Files (x86)\\*
        - C:\Program Files\\*
        - C:\Windows\SoftwareDistribution\\*
        - C:\Windows\System32\\*
        - C:\Windows\SystemTemp\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
    SELECTION_5:
        ImageLoaded:
        - '*\Anaconda3\Lib\site-packages\vtrace\platforms\windll\amd64\dbghelp.dll'
        - '*\Anaconda3\Lib\site-packages\vtrace\platforms\windll\i386\dbghelp.dll'
    SELECTION_6:
        ImageLoaded:
        - '*\Epic Games\Launcher\Engine\Binaries\ThirdParty\DbgHelp\dbghelp.dll'
        - '*\Epic Games\MagicLegends\x86\dbghelp.dll'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and  not ((SELECTION_4)))
        and  not ((SELECTION_5) or (SELECTION_6)))
falsepositives:
- Legitimate applications loading their own versions of the DLL mentioned in this
    rule
id: 6414b5cd-b19d-447e-bb5e-9f03940b5784
level: medium
logsource:
    category: image_load
    product: windows
modified: 2023/05/05
references:
- https://hijacklibs.net/
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

