title: Potential Libvlc.DLL Sideloading
ruletype: Sigma
author: X__Junior
date: 2023/04/17
description: Detects potential DLL sideloading of "libvlc.dll", a DLL that is legitimately
    used by "VLC.exe"
detection:
    SELECTION_1:
        EventID: 7
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImageLoaded: '*\libvlc.dll'
    SELECTION_4:
        ImageLoaded:
        - C:\Program Files (x86)\VideoLAN\VLC\\*
        - C:\Program Files\VideoLAN\VLC\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- False positives are expected if VLC is installed in non-default locations
id: bf9808c4-d24f-44a2-8398-b65227d406b6
level: medium
logsource:
    category: image_load
    product: windows
references:
- https://www.trendmicro.com/en_us/research/23/c/earth-preta-updated-stealthy-strategies.html
- https://hijacklibs.net/entries/3rd_party/vlc/libvlc.html
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002

