
title: Windows Spooler Service Suspicious Binary Load
ruletype: Sigma
author: FPT.EagleEye, Thomas Patzke (improvements)
date: 2021/06/29
description: Detect DLL Load from Spooler Service backup folder
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\spoolsv.exe'
  SELECTION_4:
    ImageLoaded:
    - '*\Windows\System32\spool\drivers\x64\3\\*'
    - '*\Windows\System32\spool\drivers\x64\4\\*'
  SELECTION_5:
    ImageLoaded: '*.dll'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Loading of legitimate driver
id: 02fb90de-c321-4e63-a6b9-25f4b03dfd14
level: informational
logsource:
  category: image_load
  product: windows
modified: 2022/06/02
references:
- https://github.com/hhlxf/PrintNightmare
- https://github.com/ly4k/SpoolFool
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574
- cve.2021.1675
- cve.2021.34527
