title: SafetyKatz Default Dump Filename
id: e074832a-eada-4fd7-94a1-10642b130e16
status: test
description: Detects default lsass dump filename from SafetyKatz
references:
    - https://github.com/GhostPack/SafetyKatz
    - https://github.com/GhostPack/SafetyKatz/blob/715b311f76eb3a4c8d00a1bd29c6cd1899e450b7/SafetyKatz/Program.cs#L63
author: Markus Neis
date: 2018/07/24
modified: 2021/11/27
tags:
    - attack.credential_access
    - attack.t1003.001
    - sysmon
logsource:
    category: file_event
    product: windows
detection:
    file_event:
        EventID: 11
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetFilename|endswith: \Temp\debug.bin
    condition: file_event and selection
falsepositives:
    - Rare legitimate files with similar filename structure
level: high
ruletype: Sigma
