title: Removal Of AMSI Provider Registry Keys
ruletype: Sigma
author: frack113
date: 2021/06/07
description: Detects the deletion of AMSI provider registry key entries in HKLM\Software\Microsoft\AMSI.
    This technique could be used by an attacker in order to disable AMSI inspection.
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: DeleteKey
    SELECTION_4:
        TargetObject:
        - '*{2781761E-28E0-4109-99FE-B9D127C57AFE}'
        - '*{A7C452EF-8E9F-42EB-9F2B-245613CA0DC9}'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: 41d1058a-aea7-4952-9293-29eaaf516465
level: high
logsource:
    category: registry_delete
    product: windows
modified: 2023/02/08
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://seclists.org/fulldisclosure/2020/Mar/45
status: test
tags:
- attack.defense_evasion
- attack.t1562.001

