title: RunMRU Registry Key Deletion - Registry
id: ec2a6d71-1139-d6f1-c39e-e9fc35500540
related:
    - id: c11aecef-9c37-45a6-9c07-bc0782f963fd
      type: similar
    - id: 3a9b8c1e-5b2e-4f7a-9d1c-2a7f3b6e1c55
      type: derived
status: experimental
description: |
    Detects attempts to delete the RunMRU registry key, which stores the history of commands executed via the run dialog.
    In the clickfix techniques, the phishing lures instruct users to open a run dialog through (Win + R) and execute malicious commands.
    Adversaries may delete this key to cover their tracks after executing commands.
references:
    - https://www.zscaler.com/blogs/security-research/coldriver-updates-arsenal-baitswitch-and-simplefix
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-09-25
tags:
    - attack.defense-evasion
    - attack.t1070.003
    - sysmon
logsource:
    category: registry_delete
    product: windows
detection:
    registry_delete:
        EventID: 12
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetObject|endswith: \Software\Microsoft\Windows\CurrentVersion\Explorer\RunMRU
    condition: registry_delete and selection
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/windows/registry/registry_delete/registry_delete_runmru/info.yml
ruletype: Sigma
