title: Terminal Server Client Connection History Cleared
ruletype: Sigma
author: Christian Burkard (Nextron Systems)
date: 2021/10/19
description: Detects the deletion of registry keys containing the MSTSC connection
    history
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: DeleteValue
    SELECTION_4:
        TargetObject: '*\Microsoft\Terminal Server Client\Default\MRU*'
    SELECTION_5:
        EventType: DeleteKey
    SELECTION_6:
        TargetObject: '*\Microsoft\Terminal Server Client\Servers\\*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: 07bdd2f5-9c58-4f38-aec8-e101bb79ef8d
level: high
logsource:
    category: registry_delete
    product: windows
modified: 2022/03/26
references:
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/remote/remove-entries-from-remote-desktop-connection-computer
- http://woshub.com/how-to-clear-rdp-connections-history/
- https://www.trendmicro.com/en_us/research/23/a/vice-society-ransomware-group-targets-manufacturing-companies.html
status: test
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1112

