author: Zach Mathis
date: 2022/06/14
modified: 2022/06/14

title: Mail Delivery Location PopUp
details: 'Msg: %Data[2]% | Ver: %Data[4]%' 
description: Displays the dialog box message that popped up in Mail Delivery Location for the user.

id: 553cb9bc-2e2b-4e43-acd3-2063bf601469
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: OAlerts
        EventID: 300
        EventData: 'Mail Delivery Location'
    condition: selection_basic
falsepositives:
tags:
references:
    - https://bromiley.medium.com/oalerts-the-microsoft-office-event-log-ad164e1eec0f
ruletype: Hayabusa

sample-message: 
sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft Office 15 Alerts" /> 
            <EventID Qualifiers="0">300</EventID> 
            <Level>4</Level> 
            <Task>0</Task> 
            <Keywords>0x80000000000000</Keywords> 
            <TimeCreated SystemTime="2016-03-11T02:36:24.000000000Z" /> 
            <EventRecordID>30</EventRecordID> 
            <Channel>OAlerts</Channel> 
            <Computer>Computer</Computer> 
            <Security /> 
        </System>
        <EventData>
            <Data>Mail Delivery Location</Data> 
            <Data>By adding a Microsoft Exchange account you have changed where some of your new e-mail messages and calendar information is saved.</Data> 
            <Data>350644</Data> 
            <Data>6.2.9200.16384</Data> 
            <Data /> 
            <Data /> 
        </EventData>
    </Event>