author: Zach Mathis
date: 2022/06/13
modified: 2022/06/13

title: Excel PopUp
details: 'Msg: %Data[2]% | Ver: %Data[4]%' 
description: Displays the dialog box message that popped up in Excel for the user.

id: 710b4f5a-6be7-44c2-9954-475ba2997475
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: OAlerts
        EventID: 300
        EventData: 'Microsoft Excel'
    condition: selection_basic
falsepositives:
tags:
references:
    - https://bromiley.medium.com/oalerts-the-microsoft-office-event-log-ad164e1eec0f
ruletype: Hayabusa

sample-message: 
sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft Office 15 Alerts" /> 
            <EventID Qualifiers="0">300</EventID> 
            <Level>4</Level> 
            <Task>0</Task> 
            <Keywords>0x80000000000000</Keywords> 
            <TimeCreated SystemTime="2015-06-31T03:55:30.000000000Z" /> 
            <EventRecordID>36</EventRecordID> 
            <Channel>OAlerts</Channel> 
            <Computer>Computer</Computer> 
            <Security /> 
        </System>
        <EventData>
            <Data>Microsoft Excel</Data> 
            <Data>Want to save your changes to 'Exploit.xlsx'?</Data> 
            <Data>100216</Data> 
            <Data>15.0.4420.1017</Data> 
            <Data /> 
            <Data /> 
        </EventData>
    </Event>