author: Zach Mathis
date: 2022/06/14
modified: 2022/06/14

title: SharePoint Designer PopUp
details: 'Msg: %Data[2]% | Ver: %Data[4]%' 
description: Displays the dialog box message that popped up in SharePoint Designer for the user.

id: 0779c53e-5af6-4973-bc06-a16d6a80b621
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: OAlerts
        EventID: 300
        EventData: 'Microsoft SharePoint Designer'
    condition: selection_basic
falsepositives:
tags:
references:
    - https://bromiley.medium.com/oalerts-the-microsoft-office-event-log-ad164e1eec0f
ruletype: Hayabusa

sample-message: 
sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft Office 15 Alerts" /> 
            <EventID Qualifiers="0">300</EventID> 
            <Level>4</Level> 
            <Task>0</Task> 
            <Keywords>0x80000000000000</Keywords> 
            <TimeCreated SystemTime="2016-03-21T22:09:46.000000000Z" /> 
            <EventRecordID>43</EventRecordID> 
            <Channel>OAlerts</Channel> 
            <Computer>Computer</Computer> 
            <Security /> 
        </System>
        <EventData>
            <Data>Microsoft SharePoint Designer</Data> 
            <Data>You do not have a default My Site specified. You can set one as the default by browsing to your My Site and accepting the prompt to configure it as the default My Site.</Data> 
            <Data>1310395</Data> 
            <Data>15.0.4535.1000</Data> 
            <Data /> 
            <Data /> 
        </EventData>
    </Event>