author: Zach Mathis
date: 2022/06/14
modified: 2022/06/14

title: Office PopUp
details: 'App: %Data[1]% | Msg: %Data[2]% | Ver: %Data[4]%' 
description: Displays the dialog box message that popped up in Word for the user.

id: 9db3ae3d-0b00-45f4-88b8-23b48d42ce37
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: OAlerts
        EventID: 300
    filter_already_have_alerts_for:
        - EventData: 'Microsoft Word'
        - EventData: 'Upload Center'
        - EventData: 'Activated App'
        - EventData: 'Microsoft SharePoint Designer'
        - EventData: 'Microsoft PowerPoint'
        - EventData: 'Microsoft Outlook*Startup'
        - EventData: 'Microsoft Outlook'
        - EventData: 'Microsoft OneNote'
        - EventData: 'Mail Delivery Location'
        - EventData: 'Microsoft Excel'
    condition: selection_basic and not filter_already_have_alerts_for
falsepositives:
tags:
references:
    - https://bromiley.medium.com/oalerts-the-microsoft-office-event-log-ad164e1eec0f
ruletype: Hayabusa