author: Zach Mathis
date: 2022/06/14
modified: 2022/06/14

title: Upload Center PopUp
details: 'Msg: %Data[2]% | Ver: %Data[4]%' 
description: Displays the dialog box message that popped up in Office Upload Center for the user.

id: 5e53842e-5b2b-4df3-b610-2278bf1a3d11
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: OAlerts
        EventID: 300
        EventData: 'Upload Center'
    condition: selection_basic
falsepositives:
tags:
references:
    - https://bromiley.medium.com/oalerts-the-microsoft-office-event-log-ad164e1eec0f
ruletype: Hayabusa

sample-message: 
sample-evtx: |
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft Office 15 Alerts" /> 
            <EventID Qualifiers="0">300</EventID> 
            <Level>4</Level> 
            <Task>0</Task> 
            <Keywords>0x80000000000000</Keywords> 
            <TimeCreated SystemTime="2017-07-16T21:28:08.000000000Z" /> 
            <EventRecordID>65</EventRecordID> 
            <Channel>OAlerts</Channel> 
            <Computer>Computer</Computer> 
            <Security /> 
        </System>
        <EventData>
            <Data>Upload Center</Data> 
            <Data>Are you sure you want to discard changes to this file that have not been uploaded to the server?</Data> 
            <Data>0</Data> 
            <Data>15.0.4535.1000</Data> 
            <Data /> 
            <Data /> 
        </EventData>
    </Event>