author: Zach Mathis
date: 2022/06/14
modified: 2022/06/14

title: Outlook Startup PopUp
details: 'Msg: %Data[2]% | Ver: %Data[4]%' 
description: Displays the dialog box message that popped up in Outlook for the user.

id: f9dbf647-bb0f-4a37-85cb-7277783c7335
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection_basic:
        Channel: OAlerts
        EventID: 300
        EventData: 'Microsoft Outlook*Startup'
    condition: selection_basic
falsepositives:
tags:
references:
    - https://bromiley.medium.com/oalerts-the-microsoft-office-event-log-ad164e1eec0f
ruletype: Hayabusa

sample-message: 
sample-evtx: |   
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
        <System>
            <Provider Name="Microsoft Office 14 Alerts" /> 
            <EventID Qualifiers="0">300</EventID> 
            <Level>4</Level> 
            <Task>0</Task> 
            <Keywords>0x80000000000000</Keywords> 
            <TimeCreated SystemTime="2011-03-11T14:13:51.000000000Z" /> 
            <EventRecordID>1</EventRecordID> 
            <Channel>OAlerts</Channel> 
            <Computer>Computer</Computer> 
            <Security /> 
        </System>
        <EventData>
            <Data>Microsoft Outlook 2010 Startup</Data> 
            <Data>This account has not been completely configured. Are you sure you want to exit the wizard?</Data> 
            <Data>301952</Data> 
            <Data>14.0.4763.1000</Data> 
            <Data /> 
            <Data /> 
        </EventData>
    </Event>