title: Remote Thread Creation Via PowerShell In Rundll32
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2018/06/25
description: Detects the creation of a remote thread from a Powershell process in
    a rundll32 process
detection:
    SELECTION_1:
        EventID: 8
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        SourceImage:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        TargetImage: '*\rundll32.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 99b97608-3e21-4bfe-8217-2a127c396a0e
level: high
logsource:
    category: create_remote_thread
    product: windows
modified: 2023/03/28
references:
- https://www.fireeye.com/blog/threat-research/2018/06/bring-your-own-land-novel-red-teaming-technique.html
related:
-   id: eeb2e3dc-c1f4-40dd-9bd5-149ee465ad50
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
- attack.t1059.001

