title: Remote Thread Creation Via PowerShell
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/06
description: Detects the creation of a remote thread from a Powershell process to
    another process
detection:
    SELECTION_1:
        EventID: 8
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        SourceImage:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        SourceParentImage: C:\Windows\System32\CompatTelRunner.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- Unknown
id: eeb2e3dc-c1f4-40dd-9bd5-149ee465ad50
level: medium
logsource:
    category: create_remote_thread
    product: windows
modified: 2023/03/28
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
related:
-   id: 99b97608-3e21-4bfe-8217-2a127c396a0e
    type: derived
status: test
tags:
- attack.execution
- attack.t1059.001

