title: Remote Thread Creation In Uncommon Target Image
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/03/16
description: Detects uncommon target processes for remote thread creation
detection:
    SELECTION_1:
        EventID: 8
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetImage:
        - '*\calc.exe'
        - '*\calculator.exe'
        - '*\explorer.exe'
        - '*\mspaint.exe'
        - '*\notepad.exe'
        - '*\ping.exe'
        - '*\sethc.exe'
        - '*\spoolsv.exe'
        - '*\wordpad.exe'
        - '*\write.exe'
    SELECTION_4:
        SourceImage: C:\Windows\System32\csrss.exe
    SELECTION_5:
        TargetImage: C:\Windows\System32\spoolsv.exe
    SELECTION_6:
        StartFunction: EtwpNotificationThread
    SELECTION_7:
        SourceImage: '*unknown process*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5))) and  not ((SELECTION_6) or (SELECTION_7)))
falsepositives:
- Unknown
id: a1a144b7-5c9b-4853-a559-2172be8d4a03
level: high
logsource:
    category: create_remote_thread
    product: windows
modified: 2023/05/05
references:
- https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection
related:
-   id: f016c716-754a-467f-a39e-63c06f773987
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055.003

