title: Remote Thread Creation By Uncommon Source Image
ruletype: Sigma
author: Perez Diego (@darkquassar), oscd.community
date: 2019/10/27
description: Detects uncommon processes creating remote threads
detection:
    SELECTION_1:
        EventID: 8
    SELECTION_10:
        TargetParentProcessId: 0
    SELECTION_11:
        SourceImage: C:\Windows\System32\VSSVC.exe
    SELECTION_12:
        TargetImage: System
    SELECTION_13:
        SourceImage:
        - C:\Windows\System32\schtasks.exe
        - C:\Windows\SysWOW64\schtasks.exe
    SELECTION_14:
        TargetImage: C:\Windows\System32\conhost.exe
    SELECTION_15:
        SourceImage: C:\Windows\explorer.exe
    SELECTION_16:
        TargetImage: C:\Program Files\NVIDIA Corporation\NVIDIA GeForce Experience\NVIDIA
            GeForce Experience.exe
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        SourceImage:
        - '*\bash.exe'
        - '*\cscript.exe'
        - '*\cvtres.exe'
        - '*\defrag.exe'
        - '*\dnx.exe'
        - '*\esentutl.exe'
        - '*\excel.exe'
        - '*\expand.exe'
        - '*\explorer.exe'
        - '*\find.exe'
        - '*\findstr.exe'
        - '*\forfiles.exe'
        - '*\gpupdate.exe'
        - '*\hh.exe'
        - '*\iexplore.exe'
        - '*\installutil.exe'
        - '*\lync.exe'
        - '*\makecab.exe'
        - '*\mDNSResponder.exe'
        - '*\monitoringhost.exe'
        - '*\msbuild.exe'
        - '*\mshta.exe'
        - '*\msiexec.exe'
        - '*\mspaint.exe'
        - '*\outlook.exe'
        - '*\ping.exe'
        - '*\powerpnt.exe'
        - '*\provtool.exe'
        - '*\python.exe'
        - '*\regsvr32.exe'
        - '*\robocopy.exe'
        - '*\runonce.exe'
        - '*\sapcimc.exe'
        - '*\schtasks.exe'
        - '*\smartscreen.exe'
        - '*\spoolsv.exe'
        - '*\tstheme.exe'
        - '*\userinit.exe'
        - '*\vssadmin.exe'
        - '*\vssvc.exe'
        - '*\w3wp.exe'
        - '*\winlogon.exe'
        - '*\winscp.exe'
        - '*\winword.exe'
        - '*\wmic.exe'
        - '*\wscript.exe'
    SELECTION_4:
        SourceImage: C:\Windows\System32\winlogon.exe
    SELECTION_5:
        TargetImage:
        - C:\Windows\System32\services.exe
        - C:\Windows\System32\wininit.exe
        - C:\Windows\System32\csrss.exe
    SELECTION_6:
        SourceImage: C:\Windows\System32\winlogon.exe
    SELECTION_7:
        TargetParentImage: System
    SELECTION_8:
        TargetParentProcessId: 4
    SELECTION_9:
        SourceImage: C:\Windows\System32\provtool.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13 and
        SELECTION_14))) and  not ((SELECTION_15 and SELECTION_16)))
falsepositives:
- Unknown
id: 66d31e5f-52d6-40a4-9615-002d3789a119
level: high
logsource:
    category: create_remote_thread
    product: windows
modified: 2023/05/05
references:
- Personal research, statistical analysis
- https://lolbas-project.github.io
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1055

