title: HackTool - CACTUSTORCH Remote Thread Creation
id: 13fb9149-1c95-d7ea-1ba3-be9e1ab4cb24
related:
    - id: 2e4e488a-6164-4811-9ea1-f960c7359c40
      type: derived
status: test
description: Detects remote thread creation from CACTUSTORCH as described in references.
references:
    - https://twitter.com/SBousseaden/status/1090588499517079552 # Deleted
    - https://github.com/mdsecactivebreach/CACTUSTORCH
author: '@SBousseaden (detection), Thomas Patzke (rule)'
date: 2019-02-01
modified: 2023-05-05
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1055.012
    - attack.t1059.005
    - attack.t1059.007
    - attack.t1218.005
    - sysmon
logsource:
    product: windows
    category: create_remote_thread
detection:
    create_remote_thread:
        EventID: 8
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        SourceImage|endswith:
            - \System32\cscript.exe
            - \System32\wscript.exe
            - \System32\mshta.exe
            - \winword.exe
            - \excel.exe
        TargetImage|contains: \SysWOW64\
        StartModule: null
    condition: create_remote_thread and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
