title: Remote Thread Creation By Uncommon Source Image
id: 66d31e5f-52d6-40a4-9615-002d3789a119
status: experimental
description: Detects uncommon processes creating remote threads
references:
    - Personal research, statistical analysis
    - https://lolbas-project.github.io
author: Perez Diego (@darkquassar), oscd.community
date: 2019/10/27
modified: 2023/05/05
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1055
    - sysmon
logsource:
    product: windows
    category: create_remote_thread
detection:
    create_remote_thread:
        EventID: 8
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        SourceImage|endswith:
            - \bash.exe
            - \cscript.exe
            - \cvtres.exe
            - \defrag.exe
            - \dnx.exe
            - \esentutl.exe
            - \excel.exe
            - \expand.exe
            - \explorer.exe
            - \find.exe
            - \findstr.exe
            - \forfiles.exe
            - \gpupdate.exe
            - \hh.exe
            - \iexplore.exe
            - \installutil.exe
            - \lync.exe
            - \makecab.exe
            - \mDNSResponder.exe
            - \monitoringhost.exe
            - \msbuild.exe
            - \mshta.exe
            - \msiexec.exe
            - \mspaint.exe
            - \outlook.exe
            - \ping.exe
            - \powerpnt.exe
            - \provtool.exe
            - \python.exe
            - \regsvr32.exe
            - \robocopy.exe
            - \runonce.exe
            - \sapcimc.exe
            - \schtasks.exe
            - \smartscreen.exe
            - \spoolsv.exe
            - \tstheme.exe
            - \userinit.exe
            - \vssadmin.exe
            - \vssvc.exe
            - \w3wp.exe
            - \winlogon.exe
            - \winscp.exe
            - \winword.exe
            - \wmic.exe
            - \wscript.exe
    filter_main_winlogon_1:
        SourceImage: C:\Windows\System32\winlogon.exe
        TargetImage:
            - C:\Windows\System32\services.exe
            - C:\Windows\System32\wininit.exe
            - C:\Windows\System32\csrss.exe
    filter_main_winlogon_2:
        SourceImage: C:\Windows\System32\winlogon.exe
        TargetParentImage: System
        TargetParentProcessId: 4
    filter_main_provtool:
        SourceImage: C:\Windows\System32\provtool.exe
        TargetParentProcessId: 0
    filter_main_vssvc:
        SourceImage: C:\Windows\System32\VSSVC.exe
        TargetImage: System
    filter_main_schtasks_conhost:
        SourceImage:
            - C:\Windows\System32\schtasks.exe
            - C:\Windows\SysWOW64\schtasks.exe
        TargetImage: C:\Windows\System32\conhost.exe
    filter_optional_nvidia:
        SourceImage: C:\Windows\explorer.exe
        TargetImage: C:\Program Files\NVIDIA Corporation\NVIDIA GeForce Experience\NVIDIA
            GeForce Experience.exe
    condition: create_remote_thread and (selection and not 1 of filter_main_* and
        not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
