
title: Suspicious Remote Thread Created
ruletype: Sigma
author: Perez Diego (@darkquassar), oscd.community
date: 2019/10/27
description: Offensive tradecraft is switching away from using APIs like "CreateRemoteThread",
  however, this is still largely observed in the wild. This rule aims to detect suspicious
  processes (those we would not expect to behave in this way like word.exe or outlook.exe)
  creating remote threads on other processes. It is a generalistic rule, but it should
  have a low FP ratio due to the selected range of processes.
detection:
  SELECTION_1:
    EventID: 8
  SELECTION_10:
    SourceImage: '*\git.exe'
  SELECTION_11:
    TargetImage:
    - '*\git.exe'
    - '*C:\Windows\System32\conhost.exe'
  SELECTION_12:
    SourceImage: C:\Windows\System32\VSSVC.exe
  SELECTION_13:
    TargetImage: System
  SELECTION_14:
    SourceParentImage: C:\Windows\System32\CompatTelRunner.exe
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    SourceImage:
    - '*\bash.exe'
    - '*\cvtres.exe'
    - '*\defrag.exe'
    - '*\dnx.exe'
    - '*\esentutl.exe'
    - '*\excel.exe'
    - '*\expand.exe'
    - '*\explorer.exe'
    - '*\find.exe'
    - '*\findstr.exe'
    - '*\forfiles.exe'
    - '*\gpupdate.exe'
    - '*\hh.exe'
    - '*\iexplore.exe'
    - '*\installutil.exe'
    - '*\lync.exe'
    - '*\makecab.exe'
    - '*\mDNSResponder.exe'
    - '*\monitoringhost.exe'
    - '*\msbuild.exe'
    - '*\mshta.exe'
    - '*\msiexec.exe'
    - '*\mspaint.exe'
    - '*\outlook.exe'
    - '*\ping.exe'
    - '*\powerpnt.exe'
    - '*\powershell.exe'
    - '*\pwsh.exe'
    - '*\provtool.exe'
    - '*\python.exe'
    - '*\regsvr32.exe'
    - '*\robocopy.exe'
    - '*\runonce.exe'
    - '*\sapcimc.exe'
    - '*\schtasks.exe'
    - '*\smartscreen.exe'
    - '*\spoolsv.exe'
    - '*\tstheme.exe'
    - '*\userinit.exe'
    - '*\vssadmin.exe'
    - '*\vssvc.exe'
    - '*\w3wp.exe'
    - '*\winlogon.exe'
    - '*\winscp.exe'
    - '*\wmic.exe'
    - '*\word.exe'
    - '*\wscript.exe'
  SELECTION_4:
    SourceImage: '*Visual Studio*'
  SELECTION_5:
    SourceParentImage: '*\Programs\Microsoft VS Code\\*'
  SELECTION_6:
    SourceImage: C:\Windows\System32\winlogon.exe
  SELECTION_7:
    TargetImage:
    - C:\Windows\System32\services.exe
    - C:\Windows\System32\wininit.exe
    - C:\Windows\System32\csrss.exe
  SELECTION_8:
    SourceImage: C:\Windows\System32\provtool.exe
  SELECTION_9:
    TargetParentProcessId: 0
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
    or SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)
    or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13) or (SELECTION_14)))
falsepositives:
- Unknown
fields:
- ComputerName
- User
- SourceImage
- TargetImage
id: 66d31e5f-52d6-40a4-9615-002d3789a119
level: high
logsource:
  category: create_remote_thread
  product: windows
modified: 2022/07/31
notes:
- MonitoringHost.exe is a process that loads .NET CLR by default and thus a favorite
  for process injection for .NET in-memory offensive tools.
references:
- Personal research, statistical analysis
- https://lolbas-project.github.io
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1055
