title: Suspicious Digital Signature Of AppX Package
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/16
description: Detects execution of AppX packages with known suspicious or malicious
    signature
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-AppxPackaging/Operational
    SELECTION_2:
        EventID: 157
    SELECTION_3:
        subjectName: CN=Foresee Consulting Inc., O=Foresee Consulting Inc., L=North
            York, S=Ontario, C=CA, SERIALNUMBER=1004913-1, OID.1.3.6.1.4.1.311.60.2.1.3=CA,
            OID.2.5.4.15=Private Organization
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: b5aa7d60-c17e-4538-97de-09029d6cd76b
level: medium
logsource:
    product: windows
    service: appxpackaging-om
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
status: experimental
tags:
- attack.defense_evasion
- attack.execution

