title: Potential APT-C-12 BlueMushroom DLL Load Activity Via Regsvr32
id: 2eb4e4d4-e162-58ca-7449-8b5b420ce72e
related:
    - id: bd70d3f8-e60e-4d25-89f0-0b5a9cff20e0
      type: derived
status: test
description: Detects potential BlueMushroom DLL loading activity via regsvr32 from AppData Local
references:
    - https://pbs.twimg.com/media/EF3yLGoWkAEGeLa?format=jpg
author: Florian Roth (Nextron Systems), Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
date: 2019-10-02
modified: 2023-03-29
tags:
    - attack.defense-evasion
    - attack.t1218.010
    - detection.emerging-threats
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - regsvr32
            - \AppData\Local\
            - .dll
            - ',DllEntry'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
