
title: WMI Persistence - Command Line Event Consumer
author: Thomas Patzke
date: 2018/03/07
description: Detects WMI command line event consumers
detection:
  SELECTION_1:
    Image: C:\Windows\System32\wbem\WmiPrvSE.exe
  SELECTION_2:
    ImageLoaded: '*\wbemcons.dll'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown (data set is too small; further testing needed)
id: 05936ce2-ee05-4dae-9d03-9a391cf2d2c6
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
references:
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
status: test
tags:
- attack.t1546.003
- attack.persistence
