
title: Svchost DLL Search Order Hijack
author: SBousseaden
date: 2019/10/28
description: IKEEXT and SessionEnv service, as they call LoadLibrary on files that
  do not exist within C:\Windows\System32\ by default. An attacker can place their
  malicious logic within the PROCESS_ATTACH block of their library and restart the
  aforementioned services "svchost.exe -k netsvcs" to gain code execution on a remote
  machine.
detection:
  SELECTION_1:
    Image:
    - '*\svchost.exe'
  SELECTION_2:
    ImageLoaded:
    - '*\tsmsisrv.dll'
    - '*\tsvipsrv.dll'
    - '*\wlbsctrl.dll'
  SELECTION_3:
    ImageLoaded:
    - C:\Windows\WinSxS\\*
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Pentest
id: 602a1f13-c640-4d73-b053-be9a2fa58b77
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
references:
- https://posts.specterops.io/lateral-movement-scm-and-dll-hijacking-primer-d2f61e8ab992
status: test
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1574.002
- attack.t1574.001
