
title: Suspicious Load of Advapi31.dll
ruletype: Sigma
author: frack113
date: 2022/02/03
description: Detects the load of advapi31.dll by a process running in an uncommon
  folder
detection:
  SELECTION_1:
    EventID: 7
  SELECTION_2:
    ImageLoaded: '*\advapi32.dll'
  SELECTION_3:
    Image:
    - C:\Windows\\*
    - C:\Program Files (x86)\\*
    - C:\Program Files\\*
  SELECTION_4:
    Image: C:\ProgramData\Microsoft\Windows Defender\platform\\*
  SELECTION_5:
    Image: '*\MpCmdRun.exe'
  SELECTION_6:
    Image: C:\Users\\*
  SELECTION_7:
    Image: '*\AppData\Local\Microsoft\OneDrive\\*'
  SELECTION_8:
    Image: '*FileCoAuth.exe'
  condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3) or (SELECTION_4
    and SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: d813d662-785b-42ca-8b4a-f7457d78d5a9
level: informational
logsource:
  category: image_load
  product: windows
modified: 2022/02/11
references:
- https://github.com/hlldz/Phant0m
status: experimental
tags:
- attack.defense_evasion
- attack.t1070
