
title: Suspicious WSMAN Provider Image Loads
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/06/24
description: Detects signs of potential use of the WSMAN provider from uncommon processes
  locally and remote execution.
detection:
  SELECTION_1:
    ImageLoaded:
    - '*\WsmSvc.dll'
    - '*\WsmAuto.dll'
    - '*\Microsoft.WSMan.Management.ni.dll'
  SELECTION_10:
    Image: C:\Windows\Temp\asgard2-agent\\*
  SELECTION_11:
    Image: C:\Program Files\Citrix\\*
  SELECTION_2:
    OriginalFileName:
    - WsmSvc.dll
    - WSMANAUTOMATION.DLL
    - Microsoft.WSMan.Management.dll
  SELECTION_3:
    Image: '*\svchost.exe'
  SELECTION_4:
    OriginalFileName: WsmWmiPl.dll
  SELECTION_5:
    Image:
    - '*\powershell.exe'
    - '*C:\Windows\System32\sdiagnhost.exe'
    - '*C:\Windows\System32\services.exe'
  SELECTION_6:
    CommandLine:
    - '*svchost.exe -k netsvcs -p -s BITS*'
    - '*svchost.exe -k GraphicsPerfSvcGroup -s GraphicsPerfSvc*'
    - '*svchost.exe -k NetworkService -p -s Wecsvc*'
    - '*svchost.exe -k netsvcs*'
  SELECTION_7:
    Image:
    - C:\Windows\Microsoft.NET\Framework64\v*
    - C:\Windows\Microsoft.NET\Framework\v*
  SELECTION_8:
    Image: '*\mscorsvw.exe'
  SELECTION_9:
    Image:
    - C:\Windows\System32\Configure-SMRemoting.exe
    - C:\Windows\System32\ServerManager.exe
  condition: (((SELECTION_1 or SELECTION_2) or (SELECTION_3 and SELECTION_4)) and  not
    ((SELECTION_5) or (SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9)
    or (SELECTION_10) or (SELECTION_11)))
falsepositives:
- Unknown
id: ad1f4bb9-8dfb-4765-adb6-2a7cfb6c0f94
level: medium
logsource:
  category: image_load
  product: windows
modified: 2022/02/21
references:
- https://twitter.com/chadtilbury/status/1275851297770610688
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://docs.microsoft.com/en-us/windows/win32/winrm/windows-remote-management-architecture
- https://github.com/bohops/WSMan-WinRM
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.003
