
title: CLR DLL Loaded Via Office Applications
author: Antonlovesdnb
date: 2020/02/19
description: Detects CLR DLL being loaded by an Office Product
detection:
  SELECTION_1:
    Image:
    - '*\winword.exe'
    - '*\powerpnt.exe'
    - '*\excel.exe'
    - '*\outlook.exe'
  SELECTION_2:
    ImageLoaded:
    - '*\clr.dll*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Alerts on legitimate macro usage as well, will need to filter as appropriate
id: d13c43f0-f66b-4279-8b2c-5912077c1780
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/27
references:
- https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
status: test
tags:
- attack.execution
- attack.t1204.002
