
title: UAC Bypass With Fake DLL
author: oscd.community, Dmitry Uchakin
date: 2020/10/06
description: Attempts to load dismcore.dll after dropping it
detection:
  SELECTION_1:
    Image:
    - '*\dism.exe'
  SELECTION_2:
    ImageLoaded:
    - '*\dismcore.dll'
  SELECTION_3:
    ImageLoaded:
    - C:\Windows\System32\Dism\dismcore.dll
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Pentests
- Actions of a legitimate telnet client
id: a5ea83a7-05a5-44c1-be2e-addccbbd8c03
level: high
logsource:
  category: image_load
  product: windows
modified: 2021/11/23
references:
- https://steemit.com/utopian-io/@ah101/uac-bypassing-utility
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- attack.t1574.002
