title: Dfsvc.EXE Initiated Network Connection Over Uncommon Port
id: 4255ccee-f954-7d80-4281-d5a5fe9ea9f7
related:
    - id: 4c5fba4a-9ef6-4f16-823d-606246054741
      type: derived
status: test
description: Detects an initiated network connection over uncommon ports from "dfsvc.exe". A utility used to handled ClickOnce applications.
references:
    - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-12
modified: 2024-01-31
tags:
    - attack.execution
    - attack.t1203
    - detection.threat-hunting
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Application|contains: :\Windows\Microsoft.NET\
        Application|endswith: \dfsvc.exe
        Direction: '%%14593'
    filter_main_known_ports:
        DestPort:
            - 80
            - 443
    filter_optional_dns_ipv6:
        # Based on VT. More than 140 binaries made communication over DNS
        DestinationIsIpv6: 'true'
        DestPort: 53
    condition: network_connection and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
