title: HH.EXE Initiated HTTP Network Connection
id: 13790f2d-97b2-d1a0-6624-1061d7ccbb8c
status: test
description: |
    Detects a network connection initiated by the "hh.exe" process to HTTP destination ports, which could indicate the execution/download of remotely hosted .chm files.
references:
    - https://www.splunk.com/en_us/blog/security/follina-for-protocol-handlers.html
    - https://github.com/redcanaryco/atomic-red-team/blob/1cf4dd51f83dcb0ebe6ade902d6157ad2dbc6ac8/atomics/T1218.001/T1218.001.md
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/05
tags:
    - attack.defense_evasion
    - attack.t1218.001
    - detection.threat_hunting
    - sysmon
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Application|endswith: \hh.exe
        Direction: '%%14593'
        DestPort:
            - 80
            - 443
    condition: network_connection and selection
falsepositives:
    - False positive is expected from launching "hh.exe" for the first time on a machine in a while or simply from help files containing reference to external sources. Best correlate this with process creation and file events.
level: medium
ruletype: Sigma
