title: Dllhost.EXE Initiated Network Connection To Non-Local IP Address
id: 1062d249-f014-9faf-044e-2b75d6f9763f
related:
    - id: cfed2f44-16df-4bf3-833a-79405198b277
      type: derived
status: test
description: |
    Detects Dllhost.EXE initiating a network connection to a non-local IP address.
    Aside from Microsoft own IP range that needs to be excluded. Network communication from Dllhost will depend entirely on the hosted DLL.
    An initial baseline is recommended before deployment.
references:
    - https://redcanary.com/blog/child-processes/
    - https://nasbench.medium.com/what-is-the-dllhost-exe-process-actually-running-ef9fe4c19c08
author: bartblaze
date: 2020-07-13
modified: 2024-07-16
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.execution
    - attack.t1559.001
    - detection.threat-hunting
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Application|endswith: \dllhost.exe
        Direction: '%%14593'
    filter_main_local_ranges:
        DestAddress|cidr:
            - ::1/128    # IPv6 loopback
            - 10.0.0.0/8
            - 127.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - fc00::/7    # IPv6 private addresses
            - fe80::/10    # IPv6 link-local addresses
    filter_main_msrange:
        DestAddress|cidr:
            - 20.184.0.0/13   # Microsoft Corporation
            - 20.192.0.0/10   # Microsoft Corporation
            - 23.72.0.0/13    # Akamai International B.V.
            - 51.10.0.0/15    # Microsoft Corporation
            - 51.103.0.0/16   # Microsoft Corporation
            - 51.104.0.0/15   # Microsoft Corporation
            - 52.224.0.0/11    # Microsoft Corporation
            - 150.171.0.0/19    # Microsoft Corporation
            - 204.79.197.0/24   # Microsoft Corporation'
    condition: network_connection and (selection and not 1 of filter_main_*)
falsepositives:
    - Communication to other corporate systems that use IP addresses from public address spaces
level: medium
ruletype: Sigma
