title: PUA - Sysinternal Tool Execution - Registry
ruletype: Sigma
author: Markus Neis
date: 2017/08/28
description: Detects the execution of a Sysinternals Tool via the creation of the
    "accepteula" registry key
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: CreateKey
    SELECTION_4:
        TargetObject: '*\EulaAccepted'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same Registry Key
id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
level: low
logsource:
    category: registry_add
    product: windows
modified: 2023/02/07
references:
- https://twitter.com/Moti_B/status/1008587936735035392
status: experimental
tags:
- attack.resource_development
- attack.t1588.002

