title: Usage of Suspicious Sysinternals Tools
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/24
description: Detects the usage of Suspicious Sysinternals Tools such as PsExec, Procdump...etc
    via the "accepteula" key being added to Registry
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: CreateKey
    SELECTION_4:
        TargetObject:
        - '*\PsExec*'
        - '*\ProcDump*'
        - '*\Handle*'
        - '*\LiveKd*'
        - '*\Process Explorer*'
        - '*\PsLoglist*'
        - '*\PsPasswd*'
        - '*\Active Directory Explorer*'
        - '*\Sysinternals*'
    SELECTION_5:
        TargetObject: '*\EulaAccepted'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate use of SysInternals tools
id: c7da8edc-49ae-45a2-9e61-9fd860e4e73d
level: medium
logsource:
    category: registry_add
    product: windows
references:
- https://twitter.com/Moti_B/status/1008587936735035392
related:
-   id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
    type: derived
status: experimental
tags:
- attack.resource_development
- attack.t1588.002

