title: Persistence Via New AMSI Providers
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: Detects when an attacker registers a new AMSI provider in order to achieve
    persistence
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: CreateKey
    SELECTION_4:
        TargetObject:
        - '*\SOFTWARE\Microsoft\AMSI\Providers\\*'
        - '*\SOFTWARE\WOW6432Node\Microsoft\AMSI\Providers\\*'
    SELECTION_5:
        Image:
        - C:\Windows\System32\\*
        - C:\Program Files\\*
        - C:\Program Files (x86)\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Legitimate security products adding their own AMSI providers
id: 33efc23c-6ea2-4503-8cfe-bdf82ce8f705
level: high
logsource:
    category: registry_add
    product: windows
modified: 2022/12/19
references:
- https://persistence-info.github.io/Data/amsi.html
- https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/FakeAMSI/FakeAMSI.c
status: experimental
tags:
- attack.persistence

