title: Stop Or Remove Antivirus Service
ruletype: Sigma
author: frack113
date: 2021/07/07
description: 'Detects usage of ''Stop-Service'' or ''Remove-Service'' powershell cmdlet
    to disable AV services.

    Adversaries may disable security tools to avoid possible detection of their tools
    and activities by stopping antivirus service

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '*Stop-Service *'
        - '*Remove-Service *'
    SELECTION_4:
        CommandLine:
        - '* McAfeeDLPAgentService*'
        - '* Trend Micro Deep Security Manager*'
        - '* TMBMServer*'
        - '*Sophos*'
        - '*Symantec*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 6783aa9e-0dc3-49d4-a94a-8b39c5fd700b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
status: deprecated
tags:
- attack.defense_evasion
- attack.t1562.001

