title: Credential Acquisition via Registry Hive Dumping
ruletype: Sigma
author: Tim Rauch
date: 2022/10/04
description: Detects Credential Acquisition via Registry Hive Dumping
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\reg.exe'
    SELECTION_4:
        OriginalFileName: reg.exe
    SELECTION_5:
        CommandLine:
        - '* save *'
        - '* export *'
    SELECTION_6:
        CommandLine:
        - '*hklm\sam*'
        - '*hklm\security*'
        - '*HKEY_LOCAL_MACHINE\SAM*'
        - '*HKEY_LOCAL_MACHINE\SECURITY*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
id: 4d6c9da1-318b-4edf-bcea-b6c93fa98fd0
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/06
references:
- https://www.elastic.co/guide/en/security/current/credential-acquisition-via-registry-hive-dumping.html
status: deprecated
tags:
- attack.credential_access
- attack.t1003

