title: Execution via MSSQL Xp_cmdshell Stored Procedure
ruletype: Sigma
author: Tim Rauch
date: 2022/09/28
description: Detects execution via MSSQL xp_cmdshell stored procedure. Malicious users
    may attempt to elevate their privileges by using xp_cmdshell, which is disabled
    by default.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\cmd.exe'
    SELECTION_4:
        OriginalFileName: Cmd.Exe
    SELECTION_5:
        ParentImage: '*\sqlservr.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 344482e4-a477-436c-aa70-7536d18a48c7
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/06
references:
- https://www.elastic.co/guide/en/security/current/execution-via-mssql-xp_cmdshell-stored-procedure.html
related:
-   id: d08dd86f-681e-4a00-a92c-1db218754417
    type: derived
-   id: 7f103213-a04e-4d59-8261-213dddf22314
    type: derived
status: deprecated
tags:
- attack.execution
- attack.t1059

