title: Renamed PsExec
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2019/05/21
description: Detects the execution of a renamed PsExec often used by attackers or
    malware
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description: Execute processes remotely
    SELECTION_4:
        Product: Sysinternals PsExec
    SELECTION_5:
        Image:
        - '*\PsExec.exe'
        - '*\PsExec64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Software that illegaly integrates PsExec in a renamed form
- Administrators that have renamed PsExec and no one knows why
id: a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/04
references:
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks
status: deprecated
tags:
- car.2013-05-009
- attack.defense_evasion
- attack.t1036.003

