title: Renamed PowerShell
ruletype: Sigma
author: Florian Roth (Nextron Systems), frack113
date: 2019/08/22
description: Detects the execution of a renamed PowerShell often used by attackers
    or malware
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Description:
        - Windows PowerShell*
        - pwsh*
    SELECTION_4:
        Company: Microsoft Corporation
    SELECTION_5:
        Image:
        - '*\powershell.exe'
        - '*\powershell_ise.exe'
        - '*\pwsh.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: d178a2d7-129a-4ba4-8ee6-d6e1fecd5d20
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/18
references:
- https://twitter.com/christophetd/status/1164506034720952320
status: deprecated
tags:
- car.2013-05-009
- attack.defense_evasion
- attack.t1036.003

