title: Cmd Stream Redirection
ruletype: Sigma
author: frack113
date: 2022/02/04
description: Detects the redirection of an alternate data stream (ADS) of / within
    a Windows command line session
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\cmd.exe'
    SELECTION_4:
        CommandLine: '*> *'
    SELECTION_5:
        CommandLine: '*:*'
    SELECTION_6:
        CommandLine: '* :\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6))
falsepositives:
- Unknown
id: 70e68156-6571-427b-a6e9-4476a173a9b6
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/07
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.004/T1564.004.md#atomic-test-3---create-ads-command-prompt
status: deprecated
tags:
- attack.defense_evasion
- attack.t1564.004

