title: PowerShell DownloadFile
id: 04571acd-b076-fbd9-d013-5e3be608b7b5
related:
    - id: 8f70ac5f-1f6f-4f8e-b454-db19561216c5
      type: derived
status: deprecated
description: Detects the execution of powershell, a WebClient object creation and the invocation of DownloadFile in a single command line
references:
    - https://www.fireeye.com/blog/threat-research/2020/03/apt41-initiates-global-intrusion-campaign-using-multiple-exploits.html
author: Florian Roth (Nextron Systems)
date: 2020-08-28
modified: 2025-10-20
tags:
    - attack.execution
    - attack.t1059.001
    - attack.command-and-control
    - attack.t1104
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains|all:
            - powershell
            - .DownloadFile
            - System.Net.WebClient
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
