title: WMI Reconnaissance List Remote Services
ruletype: Sigma
author: frack113
date: 2022/01/01
description: 'An adversary might use WMI to check if a certain Remote Service is running
    on a remote device.

    When the test completes, a service information will be displayed on the screen
    if it exists.

    A common feedback message is that "No instance(s) Available" if the service queried
    is not running.

    A common error message is "Node - (provided IP or default) ERROR Description =The
    RPC server is unavailable" if the provided remote host is unreachable

    '
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\WMIC.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        CommandLine: '*/node:*'
    SELECTION_6:
        CommandLine: '*service*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 09af397b-c5eb-4811-b2bb-08b3de464ebf
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1047/T1047.md
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
status: deprecated
tags:
- attack.execution
- attack.t1047

