title: Suspicious Characters in CommandLine
id: 2c0d2d7b-30d6-4d14-9751-7b9113042ab9
status: deprecated
description: Detects suspicious Unicode characters in the command line, which could
    be a sign of obfuscation or defense evasion
references:
    - https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
author: Florian Roth (Nextron Systems)
date: 2022/04/27
modified: 2023/03/03
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_spacing_modifiers:
        CommandLine|contains:
            - "\u02E3"
            - "\u02EA"
            - "\u02E2"
    selection_unicode_slashes:
        CommandLine|contains:
            - "\u2215"
            - "\u2044"
    selection_unicode_hyphens:
        CommandLine|contains:
            - "\u2015"
            - "\u2014"
    condition: process_creation and (1 of selection*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
