title: Renamed Rundll32.exe Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/06/08
description: Detects the execution of rundll32.exe that has been renamed to a different
    name to avoid detection
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        OriginalFileName: RUNDLL32.EXE
    SELECTION_4:
        Image: '*\rundll32.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: d4d2574f-ac17-4d9e-b986-aeeae0dc8fe2
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/18
references:
- https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/
status: deprecated

