title: Winword.exe Loads Suspicious DLL
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects Winword.exe loading a custom DLL using the /l flag
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\winword.exe'
    SELECTION_4:
        CommandLine: '*/l*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- CommandLine
id: 2621b3a6-3840-4810-ac14-a02426086171
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/25
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
status: deprecated
tags:
- attack.defense_evasion
- attack.t1202

