title: User Account Hidden By Registry
ruletype: Sigma
author: frack113
date: 2022/08/20
description: Detect modification for a specific user to prevent that user from being
    listed on the logon screen
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist\\*'
    SELECTION_5:
        TargetObject: '*$'
    SELECTION_6:
        Details: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 8a58209c-7ae6-4027-afb0-307a78e4589a
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1564.002/T1564.002.md
status: deprecated
tags:
- attack.defense_evasion
- attack.t1564.002

