title: Suspicious Esentutl Use
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2020/05/23
description: Detects flags often used with the LOLBAS Esentutl for malicious activity.
    It could be used in rare cases by administrators to access locked files or during
    maintenance.
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine: '* /vss *'
    SELECTION_4:
        CommandLine: '* /y *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: 56a8189f-11b2-48c8-8ca7-c54b03c2fbf7
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/04/11
references:
- https://lolbas-project.github.io/
- https://twitter.com/chadtilbury/status/1264226341408452610
status: deprecated
tags:
- attack.defense_evasion
- attack.execution
- attack.s0404
- attack.t1218

