title: Rclone Execution via Command Line or PowerShell
ruletype: Sigma
author: Aaron Greetham (@beardofbinary) - NCC Group
date: 2021/05/26
description: Detects Rclone which is commonly used by ransomware groups for exfiltration
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        CommandLine:
        - '* pass *'
        - '* user *'
        - '* copy *'
        - '* mega *'
        - '* sync *'
        - '* config *'
        - '* lsd *'
        - '* remote *'
        - '* ls *'
    SELECTION_4:
        Description: Rsync for cloud storage
    SELECTION_5:
        Image: '*\rclone.exe'
    SELECTION_6:
        ParentImage:
        - '*\PowerShell.exe'
        - '*\cmd.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Legitimate Rclone usage (rare)
id: cb7286ba-f207-44ab-b9e6-760d82b84253
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/04/11
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
status: deprecated
tags:
- attack.exfiltration
- attack.t1567.002

