title: Local Network Connection Initiated By Script Interpreter
id: 7e448677-939e-f6d0-e901-91843a3888d7
related:
    - id: 992a6cae-db6a-43c8-9cec-76d7195c96fc
      type: derived
    - id: 08249dc0-a28d-4555-8ba5-9255a198e08c
      type: derived
status: test
description: |
    Detects a script interpreter (Wscript/Cscript) initiating a local network connection to download or execute a script hosted on a shared folder.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
author: frack113
date: 2022-08-28
modified: 2024-05-31
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Direction: '%%14593'
        Application|endswith:
            - \wscript.exe
            - \cscript.exe
        DestAddress|cidr:
            - 127.0.0.0/8
            - 10.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - ::1/128    # IPv6 loopback
            - fe80::/10    # IPv6 link-local addresses
            - fc00::/7    # IPv6 private addresses
    condition: network_connection and selection
falsepositives:
    - Legitimate scripts
level: medium
ruletype: Sigma
