title: Outbound RDP Connections Over Non-Standard Tools
id: e02f9ef8-2edb-79a4-0626-b506436d7ebe
related:
    - id: ed74fe75-7594-4b4b-ae38-e38e3fd2eb23
      type: derived
status: test
description: |
    Detects Non-Standard tools initiating a connection over port 3389 indicating possible lateral movement.
    An initial baseline is required before using this utility to exclude third party RDP tooling that you might use.
references:
    - https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-0708
author: Markus Neis
date: 2019-05-15
modified: 2024-02-09
tags:
    - attack.lateral-movement
    - attack.t1021.001
    - car.2013-07-002
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        DestPort: 3389
        Direction: '%%14593'
    filter_main_mstsc:
        Application:
            - \device\harddiskvolume?\Windows\System32\mstsc.exe
            - \device\harddiskvolume?\Windows\SysWOW64\mstsc.exe
    filter_optional_dns:
        # Note: https://github.com/SigmaHQ/sigma/pull/2249
        SourcePort: 53
        Application: \device\harddiskvolume?\Windows\System32\dns.exe
        Protocol: '17'
    filter_optional_avast:
        Application|endswith:
            - \Avast Software\Avast\AvastSvc.exe
            - \Avast\AvastSvc.exe
    filter_optional_sysinternals_rdcman:
        Application|endswith: \RDCMan.exe
    filter_optional_chrome:
        Application: \device\harddiskvolume?\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_third_party:
        Application|endswith:
            - \FSAssessment.exe
            - \FSDiscovery.exe
            - \MobaRTE.exe
            - \mRemote.exe
            - \mRemoteNG.exe
            - \Passwordstate.exe
            - \RemoteDesktopManager.exe
            - \RemoteDesktopManager64.exe
            - \RemoteDesktopManagerFree.exe
            - \RSSensor.exe
            - \RTS2App.exe
            - \RTSApp.exe
            - \spiceworks-finder.exe
            - \Terminals.exe
            - \ws_TunnelService.exe
    filter_optional_thor:
        Application|endswith:
            - \thor.exe
            - \thor64.exe
    filter_optional_splunk:
        Application|startswith: \device\harddiskvolume?\Program Files\SplunkUniversalForwarder\bin\
    filter_optional_sentinel_one:
        Application|endswith: \Ranger\SentinelRanger.exe
    filter_optional_firefox:
        Application: \device\harddiskvolume?\Program Files\Mozilla Firefox\firefox.exe
    filter_optional_tsplus:  # Some RAS
        Application:
            - \device\harddiskvolume?\Program Files\TSplus\Java\bin\HTML5service.exe
            - \device\harddiskvolume?\Program Files (x86)\TSplus\Java\bin\HTML5service.exe
    filter_optional_null:
        Application: null
    filter_optional_empty:
        Application: ''
    filter_optional_unknown:
        Application: <unknown process>
    condition: network_connection and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Third party RDP tools
level: high
ruletype: Sigma
