title: Uncommon Outbound Kerberos Connection
id: 7c743e5c-7a9d-ba96-9ada-1d17687e2a6d
related:
    - id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
      type: similar
    - id: e54979bd-c5f9-4d6c-967b-a04b19ac4c74
      type: derived
status: test
description: |
    Detects uncommon outbound network activity via Kerberos default port indicating possible lateral movement or first stage PrivEsc via delegation.
references:
    - https://github.com/GhostPack/Rubeus
author: Ilyas Ochkov, oscd.community
date: 2019-10-24
modified: 2024-03-15
tags:
    - attack.defense-evasion
    - attack.credential-access
    - attack.t1558
    - attack.lateral-movement
    - attack.t1550.003
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        DestPort: 88
        Direction: '%%14593'
    filter_main_lsass:
        Application: \device\harddiskvolume?\Windows\System32\lsass.exe
    filter_optional_chrome:
        Application:
            - \device\harddiskvolume?\Program Files (x86)\Google\Chrome\Application\chrome.exe
            - \device\harddiskvolume?\Program Files\Google\Chrome\Application\chrome.exe
    filter_optional_firefox:
        Application:
            - \device\harddiskvolume?\Program Files (x86)\Mozilla Firefox\firefox.exe
            - \device\harddiskvolume?\Program Files\Mozilla Firefox\firefox.exe
    filter_optional_tomcat:
        Application|endswith: \tomcat\bin\tomcat8.exe
    condition: network_connection and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Web Browsers and third party application might generate similar activity. An initial baseline is required.
level: medium
ruletype: Sigma
