title: Office Application Initiated Network Connection Over Uncommon Ports
id: 8cf1b63a-f161-0e51-a9d2-cc697d06a5a4
related:
    - id: 3b5ba899-9842-4bc2-acc2-12308498bf42
      type: derived
status: test
description: Detects an office suit application (Word, Excel, PowerPoint, Outlook) communicating to target systems over uncommon ports.
references:
    - https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
author: X__Junior (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023-07-12
modified: 2025-10-17
tags:
    - attack.defense-evasion
    - attack.command-and-control
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Direction: '%%14593'
        Application|endswith:
            - \excel.exe
            - \outlook.exe
            - \powerpnt.exe
            - \winword.exe
            - \wordview.exe
    filter_main_common_ports:
        DestPort:
            - 53 # DNS
            - 80 # HTTP
            - 139 # NETBIOS
            - 389 # LDAP
            - 443 # HTTPS
            - 445 # SMB
            - 3268 # MSFT-GC
    filter_main_outlook_ports:
        Application|contains: :\Program Files\Microsoft Office\
        Application|endswith: \OUTLOOK.EXE
        DestPort:
            - 143
            - 465 # SMTP
            - 587 # SMTP
            - 993 # IMAP
            - 995 # POP3
    condition: network_connection and (selection and not 1 of filter_main_*)
falsepositives:
    - Other ports can be used, apply additional filters accordingly
level: medium
ruletype: Sigma
