title: RegAsm.EXE Initiating Network Connection To Public IP
id: a0e133b9-f055-5011-01e6-75ed480ad2da
related:
    - id: 0531e43a-d77d-47c2-b89f-5fe50321c805
      type: derived
status: test
description: Detects "RegAsm.exe" initiating a network connection to public IP adresses
references:
    - https://app.any.run/tasks/ec207948-4916-47eb-a0f4-4c6abb2e7668/
    - https://research.splunk.com/endpoint/07921114-6db4-4e2e-ae58-3ea8a52ae93f/
    - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
author: frack113
date: 2024-04-25
tags:
    - attack.defense-evasion
    - attack.t1218.009
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 5156
        Channel: Security
    selection:
        Direction: '%%14593'
        Application|endswith: \regasm.exe
    filter_main_local_ranges:
        DestAddress|cidr:
            - 127.0.0.0/8
            - 10.0.0.0/8
            - 172.16.0.0/12
            - 192.168.0.0/16
            - 169.254.0.0/16
            - ::1/128    # IPv6 loopback
            - fe80::/10    # IPv6 link-local addresses
            - fc00::/7    # IPv6 private addresses
    condition: network_connection and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
