
title: Rename Common File to DLL File
ruletype: Sigma
author: frack113
date: 2022/02/19
description: Detects cases in which a file gets renamed to .dll, which often happens
  to bypass perimeter protection
detection:
  SELECTION_1:
    TargetFilename: '*.dll'
  SELECTION_2:
    OriginalFilename:
    - '*.dll'
    - '*.tmp'
  SELECTION_3:
    OriginalFilename:
    - '*.dll.*'
    - '*\SquirrelTemp\temp*'
  SELECTION_4:
    Image: C:\Windows\WinSxS\\*
  SELECTION_5:
    Image: '*\TiWorker.exe'
  condition: (SELECTION_1 and  not ((SELECTION_2 or SELECTION_3) or (SELECTION_4 and
    SELECTION_5)))
falsepositives:
- Application installation
id: bbfd974c-248e-4435-8de6-1e938c79c5c1
level: medium
logsource:
  category: file_rename
  product: windows
modified: 2022/03/13
references:
- https://twitter.com/ffforward/status/1481672378639912960
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036/T1036.md#atomic-test-1---system-file-copied-to-unusual-location
status: experimental
