
title: Suspicious Process Discovery With Get-Process
ruletype: Sigma
author: frack113
date: 2022/03/17
description: Get the processes that are running on the local computer.
detection:
  SELECTION_1:
    ScriptBlockText: '*Get-Process*'
  condition: SELECTION_1
falsepositives:
- Legitimate PowerShell scripts
id: af4c87ce-bdda-4215-b998-15220772e993
level: low
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1057/T1057.md#atomic-test-3---process-discovery---get-process
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-process?view=powershell-7
status: experimental
tags:
- attack.discovery
- attack.t1057
