
title: Change User Agents with WebRequest
ruletype: Sigma
author: frack113
date: 2022/01/23
description: "Adversaries may communicate using application layer protocols associated\
  \ with web traffic to avoid detection/network filtering by blending in with existing\
  \ traffic.\nCommands to the remote system, and often the results of those commands,\
  \ will be embedded within the protocol traffic between the client and server. \n"
detection:
  SELECTION_1:
    ScriptBlockText: '*Invoke-WebRequest*'
  SELECTION_2:
    ScriptBlockText: '*-UserAgent *'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: d4488827-73af-4f8d-9244-7b7662ef046e
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1071.001/T1071.001.md#t1071001---web-protocols
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
