
title: Invoke-Obfuscation RUNDLL LAUNCHER
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
  SELECTION_1:
    ScriptBlockText: '*rundll32.exe*'
  SELECTION_2:
    ScriptBlockText: '*shell32.dll*'
  SELECTION_3:
    ScriptBlockText: '*shellexec_rundll*'
  SELECTION_4:
    ScriptBlockText: '*powershell*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: e6cb92b4-b470-4eb8-8a9d-d63e8583aae0
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/08
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
