
title: PowerShell Remote Session Creation
ruletype: Sigma
author: frack113
date: 2022/01/06
description: |
  Adversaries may abuse PowerShell commands and scripts for execution.
  PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system
detection:
  SELECTION_1:
    ScriptBlockText: '*New-PSSession*'
  SELECTION_2:
    ScriptBlockText: '*-ComputerName *'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate administrative script
id: a0edd39f-a0c6-4c17-8141-261f958e8d8f
level: medium
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.001/T1059.001.md#atomic-test-10---powershell-invoke-downloadcradle
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/new-pssession?view=powershell-7.2
status: experimental
tags:
- attack.execution
- attack.t1059.001
