
title: Suspicious Get Information for AD Groups or DoesNotRequirePreAuth User
ruletype: Sigma
author: frack113
date: 2021/12/15
description: "Adversaries may attempt to find domain-level groups and permission settings.\n\
  The knowledge of domain-level permission groups can help adversaries determine which\
  \ groups exist and which users belong to a particular group.\nAdversaries may use\
  \ this information to determine which users have elevated permissions, such as domain\
  \ administrators. \n"
detection:
  SELECTION_1:
    ScriptBlockText: '*get-ADPrincipalGroupMembership*'
  SELECTION_2:
    ScriptBlockText: '*get-aduser*'
  SELECTION_3:
    ScriptBlockText: '*-f *'
  SELECTION_4:
    ScriptBlockText: '*-pr *'
  SELECTION_5:
    ScriptBlockText: '*DoesNotRequirePreAuth*'
  condition: (SELECTION_1 or (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5))
falsepositives:
- Unknown
id: 88f0884b-331d-403d-a3a1-b668cf035603
level: low
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.002/T1069.002.md
status: experimental
tags:
- attack.discovery
- attack.t1069.001
