
title: Suspicious Start-Process PassThru
ruletype: Sigma
author: frack113
date: 2022/01/16
description: Attempting to disable scheduled scanning and other parts of windows defender
  atp.
detection:
  SELECTION_1:
    ScriptBlockText: '*Set-MpPreference*'
  SELECTION_2:
    ScriptBlockText: '* 1*'
  SELECTION_3:
    ScriptBlockText:
    - '*DisableRealtimeMonitoring*'
    - '*DisableBehaviorMonitoring*'
    - '*DisableScriptScanning*'
    - '*DisableBlockAtFirstSeen*'
    - '*DisableIOAVProtection*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate PowerShell scripts
id: 14c71865-6cd3-44ae-adaa-1db923fae5f2
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
- https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps
related:
- id: ec19ebab-72dc-40e1-9728-4c0b805d722c
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
