
title: Code Executed Via Office Add-in XLL File
ruletype: Sigma
author: frack113
date: 2021/12/28
description: |
  Adversaries may abuse Microsoft Office add-ins to obtain persistence on a compromised system.
  Office add-ins can be used to add functionality to Office programs
detection:
  SELECTION_1:
    ScriptBlockText: '*new-object *'
  SELECTION_2:
    ScriptBlockText: '*-ComObject *'
  SELECTION_3:
    ScriptBlockText: '*.application*'
  SELECTION_4:
    ScriptBlockText: '*.RegisterXLL*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 36fbec91-fa1b-4d5d-8df1-8d8edcb632ad
level: high
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1137.006/T1137.006.md
status: experimental
tags:
- attack.persistence
- attack.t1137.006
