
title: Invoke-Obfuscation Via Use Rundll32
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2019/10/08
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  SELECTION_1:
    ScriptBlockText: '*&&*'
  SELECTION_2:
    ScriptBlockText: '*rundll32*'
  SELECTION_3:
    ScriptBlockText: '*shell32.dll*'
  SELECTION_4:
    ScriptBlockText: '*shellexec_rundll*'
  SELECTION_5:
    ScriptBlockText:
    - '*value*'
    - '*invoke*'
    - '*comspec*'
    - '*iex*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/08
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
