
title: Powershell DNSExfiltration
ruletype: Sigma
author: frack113
date: 2022/01/07
description: DNSExfiltrator allows for transfering (exfiltrate) a file over a DNS
  request covert channel
detection:
  SELECTION_1:
    ScriptBlockText: '*Invoke-DNSExfiltrator*'
  SELECTION_2:
    ScriptBlockText: '* -i *'
  SELECTION_3:
    ScriptBlockText: '* -d *'
  SELECTION_4:
    ScriptBlockText: '* -p *'
  SELECTION_5:
    ScriptBlockText: '* -doh *'
  SELECTION_6:
    ScriptBlockText: '* -t *'
  condition: (SELECTION_1 or (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6))
falsepositives:
- Legitimate script
id: d59d7842-9a21-4bc6-ba98-64bfe0091355
level: high
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1048/T1048.md#atomic-test-3---dnsexfiltration-doh
- https://github.com/Arno0x/DNSExfiltrator
status: experimental
tags:
- attack.exfiltration
- attack.t1048
