
title: Invoke-Obfuscation COMPRESS OBFUSCATION
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
  SELECTION_1:
    EventID: 4104
  SELECTION_2:
    Channel: Microsoft-Windows-PowerShell/Operational
  SELECTION_3:
    ScriptBlockText: '*new-object*'
  SELECTION_4:
    ScriptBlockText: '*text.encoding]::ascii*'
  SELECTION_5:
    ScriptBlockText:
    - '*system.io.compression.deflatestream*'
    - '*system.io.streamreader*'
  SELECTION_6:
    ScriptBlockText: '*readtoend'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- unknown
id: 20e5497e-331c-4cd5-8d36-935f6e2a9a07
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
modified: 2022/03/08
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
