
title: Powershell MsXml COM Object
ruletype: Sigma
author: frack113
date: 2022/01/19
description: |
  Adversaries may abuse PowerShell commands and scripts for execution.
  PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. (Citation: TechNet PowerShell)
  Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code
detection:
  SELECTION_1:
    ScriptBlockText: '*New-Object*'
  SELECTION_2:
    ScriptBlockText: '*-ComObject*'
  SELECTION_3:
    ScriptBlockText: '*MsXml2.ServerXmlHttp*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate administrative script
id: 78aa1347-1517-4454-9982-b338d6df8343
level: medium
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.001/T1059.001.md#atomic-test-7---powershell-msxml-com-object---with-prompt
- https://docs.microsoft.com/en-us/previous-versions/windows/desktop/ms766431(v=vs.85)
status: experimental
tags:
- attack.execution
- attack.t1059.001
