
title: Manipulation of User Computer or Group Security Principals Across AD
ruletype: Sigma
author: frack113
date: 2021/12/28
description: |
  Adversaries may create a domain account to maintain access to victim systems.
  Domain accounts are those managed by Active Directory Domain Services where access and permissions are configured across systems and services that are part of that domain..
detection:
  SELECTION_1:
    ScriptBlockText: '*System.DirectoryServices.AccountManagement*'
  condition: SELECTION_1
falsepositives:
- Legitimate administrative script
id: b29a93fb-087c-4b5b-a84d-ee3309e69d08
level: medium
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1136.002/T1136.002.md#atomic-test-3---create-a-new-domain-account-using-powershell
- https://docs.microsoft.com/en-us/dotnet/api/system.directoryservices.accountmanagement?view=dotnet-plat-ext-6.0
status: experimental
tags:
- attack.persistence
- attack.t1136.002
