
title: DirectorySearcher Powershell Exploitation
ruletype: Sigma
author: frack113
date: 2022/02/12
description: Enumerates Active Directory to determine computers that are joined to
  the domain
detection:
  SELECTION_1:
    ScriptBlockText: '*New-Object *'
  SELECTION_2:
    ScriptBlockText: '*System.DirectoryServices.DirectorySearcher*'
  SELECTION_3:
    ScriptBlockText: '*.PropertiesToLoad.Add*'
  SELECTION_4:
    ScriptBlockText: '*.findall()*'
  SELECTION_5:
    ScriptBlockText: '*Properties.name*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 1f6399cf-2c80-4924-ace1-6fcff3393480
level: medium
logsource:
  category: ps_script
  definition: Script Block Logging must be enable
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1018/T1018.md#atomic-test-15---enumerate-domain-computers-within-active-directory-using-directorysearcher
status: experimental
tags:
- attack.discovery
- attack.t1018
