
title: Registry-Free Process Scope COR_PROFILER
ruletype: Sigma
author: frack113
date: 2021/12/30
description: "Adversaries may leverage the COR_PROFILER environment variable to hijack\
  \ the execution flow of programs that load the .NET CLR.\nThe COR_PROFILER is a\
  \ .NET Framework feature which allows developers to specify an unmanaged (or external\
  \ of .NET) profiling DLL to be loaded into each .NET process that loads the Common\
  \ Language Runtime (CLR).\nThese profiliers are designed to monitor, troubleshoot,\
  \ and debug managed code executed by the .NET CLR.\n(Citation: Microsoft Profiling\
  \ Mar 2017)\n(Citation: Microsoft COR_PROFILER Feb 2013) \n"
detection:
  SELECTION_1:
    ScriptBlockText: '*$env:COR_ENABLE_PROFILING*'
  SELECTION_2:
    ScriptBlockText: '*$env:COR_PROFILER*'
  SELECTION_3:
    ScriptBlockText: '*$env:COR_PROFILER_PATH*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate administrative script
id: 23590215-4702-4a70-8805-8dc9e58314a2
level: medium
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1574.012/T1574.012.md#atomic-test-3---registry-free-process-scope-cor_profiler
status: experimental
tags:
- attack.persistence
- attack.t1574.012
