
title: Service Registry Permissions Weakness Check
ruletype: Sigma
author: frack113
date: 2021/12/30
description: |
  Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services.
  Adversaries may use flaws in the permissions for registry to redirect from the originally specified executable to one that they control, in order to launch their own code at Service start.
  Windows stores local service configuration information in the Registry under HKLM\SYSTEM\CurrentControlSet\Services
detection:
  SELECTION_1:
    ScriptBlockText: '*get-acl*'
  SELECTION_2:
    ScriptBlockText: '*REGISTRY::HKLM\SYSTEM\CurrentControlSet\Services\\*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate administrative script
id: 95afc12e-3cbb-40c3-9340-84a032e596a3
level: medium
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1574.011/T1574.011.md#atomic-test-1---service-registry-permissions-weakness
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.security/get-acl?view=powershell-7.2
status: experimental
tags:
- attack.persistence
- attack.t1574.011
