
title: Suspicious Get Information for SMB Share
ruletype: Sigma
author: frack113
date: 2021/12/15
description: "Adversaries may look for folders and drives shared on remote systems\
  \ as a means of identifying sources of information to gather as a precursor for\
  \ Collection and\nto identify potential systems of interest for Lateral Movement.\n\
  Networks often contain shared network drives and folders that enable users to access\
  \ file directories on various systems across a network. \n"
detection:
  SELECTION_1:
    ScriptBlockText: '*get-smbshare*'
  condition: SELECTION_1
falsepositives:
- Unknown
id: 95f0643a-ed40-467c-806b-aac9542ec5ab
level: low
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.002/T1069.002.md
status: experimental
tags:
- attack.discovery
- attack.t1069.001
