
title: Powershell Execute Batch Script
ruletype: Sigma
author: frack113
date: 2022/01/02
description: |
  Adversaries may abuse the Windows command shell for execution.
  The Windows command shell ([cmd](https://attack.mitre.org/software/S0106)) is the primary command prompt on Windows systems.
  The Windows command prompt can be used to control almost any aspect of a system, with various permission levels required for different subsets of commands.
  Batch files (ex: .bat or .cmd) also provide the shell with a list of sequential commands to run, as well as normal scripting operations such as conditionals and loops.
  Common uses of batch files include long or repetitive tasks, or the need to run the same set of commands on multiple system
detection:
  SELECTION_1:
    ScriptBlockText: '*Start-Process*'
  SELECTION_2:
    ScriptBlockText:
    - '*.cmd*'
    - '*.bat*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate administration script
id: b5522a23-82da-44e5-9c8b-e10ed8955f88
level: medium
logsource:
  category: ps_script
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.003/T1059.003.md#atomic-test-1---create-and-execute-batch-script
status: experimental
tags:
- attack.execution
- attack.t1059.003
