
title: Powershell Directory Enumeration
ruletype: Sigma
author: frack113
date: 2022/03/17
description: Detects technique used by MAZE ransomware to enumerate directories using
  Powershell
detection:
  SELECTION_1:
    ScriptBlockText: '*foreach*'
  SELECTION_2:
    ScriptBlockText: '*Get-ChildItem*'
  SELECTION_3:
    ScriptBlockText: '*-Path *'
  SELECTION_4:
    ScriptBlockText: '*-ErrorAction *'
  SELECTION_5:
    ScriptBlockText: '*SilentlyContinue*'
  SELECTION_6:
    ScriptBlockText: '*Out-File *'
  SELECTION_7:
    ScriptBlockText: '*-append*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate PowerShell scripts
id: 162e69a7-7981-4344-84a9-0f1c9a217a52
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1083/T1083.md
- https://www.mandiant.com/resources/tactics-techniques-procedures-associated-with-maze-ransomware-incidents
status: experimental
tags:
- attack.discovery
- attack.t1083
