
title: Accessing Encrypted Credentials from Google Chrome Login Database
ruletype: Sigma
author: frack113
date: 2021/12/20
description: |
  Adversaries may acquire credentials from web browsers by reading files specific to the target browser.
  Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future.
  Web browsers typically store the credentials in an encrypted format within a credential store.
detection:
  SELECTION_1:
    ScriptBlockText: '*Copy-Item*'
  SELECTION_2:
    ScriptBlockText: '*-Destination*'
  SELECTION_3:
    ScriptBlockText:
    - '*\Google\Chrome\User Data\Default\Login Data*'
    - '*\Google\Chrome\User Data\Default\Login Data For Account*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 98f4c75c-3089-44f3-b733-b327b9cd9c9d
level: medium
logsource:
  category: ps_script
  definition: Script block logging must be enabled
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.003/T1555.003.md
status: experimental
tags:
- attack.credential_access
- attack.t1555.003
