title: Suspicious Service Installation
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
status: test
description: Detects suspicious service installation commands
author: pH-T (Nextron Systems)
date: 2022/03/18
modified: 2022/11/14
tags:
    - attack.persistence
    - attack.privilege_escalation
    - car.2013-09-005
    - attack.t1543.003
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
    suspicious1:
        ImagePath|contains:
            - ' -w hidden '
            - ' -nop '
            - ' -sta '
            - \Users\Public\
            - \Windows\Temp\
            - \Perflogs\
            - \\\\.\\pipe
            - \ADMIN$\
            - C:\Temp\
            - .downloadstring(
            - .downloadfile(
    suspicious2a:
        ImagePath|contains: ' -e'
    suspicious2b:
        ImagePath|contains:
            - ' JAB'
            - ' SUVYI'
            - ' SQBFAFgA'
            - ' aWV4I'
            - ' IAB'
            - ' PAA'
            - ' aQBlAHgA'
    filter_thor_remote:
        ImagePath|startswith: C:\WINDOWS\TEMP\thor10-remote\thor64.exe
    filter_defender_def_updates:
        ImagePath|startswith: C:\ProgramData\Microsoft\Windows Defender\Definition
            Updates\
    condition: system and (selection and ( suspicious1 or all of suspicious2* ) and
        not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
