title: Windows Defender Threat Detection Disabled - Service
id: 6c0a7755-6d31-44fa-80e1-133e57752680
related:
    -   id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
        type: derived
status: stable
description: Detects the "Windows Defender Threat Protection" service has been disabled
references:
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
author: "J\xE1n Tren\u010Dansk\xFD, frack113"
date: 2020/07/28
modified: 2023/08/08
tags:
    - attack.defense_evasion
    - attack.t1562.001
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        EventID: 7036
        Provider_Name: Service Control Manager
        param1:
            - Windows Defender Antivirus Service
            - Service antivirus Microsoft Defender
        param2:
            - stopped
            - "arr\xEAt\xE9"
    condition: system and selection
falsepositives:
    - Administrator actions
    - Auto updates of Windows Defender causes restarts
level: medium
ruletype: Sigma
