title: Important Windows Service Terminated Unexpectedly
id: 56abae0c-6212-4b97-adc0-0b559bb950c3
status: experimental
description: Detects important or interesting Windows services that got terminated
    unexpectedly.
references:
    - https://www.randori.com/blog/vulnerability-analysis-queuejumper-cve-2023-21554/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/14
tags:
    - attack.defense_evasion
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection_eid:
        Provider_Name: Service Control Manager
        EventID: 7034
    selection_name:
        -   param1|contains: Message Queuing
        -   Binary|contains:
                - 4d0053004d005100
                - 6d0073006d007100
    condition: system and (all of selection_*)
falsepositives:
    - Rare false positives could occur since service termination could happen due
        to multiple reasons
level: high
ruletype: Sigma
