title: NetSupport Manager Service Install
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/31
description: Detects NetSupport Manager service installation on the target system.
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath: '*\NetSupport Manager\client32.exe*'
    SELECTION_5:
        ServiceName: Client32
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Legitimate use of the tool
id: 2d510d8d-912b-45c5-b1df-36faa3d8c3f4
level: medium
logsource:
    product: windows
    service: system
references:
- http://resources.netsupportsoftware.com/resources/manualpdfs/nsm_manual_uk.pdf
status: experimental
tags:
- attack.persistence

