title: Anydesk Remote Access Software Service Installation
id: 87d5cdc0-24c5-8411-1230-d717dd6a47e8
related:
    - id: 530a6faa-ff3d-4022-b315-50828e77eef5
      type: derived
status: test
description: Detects the installation of the anydesk software service. Which could be an indication of anydesk abuse if you the software isn't already used.
references:
    - https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
    - https://thedfirreport.com/2025/02/24/confluence-exploit-leads-to-lockbit-ransomware/
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2022-08-11
modified: 2025-02-24
tags:
    - attack.persistence
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection_provider:
        Provider_Name: Service Control Manager
        EventID: 7045
    selection_service:
        - ServiceName|contains|all:
              - AnyDesk   # Covers both AnyDesk Service and AnyDesk MSI Service
              - Service
        - ImagePath|contains: AnyDesk
    condition: system and (all of selection_*)
falsepositives:
    - Legitimate usage of the anydesk tool
level: medium
ruletype: Sigma
