title: Moriya Rootkit - System
id: 7ca6e518-decb-de46-861e-5673c026b257
related:
    - id: 25b9c01c-350d-4b95-bed1-836d04a4f324
      type: derived
status: test
description: Detects the use of Moriya rootkit as described in the securelist's Operation TunnelSnake report
references:
    - https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831
author: Bhabesh Raj
date: 2021-05-06
modified: 2022-11-29
tags:
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1543.003
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ServiceName: ZzNetSvc
    condition: system and selection
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
