title: Invoke-Obfuscation Via Use Rundll32 - System
id: f1988b01-7f12-1851-58b5-8a4d63743183
related:
    - id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
      type: derived
status: test
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
references:
    - https://github.com/SigmaHQ/sigma/issues/1009 # (Task30)
author: Nikita Nazarov, oscd.community
date: 2020-10-09
modified: 2022-11-29
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains|all:
            - '&&'
            - rundll32
            - shell32.dll
            - shellexec_rundll
        ImagePath|contains:
            - value
            - invoke
            - comspec
            - iex
    condition: system and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
