title: Invoke-Obfuscation CLIP+ Launcher - System
id: 414e0fbd-67a8-17e4-371e-4f9f6a8799d0
related:
    - id: f7385ee2-0e0c-11eb-adc1-0242ac120002
      type: derived
status: test
description: Detects Obfuscated use of Clip.exe to execute PowerShell
references:
    - https://github.com/SigmaHQ/sigma/issues/1009  # (Task 26)
author: Jonathan Cheong, oscd.community
date: 2020-10-13
modified: 2023-02-20
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        Provider_Name: Service Control Manager
        EventID: 7045
        ImagePath|contains|all:
            - cmd
            - '&&'
            - 'clipboard]::'
    condition: system and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
