title: Remote Access Tool Services Have Been Installed - System
id: 1a31b18a-f00c-4061-9900-f735b96c99fc
related:
    -   id: c8b00925-926c-47e3-beea-298fd563728e
        type: similar
status: experimental
description: Detects service installation of different remote access tools software.
    These software are often abused by threat actors to perform
references:
    - https://redcanary.com/blog/misbehaving-rats/
author: Connor Martin, Nasreddine Bencherchali
date: 2022/12/23
modified: 2023/06/22
tags:
    - attack.persistence
    - attack.t1543.003
    - attack.t1569.002
logsource:
    product: windows
    service: system
detection:
    system:
        Channel: System
    selection:
        Provider_Name: Service Control Manager
        EventID:
            - 7045
            - 7036
        ServiceName|contains:
            - AmmyyAdmin
            - Atera
            - BASupportExpressSrvcUpdater
            - BASupportExpressStandaloneService
            - chromoting
            - GoToAssist
            - GoToMyPC
            - jumpcloud
            - LMIGuardianSvc
            - LogMeIn
            - monblanking
            - Parsec
            - RManService
            - RPCPerformanceService
            - RPCService
            - SplashtopRemoteService
            - SSUService
            - TeamViewer
            - TightVNC
            - vncserver
            - Zoho
    condition: system and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
