title: Msiexec.EXE Initiated Network Connection Over HTTP
id: 887ccc15-2bc2-11fd-d02b-78c8c83f9aa6
related:
    - id: 8e5e38e4-5350-4c0b-895a-e872ce0dd54f
      type: derived
status: test
description: |
    Detects a network connection initiated by an "Msiexec.exe" process over port 80 or 443.
    Adversaries might abuse "msiexec.exe" to install and execute remotely hosted packages.
    Use this rule to hunt for potentially anomalous or suspicious communications.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218.007/T1218.007.md
author: frack113
date: 2022-01-16
modified: 2024-07-16
tags:
    - attack.defense-evasion
    - attack.t1218.007
    - detection.threat-hunting
    - sysmon
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Initiated: 'true'
        Image|endswith: \msiexec.exe
        DestinationPort:
            - 80
            - 443
    condition: network_connection and selection
falsepositives:
    - Likely
level: low
ruletype: Sigma
