
title: Meterpreter or Cobalt Strike Getsystem Service Installation
author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
detection:
  SELECTION_1:
    ImagePath: '*cmd*'
  SELECTION_10:
    ImagePath: '*\pipe\\*'
  SELECTION_11:
    ImagePath: '*cmd.exe*'
  SELECTION_12:
    ImagePath: '*/c*'
  SELECTION_13:
    ImagePath: '*echo*'
  SELECTION_14:
    ImagePath: '*\pipe\\*'
  SELECTION_15:
    ImagePath: '*rundll32*'
  SELECTION_16:
    ImagePath: '*.dll,a*'
  SELECTION_17:
    ImagePath: '*/p:*'
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ImagePath: '*cmd*'
  SELECTION_4:
    ImagePath: '*/c*'
  SELECTION_5:
    ImagePath: '*echo*'
  SELECTION_6:
    ImagePath: '*\pipe\\*'
  SELECTION_7:
    ImagePath: '*%COMSPEC%*'
  SELECTION_8:
    ImagePath: '*/c*'
  SELECTION_9:
    ImagePath: '*echo*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9 and
    SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13 and SELECTION_14)
    or (SELECTION_15 and SELECTION_16 and SELECTION_17)))
falsepositives:
- Highly unlikely
fields:
- ComputerName
- SubjectDomainName
- SubjectUserName
- ImagePath
id: d585ab5a-6a69-49a8-96e8-4a726a54de46
level: critical
logsource:
  category: driver_load
  product: windows
modified: 2021/09/21
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
related:
- id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
  type: derived
status: experimental
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
