title: HybridConnectionManager Service Running
id: 871bc844-4977-a864-457b-46cfba6ddb65
related:
    - id: b55d23e5-6821-44ff-8a6e-67218891e49f
      type: derived
status: test
description: Rule to detect the Hybrid Connection Manager service running on an endpoint.
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021-04-12
modified: 2024-08-05
tags:
    - attack.persistence
    - attack.t1554
logsource:
    product: windows
    service: microsoft-servicebus-client # Change to servicebus-client once validators are up to date
detection:
    microsoft_servicebus_client:
        Channel: Microsoft-ServiceBus-Client
    selection:
        EventID:
            - 40300
            - 40301
            - 40302
    keywords:
        - HybridConnection
        - sb://
        - servicebus.windows.net
        - HybridConnectionManage
    condition: microsoft_servicebus_client and (selection and keywords)
falsepositives:
    - Legitimate use of Hybrid Connection Manager via Azure function apps.
level: high
ruletype: Sigma
