title: HybridConnectionManager Service Running
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
description: Rule to detect the Hybrid Connection Manager service running on an endpoint.
detection:
    SELECTION_1:
        Channel: Microsoft-ServiceBus-Client
    SELECTION_2:
        EventID: 40300
    SELECTION_3:
        EventID: 40301
    SELECTION_4:
        EventID: 40302
    SELECTION_5:
    - HybridConnection
    - sb://
    - servicebus.windows.net
    - HybridConnectionManage
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4) and (SELECTION_5))
falsepositives:
- Legitimate use of Hybrid Connection Manager via Azure function apps.
id: b55d23e5-6821-44ff-8a6e-67218891e49f
level: high
logsource:
    product: windows
    service: microsoft-servicebus-client
modified: 2022/10/09
references:
- https://twitter.com/Cyb3rWard0g/status/1381642789369286662
status: test
tags:
- attack.persistence
- attack.t1554

