title: Equation Group DLL_U Export Function Load
id: 26d86e32-1dec-3706-ae72-6314e702cb7e
related:
    - id: d465d1d8-27a2-4cca-9621-a800f37cf72e
      type: derived
status: stable
description: Detects a specific export function name used by one of EquationGroup tools
references:
    - https://github.com/00derp/EquationGroupLeak/search?utf8=%E2%9C%93&q=dll_u&type=
    - https://twitter.com/cyb3rops/status/972186477512839170
author: Florian Roth (Nextron Systems)
date: 2019-03-04
modified: 2023-03-09
tags:
    - attack.g0020
    - attack.defense-evasion
    - attack.t1218.011
    - detection.emerging-threats
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - CommandLine|contains: -export dll_u
        - CommandLine|endswith:
              - ',dll_u'
              - ' dll_u'
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
