
title: GfxDownloadWrapper.exe Downloads File from Suspicious URL
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects when GfxDownloadWrapper.exe downloads file from non standard
  URL
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\GfxDownloadWrapper.exe'
  SELECTION_4:
    CommandLine: '*gameplayapi.intel.com*'
  SELECTION_5:
    ParentImage: '*\GfxDownloadWrapper.exe'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and  not (SELECTION_4))
    and  not (SELECTION_5))
falsepositives:
- Unknown
fields:
- CommandLine
id: eee00933-a761-4cd0-be70-c42fe91731e7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/GfxDownloadWrapper.yml
status: test
tags:
- attack.command_and_control
- attack.t1105
