
title: Script Interpreter Execution From Suspicious Folder
ruletype: Sigma
author: Florian Roth
date: 2022/02/08
description: Detects a suspicious script executions in temporary folders or folders
  accessible by environment variables
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\powershell.exe'
    - '*\mshta.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\cmd.exe'
  SELECTION_4:
    CommandLine:
    - '* -w hidden *'
    - '* -ep bypass *'
    - '*/e:vbscript *'
    - '*/e:javascript *'
  SELECTION_5:
    OriginalFileName:
    - powershell.exe
    - mshta.exe
    - wscript.exe
    - cscript.exe
    - cmd.exe
  SELECTION_6:
    Image:
    - '*\Windows\Temp*'
    - '*\Temporary Internet*'
    - '*\AppData\Local\Temp*'
    - '*\AppData\Roaming\Temp*'
    - '*C:\Users\Public\\*'
    - '*C:\Perflogs\\*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
    and SELECTION_6)
falsepositives:
- Unknown
id: 1228c958-e64e-4e71-92ad-7d429f4138ba
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.virustotal.com/gui/file/91ba814a86ddedc7a9d546e26f912c541205b47a853d227756ab1334ade92c3f
status: experimental
tags:
- attack.execution
- attack.t1059
