
title: Logon Scripts (UserInitMprLogonScript)
author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation or execution of UserInitMprLogonScript persistence method
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ParentImage: '*\userinit.exe'
  SELECTION_4:
    Image:
    - '*explorer.exe'
    - '*\proquota.exe'
  SELECTION_5:
    CommandLine:
    - '*netlogon*.bat*'
    - '*UsrLogon.cmd*'
    - '*C:\WINDOWS\Explorer.EXE*'
  SELECTION_6:
    CommandLine: '*UserInitMprLogonScript*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and  not ((SELECTION_4)
    or (SELECTION_5))) or SELECTION_6))
falsepositives:
- Exclude legitimate logon scripts
id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/21
references:
- https://attack.mitre.org/techniques/T1037/
status: test
tags:
- attack.t1037.001
- attack.persistence
