
title: Suspicious Process Patterns NTDS.DIT Exfil
ruletype: Sigma
author: Florian Roth
date: 2022/03/11
description: Detects suspicious process patterns used in NTDS.DIT exfiltration
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*\windows\ntds\ntds.dit*'
  SELECTION_11:
    CommandLine: '*powershell*'
  SELECTION_12:
    CommandLine: '*ntds.dit*'
  SELECTION_13:
    CommandLine: '*ntds.dit*'
  SELECTION_14:
    ParentImage:
    - '*\apache*'
    - '*\tomcat*'
    - '*\AppData\\*'
    - '*\Temp\\*'
    - '*\Public\\*'
    - '*\PerfLogs\\*'
  SELECTION_15:
    Image:
    - '*\apache*'
    - '*\tomcat*'
    - '*\AppData\\*'
    - '*\Temp\\*'
    - '*\Public\\*'
    - '*\PerfLogs\\*'
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\NTDSDump.exe'
    - '*\NTDSDumpEx.exe'
  SELECTION_4:
    CommandLine: '*ntds.dit*'
  SELECTION_5:
    CommandLine: '*system.hiv*'
  SELECTION_6:
    CommandLine: '*NTDSgrab.ps1*'
  SELECTION_7:
    CommandLine: '*ac i ntds*'
  SELECTION_8:
    CommandLine: '*create full*'
  SELECTION_9:
    CommandLine: '*/c copy *'
  condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or (SELECTION_4 and
    SELECTION_5) or SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
    and SELECTION_10) or (SELECTION_11 and SELECTION_12)) or (SELECTION_13 and (SELECTION_14
    or SELECTION_15))))
falsepositives:
- Unknown
id: 8bc64091-6875-4881-aaf9-7bd25b5dda08
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
- https://www.n00py.io/2022/03/manipulating-user-passwords-without-mimikatz/
- https://pentestlab.blog/tag/ntds-dit/
- https://github.com/samratashok/nishang/blob/master/Gather/Copy-VSS.ps1
- https://github.com/zcgonvh/NTDSDumpEx
- https://github.com/rapid7/metasploit-framework/blob/master/data/post/powershell/NTDSgrab.ps1
status: experimental
tags:
- attack.credential_access
- attack.t1003.003
