
title: File or Folder Permissions Modifications
ruletype: Sigma
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
description: Detects a file or folder's permissions being modified.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*\AppData\Local\Programs\Microsoft VS Code*'
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\takeown.exe'
    - '*\cacls.exe'
    - '*\icacls.exe'
  SELECTION_4:
    CommandLine: '*/grant*'
  SELECTION_5:
    Image: '*\attrib.exe'
  SELECTION_6:
    CommandLine: '*-r*'
  SELECTION_7:
    CommandLine: '*ICACLS C:\ProgramData\dynatrace\gateway\config\connectivity.history
      /reset'
  SELECTION_8:
    CommandLine: '*ICACLS C:\ProgramData\dynatrace\gateway\config\config.properties
      /grant :r *'
  SELECTION_9:
    CommandLine: '*S-1-5-19:F*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    ((SELECTION_5 and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8 and SELECTION_9)
    or (SELECTION_10)))))
falsepositives:
- Users interacting with the files on their own (unlikely unless privileged users).
- Dynatrace app
fields:
- ComputerName
- User
- CommandLine
id: 37ae075c-271b-459b-8d7b-55ad5f993dd8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/12
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.001/T1222.001.md
status: test
tags:
- attack.defense_evasion
- attack.t1222.001
