
title: Ping Hex IP
author: Florian Roth
date: 2018/03/23
description: Detects a ping command that uses a hex encoded IP address
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\ping.exe'
  SELECTION_4:
    CommandLine: '*0x*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely, because no sane admin pings IP addresses in a hexadecimal form
fields:
- ParentCommandLine
id: 1a0d4aba-7668-4365-9ce4-6d79ab088dfd
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
references:
- https://github.com/vysec/Aggressor-VYSEC/blob/master/ping.can
- https://twitter.com/vysecurity/status/977198418354491392
status: test
tags:
- attack.defense_evasion
- attack.t1140
- attack.t1027
