
title: Sdiagnhost Calling Suspicious Child Process
ruletype: Sigma
author: Nextron Systems
date: 2022/06/01
description: Detects sdiagnhost.exe calling a suspicious child process
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ParentImage: '*\sdiagnhost.exe'
  SELECTION_4:
    Image:
    - '*\powershell.exe'
    - '*\cmd.exe'
    - '*\mshta.exe'
    - '*\cscript.exe'
    - '*\wscript.exe'
    - '*\taskkill.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: f3d39c45-de1a-4486-a687-ab126124f744
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1218
