
title: Suspicious Explorer Child Of Regsvr32
ruletype: Sigma
author: elhoim
date: 2022/05/05
description: Suspicious explorer.exe child of regsvr32.exe
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ParentImage: '*\regsvr32.exe'
  SELECTION_4:
    Image: '*\explorer.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 6f0947a4-1c5e-4e0d-8ac7-53159b8f23ca
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://redcanary.com/blog/intelligence-insights-april-2022/
- https://www.echotrail.io/insights/search/regsvr32.exe
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010
