
title: Suspicious LOLBIN AccCheckConsole
author: Florian Roth
date: 2022/01/06
description: Detects suspicious LOLBIN AccCheckConsole execution with parameters as
  used to load an arbitrary DLL
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\AccCheckConsole.exe'
  SELECTION_4:
    CommandLine: '* -window *'
  SELECTION_5:
    CommandLine: '*.dll*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate use of the UI Accessibility Checker
id: 0f6da907-5854-4be6-859a-e9958747b0aa
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://gist.github.com/bohops/2444129419c8acf837aedda5f0e7f340
- https://twitter.com/bohops/status/1477717351017680899?s=12
status: experimental
tags:
- attack.execution
