
title: Suspicious OfflineScannerShell.exe Execution From Another Folder
ruletype: Sigma
author: frack113
date: 2022/03/06
description: Use OfflineScannerShell.exe to execute mpclient.dll library in the current
  working directory
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\OfflineScannerShell.exe'
  SELECTION_4:
    CurrentDirectory: C:\Program Files\Windows Defender\Offline\
  SELECTION_5:
    CurrentDirectory|re: ^$
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
    or (SELECTION_5)))
falsepositives:
- Unknown
id: 02b18447-ea83-4b1b-8805-714a8a34546a
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
