
title: Winword LOLBIN Usage
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/05/17
description: Winword can be abused as a LOLBIN to download arbitary file or load arbitary
  DLLs
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\WINWORD.exe'
  SELECTION_4:
    OriginalFileName: WinWord.exe
  SELECTION_5:
    CommandLine:
    - '*http://*'
    - '*https://*'
  SELECTION_6:
    CommandLine:
    - '*/l *'
    - '*.dll*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and (SELECTION_5
    or SELECTION_6))
falsepositives:
- Unknown
id: 4ae3e30b-b03f-43aa-87e3-b622f4048eed
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Winword/
- https://github.com/D4Vinci/One-Lin3r/blob/master/one_lin3r/core/liners/windows/cmd/dll_loader_word.py
status: experimental
