
title: Execute Arbitrary Commands Using MSDT.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (rule)
date: 2022/05/29
description: Detects word documents leveraging the "ms-msdt" handler or the "msdt.exe"
  binary to execute arbitrary commands
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ParentImage: '*\WINWORD.exe'
  SELECTION_4:
    Image: '*\msdt.exe'
  SELECTION_5:
    Image: '*\msdt.exe'
  SELECTION_6:
    CommandLine: '*ms-msdt:/id*'
  SELECTION_7:
    CommandLine: '*IT_BrowseForFile=*'
  SELECTION_8:
    CommandLine: '*IT_RebrowseForFile=*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    (SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 258fc8ce-8352-443a-9120-8a11e4857fa5
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
status: experimental
