
title: Bloodhound and Sharphound Hack Tool
author: Florian Roth
date: 2019/12/20
description: Detects command line parameters used by Bloodhound and Sharphound hack
  tools
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image:
    - '*\Bloodhound.exe*'
    - '*\SharpHound.exe*'
  SELECTION_4:
    CommandLine:
    - '* -CollectionMethod All *'
    - '*.exe -c All -d *'
    - '*Invoke-Bloodhound*'
    - '*Get-BloodHoundData*'
  SELECTION_5:
    CommandLine: '* -JsonFolder *'
  SELECTION_6:
    CommandLine: '* -ZipFileName *'
  SELECTION_7:
    CommandLine: '* DCOnly *'
  SELECTION_8:
    CommandLine: '* --NoSaveCache *'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or (SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Other programs that use these command line option and accepts an 'All' parameter
id: f376c8a7-a2d0-4ddc-aa0c-16c17236d962
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/BloodHoundAD/BloodHound
- https://github.com/BloodHoundAD/SharpHound
status: test
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001
