
title: Suspicious File Download via CertOC.exe
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/05/16
description: Detects when a user downloads file by using CertOC.exe
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\certoc.exe'
  SELECTION_4:
    OriginalFileName: CertOC.exe
  SELECTION_5:
    CommandLine: '*-GetCACAPS*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Unknown
id: 70ad0861-d1fe-491c-a45f-fa48148a300d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Certoc/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
