
title: MSHTA Spawning Windows Shell
author: Michael Haag
date: 2019/01/16
description: Detects a Windows command line executable started from MSHTA
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ParentImage: '*\mshta.exe'
  SELECTION_4:
    Image:
    - '*\cmd.exe'
    - '*\powershell.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\reg.exe'
    - '*\regsvr32.exe'
  SELECTION_5:
    Image:
    - '*\BITSADMIN*'
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or SELECTION_5))
falsepositives:
- Printer software / driver installations
- HP software
fields:
- CommandLine
- ParentCommandLine
id: 03cc0c25-389f-4bf8-b48d-11878079f1ca
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://www.trustedsec.com/july-2015/malicious-htas/
status: test
tags:
- attack.defense_evasion
- attack.t1218.005
- car.2013-02-003
- car.2013-03-001
- car.2014-04-003
