
title: Suspicious Workstation Locking via Rundll32
ruletype: Sigma
author: frack113
date: 2022/06/04
description: Detects a suspicious call to the user32.dll function that locks the user
  workstation
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\rundll32.exe'
  SELECTION_4:
    ParentImage: '*\cmd.exe'
  SELECTION_5:
    CommandLine: '*user32.dll,*'
  SELECTION_6:
    CommandLine: '*LockWorkStation*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Scritps or links on the user desktop used to lock the workstation instead of Windows+L
  or the menu option
fields:
- Image
- ParentImage
id: 3b5b0213-0460-4e3f-8937-3abf98ff7dcc
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://app.any.run/tasks/2aef9c63-f944-4763-b3ef-81eee209d128/
status: experimental
tags:
- attack.defense_evasion
