
title: ADCSPwn Hack Tool
ruletype: Sigma
author: Florian Roth
date: 2021/07/31
description: Detects command line parameters used by ADCSPwn, a tool to escalate privileges
  in an active directory network by coercing authenticate from machine accounts and
  relaying to the certificate service
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    CommandLine: '* --adcs *'
  SELECTION_4:
    CommandLine: '* --port *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: cd8c163e-a19b-402e-bdd5-419ff5859f12
level: critical
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/bats3c/ADCSPwn
status: test
tags:
- attack.credential_access
- attack.t1557.001
