
title: Encoded IEX
ruletype: Sigma
author: Florian Roth
date: 2019/08/23
description: Detects a base64 encoded IEX command string in a process command line
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    CommandLine:
    - '*SUVYIChb*'
    - '*lFWCAoW*'
    - '*JRVggKF*'
    - '*aWV4IChb*'
    - '*lleCAoW*'
    - '*pZXggKF*'
    - '*aWV4IChOZX*'
    - '*lleCAoTmV3*'
    - '*pZXggKE5ld*'
    - '*SUVYIChOZX*'
    - '*lFWCAoTmV3*'
    - '*JRVggKE5ld*'
  SELECTION_4:
    CommandLine:
    - '*SQBFAFgAIAAoAFsA*'
    - '*kARQBYACAAKABbA*'
    - '*JAEUAWAAgACgAWw*'
    - '*aQBlAHgAIAAoAFsA*'
    - '*kAZQB4ACAAKABbA*'
    - '*pAGUAeAAgACgAWw*'
    - '*aQBlAHgAIAAoAE4AZQB3A*'
    - '*kAZQB4ACAAKABOAGUAdw*'
    - '*pAGUAeAAgACgATgBlAHcA*'
    - '*SQBFAFgAIAAoAE4AZQB3A*'
    - '*kARQBYACAAKABOAGUAdw*'
    - '*JAEUAWAAgACgATgBlAHcA*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 88f680b8-070e-402c-ae11-d2914f2257f1
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/03/07
status: test
tags:
- attack.execution
- attack.t1059.001
