
title: Wlrmdr Lolbin Use as Laucher
ruletype: Sigma
author: frack113
date: 2022/02/16
description: Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    ParentImage: C:\Windows\System32\winlogon.exe
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\wlrmdr.exe'
  SELECTION_4:
    CommandLine: '*-s *'
  SELECTION_5:
    CommandLine: '*-f *'
  SELECTION_6:
    CommandLine: '*-t *'
  SELECTION_7:
    CommandLine: '*-m *'
  SELECTION_8:
    CommandLine: '*-a *'
  SELECTION_9:
    CommandLine: '*-u *'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9) and  not (SELECTION_10))
falsepositives:
- Unknown
id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/02
references:
- https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
status: experimental
tags:
- attack.defense_evasion
