
title: Suspicious Add Scheduled Task Parent
author: Florian Roth
date: 2022/02/23
description: Detects suspicious scheduled task creations from a parent stored in a
  temporary folder
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*schtasks.exe'
  SELECTION_4:
    CommandLine: '*/Create *'
  SELECTION_5:
    ParentImage:
    - '*\AppData\Local\\*'
    - '*\AppData\Roaming\\*'
    - '*\Temporary Internet*'
    - '*\Users\Public\\*'
  SELECTION_6:
    CommandLine:
    - '*update_task.xml*'
    - '*unattended.ini*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6)))
falsepositives:
- Software installers that run from temporary folders and also install scheduled tasks
id: 9494479d-d994-40bf-a8b1-eea890237021
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/24
references:
- https://app.any.run/tasks/649e7b46-9bec-4d05-98a5-dfa9a13eaae5/
status: experimental
tags:
- attack.execution
- attack.t1053.005
