
title: Shells Spawned by Web Servers
ruletype: Sigma
author: Thomas Patzke, Florian Roth
date: 2019/01/16
description: Web servers that spawn shell processes could be the result of a successfully
  placed web shell or an other attack
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    ParentImage:
    - '*\w3wp.exe'
    - '*\php-cgi.exe'
    - '*\nginx.exe'
    - '*\httpd.exe'
    - '*\caddy.exe'
    - '*\ws_TomcatService.exe'
    - '*\tomcat.exe'
    - '*\UMWorkerProcess.exe'
  SELECTION_4:
    ParentImage:
    - '*\java.exe'
    - '*\javaw.exe'
  SELECTION_5:
    ParentImage:
    - '*-tomcat-*'
    - '*\tomcat*'
  SELECTION_6:
    ParentImage:
    - '*\java.exe'
    - '*\javaw.exe'
  SELECTION_7:
    CommandLine:
    - '*catalina.jar*'
    - '*CATALINA_HOME*'
  SELECTION_8:
    Image:
    - '*\cmd.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\powershell.exe'
    - '*\bitsadmin.exe'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)) and SELECTION_8)
falsepositives:
- Particular web applications may spawn a shell process legitimately
fields:
- CommandLine
- ParentCommandLine
id: 8202070f-edeb-4d31-a010-a26c72ac5600
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/17
status: test
tags:
- attack.persistence
- attack.t1505.003
- attack.t1190
