
title: VeeamBackup Database Credentials Dump
author: frack113
date: 2021/12/20
description: Detects dump of credentials in VeeamBackup dbo
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\sqlcmd.exe'
  SELECTION_4:
    CommandLine: '*SELECT*'
  SELECTION_5:
    CommandLine: '*TOP*'
  SELECTION_6:
    CommandLine: '*[VeeamBackup].[dbo].[Credentials]*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: b57ba453-b384-4ab9-9f40-1038086b4e53
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
- https://forums.veeam.com/veeam-backup-replication-f2/recover-esxi-password-in-veeam-t34630.html
status: experimental
tags:
- attack.collection
- attack.t1005
