
title: WMI Reconnaissance List Remote Services
author: frack113
date: 2022/01/01
description: |
  An adversary might use WMI to check if a certain Remote Service is running on a remote device.
  When the test completes, a service information will be displayed on the screen if it exists.
  A common feedback message is that "No instance(s) Available" if the service queried is not running.
  A common error message is "Node - (provided IP or default) ERROR Description =The RPC server is unavailable" if the provided remote host is unreacheable
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\WMIC.exe'
  SELECTION_4:
    CommandLine: '*/node:*'
  SELECTION_5:
    CommandLine: '*service*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 09af397b-c5eb-4811-b2bb-08b3de464ebf
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1047/T1047.md
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wmic
status: experimental
tags:
- attack.execution
- attack.t1047
