
title: Suspicious Registration via cscript.exe
author: Austin Songer @austinsonger
date: 2021/11/05
description: Detects when the registration of a VSS/VDS Provider as a COM+ application.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\cscript.exe'
  SELECTION_4:
    CommandLine: '*-register*'
  SELECTION_5:
    CommandLine:
    - '*\Windows Kits\10\bin\10.0.22000.0\x64*'
    - '*\Windows Kits\10\bin\10.0.19041.0\x64*'
    - '*\Windows Kits\10\bin\10.0.17763.0\x64*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 28c8f68b-098d-45af-8d43-8089f3e35403
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/sblmsrsn/status/1456613494783160325?s=20
- https://ss64.com/vb/cscript.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
