
title: Abusing IEExec To Download Payloads
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/05/16
description: Detects execution of the IEExec utility to download payloads
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\IEExec.exe'
  SELECTION_4:
    OriginalFileName: IEExec.exe
  SELECTION_5:
    CommandLine:
    - '*https://*'
    - '*http://*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Unknown
id: 9801abb8-e297-4dbf-9fbd-57dde0e830ad
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ieexec/
status: experimental
