title: Greenbug Espionage Group Indicators
id: 42f2a839-58ef-d7c7-7e5b-d1b1cb6a5f7c
related:
    - id: 3711eee4-a808-4849-8a14-faf733da3612
      type: derived
status: test
description: Detects tools and process executions used by Greenbug in their May 2020 campaign as reported by Symantec
references:
    - https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/greenbug-espionage-telco-south-asia
author: Florian Roth (Nextron Systems)
date: 2020-05-20
modified: 2023-03-09
tags:
    - attack.g0049
    - attack.execution
    - attack.t1059.001
    - attack.command-and-control
    - attack.t1105
    - attack.defense-evasion
    - attack.t1036.005
    - detection.emerging-threats
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        Image|endswith:
            - :\ProgramData\adobe\Adobe.exe
            - :\ProgramData\oracle\local.exe
            - \revshell.exe
            - \infopagesbackup\ncat.exe
            - :\ProgramData\comms\comms.exe
    selection_msf:
        CommandLine|contains|all:
            - -ExecutionPolicy Bypass -File
            - \msf.ps1
    selection_ncat:
        CommandLine|contains|all:
            - infopagesbackup
            - \ncat
            - -e cmd.exe
    selection_powershell:
        CommandLine|contains:
            - system.Data.SqlClient.SqlDataAdapter($cmd); [void]$da.fill
            - -nop -w hidden -c $k=new-object
            - '[Net.CredentialCache]::DefaultCredentials;IEX '
            - ' -nop -w hidden -c $m=new-object net.webclient;$m'
            - -noninteractive -executionpolicy bypass whoami
            - -noninteractive -executionpolicy bypass netstat -a
    selection_other:
        CommandLine|contains: L3NlcnZlcj1    # base64 encoded '/server='
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
