title: Suspicious Computer Machine Password by PowerShell
id: 31981511-e5c7-fa6d-65dd-422e26ba8f0d
related:
    - id: e3818659-5016-4811-a73c-dde4679169d2
      type: derived
status: test
description: |
    The Reset-ComputerMachinePassword cmdlet changes the computer account password that the computers use to authenticate to the domain controllers in the domain.
    You can use it to reset the password of the local computer.
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword?view=powershell-5.1
    - https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
author: frack113
date: 2022-02-21
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.defense-evasion
    - attack.initial-access
    - attack.t1078
logsource:
    product: windows
    category: ps_module
    definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
detection:
    ps_module:
        EventID: 4103
        Channel:
            - Microsoft-Windows-PowerShell/Operational
            - PowerShellCore/Operational
    selection:
        ContextInfo|contains: Reset-ComputerMachinePassword
    condition: ps_module and selection
falsepositives:
    - Administrator PowerShell scripts
level: medium
ruletype: Sigma
