title: Wdigest Enable UseLogonCredential
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2019/09/12
description: Detects potential malicious modification of the property value of UseLogonCredential
    from HKLM:\SYSTEM\CurrentControlSet\Control\SecurityProviders\WDigest to enable
    clear-text credentials
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*WDigest\UseLogonCredential'
    SELECTION_5:
        Details: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: d6a9b252-c666-4de6-8806-5561bbbd3bdc
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190511223310.html
- https://support.microsoft.com/en-us/topic/microsoft-security-advisory-update-to-improve-credentials-protection-and-management-may-13-2014-93434251-04ac-b7f3-52aa-9f951c14b649
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
yml_filename: registry_set_wdigest_enable_uselogoncredential.yml
yml_path: rules/windows/registry/registry_set
---

