title: Disable Sysmon Event Logging Via Registry
ruletype: Sigma
author: B.Talebi
date: 2022/07/28
description: Detects changes in Sysmon driver altitude. If the Sysmon driver is configured
    to load at an altitude of another registered service, it will fail to load at
    boot.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: HKLM\SYSTEM\CurrentControlSet\\*
    SELECTION_5:
        TargetObject: '*\Instances\Sysmon Instance\Altitude'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate driver altitude change to hide sysmon
id: 4916a35e-bfc4-47d0-8e25-a003d7067061
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://posts.specterops.io/shhmon-silencing-sysmon-via-driver-unload-682b5be57650
- https://youtu.be/zSihR3lTf7g
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: registry_set_change_sysmon_driver_altitude.yml
yml_path: rules/windows/registry/registry_set
---

