
title: Windows Defender Threat Detection Disabled - Registry
ruletype: Sigma
author: Ján Trenčanský, frack113, AlertIQ
date: 2020/07/28
description: Detects disabling Windows Defender threat protection based on windows
  defender related registry keys
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    EventType: SetValue
  SELECTION_4:
    TargetObject:
    - HKLM\SOFTWARE\Policies\Microsoft\Windows Defender\DisableAntiSpyware
    - HKLM\SOFTWARE\Policies\Microsoft\Windows Defender\DisableAntiVirus
  SELECTION_5:
    Details: DWORD (0x00000001)
  SELECTION_6:
    EventType: SetValue
  SELECTION_7:
    TargetObject:
    - HKLM\SYSTEM\CurrentControlSet\Services\WinDefend
    - HKLM\SOFTWARE\Microsoft\Windows Defender
    - HKLM\SOFTWARE\Policies\Microsoft\Windows Defender
  SELECTION_8:
    Details: DWORD (0x00000001)
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Administrator actions
id: a64e4198-c1c8-46a5-bc9c-324c86455fd4
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/05/04
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-antivirus/troubleshoot-windows-defender-antivirus
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
related:
- id: fe34868f-6e0e-4882-81f6-c43aa8f15b62
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
