title: Potential Persistence Via Outlook Today Pages
ruletype: Sigma
author: Tobias Michalski (Nextron Systems)
date: 2021/06/10
description: Detects potential persistence activity via outlook today pages. An attacker
    can set a custom page to execute arbitrary code and link to it via the registry
    key "UserDefinedUrl".
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        Image: '*\OfficeClickToRun.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*Software\Microsoft\Office\\*'
    SELECTION_5:
        TargetObject: '*\Outlook\Today\\*'
    SELECTION_6:
        TargetObject: '*Stamp'
    SELECTION_7:
        Details: DWORD (0x00000001)
    SELECTION_8:
        TargetObject: '*UserDefinedUrl'
    SELECTION_9:
        Image:
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) and ((SELECTION_6 and SELECTION_7) or SELECTION_8)) and  not
        ((SELECTION_9 and SELECTION_10)))
falsepositives:
- Unknown
fields:
- Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/02/08
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=74
status: experimental
tags:
- attack.persistence
- attack.t1112

