title: Windows Defender Exclusions Added - Registry
ruletype: Sigma
author: Christian Burkard
date: 2021/07/06
description: Detects the Setting of Windows Defender Exclusions
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\Microsoft\Windows Defender\Exclusions*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrator actions
id: a982fc9c-6333-4ffb-a51d-addb04e8b529
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/11/26
references:
- https://twitter.com/_nullbind/status/1204923340810543109
related:
-   id: 1321dc4e-a1fe-481d-a016-52c45f0c8b4f
    type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1562.001

