title: Hide User Account Via Special Accounts Reg Key
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/12
description: Detects when an attacker set the registry key "HKLM\Software\Microsoft\Windows
    NT\CurrentVersion\Winlogon\SpecialAccounts\Userlist" to "0" in order to hide user
    account.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\SpecialAccounts\UserList*'
    SELECTION_5:
        Details: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: f8aebc67-a56d-4ec9-9fbe-7b0e8b7b4efd
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.002

