title: ETW Logging Disabled For rpcrt4.dll
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/09
description: Detects changes to the "ExtErrorInformation" key in order to disable
    ETW logging for rpcrt4.dll
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\Microsoft\Windows NT\Rpc\ExtErrorInformation'
    SELECTION_5:
        Details:
        - DWORD (0x00000000)
        - DWORD (0x00000002)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 90f342e1-1aaa-4e43-b092-39fda57ed11e
level: low
logsource:
    category: registry_set
    product: windows
references:
- http://redplait.blogspot.com/2020/07/whats-wrong-with-etw.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562

