title: Common Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split), wagga (name)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        TargetObject: '*\Software\Microsoft\Active Setup\Installed Components\{89820200-ECBD-11cf-8B85-00AA005B4383}*'
    SELECTION_11:
        Image:
        - C:\Windows\System32\poqexec.exe
        - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    SELECTION_12:
        Image:
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
    SELECTION_13:
        Image: '*\OfficeClickToRun.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject:
        - '*\SOFTWARE\Wow6432Node\Microsoft\Windows CE Services\AutoStart*'
        - '*\Software\Wow6432Node\Microsoft\Command Processor\Autorun*'
        - '*\SOFTWARE\Wow6432Node\Microsoft\Active Setup\Installed Components*'
        - '*\SOFTWARE\Microsoft\Windows CE Services\AutoStartOnDisconnect*'
        - '*\SOFTWARE\Microsoft\Windows CE Services\AutoStartOnConnect*'
        - '*\SYSTEM\Setup\CmdLine*'
        - '*\Software\Microsoft\Ctf\LangBarAddin*'
        - '*\Software\Microsoft\Command Processor\Autorun*'
        - '*\SOFTWARE\Microsoft\Active Setup\Installed Components*'
        - '*\SOFTWARE\Classes\Protocols\Handler*'
        - '*\SOFTWARE\Classes\Protocols\Filter*'
        - '*\SOFTWARE\Classes\Htmlfile\Shell\Open\Command\(Default)*'
        - '*\Environment\UserInitMprLogonScript*'
        - '*\SOFTWARE\Policies\Microsoft\Windows\Control Panel\Desktop\Scrnsave.exe*'
        - '*\Software\Microsoft\Internet Explorer\UrlSearchHooks*'
        - '*\SOFTWARE\Microsoft\Internet Explorer\Desktop\Components*'
        - '*\Software\Classes\Clsid\{AB8902B4-09CA-4bb6-B78D-A8F59079A8D5}\Inprocserver32*'
        - '*\Control Panel\Desktop\Scrnsave.exe*'
    SELECTION_5:
        Details: (Empty)
    SELECTION_6:
        TargetObject:
        - '*\Office\ClickToRun\REGISTRY\MACHINE\Software\Classes\PROTOCOLS\Handler\\*'
        - '*\ClickToRunStore\HKMU\SOFTWARE\Classes\PROTOCOLS\Handler\\*'
    SELECTION_7:
        Details:
        - '{314111c7-a502-11d2-bbca-00c04f8ec294}'
        - '{3459B272-CC19-4448-86C9-DDC3B4B2FAD3}'
        - '{42089D2D-912D-4018-9087-2B87803E93FB}'
        - '{5504BE45-A83B-4808-900A-3A5C36E7F77A}'
        - '{807583E5-5146-11D5-A672-00B0D022E945}'
    SELECTION_8:
        TargetObject: '*\SOFTWARE\Microsoft\Active Setup\Installed Components\{8A69D345-D564-463c-AFF1-A69D9E530F96}*'
    SELECTION_9:
        TargetObject: '*\SOFTWARE\Microsoft\Active Setup\Installed Components\{9459C573-B17A-45AE-9F64-1857B5D58CEE}*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 or SELECTION_7) or (SELECTION_8) or (SELECTION_9)
        or (SELECTION_10) or (SELECTION_11) or (SELECTION_12 and SELECTION_13)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: f59c3faf-50f3-464b-9f4c-1b67ab512d99
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2023/03/24
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
- https://persistence-info.github.io/Data/userinitmprlogonscript.html
related:
-   id: 17f878b8-9968-4578-b814-c4217fc5768c
    type: obsoletes
status: experimental
tags:
- attack.persistence
- attack.t1547.001

