title: Scheduled TaskCache Change by Uncommon Program
ruletype: Sigma
author: Syed Hasan (@syedhasan009)
date: 2021/06/18
description: Monitor the creation of a new key under 'TaskCache' when a new scheduled
    task is registered by a process that is not svchost.exe, which is suspicious
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        Image: '*\ngen.exe'
    SELECTION_11:
        TargetObject:
        - '*\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tasks\{B66B135D-DA06-4FC4-95F8-7458E1D10129}*'
        - '*\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\Tree\Microsoft\Windows\.NET
            Framework\.NET Framework NGEN*'
    SELECTION_12:
        Image:
        - C:\Program Files\Microsoft Office\root\Integration\Integrator.exe
        - C:\Program Files (x86)\Microsoft Office\root\Integration\Integrator.exe
    SELECTION_13:
        Image: C:\Windows\System32\msiexec.exe
    SELECTION_14:
        Image:
        - C:\Program Files (x86)\Dropbox\Update\DropboxUpdate.exe
        - C:\Program Files\Dropbox\Update\DropboxUpdate.exe
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*SOFTWARE\Microsoft\Windows NT\CurrentVersion\Schedule\TaskCache\\*'
    SELECTION_5:
        TargetObject:
        - '*Microsoft\Windows\UpdateOrchestrator*'
        - '*Microsoft\Windows\SoftwareProtectionPlatform\SvcRestartTask\Index*'
        - '*Microsoft\Windows\Flighting\OneSettings\RefreshCache\Index*'
    SELECTION_6:
        Image: C:\Windows\\*
    SELECTION_7:
        Image: '*\TiWorker.exe'
    SELECTION_8:
        Image: C:\WINDOWS\system32\svchost.exe
    SELECTION_9:
        Image: C:\Windows\Microsoft.NET\Framework*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8) or (SELECTION_9
        and SELECTION_10 and SELECTION_11) or (SELECTION_12) or (SELECTION_13) or
        (SELECTION_14)))
falsepositives:
- Unknown
id: 4720b7df-40c3-48fd-bbdf-fd4b3c464f0d
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/10/14
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://labs.f-secure.com/blog/scheduled-task-tampering/
status: experimental
tags:
- attack.persistence
- attack.t1053
- attack.t1053.005

