title: CurrentControlSet Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        Image: C:\Windows\System32\spoolsv.exe
    SELECTION_11:
        TargetObject: '*Print\Monitors\Appmon\Ports\Microsoft.Office.OneNote_*'
    SELECTION_12:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_13:
        Image: C:\Windows\System32\poqexec.exe
    SELECTION_14:
        TargetObject: '*\NetworkProvider\Order\ProviderOrder'
    SELECTION_15:
        Image: C:\Windows\System32\spoolsv.exe
    SELECTION_16:
        TargetObject: '*\Print\Monitors\MONVNC\Driver'
    SELECTION_17:
        Details: VNCpm.dll
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SYSTEM\CurrentControlSet\Control*'
    SELECTION_5:
        TargetObject:
        - '*\Terminal Server\WinStations\RDP-Tcp\InitialProgram*'
        - '*\Terminal Server\Wds\rdpwd\StartupPrograms*'
        - '*\SecurityProviders\SecurityProviders*'
        - '*\SafeBoot\AlternateShell*'
        - '*\Print\Providers*'
        - '*\Print\Monitors*'
        - '*\NetworkProvider\Order*'
        - '*\Lsa\Notification Packages*'
        - '*\Lsa\Authentication Packages*'
        - '*\BootVerificationProgram\ImagePath*'
    SELECTION_6:
        Details: (Empty)
    SELECTION_7:
        Image: C:\Windows\System32\spoolsv.exe
    SELECTION_8:
        TargetObject: '*\Print\Monitors\CutePDF Writer Monitor*'
    SELECTION_9:
        Details:
        - cpwmon64_v40.dll
        - CutePDF Writer
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16 and SELECTION_17)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: f674e36a-4b91-431e-8aef-f8a96c2aca35
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/09/20
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
-   id: 17f878b8-9968-4578-b814-c4217fc5768c
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001

