title: Disable Macro Runtime Scan Scope
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/25
description: Detects tampering with the MacroRuntimeScanScope registry key to disable
    runtime scanning of enabled macros
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\\*'
    SELECTION_5:
        TargetObject: '*\Microsoft\Office\\*'
    SELECTION_6:
        TargetObject: '*\Common\Security*'
    SELECTION_7:
        TargetObject: '*\MacroRuntimeScanScope'
    SELECTION_8:
        Details: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: ab871450-37dc-4a3a-997f-6662aa8ae0f1
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2018/09/12/office-vba-amsi-parting-the-veil-on-malicious-macros/
- https://admx.help/?Category=Office2016&Policy=office16.Office.Microsoft.Policies.Windows::L_MacroRuntimeScanScope
- https://github.com/S3cur3Th1sSh1t/OffensiveVBA/blob/28cc6a2802d8176195ac19b3c8e9a749009a82a3/src/AMSIbypasses.vba
status: experimental
tags:
- attack.defense_evasion

