title: Potential Persistence Via COM Hijacking From Suspicious Locations
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/28
description: Detects potential COM object hijacking where the "Server" (In/Out) is
    pointing to a supsicious or unsuale location
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject:
        - HKCR\CLSID\\*
        - HKEY_CLASSES_ROOT\CLSID\\*
        - HKCU\Software\Classes\CLSID\\*
        - HKEY_CURRENT_USER\Software\Classes\CLSID\\*
    SELECTION_5:
        TargetObject:
        - '*\InprocServer32\(Default)'
        - '*\LocalServer32\(Default)'
    SELECTION_6:
        Details:
        - '*\Users\Public\\*'
        - '*\Desktop\\*'
        - '*\AppData\Local\Temp\\*'
        - '*\Downloads\\*'
        - '*\Windows\Temp\\*'
        - '*\Microsoft\Windows\Start Menu\Programs\Startup\\*'
        - '*\System32\spool\drivers\color\\*'
        - '*%temp%*'
        - '*%tmp%*'
        - '*%appdata%*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Probable legitimate applications. If you find these please add them to an exclusion
    list
id: 3d968d17-ffa4-4bc0-bfdc-f139de76ce77
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/10
references:
- https://www.microsoft.com/security/blog/2022/07/27/untangling-knotweed-european-private-sector-offensive-actor-using-0-day-exploits/
    (idea)
status: experimental
tags:
- attack.persistence
- attack.t1546.015

