title: Registry Modification to Hidden File Extension
ruletype: Sigma
author: frack113
date: 2022/01/22
description: Hides the file extension through modification of the registry
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\HideFileExt'
    SELECTION_5:
        Details: DWORD (0x00000001)
    SELECTION_6:
        EventType: SetValue
    SELECTION_7:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\Hidden'
    SELECTION_8:
        Details: DWORD (0x00000002)
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Administrative scripts
id: 5df86130-4e95-4a54-90f7-26541b40aec2
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-1---modify-registry-of-current-user-profile---cmd
- https://unit42.paloaltonetworks.com/ransomware-families/
- https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?name=TrojanSpy%3aMSIL%2fHakey.A
status: experimental
tags:
- attack.persistence
- attack.t1137
yml_filename: registry_set_hidden_extention.yml
yml_path: rules/windows/registry/registry_set
---

