title: Disable Internal Tools or Feature in Registry
ruletype: Sigma
author: frack113, Nasreddine Bencherchali
date: 2022/03/18
description: Detects registry modifications that change features of internal Windows
    tools (malware like Agent Tesla uses this technique)
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject:
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\system\DisableRegistryTools'
        - '*SOFTWARE\Policies\Microsoft\Windows\System\DisableCMD'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\system\DisableTaskmgr'
        - '*SOFTWARE\Policies\Microsoft\Windows\Explorer\DisableNotificationCenter'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableChangePassword'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\DisableLockWorkstation'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\StartMenuLogOff'
    SELECTION_5:
        Details: DWORD (0x00000001)
    SELECTION_6:
        EventType: SetValue
    SELECTION_7:
        TargetObject:
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\shutdownwithoutlogon'
        - '*SOFTWARE\Microsoft\Windows\CurrentVersion\PushNotifications\ToastEnabled'
        - '*\SYSTEM\CurrentControlSet\Control\Storage\Write Protection'
        - '*\SYSTEM\CurrentControlSet\Control\StorageDevicePolicies\WriteProtect'
    SELECTION_8:
        Details: DWORD (0x00000000)
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate admin script
id: e2482f8d-3443-4237-b906-cc145d87a076
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/06/03
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md
- https://www.mandiant.com/resources/unc2165-shifts-to-evade-sanctions
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
yml_filename: registry_set_disable_fonction_user.yml
yml_path: rules/windows/registry/registry_set
---

