title: Allow RDP Remote Assistance Feature
ruletype: Sigma
author: frack113
date: 2022/08/19
description: Detect enable rdp feature to allow specific user to rdp connect on the
    targeted machine
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*System\CurrentControlSet\Control\Terminal Server\fAllowToGetHelp'
    SELECTION_5:
        Details: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitmate use of the feature (alerts should be investigated either way)
id: 37b437cf-3fc5-4c8e-9c94-1d7c9aff842b
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

