title: Potential PowerShell Execution Policy Tampering
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/11
description: Detects changes to the PowerShell execution policy in order to bypass
    signing requirements for script execution
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject:
        - '*\ShellIds\Microsoft.PowerShell\ExecutionPolicy'
        - '*\Policies\Microsoft\Windows\PowerShell\ExecutionPolicy'
    SELECTION_5:
        Details:
        - '*Bypass*'
        - '*RemoteSigned*'
        - '*Unrestricted*'
    SELECTION_6:
        Image:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6)))
falsepositives:
- Unknown
id: fad91067-08c5-4d1a-8d8c-d96a21b37814
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.3
related:
-   id: cf2e938e-9a3e-4fe8-a347-411642b28a9f
    type: similar
-   id: 87e3c4e8-a6a8-4ad9-bb4f-46e7ff99a180
    type: similar
-   id: 61d0475c-173f-4844-86f7-f3eebae1c66b
    type: similar
status: experimental
tags:
- attack.defense_evasion

