title: PowerShell Logging Disabled Via Registry Key Tampering
ruletype: Sigma
author: frack113
date: 2022/04/02
description: Detects changes to the registry for the currently logged-in user. In
    order to disable PowerShell module logging, script block logging or transcription
    and script execution logging
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject:
        - '*\Microsoft\Windows\PowerShell\ModuleLogging\EnableModuleLogging'
        - '*\Microsoft\Windows\PowerShell\ScriptBlockLogging\EnableScriptBlockLogging'
        - '*\Microsoft\Windows\PowerShell\Transcription\EnableTranscripting'
        - '*\Microsoft\Windows\PowerShell\EnableScripts'
        - '*\Microsoft\PowerShellCore\ModuleLogging\EnableModuleLogging'
        - '*\Microsoft\PowerShellCore\ScriptBlockLogging\EnableScriptBlockLogging'
        - '*\Microsoft\PowerShellCore\Transcription\EnableTranscripting'
        - '*\Microsoft\PowerShellCore\EnableScripts'
    SELECTION_5:
        Details: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: fecfd1a1-cc78-4313-a1ea-2ee2e8ec27a7
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/10
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-32---windows-powershell-logging-disabled
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001

