title: DNS ServerLevelPluginDll Install
ruletype: Sigma
author: Florian Roth
date: 2017/05/08
description: Detects the installation of a plugin DLL via ServerLevelPluginDll parameter
    in Registry, which can be used to execute code in context of the DNS server (restart
    required)
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\services\DNS\Parameters\ServerLevelPluginDll'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- Image
- User
- TargetObject
id: e61e8a88-59a9-451c-874e-70fcc9740d67
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/08/23
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
status: experimental
tags:
- attack.defense_evasion
- attack.t1574.002
- attack.t1112

