title: Add DisallowRun Execution to Registry
ruletype: Sigma
author: frack113
date: 2022/08/19
description: Detect set DisallowRun to 1  to prevent user running specific computer
    program
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\DisallowRun'
    SELECTION_5:
        Details: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 275641a5-a492-45e2-a817-7c81e9d9d3e9
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

