title: Outlook EnableUnsafeClientMailRules Setting Enabled - Registry
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/08
description: Detects an attacker trying to enable the outlook security setting "EnableUnsafeClientMailRules"
    which allows outlook to run applications or execute macros
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\Outlook\Security\EnableUnsafeClientMailRules'
    SELECTION_5:
        Details: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 6763c6c8-bd01-4687-bc8d-4fa52cf8ba08
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/02/09
references:
- https://support.microsoft.com/en-us/topic/how-to-control-the-rule-actions-to-start-an-application-or-run-a-macro-in-outlook-2016-and-outlook-2013-e4964b72-173c-959d-5d7b-ead562979048
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=44
related:
-   id: c3cefdf4-6703-4e1c-bad8-bf422fc5015a
    type: similar
-   id: 55f0a3a1-846e-40eb-8273-677371b8d912
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

