title: DHCP Callout DLL Installation
ruletype: Sigma
author: Dimitrios Slamaris
date: 2017/05/15
description: Detects the installation of a Callout DLL via CalloutDlls and CalloutEnabled
    parameter in Registry, which can be used to execute code in context of the DHCP
    server (restart required)
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: Setvalue
    SELECTION_4:
        TargetObject:
        - '*\Services\DHCPServer\Parameters\CalloutDlls'
        - '*\Services\DHCPServer\Parameters\CalloutEnabled'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 9d3436ef-9476-4c43-acca-90ce06bdf33a
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/06/26
references:
- https://blog.3or.de/mimilib-dhcp-server-callout-dll-injection.html
- https://technet.microsoft.com/en-us/library/cc726884(v=ws.10).aspx
- https://msdn.microsoft.com/de-de/library/windows/desktop/aa363389(v=vs.85).aspx
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
- attack.t1112
yml_filename: registry_set_dhcp_calloutdll.yml
yml_path: rules/windows/registry/registry_set
---

