title: Modify Attachment Manager Settings - Attachments
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/01
description: Detects tampering with attachment manager settings policies attachments
    (See reference for more information)
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        Details: DWORD (0x00000001)
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Attachments\\*'
    SELECTION_5:
        TargetObject: '*\HideZoneInfoOnProperties'
    SELECTION_6:
        Details: DWORD (0x00000001)
    SELECTION_7:
        TargetObject: '*\SaveZoneInformation'
    SELECTION_8:
        Details: DWORD (0x00000002)
    SELECTION_9:
        TargetObject: '*\ScanWithAntiVirus'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10)))
falsepositives:
- Unlikely
id: ee77a5db-b0f3-4be2-bfd4-b58be1c6b15a
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://support.microsoft.com/en-us/topic/information-about-the-attachment-manager-in-microsoft-windows-c48a4dcd-8de5-2af5-ee9b-cd795ae42738
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
status: experimental
tags:
- attack.defense_evasion

