title: Add Debugger Entry To AeDebug For Persistence
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: Detects when an attacker adds a new "Debugger" value to the "AeDebug"
    key in order to achieve persistence which will get invoked when an application
    crashes
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AeDebug\Debugger*'
    SELECTION_5:
        Details: '*.dll'
    SELECTION_6:
        Details: '"C:\WINDOWS\system32\vsjitdebugger.exe" -p %ld -e %ld -j 0x%p'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6))
falsepositives:
- Legitimate use of the key to setup a debugger. Which is often the case on developers
    machines
id: 092af964-4233-4373-b4ba-d86ea2890288
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://persistence-info.github.io/Data/aedebug.html
- https://docs.microsoft.com/en-us/windows/win32/debug/configuring-automatic-debugging
status: experimental
tags:
- attack.persistence

