title: CurrentVersion NT Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        Image: '*\MicrosoftEdgeUpdate.exe'
    SELECTION_11:
        TargetObject:
        - '*\ClickToRunStore\HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\\*'
        - '*\ClickToRun\REGISTRY\MACHINE\Software\Microsoft\Windows NT\CurrentVersion\\*'
    SELECTION_12:
        Image:
        - C:\Program Files\Microsoft Office\root\integration\integrator.exe
        - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    SELECTION_13:
        Image:
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
    SELECTION_14:
        Image: '*\OfficeClickToRun.exe'
    SELECTION_15:
        Image: C:\Windows\system32\svchost.exe
    SELECTION_16:
        TargetObject:
        - '*\Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\PreviousPolicyAreas*'
        - '*\Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\MaxNoGPOListChangesInterval*'
    SELECTION_17:
        Details:
        - DWORD (0x00000009)
        - DWORD (0x000003c0)
    SELECTION_18:
        Image: C:\Windows\Microsoft.NET\Framework*
    SELECTION_19:
        Image: '*\ngen.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        Image: '*\AppData\Local\Microsoft\OneDrive\StandaloneUpdater\OneDriveSetup.exe'
    SELECTION_21:
        TargetObject: '*\Microsoft\Windows\CurrentVersion\RunOnce\Delete Cached Update
            Binary'
    SELECTION_22:
        Details: C:\Windows\system32\cmd.exe /q /c del /q "C:\Users\\*
    SELECTION_23:
        Details: '*\AppData\Local\Microsoft\OneDrive\Update\OneDriveSetup.exe"'
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion*'
    SELECTION_5:
        TargetObject:
        - '*\Winlogon\VmApplet*'
        - '*\Winlogon\Userinit*'
        - '*\Winlogon\Taskman*'
        - '*\Winlogon\Shell*'
        - '*\Winlogon\GpExtensions*'
        - '*\Winlogon\AppSetup*'
        - '*\Winlogon\AlternateShells\AvailableShells*'
        - '*\Windows\IconServiceLib*'
        - '*\Windows\Appinit_Dlls*'
        - '*\Image File Execution Options*'
        - '*\Font Drivers*'
        - '*\Drivers32*'
        - '*\Windows\Run*'
        - '*\Windows\Load*'
    SELECTION_6:
        Details: (Empty)
    SELECTION_7:
        TargetObject: '*\Image File Execution Options\\*'
    SELECTION_8:
        TargetObject:
        - '*\DisableExceptionChainValidation'
        - '*\MitigationOptions'
    SELECTION_9:
        Image: C:\Program Files (x86)\Microsoft\Temp\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10) or (SELECTION_11 or SELECTION_12) or (SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16 and SELECTION_17) or (SELECTION_18 and SELECTION_19)
        or (SELECTION_20 and SELECTION_21 and SELECTION_22 and SELECTION_23)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: cbf93e5d-ca6c-4722-8bea-e9119007c248
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/07/05
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
-   id: 17f878b8-9968-4578-b814-c4217fc5768c
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
yml_filename: registry_set_asep_reg_keys_modification_currentversion_nt.yml
yml_path: rules/windows/registry/registry_set
---

