title: DNS-over-HTTPS Enabled by Registry
ruletype: Sigma
author: Austin Songer
date: 2021/07/22
description: |
    Detects when a user enables DNS-over-HTTPS.
    This can be used to hide internet activity or be used to hide the process of exfiltrating data.
    With this enabled organization will lose visibility into data such as query type, response and originating IP that are used to determine bad actors.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        TargetObject: '*\SOFTWARE\Policies\Mozilla\Firefox\DNSOverHTTPS\Enabled'
    SELECTION_11:
        Details: DWORD (0x00000001)
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Policies\Microsoft\Edge\BuiltInDnsClientEnabled'
    SELECTION_5:
        Details: DWORD (0x00000001)
    SELECTION_6:
        EventType: SetValue
    SELECTION_7:
        TargetObject: '*\SOFTWARE\Google\Chrome\DnsOverHttpsMode'
    SELECTION_8:
        Details: secure
    SELECTION_9:
        EventType: SetValue
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10 and SELECTION_11)))
falsepositives:
- Unlikely
id: 04b45a8a-d11d-49e4-9acc-4a1b524407a5
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://www.tenforums.com/tutorials/151318-how-enable-disable-dns-over-https-doh-microsoft-edge.html
- https://github.com/elastic/detection-rules/issues/1371
- https://chromeenterprise.google/policies/?policy=DnsOverHttpsMode
- https://admx.help/HKLM/Software/Policies/Mozilla/Firefox/DNSOverHTTPS
status: experimental
tags:
- attack.defense_evasion
- attack.t1140
- attack.t1112

