title: Persistence Via Mpnotify
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: Detects when an attacker register a new SIP provider for persistence
    and defense evasion
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\mpnotify*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Might trigger if a legitimate new SIP provider is registered. But this is not a
    common occurrence in an environment and should be investigated either way
id: 92772523-d9c1-4c93-9547-b0ca500baba3
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://persistence-info.github.io/Data/mpnotify.html
- https://www.youtube.com/watch?v=ggY3srD9dYs&ab_channel=GrzegorzTworek
status: experimental
tags:
- attack.persistence

