title: Potential AutoLogger Sessions Tampering
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/01
description: Detects tampering with autologger trace sessions which is a technique
    used by attackers to disable logging
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\System\CurrentControlSet\Control\WMI\Autologger\\*'
    SELECTION_5:
        TargetObject:
        - '*\EventLog-*'
        - '*\Defender*'
    SELECTION_6:
        TargetObject:
        - '*\Enable'
        - '*\Start'
    SELECTION_7:
        Details: DWORD (0x00000000)
    SELECTION_8:
        Image: C:\Windows\system32\wevtutil.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7) and  not ((SELECTION_8)))
falsepositives:
- Unknown
id: f37b4bce-49d0-4087-9f5b-58bffda77316
level: high
logsource:
    category: registry_set
    product: windows
modified: 2023/01/18
references:
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://i.blackhat.com/EU-21/Wednesday/EU-21-Teodorescu-Veni-No-Vidi-No-Vici-Attacks-On-ETW-Blind-EDRs.pdf
status: experimental
tags:
- attack.defense_evasion

