title: VBScript Payload Stored in Registry
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/03/05
description: Detects VBScript content stored into registry keys as seen being used
    by UNC2452 group
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*Software\Microsoft\Windows\CurrentVersion*'
    SELECTION_5:
        Details:
        - '*vbscript:*'
        - '*jscript:*'
        - '*mshtml,*'
        - '*RunHTMLApplication*'
        - '*Execute(*'
        - '*CreateObject*'
        - '*window.close*'
    SELECTION_6:
        TargetObject: '*Software\Microsoft\Windows\CurrentVersion\Run*'
    SELECTION_7:
        Image: '*\msiexec.exe'
    SELECTION_8:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\\*'
    SELECTION_9:
        Details:
        - '*\Microsoft.NET\Primary Interop Assemblies\Microsoft.mshtml.dll*'
        - '*<\Microsoft.mshtml,fileVersion=*'
        - '*_mshtml_dll_*'
        - '*<\Microsoft.mshtml,culture=*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: 46490193-1b22-4c29-bdd6-5bf63907216f
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/09/19
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.persistence
- attack.t1547.001

