title: Activate Suppression of Windows Security Center Notifications
ruletype: Sigma
author: frack113
date: 2022/08/19
description: Detect set Notification_Suppress to 1 to disable the windows security
    center notification
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*SOFTWARE\Policies\Microsoft\Windows Defender\UX Configuration\Notification_Suppress'
    SELECTION_5:
        Details: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 0c93308a-3f1b-40a9-b649-57ea1a1c1d63
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/11/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

