
title: Register New IFiltre For Persistence
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: Detects when an attacker register a new IFilter for an exntesion. Microsoft
  Windows Search uses filters to extract the content of items for inclusion in a full-text
  index. You can extend Windows Search to index new or proprietary file types by writing
  filters to extract the content, and property handlers to extract the properties
  of files
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    EventType: SetValue
  SELECTION_4:
    TargetObject:
    - HKLM\SOFTWARE\Classes\.*
    - HKEY_LOCAL_MACHINE\SOFTWARE\Classes\.*
  SELECTION_5:
    TargetObject: '*\PersistentHandler*'
  SELECTION_6:
    EventType: SetValue
  SELECTION_7:
    TargetObject:
    - HKLM\SOFTWARE\Classes\CLSID*
    - HKEY_LOCAL_MACHINE\SOFTWARE\Classes\CLSID*
  SELECTION_8:
    TargetObject: '*\PersistentAddinsRegistered\{89BCB740-6119-101A-BCB7-00DD010655AF}*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate registration of IFilters by the OS or software
id: b23818c7-e575-4d13-8012-332075ec0a2b
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://persistence-info.github.io/Data/ifilters.html
- https://twitter.com/0gtweet/status/1468548924600459267
- https://github.com/gtworek/PSBits/tree/master/IFilter
- https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/IFilter/Dll.cpp#L281-L308
status: experimental
tags:
- attack.persistence
