title: Wow6432Node CurrentVersion Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_10:
        TargetObject: '*\Office\ClickToRun\REGISTRY\MACHINE\Software\Wow6432Node\\*'
    SELECTION_11:
        Image:
        - C:\Program Files\Microsoft Office\root\integration\integrator.exe
        - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
    SELECTION_12:
        TargetObject: '*\Explorer\Browser Helper Objects\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}\\*'
    SELECTION_13:
        Details: '*-A251-47B7-93E1-CDD82E34AF8B}'
    SELECTION_14:
        Details: grpconv -o
    SELECTION_15:
        Details: '*C:\Program Files*'
    SELECTION_16:
        Details: '*\Dropbox\Client\Dropbox.exe*'
    SELECTION_17:
        Details: '* /systemstartup*'
    SELECTION_18:
        TargetObject: '*\Explorer\Browser Helper Objects\{92EF2EAD-A7CE-4424-B0DB-499CF856608E}\NoExplorer'
    SELECTION_19:
        Image: '*\windowsdesktop-runtime-*'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_20:
        TargetObject:
        - '*\WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}'
        - '*\WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{7037b699-7382-448c-89a7-4765961d2537}'
    SELECTION_21:
        Details:
        - '"C:\ProgramData\Package Cache\{7037b699-7382-448c-89a7-4765961d2537}\windowsdesktop-runtime-*'
        - '"C:\ProgramData\Package Cache\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}\windowsdesktop-runtime-*'
    SELECTION_22:
        Details: '*.exe" /burn.runonce'
    SELECTION_23:
        Image:
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
    SELECTION_24:
        Image: '*\OfficeClickToRun.exe'
    SELECTION_25:
        Details: '"C:\ProgramData\Package Cache\{d21a4f20-968a-4b0c-bf04-a38da5f06e41}\windowsdesktop-runtime-*'
    SELECTION_26:
        Image: '*\VC_redist.x64.exe'
    SELECTION_27:
        Details: '*}\VC_redist.x64.exe" /burn.runonce'
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion*'
    SELECTION_5:
        TargetObject:
        - '*\ShellServiceObjectDelayLoad*'
        - '*\Run\\*'
        - '*\RunOnce\\*'
        - '*\RunOnceEx\\*'
        - '*\RunServices\\*'
        - '*\RunServicesOnce\\*'
        - '*\Explorer\ShellServiceObjects*'
        - '*\Explorer\ShellIconOverlayIdentifiers*'
        - '*\Explorer\ShellExecuteHooks*'
        - '*\Explorer\SharedTaskScheduler*'
        - '*\Explorer\Browser Helper Objects*'
    SELECTION_6:
        Details: (Empty)
    SELECTION_7:
        Image: '*C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{*'
    SELECTION_8:
        Image: '*\setup.exe*'
    SELECTION_9:
        Image: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\OfficeClickToRun.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13 or SELECTION_14
        or SELECTION_15 and SELECTION_16 and SELECTION_17) or (SELECTION_18) or (SELECTION_19
        and SELECTION_20 and SELECTION_21 and SELECTION_22) or (SELECTION_23 and SELECTION_24)
        or (SELECTION_25) or (SELECTION_26 and SELECTION_27)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: b29aed60-ebd1-442b-9cb5-16a1d0324adb
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/09/21
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
- https://oddvar.moe/2018/03/21/persistence-using-runonceex-hidden-from-autoruns-exe/
related:
-   id: 17f878b8-9968-4578-b814-c4217fc5768c
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001

