title: NET NGenAssemblyUsageLog Registry Key Tamper
ruletype: Sigma
author: frack113
date: 2022/11/18
description: |
    Detects changes to the NGenAssemblyUsageLog registry key.
    .NET Usage Log output location can be controlled by setting the NGenAssemblyUsageLog CLR configuration knob in the Registry or by configuring an environment variable (as described in the next section).
    By simplify specifying an arbitrary value (e.g. fake output location or junk data) for the expected value, a Usage Log file for the .NET execution context will not be created.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*SOFTWARE\Microsoft\.NETFramework\NGenAssemblyUsageLog'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 28036918-04d3-423d-91c0-55ecf99fb892
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://bohops.com/2021/03/16/investigating-net-clr-usage-log-tampering-techniques-for-edr-evasion/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

