
title: Change User Account Associated with the FAX Service
ruletype: Sigma
author: frack113
date: 2022/07/17
description: Detect change of the user account associated with the FAX service to
  avoid the escalation problem.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetObject: HKLM\System\CurrentControlSet\Services\Fax\ObjectName
  SELECTION_4:
    details: '*NetworkService*'
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: e3fdf743-f05b-4051-990a-b66919be1743
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://twitter.com/dottor_morte/status/1544652325570191361
- https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
