title: Newly Registered Protocol Handler
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/05/30
description: Detects when a new custom protocole handler is registered
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        TargetObject: HKCR\\*
    SELECTION_4:
        Details: URL:*
    SELECTION_5:
        Details: URL:ms-*
    SELECTION_6:
        Image:
        - C:\Program Files\\*
        - C:\Program Files (x86)*
        - C:\Windows\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5 or SELECTION_6)))
falsepositives:
- Legitimate applications registering a new custom protocol handler
id: fdbf0b9d-0182-4c43-893b-a1eaab92d085
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://ladydebug.com/blog/2019/06/21/custom-protocol-handler-cph/
status: experimental
tags:
- attack.defense_evasion
- attack.t1112

