title: Modify Attachment Manager Settings - Associations
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/01
description: Detects tampering with attachment manager settings policies associations
    to lower the default file type risks (See reference for more information)
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Associations\\*'
    SELECTION_5:
        TargetObject: '*\DefaultFileTypeRisk'
    SELECTION_6:
        Details: DWORD (0x00006152)
    SELECTION_7:
        TargetObject: '*\LowRiskFileTypes'
    SELECTION_8:
        Details:
        - '*.zip;*'
        - '*.rar;*'
        - '*.exe;*'
        - '*.bat;*'
        - '*.com;*'
        - '*.cmd;*'
        - '*.reg;*'
        - '*.msi;*'
        - '*.htm;*'
        - '*.html;*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unlikely
id: a9b6c011-ab69-4ddb-bc0a-c4f21c80ec47
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://support.microsoft.com/en-us/topic/information-about-the-attachment-manager-in-microsoft-windows-c48a4dcd-8de5-2af5-ee9b-cd795ae42738
- https://www.virustotal.com/gui/file/2bcd5702a7565952c44075ac6fb946c7780526640d1264f692c7664c02c68465
status: experimental
tags:
- attack.defense_evasion
yml_filename: registry_set_policies_associations_tamper.yml
yml_path: rules/windows/registry/registry_set
---

