title: Changing RDP Port to Non Standard Number
ruletype: Sigma
author: frack113
date: 2022/01/01
description: |
    Remote desktop is a common feature in operating systems.
    It allows a user to log into an interactive session with a system desktop graphical user interface on a remote system.
    Microsoft refers to its implementation of the Remote Desktop Protocol (RDP) as Remote Desktop Services (RDS).
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: HKLM\System\CurrentControlSet\Control\Terminal Server\WinStations\RDP-Tcp\PortNumber
    SELECTION_5:
        Details: DWORD (0x00000d3d)
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: 509e84b9-a71a-40e0-834f-05470369bd1e
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#atomic-test-1---rdp-to-domaincontroller
status: experimental
tags:
- attack.persistence
- attack.t1547.010
yml_filename: registry_set_change_rdp_port.yml
yml_path: rules/windows/registry/registry_set
---

