title: Enabling COR Profiler Environment Variables
id: ad89044a-8f49-4673-9a55-cbd88a1b374f
status: test
description: This rule detects cor_enable_profiling and cor_profiler environment variables
    being set and configured.
references:
    - https://twitter.com/jamieantisocial/status/1304520651248668673
    - https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors
    - https://www.sans.org/cyber-security-summit/archives
author: Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)
date: 2020/09/10
modified: 2023/08/17
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.t1574.012
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 13
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetObject|endswith:
            - \COR_ENABLE_PROFILING
            - \COR_PROFILER
    condition: registry_set and selection
level: high
ruletype: Sigma
