title: Potential Signing Bypass Via Windows Developer Features - Registry
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/12
description: Detects when the enablement of developer features such as "Developer
    Mode" or "Application Sideloading". Which allows the user to install untrusted
    packages.
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject:
        - '*\Microsoft\Windows\CurrentVersion\AppModelUnlock*'
        - '*\Policies\Microsoft\Windows\Appx\\*'
    SELECTION_5:
        TargetObject:
        - '*\AllowAllTrustedApps'
        - '*\AllowDevelopmentWithoutDevLicense'
    SELECTION_6:
        Details: DWORD (0x00000001)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: b110ebaf-697f-4da1-afd5-b536fa27a2c1
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://twitter.com/malmoeb/status/1560536653709598721
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
related:
-   id: a383dec4-deec-4e6e-913b-ed9249670848
    type: similar
status: experimental
tags:
- attack.defense_evasion

