title: Windows Credential Guard Disabled - Registry
id: 25ec1ad5-3ba3-7e1c-9394-a54b1c158c59
related:
    - id: c17d47b7-dcd6-4109-87eb-d1817bd4cbc9
      type: similar
    - id: 73921b9c-cafd-4446-b0c6-fdb0ace42bc0
      type: derived
status: experimental
description: |
    Detects attempts to disable Windows Credential Guard by setting registry values to 0. Credential Guard uses virtualization-based security to isolate secrets so that only privileged system software can access them.
    Adversaries may disable Credential Guard to gain access to sensitive credentials stored in the system, such as NTLM hashes and Kerberos tickets, which can be used for lateral movement and privilege escalation.
references:
    - https://woshub.com/disable-credential-guard-windows/
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-26
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - sysmon
logsource:
    category: registry_set
    product: windows
detection:
    registry_set:
        EventID: 13
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        TargetObject|endswith:
            - \DeviceGuard\EnableVirtualizationBasedSecurity
            - \DeviceGuard\LsaCfgFlags
            - \Lsa\LsaCfgFlags
        Details: DWORD (0x00000000)
    condition: registry_set and selection
falsepositives:
    - Unlikely
level: high
regression_tests_path: regression_data/rules/windows/registry/registry_set/registry_set_credential_guard_disabled/info.yml
ruletype: Sigma
