title: Persistence Via AutodialDLL
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/10
description: Detects change the the "AutodialDLL" key which could be used as a persistence
    method to load custom DLL via the "ws2_32" library
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\Services\WinSock2\Parameters\AutodialDLL*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikley
id: e6fe26ee-d063-4f5b-b007-39e90aaf50e3
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://www.hexacorn.com/blog/2015/01/13/beyond-good-ol-run-key-part-24/
status: experimental
tags:
- attack.persistence
yml_filename: registry_set_persistence_autodial_dll.yml
yml_path: rules/windows/registry/registry_set
---

