title: IE Change Domain Zone
ruletype: Sigma
author: frack113
date: 2022/01/22
description: Hides the file extension through modification of the registry
detection:
    SELECTION_1:
        EventID: 13
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        EventType: SetValue
    SELECTION_4:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Internet Settings\ZoneMap\Domains\\*'
    SELECTION_5:
        Details:
        - DWORD (0x00000000)
        - DWORD (0x00000001)
        - (Empty)
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Administrative scripts
id: 45e112d0-7759-4c2a-aa36-9f8fb79d3393
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/04/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://docs.microsoft.com/en-us/troubleshoot/developer/browsers/security-privacy/ie-security-zones-registry-entries
related:
-   id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1137

