
title: Suspicious Desktopimgdownldr Command
author: Florian Roth
date: 2020/07/03
description: Detects a suspicious Microsoft desktopimgdownldr execution with parameters
  used to download files from the Internet
detection:
  SELECTION_1:
    CommandLine: '* /lockscreenurl:*'
  SELECTION_2:
    CommandLine:
    - '*.jpg*'
    - '*.jpeg*'
    - '*.png*'
  SELECTION_3:
    CommandLine: '*reg delete*'
  SELECTION_4:
    CommandLine: '*\PersonalizationCSP*'
  condition: ((SELECTION_1 and  not (SELECTION_2)) or (SELECTION_3 and SELECTION_4))
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
fields:
- CommandLine
- ParentCommandLine
id: bb58aa4a-b80b-415a-a2c0-2f65a4c81009
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://labs.sentinelone.com/living-off-windows-land-a-new-native-file-downldr/
- https://twitter.com/SBousseaden/status/1278977301745741825
status: test
tags:
- attack.command_and_control
- attack.t1105
