
title: Executable Used by PlugX in Uncommon Location
author: Florian Roth
date: 2017/06/12
description: Detects the execution of an executable that is typically used by PlugX
  for DLL side loading started from an uncommon location
detection:
  SELECTION_1:
    Image: '*\CamMute.exe'
  SELECTION_10:
    Image: '*\HTML Help Workshop\\*'
  SELECTION_11:
    Image: '*\hkcmd.exe'
  SELECTION_12:
    Image:
    - '*\System32\\*'
    - '*\SysNative\\*'
    - '*\SysWow64\\*'
  SELECTION_13:
    Image: '*\Mc.exe'
  SELECTION_14:
    Image:
    - '*\Microsoft Visual Studio*'
    - '*\Microsoft SDK*'
    - '*\Windows Kit*'
  SELECTION_15:
    Image: '*\MsMpEng.exe'
  SELECTION_16:
    Image:
    - '*\Microsoft Security Client\\*'
    - '*\Windows Defender\\*'
    - '*\AntiMalware\\*'
  SELECTION_17:
    Image: '*\msseces.exe'
  SELECTION_18:
    Image:
    - '*\Microsoft Security Center\\*'
    - '*\Microsoft Security Client\\*'
    - '*\Microsoft Security Essentials\\*'
  SELECTION_19:
    Image: '*\OInfoP11.exe'
  SELECTION_2:
    Image:
    - '*\Lenovo\Communication Utility\\*'
    - '*\Lenovo\Communications Utility\\*'
  SELECTION_20:
    Image: '*\Common Files\Microsoft Shared\\*'
  SELECTION_21:
    Image: '*\OleView.exe'
  SELECTION_22:
    Image:
    - '*\Microsoft Visual Studio*'
    - '*\Microsoft SDK*'
    - '*\Windows Kit*'
    - '*\Windows Resource Kit\\*'
  SELECTION_23:
    Image: '*\rc.exe'
  SELECTION_24:
    Image:
    - '*\Microsoft Visual Studio*'
    - '*\Microsoft SDK*'
    - '*\Windows Kit*'
    - '*\Windows Resource Kit\\*'
    - '*\Microsoft.NET\\*'
  SELECTION_3:
    Image: '*\chrome_frame_helper.exe'
  SELECTION_4:
    Image: '*\Google\Chrome\application\\*'
  SELECTION_5:
    Image: '*\dvcemumanager.exe'
  SELECTION_6:
    Image: '*\Microsoft Device Emulator\\*'
  SELECTION_7:
    Image: '*\Gadget.exe'
  SELECTION_8:
    Image: '*\Windows Media Player\\*'
  SELECTION_9:
    Image: '*\hcc.exe'
  condition: ((((((((((((SELECTION_1 and  not (SELECTION_2)) or (SELECTION_3 and  not
    (SELECTION_4))) or (SELECTION_5 and  not (SELECTION_6))) or (SELECTION_7 and  not
    (SELECTION_8))) or (SELECTION_9 and  not (SELECTION_10))) or (SELECTION_11 and  not
    (SELECTION_12))) or (SELECTION_13 and  not (SELECTION_14))) or (SELECTION_15 and  not
    (SELECTION_16))) or (SELECTION_17 and  not (SELECTION_18))) or (SELECTION_19 and  not
    (SELECTION_20))) or (SELECTION_21 and  not (SELECTION_22))) or (SELECTION_23 and  not
    (SELECTION_24)))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: aeab5ec5-be14-471a-80e8-e344418305c2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/28
references:
- http://www.hexacorn.com/blog/2016/03/10/beyond-good-ol-run-key-part-36/
- https://countuponsecurity.com/2017/06/07/threat-hunting-in-the-enterprise-with-appcompatprocessor/
status: test
tags:
- attack.s0013
- attack.defense_evasion
- attack.t1574.002
