
title: WSF/JSE/JS/VBA/VBE File Execution
author: Michael Haag
date: 2019/01/16
description: Detects suspicious file execution by wscript and cscript
detection:
  SELECTION_1:
    Image:
    - '*\wscript.exe'
    - '*\cscript.exe'
  SELECTION_2:
    CommandLine:
    - '*.jse*'
    - '*.vbe*'
    - '*.js*'
    - '*.vba*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Will need to be tuned. I recommend adding the user profile path in CommandLine if
  it is getting too noisy.
fields:
- CommandLine
- ParentCommandLine
id: 1e33157c-53b1-41ad-bbcc-780b80b58288
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
status: test
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
