
title: Exchange Exploitation Activity
author: Florian Roth
date: 2021/03/09
description: Detects activity observed by different researchers to be HAFNIUM group
  activity (or related) on Exchange servers
detection:
  SELECTION_1:
    CommandLine: '*attrib*'
  SELECTION_10:
    CommandLine: '*%TEMP%\execute.bat*'
  SELECTION_11:
    Image: '*Users\Public\opera\Opera_browser.exe'
  SELECTION_12:
    Image: '*Opera_browser.exe'
  SELECTION_13:
    ParentImage:
    - '*\services.exe'
    - '*\svchost.exe'
  SELECTION_14:
    Image: '*\ProgramData\VSPerfMon\\*'
  SELECTION_15:
    CommandLine: '* -t7z *'
  SELECTION_16:
    CommandLine: '*C:\Programdata\pst*'
  SELECTION_17:
    CommandLine: '*\it.zip*'
  SELECTION_18:
    Image: '*\makecab.exe'
  SELECTION_19:
    CommandLine:
    - '*Microsoft\Exchange Server\\*'
    - '*inetpub\wwwroot*'
  SELECTION_2:
    CommandLine: '* +h *'
  SELECTION_20:
    CommandLine:
    - '*\Temp\xx.bat*'
    - '*Windows\WwanSvcdcs*'
    - '*Windows\Temp\cw.exe*'
  SELECTION_21:
    CommandLine: '*\comsvcs.dll*'
  SELECTION_22:
    CommandLine: '*Minidump*'
  SELECTION_23:
    CommandLine: '*\inetpub\wwwroot*'
  SELECTION_24:
    CommandLine: '*dsquery*'
  SELECTION_25:
    CommandLine: '* -uco *'
  SELECTION_26:
    CommandLine: '*\inetpub\wwwroot*'
  SELECTION_3:
    CommandLine: '* +s *'
  SELECTION_4:
    CommandLine: '* +r *'
  SELECTION_5:
    CommandLine: '*.aspx*'
  SELECTION_6:
    CommandLine: '*schtasks*'
  SELECTION_7:
    CommandLine: '*VSPerfMon*'
  SELECTION_8:
    CommandLine: '*vssadmin list shadows*'
  SELECTION_9:
    CommandLine: '*Temp\__output*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9) or SELECTION_10
    or SELECTION_11 or (SELECTION_12 and SELECTION_13) or SELECTION_14 or (SELECTION_15
    and SELECTION_16 and SELECTION_17) or (SELECTION_18 and SELECTION_19) or SELECTION_20
    or (SELECTION_21 and SELECTION_22 and SELECTION_23) or (SELECTION_24 and SELECTION_25
    and SELECTION_26))
falsepositives:
- Unknown
id: bbb2dedd-a0e3-46ab-ba6c-6c82ae7a9aa7
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/03/16
references:
- https://blog.truesec.com/2021/03/07/exchange-zero-day-proxylogon-and-hafnium/
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
- https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3
- https://twitter.com/GadixCRK/status/1369313704869834753?s=20
- https://twitter.com/BleepinComputer/status/1372218235949617161
status: experimental
tags:
- attack.persistence
- attack.t1546
- attack.t1053
