title: CHCP CodePage Locale Lookup
ruletype: Sigma
author: _pete_0, TheDFIRReport
date: 2022/02/21
description: Detects use of chcp to look up the system locale value as part of host
    discovery
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\cmd.exe'
    SELECTION_4:
        ParentCommandLine: '* /c *'
    SELECTION_5:
        NewProcessName: '*\chcp.com'
    SELECTION_6:
        CommandLine:
        - '*chcp'
        - '*chcp '
        - '*chcp  '
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 7090adee-82e2-4269-bd59-80691e7c6338
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/04/21
references:
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/chcp
status: experimental
tags:
- attack.discovery
- attack.t1614.001
yml_filename: proc_creation_win_susp_codepage_lookup.yml
yml_path: rules/windows/process_creation
---

