title: Python Spawning Pretty TTY on Windows
ruletype: Sigma
author: Nextron Systems
date: 2022/06/03
description: Detects python spawning a pretty tty
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*python.exe'
        - '*python3.exe'
        - '*python2.exe'
    SELECTION_4:
        CommandLine: '*import pty*'
    SELECTION_5:
        CommandLine: '*.spawn(*'
    SELECTION_6:
        CommandLine: '*from pty import spawn*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and ((SELECTION_4 and
        SELECTION_5) or SELECTION_6))
falsepositives:
- Unknown
id: 480e7e51-e797-47e3-8d72-ebfce65b6d8d
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
status: experimental
tags:
- attack.execution
- attack.t1059
yml_filename: proc_creation_win_python_pty_spawn.yml
yml_path: rules/windows/process_creation
---

