
title: Disable Important Scheduled Task
author: frack113
date: 2021/12/26
description: Adversaries may stop services or processes in order to conduct Data Destruction
  or Data Encrypted for Impact on the data stores of services like Exchange and SQL
  Server.
detection:
  SELECTION_1:
    Image: '*\schtasks.exe'
  SELECTION_2:
    CommandLine: '*/Change*'
  SELECTION_3:
    CommandLine: '*/TN*'
  SELECTION_4:
    CommandLine: '*/disable*'
  SELECTION_5:
    CommandLine: '*\Microsoft\Windows\SystemRestore\SR*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 9ac94dc8-9042-493c-ba45-3b5e7c86b980
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-8---windows---disable-the-sr-scheduled-task
status: experimental
tags:
- attack.impact
- attack.t1489
