title: RedMimicry Winnti Playbook Execute
ruletype: Sigma
author: Alexander Rausch
date: 2020/06/24
description: Detects actions caused by the RedMimicry Winnti playbook
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*rundll32.exe*'
        - '*cmd.exe*'
    SELECTION_4:
        CommandLine:
        - '*gthread-3.6.dll*'
        - '*\Windows\Temp\tmp.bat*'
        - '*sigcmm-2.4.dll*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 95022b85-ff2a-49fa-939a-d7b8f56eeb9b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://redmimicry.com
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1106
- attack.t1059.003
- attack.t1218.011
yml_filename: proc_creation_win_redmimicry_winnti_proc.yml
yml_path: rules/windows/process_creation
---

