
title: Suspicious Shells Spawn by Java Utility Keytool
ruletype: Sigma
author: Andreas Hunkeler (@Karneades)
date: 2021/12/22
description: Detects suspicious shell spawn from Java utility keytool process (e.g.
  adselfservice plus exploitation)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    ParentImage: '*\keytool.exe'
  SELECTION_3:
    Image:
    - '*\cmd.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\powershell.exe'
    - '*\schtasks.exe'
    - '*\certutil.exe'
    - '*\whoami.exe'
    - '*\bitsadmin.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\scrcons.exe'
    - '*\regsvr32.exe'
    - '*\hh.exe'
    - '*\wmic.exe'
    - '*\mshta.exe'
    - '*\rundll32.exe'
    - '*\forfiles.exe'
    - '*\scriptrunner.exe'
    - '*\mftrace.exe'
    - '*\AppVLP.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 90fb5e62-ca1f-4e22-b42e-cc521874c938
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://redcanary.com/blog/intelligence-insights-december-2021
- https://www.synacktiv.com/en/publications/how-to-exploit-cve-2021-40539-on-manageengine-adselfservice-plus.html
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
