title: Suspicious GrpConv Execution
ruletype: Sigma
author: Florian Roth
date: 2022/05/19
description: Detects the suspicious execution of a utility to convert Windows 3.x
    .grp files or for persistence purposes by malicious software or actors
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*grpconv.exe -o*'
        - '*grpconv -o*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: f14e169e-9978-4c69-acb3-1cff8200bc36
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/0gtweet/status/1526833181831200770
status: experimental
tags:
- attack.persistence
- attack.t1547
yml_filename: proc_creation_win_lolbin_susp_grpconv.yml
yml_path: rules/windows/process_creation
---

