
title: Abuse of Service Permissions to Hide Services in Tools
author: Andreas Hunkeler (@Karneades)
date: 2021/12/20
description: Detection of sc.exe utility adding a new service with special permission
  which hides that service.
detection:
  SELECTION_1:
    Image: '*\sc.exe'
  SELECTION_2:
    CommandLine: '*sdset*'
  SELECTION_3:
    CommandLine: '*DCLCWPDTSD*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Intended use of hidden services
id: a537cfc3-4297-4789-92b5-345bfd845ad0
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://blog.talosintelligence.com/2021/10/threat-hunting-in-large-datasets-by.html
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
status: experimental
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.011
