title: Devtoolslauncher.exe Executes Specified Binary
ruletype: Sigma
author: Beyu Denis, oscd.community (rule), @_felamos (idea)
date: 2019/10/12
description: The Devtoolslauncher.exe executes other binary
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\devtoolslauncher.exe'
    SELECTION_4:
        CommandLine: '*LaunchForDeploy*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of devtoolslauncher.exe by legitimate user
id: cc268ac1-42d9-40fd-9ed3-8c4e1a5b87e6
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Devtoolslauncher/
- https://twitter.com/_felamos/status/1179811992841797632
status: test
tags:
- attack.defense_evasion
- attack.t1218
yml_filename: proc_creation_win_susp_devtoolslauncher.yml
yml_path: rules/windows/process_creation
---

