title: Suspicious Sc Query
ruletype: Sigma
author: frack113
date: 2021/12/06
description: Adversaries may try to get information about registered services
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*sc query*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 57712d7a-679c-4a41-a913-87e7175ae429
level: low
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1007/T1007.md#atomic-test-1---system-service-discovery
status: experimental
tags:
- attack.discovery
- attack.t1007
yml_filename: proc_creation_win_susp_sc_query.yml
yml_path: rules/windows/process_creation
---

