
title: Write Protect For Storage Disabled
author: Sreeman
date: 2021/06/11
description: Looks for changes to registry to disable any write-protect property for
  storage devices. This could be a precursor to a ransomware attack and has been an
  observed technique used by cypherpunk group.
detection:
  SELECTION_1:
    CommandLine: '*reg add*'
  SELECTION_2:
    CommandLine: '*hklm\system\currentcontrolset\control*'
  SELECTION_3:
    CommandLine: '*write protection*'
  SELECTION_4:
    CommandLine: '*0*'
  SELECTION_5:
    CommandLine:
    - '*storage*'
    - '*storagedevicepolicies*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- none observed
id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/07
status: experimental
tags:
- attack.defense_evasion
- attack.t1562
