
title: Mimikatz Command Line
author: Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim
  Shelton
date: 2019/10/22
description: Detection well-known mimikatz command line arguments
detection:
  SELECTION_1:
    CommandLine:
    - '*DumpCreds*'
    - '*invoke-mimikatz*'
  SELECTION_2:
    CommandLine:
    - '*rpc*'
    - '*token*'
    - '*crypto*'
    - '*dpapi*'
    - '*sekurlsa*'
    - '*kerberos*'
    - '*lsadump*'
    - '*privilege*'
    - '*process*'
    - '*vault*'
  SELECTION_3:
    CommandLine:
    - '*::*'
  SELECTION_4:
    CommandLine:
    - '*aadcookie*'
    - '*detours*'
    - '*memssp*'
    - '*mflt*'
    - '*ncroutemon*'
    - '*ngcsign*'
    - '*printnightmare*'
    - '*skeleton*'
    - '*preshutdown*'
    - '*mstsc*'
    - '*multirdp*'
  SELECTION_5:
    CommandLine:
    - '*::*'
  SELECTION_6:
    CommandLine:
    - '*function Convert-GuidToCompressedGuid*'
  condition: (((SELECTION_1 or (SELECTION_2 and SELECTION_3)) or (SELECTION_4 and
    SELECTION_5)) and  not ((SELECTION_6)))
falsepositives:
- Legitimate Administrator using tool for password recovery
id: a642964e-bead-4bed-8910-1bb4d63e3b4d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/07
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://tools.thehacker.recipes/mimikatz/modules
status: test
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- attack.t1003.006
