
title: Execution Of Non-Existing File
author: Max Altgelt
date: 2021/12/09
description: Checks whether the image specified in a process creation event is not
  a full, absolute path (caused by process ghosting or other unorthodox methods to
  start a process)
detection:
  SELECTION_1:
    Image: '*\\*'
  SELECTION_2:
    Image|re: ^$
  SELECTION_3:
    Image:
    - '-'
    - ''
  SELECTION_4:
    Image:
    - Registry
    - MemCompression
  SELECTION_5:
    CommandLine:
    - Registry
    - MemCompression
  condition: ( not (SELECTION_1) and  not ((SELECTION_2) or (SELECTION_3) or (SELECTION_4
    or SELECTION_5)))
falsepositives:
- unknown
id: 71158e3f-df67-472b-930e-7d287acaa3e1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/08
references:
- https://pentestlaboratories.com/2021/12/08/process-ghosting/
status: experimental
tags:
- attack.defense_evasion
