
title: UAC Bypass Using ComputerDefaults
author: Christian Burkard
date: 2021/08/31
description: Detects the pattern of UAC Bypass using computerdefaults.exe (UACMe 59)
detection:
  SELECTION_1:
    IntegrityLevel:
    - High
    - System
  SELECTION_2:
    Image: C:\Windows\System32\ComputerDefaults.exe
  SELECTION_3:
    ParentImage:
    - '*:\Windows\System32*'
    - '*:\Program Files*'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Unknown
id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
