
title: Password Provided In Command Line Of Net.exe
author: Tim Shelton (HAWK.IO)
date: 2021/12/09
description: Detects a when net.exe is called with a password in the command line
detection:
  SELECTION_1:
    Image: C:\Windows\System32\net.exe
  SELECTION_2:
    CommandLine: '*net*'
  SELECTION_3:
    CommandLine: '* use *'
  SELECTION_4:
    CommandLine: '*:*\\\*'
  SELECTION_5:
    CommandLine: '*/USER:* *'
  SELECTION_6:
    CommandLine: '* '
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6)))
falsepositives:
- Unknown
id: d4498716-1d52-438f-8084-4a603157d131
level: medium
logsource:
  category: process_creation
  product: windows
references:
- Internal Research
status: experimental
