
title: ShimCache Flush
author: Florian Roth
date: 2021/02/01
description: Detects actions that clear the local ShimCache and remove forensic evidence
detection:
  SELECTION_1:
    CommandLine: '*rundll32*'
  SELECTION_2:
    CommandLine: '*apphelp.dll*'
  SELECTION_3:
    CommandLine:
    - '*ShimFlushCache*'
    - '*#250*'
  SELECTION_4:
    CommandLine: '*kernel32.dll*'
  SELECTION_5:
    CommandLine:
    - '*BaseFlushAppcompatCache*'
    - '*#46*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
- ParentCommandLine
id: b0524451-19af-4efa-a46f-562a977f792e
level: critical
logsource:
  category: process_creation
  product: windows
references:
- https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
