
title: GatherNetworkInfo.vbs Script Usage
ruletype: Sigma
author: blueteamer8699
date: 2022/01/03
description: Adversaries can abuse of C:\Windows\System32\gatherNetworkInfo.vbs script
  along with cscript.exe to gather information about the target
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*cscript.exe*'
  SELECTION_3:
    CommandLine: '*gatherNetworkInfo.vbs*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Administrative activity
fields:
- CommandLine
- ParentImage
id: 575dce0c-8139-4e30-9295-1ee75969f7fe
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://posts.slayerlabs.com/living-off-the-land/#gathernetworkinfovbs
status: experimental
tags:
- attack.discovery
- attack.group_policy_discovery
- attack.execution
- attack.command_and_scripting_interpreter
- attack.visual_basic
- attack.t1059.005
