
title: Cmd.exe CommandLine Path Traversal
author: xknow @xknow_infosec
date: 2020/06/11
description: detects the usage of path traversal in cmd.exe indicating possible command/argument
  confusion/hijacking
detection:
  SELECTION_1:
    ParentCommandLine: '*cmd*'
  SELECTION_2:
    ParentCommandLine: '*/c*'
  SELECTION_3:
    CommandLine: '*/../../*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- (not much) some benign Java tools may product false-positive commandlines for loading
  libraries
id: 087790e3-3287-436c-bccf-cbd0184a7db1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/
- https://twitter.com/Oddvarmoe/status/1270633613449723905
status: test
tags:
- attack.execution
- attack.t1059.003
