
title: Suspicious Msiexec Quiet Install
author: frack113
date: 2022/01/16
description: |
  Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.
  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)
detection:
  SELECTION_1:
    Image: '*\msiexec.exe'
  SELECTION_2:
    CommandLine: '* /i*'
  SELECTION_3:
    CommandLine: '* /q*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitim script
id: 79a87aa6-e4bd-42fc-a5bb-5e6fbdcd62f5
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.007
