title: Shells Spawned by Java
ruletype: Sigma
author: Andreas Hunkeler (@Karneades), Nasreddine Bencherchali
date: 2021/12/17
description: Detects shell spawned from Java host process, which could be a sign of
    exploitation (e.g. log4j exploitation)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\java.exe'
    SELECTION_4:
        NewProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_5:
        ParentProcessName: '*build*'
    SELECTION_6:
        CommandLine: '*build*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/27
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
yml_filename: proc_creation_win_shell_spawn_by_java.yml
yml_path: rules/windows/process_creation
---

