title: PowerShell Get-Process LSASS
ruletype: Sigma
author: Florian Roth
date: 2021/04/23
description: Detects a Get-Process command on lsass process, which is in almost all
    cases a sign of malicious activity
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*Get-Process lsass*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: b2815d0d-7481-4bf0-9b6c-a4c48a94b349
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/PythonResponder/status/1385064506049630211
status: experimental
tags:
- attack.credential_access
- attack.t1552.004
yml_filename: proc_creation_win_susp_powershell_getprocess_lsass.yml
yml_path: rules/windows/process_creation
---

