title: Remote Code Execute via Winrm.vbs
ruletype: Sigma
author: Julia Fomina, oscd.community
date: 2020/10/07
description: Detects an attempt to execute code or create service on remote host via
    winrm.vbs.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\cscript.exe'
    SELECTION_4:
        OriginalFileName: cscript.exe
    SELECTION_5:
        CommandLine: '*winrm*'
    SELECTION_6:
        CommandLine: '*invoke Create wmicimv2/Win32_*'
    SELECTION_7:
        CommandLine: '*-r:http*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Legitimate use for administartive purposes. Unlikely
id: 9df0dd3a-1a5c-47e3-a2bc-30ed177646a0
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/05/13
references:
- https://twitter.com/bohops/status/994405551751815170
- https://redcanary.com/blog/lateral-movement-winrm-wmi/
status: test
tags:
- attack.defense_evasion
- attack.t1216
yml_filename: proc_creation_win_susp_winrm_execution.yml
yml_path: rules/windows/process_creation
---

