
title: Firewall Disabled via Netsh
author: Fatih Sirin
date: 2019/11/01
description: Detects netsh commands that turns off the Windows firewall
detection:
  SELECTION_1:
    CommandLine: '*netsh*'
  SELECTION_2:
    CommandLine: '*set*'
  SELECTION_3:
    CommandLine: '*firewall*'
  SELECTION_4:
    CommandLine: '*opmode*'
  SELECTION_5:
    CommandLine: '*mode=disable*'
  SELECTION_6:
    CommandLine: '*advfirewall*'
  SELECTION_7:
    CommandLine: '*state*'
  SELECTION_8:
    CommandLine: '*off*'
  condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate administration
id: 57c4bf16-227f-4394-8ec7-1b745ee061c3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/09
references:
- https://www.winhelponline.com/blog/enable-and-disable-windows-firewall-quickly-using-command-line/
- https://app.any.run/tasks/210244b9-0b6b-4a2c-83a3-04bd3175d017/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.004/T1562.004.md#atomic-test-1---disable-microsoft-defender-firewall
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
- attack.s0108
