title: Suspicious Curl Change User Agents
ruletype: Sigma
author: frack113
date: 2022/01/23
description: Detects a suspicious curl process start on Windows with set useragent
    options
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\curl.exe'
    SELECTION_4:
        Product: The curl executable
    SELECTION_5:
        CommandLine:
        - '* -A *'
        - '* --user-agent *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: 3286d37a-00fd-41c2-a624-a672dcd34e60
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://curl.se/docs/manpage.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1071.001/T1071.001.md#atomic-test-2---malicious-user-agents---cmd
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
yml_filename: proc_creation_win_susp_curl_useragent.yml
yml_path: rules/windows/process_creation
---

