
title: Meterpreter or Cobalt Strike Getsystem Service Start
author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service starting
detection:
  SELECTION_1:
    ParentImage: '*\services.exe'
  SELECTION_10:
    CommandLine: '*cmd.exe*'
  SELECTION_11:
    CommandLine: '*/c*'
  SELECTION_12:
    CommandLine: '*echo*'
  SELECTION_13:
    CommandLine: '*\pipe\\*'
  SELECTION_14:
    CommandLine: '*rundll32*'
  SELECTION_15:
    CommandLine: '*.dll,a*'
  SELECTION_16:
    CommandLine: '*/p:*'
  SELECTION_17:
    CommandLine: '*MpCmdRun*'
  SELECTION_2:
    CommandLine: '*cmd*'
  SELECTION_3:
    CommandLine: '*/c*'
  SELECTION_4:
    CommandLine: '*echo*'
  SELECTION_5:
    CommandLine: '*\pipe\\*'
  SELECTION_6:
    CommandLine: '*%COMSPEC%*'
  SELECTION_7:
    CommandLine: '*/c*'
  SELECTION_8:
    CommandLine: '*echo*'
  SELECTION_9:
    CommandLine: '*\pipe\\*'
  condition: ((SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9) or (SELECTION_10
    and SELECTION_11 and SELECTION_12 and SELECTION_13) or (SELECTION_14 and SELECTION_15
    and SELECTION_16))) and  not (SELECTION_17))
falsepositives:
- Commandlines containing components like cmd accidentally
- Jobs and services started with cmd
fields:
- ComputerName
- User
- CommandLine
id: 15619216-e993-4721-b590-4c520615a67d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/05/20
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
status: experimental
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
