title: SyncAppvPublishingServer VBS Execute Arbitrary PowerShell Code
ruletype: Sigma
author: frack113
date: 2021/07/16
description: Executes arbitrary PowerShell code using SyncAppvPublishingServer.vbs
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*\SyncAppvPublishingServer.vbs*'
    SELECTION_4:
        CommandLine: '*;*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 36475a7d-0f6d-4dce-9b01-6aeb473bbaf1
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/06/22
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md
- https://lolbas-project.github.io/lolbas/Binaries/Syncappvpublishingserver/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1216
yml_filename: proc_creation_win_lolbin_syncappvpublishingserver_vbs_execute_psh.yml
yml_path: rules/windows/process_creation
---

