
title: Non-privileged Usage of Reg or Powershell
author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
date: 2020/10/05
description: Search for usage of reg or Powershell by non-priveleged users to modify
  service configuration in registry
detection:
  SELECTION_1:
    IntegrityLevel: Medium
  SELECTION_2:
    CommandLine: '*reg*'
  SELECTION_3:
    CommandLine: '*add*'
  SELECTION_4:
    CommandLine: '*powershell*'
  SELECTION_5:
    CommandLine:
    - '*set-itemproperty*'
    - '* sp *'
    - '*new-itemproperty*'
  SELECTION_6:
    CommandLine: '*ControlSet*'
  SELECTION_7:
    CommandLine: '*Services*'
  SELECTION_8:
    CommandLine:
    - '*ImagePath*'
    - '*FailureCommand*'
    - '*ServiceDLL*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5))
    and (SELECTION_6 and SELECTION_7) and SELECTION_8)
falsepositives:
- Unknown
fields:
- EventID
- IntegrityLevel
- CommandLine
id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
status: test
tags:
- attack.defense_evasion
- attack.t1112
