
title: Squirrel Lolbin
author: Karneades / Markus Neis, Jonhnathan Ribeiro, oscd.community
date: 2019/11/12
description: Detects Possible Squirrel Packages Manager as Lolbin
detection:
  SELECTION_1:
    Image: '*\update.exe'
  SELECTION_2:
    CommandLine:
    - '*--processStart*'
    - '*--processStartAndWait*'
    - '*--createShortcut*'
  SELECTION_3:
    CommandLine: '*.exe*'
  SELECTION_4:
    CommandLine: '*C:\Users\\*'
  SELECTION_5:
    CommandLine: '*\AppData\Local\Discord\Update.exe*'
  SELECTION_6:
    CommandLine: '* --processStart Discord.exe*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and  not ((SELECTION_4
    and SELECTION_5 and SELECTION_6)))
falsepositives:
- 1Clipboard
- Beaker Browser
- Caret
- Collectie
- Discord
- Figma
- Flow
- Ghost
- GitHub Desktop
- GitKraken
- Hyper
- Insomnia
- JIBO
- Kap
- Kitematic
- Now Desktop
- Postman
- PostmanCanary
- Rambox
- Simplenote
- Skype
- Slack
- SourceTree
- Stride
- Svgsus
- WebTorrent
- WhatsApp
- WordPress.com
- atom
- gitkraken
- slack
- teams
id: fa4b21c9-0057-4493-b289-2556416ae4d7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/12
references:
- http://www.hexacorn.com/blog/2019/03/30/sqirrel-packages-manager-as-a-lolbin-a-k-a-many-electron-apps-are-lolbins-by-default/
- http://www.hexacorn.com/blog/2018/08/16/squirrel-as-a-lolbin/
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
