
title: Suspicious OfflineScannerShell.exe Execution From Another Folder
author: frack113
date: 2022/03/06
description: Use OfflineScannerShell.exe to execute mpclient.dll library in the current
  working directory
detection:
  SELECTION_1:
    Image: '*\OfflineScannerShell.exe'
  SELECTION_2:
    CurrentDirectory: C:\Program Files\Windows Defender\Offline\
  SELECTION_3:
    CurrentDirectory|re: ^$
  condition: (SELECTION_1 and  not ((SELECTION_2) or (SELECTION_3)))
falsepositives:
- unknown
id: 02b18447-ea83-4b1b-8805-714a8a34546a
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
