
title: Esentutl Steals Browser Information
author: frack113
date: 2022/02/13
description: One way Qbot steals sensitive information is by extracting browser data
  from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe
detection:
  SELECTION_1:
    Image: '*\esentutl.exe'
  SELECTION_2:
    CommandLine: '*/r *'
  SELECTION_3:
    CommandLine: '*\Windows\WebCache*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- legitimate use
id: 6a69f62d-ce75-4b57-8dce-6351eb55b362
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
- https://redcanary.com/threat-detection-report/threats/qbot/
status: experimental
tags:
- attack.collection
- attack.t1005
