
title: Suspicious Calculator Usage
author: Florian Roth
date: 2019/02/09
description: Detects suspicious use of calc.exe with command line parameters or in
  a suspicious directory, which is likely caused by some PoC or detection evasion
detection:
  SELECTION_1:
    CommandLine: '*\calc.exe *'
  SELECTION_2:
    Image: '*\calc.exe'
  SELECTION_3:
    Image: '*\Windows\Sys*'
  condition: (SELECTION_1 or (SELECTION_2 and  not (SELECTION_3)))
falsepositives:
- Unknown
id: 737e618a-a410-49b5-bec3-9e55ff7fbc15
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://twitter.com/ItsReallyNick/status/1094080242686312448
status: test
tags:
- attack.defense_evasion
- attack.t1036
