title: Local Accounts Discovery
ruletype: Sigma
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: 2019/10/21
description: Local accounts, System Owner/User discovery using operating systems utilities
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        NewProcessName: '*\cmd.exe'
    SELECTION_11:
        CommandLine: '* /c*'
    SELECTION_12:
        CommandLine: '*dir *'
    SELECTION_13:
        CommandLine: '*\Users\\*'
    SELECTION_14:
        CommandLine: '* rmdir *'
    SELECTION_15:
        NewProcessName:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_16:
        CommandLine: '*user*'
    SELECTION_17:
        CommandLine:
        - '*/domain*'
        - '*/add*'
        - '*/delete*'
        - '*/active*'
        - '*/expires*'
        - '*/passwordreq*'
        - '*/scriptpath*'
        - '*/times*'
        - '*/workstations*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\whoami.exe'
    SELECTION_4:
        NewProcessName: '*\wmic.exe'
    SELECTION_5:
        CommandLine: '*useraccount*'
    SELECTION_6:
        CommandLine: '*get*'
    SELECTION_7:
        NewProcessName:
        - '*\quser.exe'
        - '*\qwinsta.exe'
    SELECTION_8:
        NewProcessName: '*\cmdkey.exe'
    SELECTION_9:
        CommandLine: '* /l*'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or (SELECTION_4 and
        SELECTION_5 and SELECTION_6) or SELECTION_7 or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11 and SELECTION_12 and SELECTION_13)) and  not
        (SELECTION_14)) or ((SELECTION_15 and SELECTION_16) and  not (SELECTION_17))))
falsepositives:
- Legitimate administrator or user enumerates local users for legitimate reason
fields:
- Image
- CommandLine
- User
- LogonGuid
- Hashes
- ParentProcessGuid
- ParentCommandLine
id: 502b42de-4306-40b4-9596-6f590c81f073
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/06/12
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1033/T1033.md
status: test
tags:
- attack.discovery
- attack.t1033
- attack.t1087.001
yml_filename: proc_creation_win_local_system_owner_account_discovery.yml
yml_path: rules/windows/process_creation
---

