
title: Too Long PowerShell Commandlines
author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects Too long PowerShell command lines
detection:
  SELECTION_1:
    CommandLine:
    - '*powershell*'
    - '*pwsh*'
  SELECTION_2:
    Description: Windows Powershell
  SELECTION_3:
    Product: PowerShell Core 6
  SELECTION_4:
    CommandLine|re: .{1000,}
  condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4)
falsepositives:
- Unknown
id: d0d28567-4b9a-45e2-8bbc-fb1b66a1f7f6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/12/02
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: experimental
tags:
- attack.execution
- attack.t1059.001
