
title: Monitoring Wuauclt.exe For Lolbas Execution Of DLL
author: Sreeman
date: 2020/10/29
description: Adversaries can abuse wuauclt.exe (Windows Update client) to run code
  execution by specifying an arbitrary DLL.
detection:
  SELECTION_1:
    CommandLine: '*wuauclt.exe*'
  SELECTION_2:
    CommandLine: '*/UpdateDeploymentProvider*'
  SELECTION_3:
    CommandLine: '*/Runhandlercomserver*'
  SELECTION_4:
    CommandLine:
    - '*wuaueng.dll*'
    - '*UpdateDeploymentProvider.dll /ClassId*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Wuaueng.dll which is a module belonging to Microsoft Windows Update.
fields:
- CommandLine
id: ba1bb0cb-73da-42de-ad3a-de10c643a5d0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/07
references:
- https://dtm.uk/wuauclt/
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
