
title: Suspicious Execution of Powershell with Base64
author: frack113
date: 2022/01/02
description: Commandline to lauch powershell with a base64 payload
detection:
  SELECTION_1:
    Image: '*\powershell.exe'
  SELECTION_2:
    CommandLine:
    - '* -e *'
    - '* -en *'
    - '* -enc *'
    - '* -enco*'
    - '* -ec *'
  SELECTION_3:
    CommandLine:
    - '* -Encoding *'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Unknown
id: fb843269-508c-4b76-8b8d-88679db22ce7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/10
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.001/T1059.001.md#atomic-test-20---powershell-invoke-known-malicious-cmdlets
- https://unit42.paloaltonetworks.com/unit42-pulling-back-the-curtains-on-encodedcommand-powershell-attacks/
- https://mikefrobbins.com/2017/06/15/simple-obfuscation-with-powershell-using-base64-encoding/
status: experimental
tags:
- attack.execution
- attack.t1059.001
