
title: Use Radmin Viewer Utility
author: frack113
date: 2022/01/22
description: An adversary may use Radmin Viewer Utility to remotely control Windows
  device
detection:
  SELECTION_1:
    Description: Radmin Viewer
  SELECTION_2:
    Product: Radmin Viewer
  SELECTION_3:
    OriginalFileName: Radmin.exe
  condition: (SELECTION_1 or SELECTION_2 or SELECTION_3)
falsepositives:
- Unknown
id: 5817e76f-4804-41e6-8f1d-5fa0b3ecae2d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1072/T1072.md#atomic-test-1---radmin-viewer-utility
- https://www.radmin.fr/
status: experimental
tags:
- attack.execution
- attack.lateral_movement
- attack.t1072
