
title: Service ImagePath Change with Reg.exe
ruletype: Sigma
author: frack113
date: 2021/12/30
description: |
  Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services.
  Adversaries may use flaws in the permissions for registry to redirect from the originally specified executable to one that they control, in order to launch their own code at Service start.
  Windows stores local service configuration information in the Registry under HKLM\SYSTEM\CurrentControlSet\Services
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\reg.exe'
  SELECTION_3:
    CommandLine: '*add *'
  SELECTION_4:
    CommandLine: '*SYSTEM\CurrentControlSet\Services\\*'
  SELECTION_5:
    CommandLine: '* ImagePath *'
  SELECTION_6:
    CommandLine:
    - '* /d *'
    - '* -d *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 9b0b7ac3-6223-47aa-a3fd-e8f211e637db
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/29
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1574.011/T1574.011.md#atomic-test-2---service-imagepath-change-with-regexe
status: experimental
tags:
- attack.persistence
- attack.t1574.011
