
title: Suspicious Reg Add Open Command
ruletype: Sigma
author: frack113
date: 2021/12/20
description: Threat actors performed dumping of SAM, SECURITY and SYSTEM registry
  hives using DelegateExecute key
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*/v*'
  SELECTION_11:
    CommandLine: '*DelegateExecute*'
  SELECTION_12:
    CommandLine: '*reg*'
  SELECTION_13:
    CommandLine: '*delete*'
  SELECTION_14:
    CommandLine: '*hkcu\software\classes\ms-settings*'
  SELECTION_2:
    CommandLine: '*reg*'
  SELECTION_3:
    CommandLine: '*add*'
  SELECTION_4:
    CommandLine: '*hkcu\software\classes\ms-settings\shell\open\command*'
  SELECTION_5:
    CommandLine: '*/ve *'
  SELECTION_6:
    CommandLine: '*/d*'
  SELECTION_7:
    CommandLine: '*reg*'
  SELECTION_8:
    CommandLine: '*add*'
  SELECTION_9:
    CommandLine: '*hkcu\software\classes\ms-settings\shell\open\command*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9 and SELECTION_10
    and SELECTION_11) or (SELECTION_12 and SELECTION_13 and SELECTION_14)))
falsepositives:
- Unknown
id: dd3ee8cc-f751-41c9-ba53-5a32ed47e563
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
status: experimental
tags:
- attack.credential_access
- attack.t1003
