
title: Stop Windows Service
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
description: Detects a windows service to be stopped
detection:
  SELECTION_1:
    Image:
    - '*\sc.exe'
    - '*\net.exe'
    - '*\net1.exe'
  SELECTION_2:
    CommandLine: '*stop*'
  SELECTION_3:
    CommandLine: sc  stop KSCWebConsoleMessageQueue
  SELECTION_4:
    User:
    - NT AUTHORITY\SYSTEM*
    - AUTORITE NT\Sys*
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3 and SELECTION_4))
falsepositives:
- Administrator shutting down the service due to upgrade or removal purposes
fields:
- ComputerName
- User
- CommandLine
id: eb87818d-db5d-49cc-a987-d5da331fbd90
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/11/30
status: experimental
tags:
- attack.impact
- attack.t1489
