title: Suspicious DumpMinitool Usage
ruletype: Sigma
author: Florian Roth
date: 2022/04/06
description: Detects suspicious ways to use of a Visual Studio bundled tool named
    DumpMinitool.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\DumpMinitool.exe'
    SELECTION_4:
        OriginalName: DumpMinitool.exe
    SELECTION_5:
        NewProcessName:
        - '*\Microsoft Visual Studio\\*'
        - '*\Extensions\\*'
    SELECTION_6:
        CommandLine: '*.txt*'
    SELECTION_7:
        CommandLine: '* Full*'
    SELECTION_8:
        CommandLine: '*--dumpType*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (( not (SELECTION_5) or SELECTION_6) or (SELECTION_7 and  not (SELECTION_8))))
falsepositives:
- Unknown
id: eb1c4225-1c23-4241-8dd4-051389fde4ce
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
yml_filename: proc_creation_win_proc_dump_susp_dumpminitool.yml
yml_path: rules/windows/process_creation
---

