
title: Wlrmdr Lolbin Use as Laucher
author: frack113
date: 2022/02/16
description: Detects use of Wlrmdr.exe in which the -u parameter is passed to ShellExecute
detection:
  SELECTION_1:
    Image: '*wlrmdr.exe'
  SELECTION_2:
    CommandLine: '*-s *'
  SELECTION_3:
    CommandLine: '*-f *'
  SELECTION_4:
    CommandLine: '*-t *'
  SELECTION_5:
    CommandLine: '*-m *'
  SELECTION_6:
    CommandLine: '*-a *'
  SELECTION_7:
    CommandLine: '*-u *'
  SELECTION_8:
    ParentImage: C:\Windows\System32\winlogon.exe
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7) and  not (SELECTION_8))
falsepositives:
- Unknown
id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/21
references:
- https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
status: experimental
tags:
- attack.defense_evasion
