title: Suspicious Execution Of PDQDeployRunner
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/22
description: Detects suspicious execution of "PDQDeployRunner" which is part of the
    PDQDeploy service stack that is responsible for executing commands and packages
    on a remote machines
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*PDQDeployRunner-*'
    SELECTION_4:
        NewProcessName:
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\rundll32.exe'
        - '*\regsvr32.exe'
        - '*\wmic.exe'
        - '*\msiexec.exe'
        - '*\mshta.exe'
        - '*\csc.exe'
        - '*\dllhost.exe'
        - '*\certutil.exe'
        - '*\scriptrunner.exe'
        - '*\bash.exe'
        - '*\wsl.exe'
    SELECTION_5:
        NewProcessName:
        - '*C:\Users\Public\\*'
        - '*C:\ProgramData\\*'
        - '*C:\Windows\TEMP\\*'
        - '*\AppData\Local\Temp*'
    SELECTION_6:
        CommandLine:
        - '*iex *'
        - '*Invoke-*'
        - '*DownloadString*'
        - '*http*'
        - '* -enc *'
        - '* -encodedcommand *'
        - '*FromBase64String*'
        - '* -decode *'
        - '* -w hidden*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5 or SELECTION_6))
falsepositives:
- Legitimate use of the PDQDeploy tool to execute these commands
id: 12b8e9f5-96b2-41e1-9a42-8c6779a5c184
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/malmoeb/status/1550483085472432128
status: experimental
tags:
- attack.execution
yml_filename: proc_creation_win_pdqdeploy_runner_susp_children.yml
yml_path: rules/windows/process_creation
---

