
title: Suspicious Listing of Network Connections
author: frack113
date: 2021/12/10
description: Adversaries may attempt to get a listing of network connections to or
  from the compromised system they are currently accessing or from remote systems
  by querying for information over the network.
detection:
  SELECTION_1:
    CommandLine: '*netstat*'
  SELECTION_2:
    CommandLine: '*net *'
  SELECTION_3:
    CommandLine:
    - '* use'
    - '* sessions'
  SELECTION_4:
    CommandLine:
    - '* use *'
    - '* sessions *'
  condition: (SELECTION_1 or (SELECTION_2 and (SELECTION_3 or SELECTION_4)))
falsepositives:
- unknown
id: 1c67a717-32ba-409b-a45d-0fb704a73a81
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/12/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery
status: experimental
tags:
- attack.discovery
- attack.t1049
