
title: Command Line Path Traversal Evasion
author: Christian Burkard
date: 2021/10/26
description: Detects the attempt to evade or obfuscate the executed command on the
  CommandLine using bogus path traversal
detection:
  SELECTION_1:
    Image: '*\Windows\\*'
  SELECTION_2:
    CommandLine:
    - '*\..\Windows\\*'
    - '*\..\System32\\*'
    - '*\..\..\\*'
  SELECTION_3:
    CommandLine: '*.exe\..\\*'
  SELECTION_4:
    CommandLine: '*\Google\Drive\googledrivesync.exe\..\\*'
  condition: (((SELECTION_1 and SELECTION_2) or SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Google Drive
id: 1327381e-6ab0-4f38-b583-4c1b8346a56b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/02
references:
- https://twitter.com/hexacorn/status/1448037865435320323
- https://twitter.com/Gal_B1t/status/1062971006078345217
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
