
title: Disable of ETW Trace
author: '@neu5ron, Florian Roth, Jonhnathan Ribeiro, oscd.community'
date: 2019/03/22
description: Detects a command that clears or disables any ETW trace log which could
  indicate a logging evasion.
detection:
  SELECTION_1:
    CommandLine: '*cl*'
  SELECTION_10:
    CommandLine: '*EventLog-Microsoft-Windows-WMI-Activity-Trace*'
  SELECTION_11:
    CommandLine: '*{1418ef04-b0b4-4623-bf7e-d74ab47bbdaa}*'
  SELECTION_12:
    CommandLine: '*Set-EtwTraceProvider*'
  SELECTION_13:
    CommandLine: '*{1418ef04-b0b4-4623-bf7e-d74ab47bbdaa}*'
  SELECTION_14:
    CommandLine: '*EventLog-Microsoft-Windows-WMI-Activity-Trace*'
  SELECTION_15:
    CommandLine: '*0x11*'
  SELECTION_16:
    CommandLine: '*logman*'
  SELECTION_17:
    CommandLine: '*update*'
  SELECTION_18:
    CommandLine: '*trace*'
  SELECTION_19:
    CommandLine: '*--p*'
  SELECTION_2:
    CommandLine: '*/Trace*'
  SELECTION_20:
    CommandLine: '*-ets*'
  SELECTION_3:
    CommandLine: '*clear-log*'
  SELECTION_4:
    CommandLine: '*/Trace*'
  SELECTION_5:
    CommandLine: '*sl*'
  SELECTION_6:
    CommandLine: '*/e:false*'
  SELECTION_7:
    CommandLine: '*set-log*'
  SELECTION_8:
    CommandLine: '*/e:false*'
  SELECTION_9:
    CommandLine: '*Remove-EtwTraceProvider*'
  condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9 and SELECTION_10
    and SELECTION_11) or (SELECTION_12 and SELECTION_13 and SELECTION_14 and SELECTION_15)
    or (SELECTION_16 and SELECTION_17 and SELECTION_18 and SELECTION_19 and SELECTION_20))
falsepositives:
- Unknown
id: a238b5d0-ce2d-4414-a676-7a531b3d13d6
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/wevtutil
- https://abuse.io/lockergoga.txt
- https://medium.com/palantir/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
status: test
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1562.006
- car.2016-04-002
