
title: Node Process Executions
ruletype: Sigma
author: Max Altgelt
date: 2022/04/06
description: Detects the execution of other scripts using the Node executable packaged
  with Adobe Creative Cloud
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\Adobe Creative Cloud Experience\libs\node.exe'
  SELECTION_3:
    CommandLine: '*Adobe Creative Cloud Experience\js*'
  condition: (SELECTION_1 and SELECTION_2 and  not (SELECTION_3))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
- ParentCommandLine
id: df1f26d3-bea7-4700-9ea2-ad3e990cf90e
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mttaggart/status/1511804863293784064
status: experimental
tags:
- attack.defense_evasion
- attack.t1127
- attack.t1059.007
