
title: CleanWipe Usage
author: Nasreddine Bencherchali @nas_bench
date: 2021/12/18
description: Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.
detection:
  SELECTION_1:
    Image:
    - '*\SepRemovalToolNative_x64.exe'
  SELECTION_2:
    Image: '*\CATClean.exe'
  SELECTION_3:
    CommandLine: '*--uninstall*'
  SELECTION_4:
    Image: '*\NetInstaller.exe'
  SELECTION_5:
    CommandLine: '*-r*'
  SELECTION_6:
    Image: '*\WFPUnins.exe'
  SELECTION_7:
    CommandLine: '*/uninstall*'
  SELECTION_8:
    CommandLine: '*/enterprise*'
  condition: (SELECTION_1 or (SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7 and SELECTION_8))
falsepositives:
- Legitimate administrative use
id: f44800ac-38ec-471f-936e-3fa7d9c53100
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
