title: Discovery/Execution via dnscmd.exe
ruletype: Sigma
author: '@gott_cyber'
date: 2022/07/31
description: |
    Detects an attempt to add a potentially crafted DLL as a plug in of the DNS Service.
    Detects an attempt to leverage dnscmd.exe to enumerate the DNS zones of a domain.
    DNS zones used to host the DNS records for a particular domain
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\dnscmd.exe'
    SELECTION_4:
        CommandLine:
        - '*/enumrecords*'
        - '*/enumzones*'
        - '*/info*'
    SELECTION_5:
        CommandLine: '*/config*'
    SELECTION_6:
        CommandLine: '*/serverlevelplugindll*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Legitimate administration use
id: b6457d63-d2a2-4e29-859d-4e7affc153d1
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
- https://docs.microsoft.com/en-us/azure/dns/dns-zones-records
- https://lolbas-project.github.io/lolbas/Binaries/Dnscmd/
status: experimental
tags:
- attack.discovery
- attack.execution
- attack.t1543.003
yml_filename: proc_creation_win_dnscmd_discovery.yml
yml_path: rules/windows/process_creation
---

