title: Suspicious Add Scheduled Command Pattern
ruletype: Sigma
author: Florian Roth
date: 2022/02/23
description: Detects suspicious scheduled task creations with commands that are uncommon
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*wscript.exe*'
    SELECTION_11:
        CommandLine: '*\AppData\\*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\schtasks.exe'
    SELECTION_4:
        CommandLine: '*/Create *'
    SELECTION_5:
        CommandLine:
        - '*/sc minute *'
        - '*/ru system *'
    SELECTION_6:
        CommandLine:
        - '*cmd.exe /c *'
        - '*cmd /c*'
    SELECTION_7:
        CommandLine:
        - '* bypass *'
        - '*.DownloadString*'
        - '*.DownloadFile*'
        - '*FromBase64String*'
        - '* -w hidden *'
        - '* IEX*'
        - '* -enc *'
        - '* -decode *'
        - '*/c start /min *'
        - '* curl *'
    SELECTION_8:
        CommandLine: '*/xml C:\Users\\*'
    SELECTION_9:
        CommandLine: '*\AppData\Local\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or SELECTION_7 or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11)))
falsepositives:
- Software installers that run from temporary folders and also install scheduled tasks
id: f2c64357-b1d2-41b7-849f-34d2682c0fad
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/06/02
references:
- https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/
status: experimental
tags:
- attack.execution
- attack.t1053.005
yml_filename: proc_creation_win_susp_schtasks_pattern.yml
yml_path: rules/windows/process_creation
---

