title: CrackMapExec PowerShell Obfuscation
ruletype: Sigma
author: Thomas Patzke
date: 2020/05/22
description: The CrachMapExec pentesting framework implements a PowerShell obfuscation
    with some static strings detected by this rule.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*powershell.exe*'
        - '*pwsh.exe*'
    SELECTION_4:
        CommandLine:
        - '*join*split*'
        - '*( $ShellId[1]+$ShellId[13]+''x'')*'
        - '*( $PSHome[*]+$PSHOME[*]+*'
        - '*( $env:Public[13]+$env:Public[5]+''x'')*'
        - '*( $env:ComSpec[4,*,25]-Join'''')*'
        - '*[1,3]+''x''-Join'''')*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
id: 6f8b3439-a203-45dc-a88b-abf57ea15ccf
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://github.com/byt3bl33d3r/CrackMapExec
- https://github.com/byt3bl33d3r/CrackMapExec/blob/0a49f75347b625e81ee6aa8c33d3970b5515ea9e/cme/helpers/powershell.py#L242
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1027.005
yml_filename: proc_creation_win_susp_crackmapexec_powershell_obfuscation.yml
yml_path: rules/windows/process_creation
---

