
title: Winnti Malware HK University Campaign
author: Florian Roth, Markus Neis
date: 2020/02/01
description: Detects specific process characteristics of Winnti malware noticed in
  Dec/Jan 2020 in a campaign against Honk Kong universities
detection:
  SELECTION_1:
    ParentImage:
    - '*C:\Windows\Temp*'
    - '*\hpqhvind.exe*'
  SELECTION_2:
    Image: C:\ProgramData\DRM*
  SELECTION_3:
    ParentImage: C:\ProgramData\DRM*
  SELECTION_4:
    Image: '*\wmplayer.exe'
  SELECTION_5:
    ParentImage: '*\Test.exe'
  SELECTION_6:
    Image: '*\wmplayer.exe'
  SELECTION_7:
    Image: C:\ProgramData\DRM\CLR\CLR.exe
  SELECTION_8:
    ParentImage: C:\ProgramData\DRM\Windows*
  SELECTION_9:
    Image: '*\SearchFilterHost.exe'
  condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6) or SELECTION_7 or (SELECTION_8 and SELECTION_9))
falsepositives:
- Unlikely
id: 3121461b-5aa0-4a41-b910-66d25524edbb
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://www.welivesecurity.com/2020/01/31/winnti-group-targeting-universities-hong-kong/
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
- attack.g0044
