
title: Rundll32 Registered COM Objects
ruletype: Sigma
author: frack113
date: 2022/02/13
description: load malicious registered COM objects
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\rundll32.exe'
  SELECTION_3:
    CommandLine:
    - '*-sta *'
    - '*–localserver *'
  SELECTION_4:
    CommandLine: '*{*'
  SELECTION_5:
    CommandLine: '*}*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Legitimate use
id: f1edd233-30b5-4823-9e6a-c4171b24d316
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://nasbench.medium.com/a-deep-dive-into-rundll32-exe-642344b41e90
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.015/T1546.015.md
status: experimental
tags:
- attack.privilege_escalation
- attack.persistence
- attack.t1546.015
