
title: Suspicious Conhost Legacy Option
ruletype: Sigma
author: frack113
date: 2022/04/04
description: ForceV1 asks for information directly from the kernel space. Conhost
  connects to the console application
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*conhost.exe*'
  SELECTION_3:
    CommandLine: '*0xffffffff*'
  SELECTION_4:
    CommandLine: '*-ForceV1*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 3037d961-21e9-4732-b27a-637bcc7bf539
level: informational
logsource:
  category: process_creation
  product: windows
references:
- https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- 
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
