
title: RdrLeakDiag Process Dump
ruletype: Sigma
author: Florian Roth
date: 2022/01/04
description: Detects uses of the rdrleakdiag.exe LOLOBIN utility to dump process memory
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\rdrleakdiag.exe'
  SELECTION_3:
    CommandLine: '*/fullmemdmp*'
  SELECTION_4:
    CommandLine: '*/fullmemdmp*'
  SELECTION_5:
    CommandLine: '* /o *'
  SELECTION_6:
    CommandLine: '* /p *'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6)))
falsepositives:
- Unknown
id: 6355a919-2e97-4285-a673-74645566340d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
