
title: Renamed PsExec
author: Florian Roth
date: 2019/05/21
description: Detects the execution of a renamed PsExec often used by attackers or
  malware
detection:
  SELECTION_1:
    Description: Execute processes remotely
  SELECTION_2:
    Product: Sysinternals PsExec
  SELECTION_3:
    Image:
    - '*\PsExec.exe'
    - '*\PsExec64.exe'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Software that illegaly integrates PsExec in a renamed form
- Administrators that have renamed PsExec and no one knows why
id: a7a7e0e5-1d57-49df-9c58-9fe5bc0346a2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/megacortex-ransomware-spotted-attacking-enterprise-networks
status: test
tags:
- car.2013-05-009
- attack.defense_evasion
- attack.t1036.003
