title: Verclsid.exe Runs COM Object
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects when verclsid.exe is used to run COM object via GUID
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\verclsid.exe'
    SELECTION_4:
        OriginalFileName: verclsid.exe
    SELECTION_5:
        CommandLine: '*/S*'
    SELECTION_6:
        CommandLine: '*/C*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
fields:
- CommandLine
id: d06be4b9-8045-428b-a567-740a26d9db25
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/11
references:
- https://lolbas-project.github.io/lolbas/Binaries/Verclsid/
- https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
status: test
tags:
- attack.defense_evasion
- attack.t1218
yml_filename: proc_creation_win_verclsid_runs_com.yml
yml_path: rules/windows/process_creation
---

