
title: Renamed SysInternals Debug View
author: Florian Roth
date: 2020/05/28
description: Detects suspicious renamed SysInternals DebugView execution
detection:
  SELECTION_1:
    Product:
    - Sysinternals DebugView
    - Sysinternals Debugview
  SELECTION_2:
    OriginalFileName: Dbgview.exe
  SELECTION_3:
    Image: '*\Dbgview.exe'
  condition: (SELECTION_1 and  not (SELECTION_2 and SELECTION_3))
falsepositives:
- Unknown
id: cd764533-2e07-40d6-a718-cfeec7f2da7f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://www.epicturla.com/blog/sysinturla
status: test
tags:
- attack.resource_development
- attack.t1588.002
