
title: Suspicious Get Local Groups Information with WMIC
ruletype: Sigma
author: frack113
date: 2021/12/12
description: |
  Adversaries may attempt to find local system groups and permission settings.
  The knowledge of local system permission groups can help adversaries determine which groups exist and which users belong to a particular group.
  Adversaries may use this information to determine which users have elevated permissions, such as the users found within the local administrators group.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\wmic.exe'
  SELECTION_3:
    CommandLine: '* group*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 164eda96-11b2-430b-85ff-6a265c15bf32
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
status: experimental
tags:
- attack.discovery
- attack.t1069.001
