
title: Parent in Public Folder Suspicious Process
author: Florian Roth
date: 2022/02/25
description: This rule detects suspicious processes with parent images located in
  the C:\Users\Public folder
detection:
  SELECTION_1:
    ParentImage: C:\Users\Public\\*
  SELECTION_2:
    CommandLine:
    - '*powershell*'
    - '*cmd.exe /c *'
    - '*cmd /c *'
    - '*wscript.exe*'
    - '*cscript.exe*'
    - '*bitsadmin*'
    - '*certutil*'
    - '*mshta.exe*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
id: 69bd9b97-2be2-41b6-9816-fb08757a4d1a
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://redcanary.com/blog/blackbyte-ransomware/
status: experimental
