
title: Suspicious Execution of Shutdown
author: frack113
date: 2022/01/01
description: Use of the commandline to shutdown or reboot windows
detection:
  SELECTION_1:
    Image: '*\shutdown.exe'
  SELECTION_2:
    CommandLine:
    - '*/r *'
    - '*/s *'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 34ebb878-1b15-4895-b352-ca2eeb99b274
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1529/T1529.md
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown
status: experimental
tags:
- attack.impact
- attack.t1529
