
title: Modification Of Existing Services For Persistence
author: Sreeman
date: 2020/09/29
description: Detects modification of an existing service on a compromised host in
  order to execute an arbitrary payload when the service is started or killed as a
  method of persistence.
detection:
  SELECTION_1:
    CommandLine: '*sc *'
  SELECTION_10:
    CommandLine:
    - '*.sh*'
    - '*.exe*'
    - '*.dll*'
    - '*.bin$*'
    - '*.bat*'
    - '*.cmd*'
    - '*.js*'
    - '*.msh$*'
    - '*.reg$*'
    - '*.scr*'
    - '*.ps*'
    - '*.vb*'
    - '*.jar*'
    - '*.pl*'
  SELECTION_11:
    CommandLine: '*reg *'
  SELECTION_12:
    CommandLine: '*add *'
  SELECTION_13:
    CommandLine: '*ImagePath*'
  SELECTION_14:
    CommandLine:
    - '*.sh*'
    - '*.exe*'
    - '*.dll*'
    - '*.bin$*'
    - '*.bat*'
    - '*.cmd*'
    - '*.js*'
    - '*.msh$*'
    - '*.reg$*'
    - '*.scr*'
    - '*.ps*'
    - '*.vb*'
    - '*.jar*'
    - '*.pl*'
  SELECTION_2:
    CommandLine: '*config *'
  SELECTION_3:
    CommandLine: '*binpath=*'
  SELECTION_4:
    CommandLine: '*sc *'
  SELECTION_5:
    CommandLine: '*failure*'
  SELECTION_6:
    CommandLine: '*command=*'
  SELECTION_7:
    CommandLine: '*reg *'
  SELECTION_8:
    CommandLine: '*add *'
  SELECTION_9:
    CommandLine: '*FailureCommand*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9 and SELECTION_10)
    or (SELECTION_11 and SELECTION_12 and SELECTION_13 and SELECTION_14))
falsepositives:
- unknown
id: 38879043-7e1e-47a9-8d46-6bec88e201df
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/06
references:
- https://pentestlab.blog/2020/01/22/persistence-modify-existing-service/
status: experimental
tags:
- attack.persistence
- attack.t1543.003
- attack.t1574.011
