
title: Obfuscated Command Line Using Special Unicode Characters
ruletype: Sigma
author: frack113
date: 2022/01/15
description: Adversaries may attempt to make an executable or file difficult to discover
  or analyze by encrypting, encoding, or otherwise obfuscating its contents on the
  system or in transit.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*â*'
    - '*€*'
    - '*£*'
    - '*¯*'
    - '*®*'
    - '*µ*'
    - '*¶*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: e0552b19-5a83-4222-b141-b36184bb8d79
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
