
title: Execution File Type Other Than .exe
ruletype: Sigma
author: Max Altgelt
date: 2021/12/09
description: Checks whether the image specified in a process creation event doesn't
  refer to an .exe file (caused by process ghosting or other unorthodox methods to
  start a process)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    Image: '*.scr'
  SELECTION_11:
    Image: '*NVIDIA\NvBackend\\*'
  SELECTION_12:
    Image: '*.dat'
  SELECTION_13:
    Image: C:\Windows\System32\\*
  SELECTION_14:
    Image: '*.com'
  SELECTION_2:
    Image: '*.exe'
  SELECTION_3:
    Image|re: ^$
  SELECTION_4:
    Image: Registry
  SELECTION_5:
    Image:
    - '-'
    - ''
  SELECTION_6:
    Image: C:\Windows\Installer\MSI*
  SELECTION_7:
    ParentImage: C:\ProgramData\Avira\\*
  SELECTION_8:
    Image: C:\Windows\Temp\\*
  SELECTION_9:
    Image: '*\avira_speedup_setup_update.tmp'
  condition: (SELECTION_1 and  not (SELECTION_2) and  not ((SELECTION_3) or (SELECTION_4)
    or (SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8 and SELECTION_9)
    or (SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14)))
falsepositives:
- unknown
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/14
references:
- https://pentestlaboratories.com/2021/12/08/process-ghosting/
status: experimental
tags:
- attack.defense_evasion
