
title: Suspicious PowerShell Command Line
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community, Tim Shelton
  (fp)
date: 2020/10/15
description: Detects the PowerShell command lines with special characters
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    Image: '*\powershell.exe'
  SELECTION_11:
    CommandLine|re: .*`.*`.*`.*`.*`.*
  SELECTION_12:
    ParentImage: C:\Program Files\Amazon\SSM\ssm-document-worker.exe
  SELECTION_13:
    Image: '*\powershell.exe'
  SELECTION_14:
    CommandLine|re: .*\{.*\{.*\{.*\{.*\{.*
  SELECTION_15:
    CommandLine:
    - '*new EventSource("Microsoft.Windows.Sense.Client.Management"*'
    - '*public static extern bool InstallELAMCertificateInfo(SafeFileHandle handle);*'
  SELECTION_2:
    Image: '*\powershell.exe'
  SELECTION_3:
    CommandLine|re: .*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*\+.*
  SELECTION_4:
    Image: '*\powershell.exe'
  SELECTION_5:
    CommandLine|re: .*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*\{.*
  SELECTION_6:
    Image: '*\powershell.exe'
  SELECTION_7:
    CommandLine|re: .*\{.*\{.*\{.*\{.*\{.*
  SELECTION_8:
    Image: '*\powershell.exe'
  SELECTION_9:
    CommandLine|re: .*\^.*\^.*\^.*\^.*\^.*
  condition: (SELECTION_1 and ((((((SELECTION_2 and SELECTION_3) or (SELECTION_4 and
    SELECTION_5)) or (SELECTION_6 and SELECTION_7)) or (SELECTION_8 and SELECTION_9))
    or (SELECTION_10 and SELECTION_11)) and  not (SELECTION_12)) and  not ((SELECTION_13
    and SELECTION_14 and SELECTION_15)))
falsepositives:
- Unlikely
- Amazon SSM Document Worker
- Windows Defender ATP
id: d7bcd677-645d-4691-a8d4-7a5602b780d1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/08
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=64
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
