title: Suspicious GUP Usage
ruletype: Sigma
author: Florian Roth
date: 2019/02/06
description: Detects execution of the Notepad++ updater in a suspicious directory,
    which is often used in DLL side-loading attacks
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\GUP.exe'
    SELECTION_4:
        NewProcessName:
        - '*\Program Files\Notepad++\updater\GUP.exe'
        - '*\Program Files (x86)\Notepad++\updater\GUP.exe'
    SELECTION_5:
        NewProcessName: '*\Users\\*'
    SELECTION_6:
        NewProcessName:
        - '*\AppData\Local\Notepad++\updater\GUP.exe'
        - '*\AppData\Roaming\Notepad++\updater\GUP.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5 and SELECTION_6)))
falsepositives:
- Execution of tools named GUP.exe and located in folders different than Notepad++\updater
id: 0a4f6091-223b-41f6-8743-f322ec84930b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/13
references:
- https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
yml_filename: proc_creation_win_susp_gup.yml
yml_path: rules/windows/process_creation
---

