title: Suspicious Script Execution From Temp Folder
ruletype: Sigma
author: Florian Roth, Max Altgelt
date: 2021/07/14
description: Detects a suspicious script executions from temporary folder
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\mshta.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
    SELECTION_4:
        CommandLine:
        - '*\Windows\Temp*'
        - '*\Temporary Internet*'
        - '*\AppData\Local\Temp*'
        - '*\AppData\Roaming\Temp*'
        - '*%TEMP%*'
        - '*%TMP%*'
        - '*%LocalAppData%\Temp*'
    SELECTION_5:
        CommandLine:
        - '* >*'
        - '*Out-File*'
        - '*ConvertTo-Json*'
        - '*-WindowStyle hidden -Verb runAs*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Administrative scripts
id: a6a39bdb-935c-4f0a-ab77-35f4bbf44d33
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
status: experimental
tags:
- attack.execution
- attack.t1059
yml_filename: proc_creation_win_susp_script_exec_from_temp.yml
yml_path: rules/windows/process_creation
---

