
title: Suspicious PowerShell Parent Process
author: Teymur Kheirkhabarov, Harish Segar (rule)
date: 2020/03/20
description: Detects a suspicious parents of powershell.exe
detection:
  SELECTION_1:
    ParentImage:
    - '*\mshta.exe'
    - '*\rundll32.exe'
    - '*\regsvr32.exe'
    - '*\services.exe'
    - '*\winword.exe'
    - '*\wmiprvse.exe'
    - '*\powerpnt.exe'
    - '*\excel.exe'
    - '*\msaccess.exe'
    - '*\mspub.exe'
    - '*\visio.exe'
    - '*\outlook.exe'
    - '*\amigo.exe'
    - '*\chrome.exe'
    - '*\firefox.exe'
    - '*\iexplore.exe'
    - '*\microsoftedgecp.exe'
    - '*\microsoftedge.exe'
    - '*\browser.exe'
    - '*\vivaldi.exe'
    - '*\safari.exe'
    - '*\sqlagent.exe'
    - '*\sqlserver.exe'
    - '*\sqlservr.exe'
    - '*\w3wp.exe'
    - '*\httpd.exe'
    - '*\nginx.exe'
    - '*\php-cgi.exe'
    - '*\jbosssvc.exe'
    - '*MicrosoftEdgeSH.exe'
  SELECTION_2:
    ParentImage: '*tomcat*'
  SELECTION_3:
    CommandLine:
    - '*powershell*'
    - '*pwsh*'
  SELECTION_4:
    Description: Windows PowerShell
  SELECTION_5:
    Product: PowerShell Core 6
  condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Other scripts
id: 754ed792-634f-40ae-b3bc-e0448d33f695
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/12/02
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26
status: test
tags:
- attack.execution
- attack.t1059.001
