
title: Suspicious aspnet_compiler.exe Execution
author: frack113
date: 2021/11/24
description: Execute C# code with the Build Provider and proper folder structure in
  place.
detection:
  SELECTION_1:
    Image: '*C:\Windows\Microsoft.NET\Framework*'
  SELECTION_2:
    Image: '*aspnet_compiler.exe*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- unknown
id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
status: experimental
tags:
- attack.defense_evasion
- attack.t1127
