
title: Local Accounts Discovery
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: 2019/10/21
description: Local accounts, System Owner/User discovery using operating systems utilities
detection:
  SELECTION_1:
    Image: '*\whoami.exe'
  SELECTION_10:
    CommandLine: '*dir *'
  SELECTION_11:
    CommandLine: '*\Users\\*'
  SELECTION_12:
    CommandLine:
    - '* rmdir *'
  SELECTION_13:
    Image:
    - '*\net.exe'
    - '*\net1.exe'
  SELECTION_14:
    CommandLine: '*user*'
  SELECTION_15:
    CommandLine:
    - '*/domain*'
    - '*/add*'
    - '*/delete*'
    - '*/active*'
    - '*/expires*'
    - '*/passwordreq*'
    - '*/scriptpath*'
    - '*/times*'
    - '*/workstations*'
  SELECTION_2:
    Image: '*\wmic.exe'
  SELECTION_3:
    CommandLine: '*useraccount*'
  SELECTION_4:
    CommandLine: '*get*'
  SELECTION_5:
    Image:
    - '*\quser.exe'
    - '*\qwinsta.exe'
  SELECTION_6:
    Image: '*\cmdkey.exe'
  SELECTION_7:
    CommandLine: '*/list*'
  SELECTION_8:
    Image: '*\cmd.exe'
  SELECTION_9:
    CommandLine: '*/c*'
  condition: (((SELECTION_1 or (SELECTION_2 and SELECTION_3 and SELECTION_4) or SELECTION_5
    or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9 and SELECTION_10
    and SELECTION_11)) and  not (SELECTION_12)) or ((SELECTION_13 and SELECTION_14)
    and  not (SELECTION_15)))
falsepositives:
- Legitimate administrator or user enumerates local users for legitimate reason
fields:
- Image
- CommandLine
- User
- LogonGuid
- Hashes
- ParentProcessGuid
- ParentCommandLine
id: 502b42de-4306-40b4-9596-6f590c81f073
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1033/T1033.md
status: test
tags:
- attack.discovery
- attack.t1033
- attack.t1087.001
