title: PowerShell Download from URL
ruletype: Sigma
author: Florian Roth, oscd.community, Jonhnathan Ribeiro
date: 2019/01/16
description: Detects a Powershell process that contains download commands in its command
    line string
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        CommandLine: '*new-object*'
    SELECTION_5:
        CommandLine: '*net.webclient).*'
    SELECTION_6:
        CommandLine: '*download*'
    SELECTION_7:
        CommandLine:
        - '*string(*'
        - '*file(*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
status: test
tags:
- attack.execution
- attack.t1059.001
yml_filename: proc_creation_win_powershell_download.yml
yml_path: rules/windows/process_creation
---

