
title: Logon Scripts (UserInitMprLogonScript)
author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation or execution of UserInitMprLogonScript persistence method
detection:
  SELECTION_1:
    ParentImage: '*\userinit.exe'
  SELECTION_2:
    Image:
    - '*explorer.exe'
    - '*\proquota.exe'
  SELECTION_3:
    CommandLine:
    - '*netlogon*.bat*'
    - '*UsrLogon.cmd*'
    - '*C:\WINDOWS\Explorer.EXE*'
  SELECTION_4:
    CommandLine: '*UserInitMprLogonScript*'
  condition: ((SELECTION_1 and  not ((SELECTION_2) or (SELECTION_3))) or SELECTION_4)
falsepositives:
- exclude legitimate logon scripts
- penetration tests, red teaming
id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/21
references:
- https://attack.mitre.org/techniques/T1037/
status: test
tags:
- attack.t1037.001
- attack.persistence
