title: Shell32 DLL Execution in Suspicious Directory
ruletype: Sigma
author: Christian Burkard
date: 2021/11/24
description: Detects shell32.dll executing a DLL in a suspicious directory
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\rundll32.exe'
    SELECTION_4:
        CommandLine: '*shell32.dll*'
    SELECTION_5:
        CommandLine: '*Control_RunDLL*'
    SELECTION_6:
        CommandLine:
        - '*%AppData%*'
        - '*%LocalAppData%*'
        - '*%Temp%*'
        - '*\AppData\\*'
        - '*\Temp\\*'
        - '*\Users\Public\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 32b96012-7892-429e-b26c-ac2bf46066ff
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.group-ib.com/resources/threat-research/red-curl-2.html
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218.011
yml_filename: proc_creation_win_susp_target_location_shell32.yml
yml_path: rules/windows/process_creation
---

