
title: Proxy Execution via Wuauclt
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research), Florian Roth
date: 2020/10/12
description: Detects the use of the Windows Update Client binary (wuauclt.exe) to
  proxy execute code.
detection:
  SELECTION_1:
    Image: '*wuauclt*'
  SELECTION_2:
    OriginalFileName: wuauclt.exe
  SELECTION_3:
    CommandLine: '*UpdateDeploymentProvider*'
  SELECTION_4:
    CommandLine: '*.dll*'
  SELECTION_5:
    CommandLine: '*RunHandlerComServer*'
  SELECTION_6:
    CommandLine:
    - '* /UpdateDeploymentProvider UpdateDeploymentProvider.dll *'
    - '* wuaueng.dll *'
  condition: (((SELECTION_1 or SELECTION_2) and (SELECTION_3 and SELECTION_4 and SELECTION_5))
    and  not (SELECTION_6))
falsepositives:
- Unknown
id: af77cf95-c469-471c-b6a0-946c685c4798
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/05/10
references:
- https://dtm.uk/wuauclt/
- https://blog.malwarebytes.com/threat-intelligence/2022/01/north-koreas-lazarus-apt-leverages-windows-update-client-github-in-latest-campaign/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
