
title: DevInit Lolbin Download
author: Florian Roth
date: 2022/01/11
description: Detects a certain command line flag combination used by devinit.exe lolbin
  to download arbitrary MSI packages on a Windows system
detection:
  SELECTION_1:
    CommandLine: '* -t msi-install *'
  SELECTION_2:
    CommandLine: '* -i http*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 90d50722-0483-4065-8e35-57efaadd354d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mrd0x/status/1460815932402679809
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
