
title: Registry Dump of SAM Creds and Secrets
ruletype: Sigma
author: frack113
date: 2022/01/05
description: Adversaries may attempt to extract credential material from the Security
  Account Manager (SAM) database either through Windows Registry where the SAM database
  is stored
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '* save *'
  SELECTION_3:
    CommandLine:
    - '*HKLM\sam*'
    - '*HKLM\system*'
    - '*HKLM\security*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 038cd51c-3ad8-41c5-ba8f-5d1c92f3cc1e
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
