title: Ping Hex IP
ruletype: Sigma
author: Florian Roth
date: 2018/03/23
description: Detects a ping command that uses a hex encoded IP address
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\ping.exe'
    SELECTION_4:
        CommandLine: '*0x*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely, because no sane admin pings IP addresses in a hexadecimal form
fields:
- ParentCommandLine
id: 1a0d4aba-7668-4365-9ce4-6d79ab088dfd
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/01/07
references:
- https://github.com/vysecurity/Aggressor-VYSEC/blob/0d61c80387b9432dab64b8b8a9fb52d20cfef80e/ping.cna
- https://twitter.com/vysecurity/status/977198418354491392
status: test
tags:
- attack.defense_evasion
- attack.t1140
- attack.t1027
yml_filename: proc_creation_win_susp_ping_hex_ip.yml
yml_path: rules/windows/process_creation
---

