title: Suspicious Query of MachineGUID
ruletype: Sigma
author: frack113
date: 2022/01/01
description: Use of reg to get MachineGuid information
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\reg.exe'
    SELECTION_4:
        CommandLine: '*SOFTWARE\Microsoft\Cryptography*'
    SELECTION_5:
        CommandLine: '*/v *'
    SELECTION_6:
        CommandLine: '*MachineGuid*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: f5240972-3938-4e56-8e4b-e33893176c1f
level: low
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-8---windows-machineguid-discovery
status: experimental
tags:
- attack.discovery
- attack.t1082
yml_filename: proc_creation_win_susp_machineguid.yml
yml_path: rules/windows/process_creation
---

