
title: File or Folder Permissions Modifications
author: Jakob Weinzettl, oscd.community
date: 2019/10/23
description: Detects a file or folder's permissions being modified.
detection:
  SELECTION_1:
    Image:
    - '*\takeown.exe'
    - '*\cacls.exe'
    - '*\icacls.exe'
  SELECTION_2:
    CommandLine: '*/grant*'
  SELECTION_3:
    Image: '*\attrib.exe'
  SELECTION_4:
    CommandLine: '*-r*'
  SELECTION_5:
    CommandLine: '*ICACLS C:\ProgramData\dynatrace\gateway\config\connectivity.history
      /reset'
  SELECTION_6:
    CommandLine: '*ICACLS C:\ProgramData\dynatrace\gateway\config\config.properties
      /grant :r *'
  SELECTION_7:
    CommandLine: '*S-1-5-19:F*'
  condition: ((SELECTION_1 and SELECTION_2) or ((SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5) or (SELECTION_6 and SELECTION_7))))
falsepositives:
- Users interacting with the files on their own (unlikely unless privileged users).
- Dynatrace app
fields:
- ComputerName
- User
- CommandLine
id: 37ae075c-271b-459b-8d7b-55ad5f993dd8
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1222.001/T1222.001.md
status: test
tags:
- attack.defense_evasion
- attack.t1222.001
