
title: Windows Hacktool Imphash
ruletype: Sigma
author: Florian Roth
date: 2022/03/04
description: Detects the use of Windows hacktools based on their import hash (imphash)
  even if the files have been renamed
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Imphash:
    - BCCA3C247B619DCD13C8CDFF5F123932
    - 3A19059BD7688CB88E70005F18EFC439
    - 9DA6D5D77BE11712527DCAB86DF449A3
    - A6E01BC1AB89F8D91D9EAB72032AAE88
    - D21BBC50DCC169D7B4D0F01962793154
    - 9528A0E91E28FBB88AD433FEABCA2456
    - 4C1B52A19748428E51B14C278D0F58E3
    - 725BB81DC24214F6ECACC0CFB36AD30D
    - 672B13F4A0B6F27D29065123FE882DFC
    - 0C106686A31BFE2BA931AE1CF6E9DBC6
    - 23867A89C2B8FC733BE6CF5EF902F2D1
    - 9FB060C2977A9D9B782440B98D410C3E
    - B18A1401FF8F444056D29450FBC0A6CE
    - 13F08707F759AF6003837A150A371BA1
    - 749A7BB1F0B4C4455949C0B2BF7F9E9F
    - 94CB940A1A6B65BED4D5A8F849CE9793
    - 1781F06048A7E58B323F0B9259BE798B
    - CB567F9498452721D77A451374955F5F
    - 730073214094CD328547BF1F72289752
    - 6EEFD92BFFBFB27F378B81C09CA96786
    - AC615FB1D93576FA3C26077A619C9144
    - DC25EE78E2EF4D36FAA0BADF1E7461C9
    - 17B461A082950FC6332228572138B80C
    - C547F2E66061A8DFFB6F5A3FF63C0A74
    - 0588081AB0E63BA785938467E1B10CCA
    - ADA161BF41B8E5E9132858CB54CAB5FB
    - 2A1BC4913CD5ECB0434DF07CB675B798
    - 11083E75553BAAE21DC89CE8F9A195E4
    - A23D29C9E566F2FA8FFBB79267F5DF80
  SELECTION_3:
    Hashes:
    - '*IMPHASH=BCCA3C247B619DCD13C8CDFF5F123932*'
    - '*IMPHASH=3A19059BD7688CB88E70005F18EFC439*'
    - '*IMPHASH=9DA6D5D77BE11712527DCAB86DF449A3*'
    - '*IMPHASH=A6E01BC1AB89F8D91D9EAB72032AAE88*'
    - '*IMPHASH=D21BBC50DCC169D7B4D0F01962793154*'
    - '*IMPHASH=9528A0E91E28FBB88AD433FEABCA2456*'
    - '*IMPHASH=4C1B52A19748428E51B14C278D0F58E3*'
    - '*IMPHASH=725BB81DC24214F6ECACC0CFB36AD30D*'
    - '*IMPHASH=672B13F4A0B6F27D29065123FE882DFC*'
    - '*IMPHASH=0C106686A31BFE2BA931AE1CF6E9DBC6*'
    - '*IMPHASH=23867A89C2B8FC733BE6CF5EF902F2D1*'
    - '*IMPHASH=9FB060C2977A9D9B782440B98D410C3E*'
    - '*IMPHASH=B18A1401FF8F444056D29450FBC0A6CE*'
    - '*IMPHASH=13F08707F759AF6003837A150A371BA1*'
    - '*IMPHASH=749A7BB1F0B4C4455949C0B2BF7F9E9F*'
    - '*IMPHASH=94CB940A1A6B65BED4D5A8F849CE9793*'
    - '*IMPHASH=1781F06048A7E58B323F0B9259BE798B*'
    - '*IMPHASH=CB567F9498452721D77A451374955F5F*'
    - '*IMPHASH=730073214094CD328547BF1F72289752*'
    - '*IMPHASH=6EEFD92BFFBFB27F378B81C09CA96786*'
    - '*IMPHASH=AC615FB1D93576FA3C26077A619C9144*'
    - '*IMPHASH=DC25EE78E2EF4D36FAA0BADF1E7461C9*'
    - '*IMPHASH=17B461A082950FC6332228572138B80C*'
    - '*IMPHASH=C547F2E66061A8DFFB6F5A3FF63C0A74*'
    - '*IMPHASH=0588081AB0E63BA785938467E1B10CCA*'
    - '*IMPHASH=ADA161BF41B8E5E9132858CB54CAB5FB*'
    - '*IMPHASH=2A1BC4913CD5ECB0434DF07CB675B798*'
    - '*IMPHASH=11083E75553BAAE21DC89CE8F9A195E4*'
    - '*IMPHASH=A23D29C9E566F2FA8FFBB79267F5DF80*'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Legitimate use of one of these tools
id: 24e3e58a-646b-4b50-adef-02ef935b9fc8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/16
references:
- Internal Research
status: experimental
