
title: Hermetic Wiper TG Process Patterns
author: Florian Roth
date: 2022/02/25
description: This rule detects process execution patterns found in intrusions related
  to the Hermetic Wiper malware attacks against Ukraine in February 2022
detection:
  SELECTION_1:
    Image:
    - '*\policydefinitions\postgresql.exe'
  SELECTION_2:
    CommandLine:
    - '*CSIDL_SYSTEM_DRIVE\temp\sys.tmp*'
    - '* 1> \\127.0.0.1\ADMIN$\__16*'
  SELECTION_3:
    CommandLine: '*powershell -c *'
  SELECTION_4:
    CommandLine: '*\comsvcs.dll MiniDump *'
  SELECTION_5:
    CommandLine: '*\winupd.log full*'
  condition: (SELECTION_1 or SELECTION_2 or (SELECTION_3 and SELECTION_4 and SELECTION_5))
falsepositives:
- Unknown
id: 2f974656-6d83-4059-bbdf-68ac5403422f
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ukraine-wiper-malware-russia
status: experimental
