
title: TAIDOOR RAT DLL Load
author: Florian Roth
date: 2020/07/30
description: Detects specific process characteristics of Chinese TAIDOOR RAT malware
  load
detection:
  SELECTION_1:
    CommandLine:
    - '*dll,MyStart*'
    - '*dll MyStart*'
  SELECTION_2:
    CommandLine:
    - '* MyStart'
  SELECTION_3:
    CommandLine:
    - '*rundll32.exe*'
  condition: (SELECTION_1 or (SELECTION_2 and SELECTION_3))
falsepositives:
- Unknown
id: d1aa3382-abab-446f-96ea-4de52908210b
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://us-cert.cisa.gov/ncas/analysis-reports/ar20-216a
status: test
tags:
- attack.execution
- attack.t1055.001
