title: Suspicious Copy From or To System32
ruletype: Sigma
author: Florian Roth, Markus Neis, Tim Shelton (HAWK.IO), Nasreddine Bencherchali
    (update)
date: 2020/07/03
description: |
    Detects a suspicious copy operation that tries to copy a program from a system (System32 or SysWOW64) directory to another on disk.
    Often used to move LOLBINs such as 'certutil' or 'desktopimgdownldr' to a different location with a different name in order to bypass detections based on locations
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\cmd.exe'
    SELECTION_4:
        CommandLine: '*copy *'
    SELECTION_5:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_6:
        CommandLine:
        - '*copy-item*'
        - '*copy*'
        - '*cpi *'
        - '* cp *'
    SELECTION_7:
        NewProcessName:
        - '*\robocopy.exe'
        - '*\xcopy.exe'
    SELECTION_8:
        CommandLine:
        - '*\System32*'
        - '*\SysWOW64*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6) or SELECTION_7) and SELECTION_8)
falsepositives:
- Depend on scripts and administrative tools used in the monitored environment (For
    example an admin scripts like https://www.itexperience.net/sccm-batch-files-and-32-bits-processes-on-64-bits-os/)
- When cmd.exe and xcopy.exe are called directly
- When the command contains the keywords but not in the correct order
fields:
- CommandLine
- ParentCommandLine
id: fff9d2b7-e11c-4a69-93d3-40ef66189767
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/04
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
related:
-   id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
    type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1036.003
yml_filename: proc_creation_win_susp_copy_system32.yml
yml_path: rules/windows/process_creation
---

