title: Suspicious Userinit Child Process
ruletype: Sigma
author: Florian Roth (rule), Samir Bousseaden (idea)
date: 2019/06/17
description: Detects a suspicious child process of userinit
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\userinit.exe'
    SELECTION_4:
        CommandLine: '*\netlogon\\*'
    SELECTION_5:
        NewProcessName: '*\explorer.exe'
    SELECTION_6:
        ImageFileName: explorer.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and  not (SELECTION_4))
        and  not (SELECTION_5 or SELECTION_6))
falsepositives:
- Administrative scripts
fields:
- CommandLine
- ParentCommandLine
id: b655a06a-31c0-477a-95c2-3726b83d649d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/06/29
references:
- https://twitter.com/SBousseaden/status/1139811587760562176
status: experimental
tags:
- attack.defense_evasion
- attack.t1055
yml_filename: proc_creation_win_susp_userinit_child.yml
yml_path: rules/windows/process_creation
---

