
title: Suspicious PowerShell Download and Execute Pattern
ruletype: Sigma
author: Florian Roth
date: 2022/02/28
description: Detects suspicious PowerShell download patterns that are often used in
  malicious scripts, stagers or downloaders (make sure that your backend applies the
  strings case-insensitive)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*IEX ((New-Object Net.WebClient).DownloadString*'
    - '*IEX (New-Object Net.WebClient).DownloadString*'
    - '*IEX((New-Object Net.WebClient).DownloadString*'
    - '*IEX(New-Object Net.WebClient).DownloadString*'
    - '* -command (New-Object System.Net.WebClient).DownloadFile(*'
    - '* -c (New-Object System.Net.WebClient).DownloadFile(*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Software installers that pull packages from remote systems and execute them
id: e6c54d94-498c-4562-a37c-b469d8e9a275
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/01
references:
- https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
status: experimental
tags:
- attack.execution
- attack.t1059.001
