
title: Possible Privilege Escalation via Weak Service Permissions
author: Teymur Kheirkhabarov
date: 2019/10/26
description: Detection of sc.exe utility spawning by user with Medium integrity level
  to change service ImagePath or FailureCommand
detection:
  SELECTION_1:
    Image: '*\sc.exe'
  SELECTION_2:
    IntegrityLevel: Medium
  SELECTION_3:
    CommandLine: '*config*'
  SELECTION_4:
    CommandLine: '*binPath*'
  SELECTION_5:
    CommandLine: '*failure*'
  SELECTION_6:
    CommandLine: '*command*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: d937b75f-a665-4480-88a5-2f20e9f9b22a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://pentestlab.blog/2017/03/30/weak-service-permissions/
status: test
tags:
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.011
