
title: Suspicious DumpMinitool Usage
ruletype: Sigma
author: Florian Roth
date: 2022/04/06
description: Detects suspicious ways to use of a Visual Studio bundled tool named
  DumpMinitool.exe
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\DumpMinitool.exe'
  SELECTION_3:
    OriginalName: DumpMinitool.exe
  SELECTION_4:
    Image:
    - '*\Microsoft Visual Studio\\*'
    - '*\Extensions\\*'
  SELECTION_5:
    CommandLine: '*.txt*'
  SELECTION_6:
    CommandLine: '* Full*'
  SELECTION_7:
    CommandLine: '*--dumpType*'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3) and (( not (SELECTION_4)
    or SELECTION_5) or (SELECTION_6 and  not (SELECTION_7))))
falsepositives:
- Unknown
id: eb1c4225-1c23-4241-8dd4-051389fde4ce
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001
