title: Possible Privilege Escalation via Service Permissions Weakness
ruletype: Sigma
author: Teymur Kheirkhabarov
date: 2019/10/26
description: Detect modification of services configuration (ImagePath, FailureCommand
    and ServiceDLL) in registry by processes with Medium integrity level
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        IntegrityLevel: Medium
    SELECTION_4:
        CommandLine: '*ControlSet*'
    SELECTION_5:
        CommandLine: '*services*'
    SELECTION_6:
        CommandLine:
        - '*\ImagePath*'
        - '*\FailureCommand*'
        - '*\ServiceDll*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
enrichment:
- EN_0001_cache_sysmon_event_id_1_info
- EN_0003_enrich_other_sysmon_events_with_event_id_1_data
falsepositives:
- Unknown
id: 0f9c21f1-6a73-4b0e-9809-cb562cb8d981
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/09/15
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://pentestlab.blog/2017/03/31/insecure-registry-permissions/
status: experimental
tags:
- attack.privilege_escalation
- attack.t1574.011
yml_filename: proc_creation_win_possible_privilege_escalation_via_service_reg_perm.yml
yml_path: rules/windows/process_creation
---

