title: Service ImagePath Change with Reg.exe
ruletype: Sigma
author: frack113
date: 2021/12/30
description: |
    Adversaries may execute their own malicious payloads by hijacking the Registry entries used by services.
    Adversaries may use flaws in the permissions for registry to redirect from the originally specified executable to one that they control, in order to launch their own code at Service start.
    Windows stores local service configuration information in the Registry under HKLM\SYSTEM\CurrentControlSet\Services
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\reg.exe'
    SELECTION_4:
        CommandLine: '*add *'
    SELECTION_5:
        CommandLine: '*SYSTEM\CurrentControlSet\Services\\*'
    SELECTION_6:
        CommandLine: '* ImagePath *'
    SELECTION_7:
        CommandLine:
        - '* /d *'
        - '* -d *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 9b0b7ac3-6223-47aa-a3fd-e8f211e637db
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/03/29
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1574.011/T1574.011.md#atomic-test-2---service-imagepath-change-with-regexe
status: experimental
tags:
- attack.persistence
- attack.t1574.011
yml_filename: proc_creation_win_reg_service_imagepath_change.yml
yml_path: rules/windows/process_creation
---

