
title: Suspicious Schtasks Execution AppData Folder
ruletype: Sigma
author: pH-T
date: 2022/03/15
description: Detects the creation of a schtask that executes a file from C:\Users\<USER>\AppData\Local
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\schtasks.exe'
  SELECTION_3:
    CommandLine: '*/Create*'
  SELECTION_4:
    CommandLine: '*/RU "NT AUT*'
  SELECTION_5:
    CommandLine: '*/TR*'
  SELECTION_6:
    CommandLine: '*C:\Users\\*'
  SELECTION_7:
    CommandLine: '*\AppData\Local\\*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: c5c00f49-b3f9-45a6-997e-cfdecc6e1967
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
status: experimental
tags:
- attack.execution
- attack.persistence
- attack.t1053.005
- attack.t1059.001
