
title: Always Install Elevated Windows Installer
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
date: 2020/10/13
description: This rule looks for Windows Installer service (msiexec.exe) trying to
  install MSI packages with SYSTEM privilege
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*\system32\msiexec.exe /V'
  SELECTION_11:
    ParentCommandLine: '*\system32\msiexec.exe /V'
  SELECTION_2:
    Image: '*\Windows\Installer\\*'
  SELECTION_3:
    Image: '*msi*'
  SELECTION_4:
    Image: '*tmp'
  SELECTION_5:
    User:
    - '*AUTHORI*'
    - '*AUTORI*'
  SELECTION_6:
    Image: '*\msiexec.exe'
  SELECTION_7:
    User:
    - '*AUTHORI*'
    - '*AUTORI*'
  SELECTION_8:
    IntegrityLevel: System
  SELECTION_9:
    ParentImage: C:\Windows\System32\services.exe
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7 and SELECTION_8)) and  not ((SELECTION_9) or (SELECTION_10
    or SELECTION_11)))
falsepositives:
- System administrator Usage
fields:
- IntegrityLevel
- User
- Image
id: cd951fdc-4b2f-47f5-ba99-a33bf61e3770
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/18
references:
- https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-48-638.jpg
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548.002
