
title: Use of ScreenConnect Remote Access Software
ruletype: Sigma
author: frack113
date: 2022/02/13
description: "An adversary may use legitimate desktop support and remote access software,\
  \ such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive\
  \ command and control channel to target systems within networks.\nThese services\
  \ are commonly used as legitimate technical support software, and may be allowed\
  \ by application control within a target environment.\nRemote access tools like\
  \ VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate\
  \ software commonly used by adversaries. (Citation: Symantec Living off the Land)\
  \ \n"
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Description: ScreenConnect Service
  SELECTION_3:
    Product: ScreenConnect
  SELECTION_4:
    Company: ScreenConnect Software
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use
id: 57bff678-25d1-4d6c-8211-8ca106d12053
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1219/T1219.md#atomic-test-5---screenconnect-application-download-and-install-on-windows
status: experimental
tags:
- attack.command_and_control
- attack.t1219
