
title: Suspicious Add Scheduled Command Pattern
ruletype: Sigma
author: Florian Roth
date: 2022/02/23
description: Detects suspicious scheduled task creations with commands that are uncommon
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*\AppData\\*'
  SELECTION_2:
    Image: '*schtasks.exe'
  SELECTION_3:
    CommandLine: '*/Create *'
  SELECTION_4:
    CommandLine:
    - '*/sc minute *'
    - '*/ru system *'
  SELECTION_5:
    CommandLine:
    - '*cmd.exe /c *'
    - '*cmd /c*'
  SELECTION_6:
    CommandLine:
    - '* bypass *'
    - '*.DownloadString*'
    - '*.DownloadFile*'
    - '*FromBase64String*'
    - '* -w hidden *'
    - '* IEX*'
    - '* -enc *'
    - '* -decode *'
    - '*/c start /min *'
    - '* curl *'
  SELECTION_7:
    CommandLine: '*/xml C:\Users\\*'
  SELECTION_8:
    CommandLine: '*\AppData\Local\\*'
  SELECTION_9:
    CommandLine: '*wscript.exe*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
    SELECTION_5) or SELECTION_6 or (SELECTION_7 and SELECTION_8) or (SELECTION_9 and
    SELECTION_10)))
falsepositives:
- Software installers that run from temporary folders and also install scheduled tasks
id: f2c64357-b1d2-41b7-849f-34d2682c0fad
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/23
references:
- https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/
status: experimental
tags:
- attack.execution
- attack.t1053.005
