title: NirCmd Tool Execution
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2022/01/24
description: Detects the use of NirCmd tool for command execution, which could be
    the result of legitimate administrative activity
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: NirCmd.exe
    SELECTION_4:
        CommandLine:
        - '* execmd *'
        - '*.exe script *'
        - '*.exe shexec *'
        - '* runinteractive *'
    SELECTION_5:
        CommandLine:
        - '* exec *'
        - '* exec2 *'
    SELECTION_6:
        CommandLine:
        - '* show *'
        - '* hide *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Legitimate use by administrators
fields:
- CommandLine
- ParentCommandLine
id: 4e2ed651-1906-4a59-a78a-18220fca1b22
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/08
references:
- https://www.nirsoft.net/utils/nircmd.html
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
- https://www.nirsoft.net/utils/nircmd2.html#using
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
yml_filename: proc_creation_win_tool_nircmd.yml
yml_path: rules/windows/process_creation
---

