
title: Harvesting of Wifi Credentials Using netsh.exe
author: Andreas Hunkeler (@Karneades), oscd.community
date: 2020/04/20
description: Detect the harvesting of wifi credentials using netsh.exe
detection:
  SELECTION_1:
    Image: '*\netsh.exe'
  SELECTION_2:
    CommandLine: '*wlan*'
  SELECTION_3:
    CommandLine: '* s*'
  SELECTION_4:
    CommandLine: '* p*'
  SELECTION_5:
    CommandLine: '* k*'
  SELECTION_6:
    CommandLine: '*=clear*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Legitimate administrator or user uses netsh.exe wlan functionality for legitimate
  reason
id: 42b1a5b8-353f-4f10-b256-39de4467faff
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
references:
- https://blog.malwarebytes.com/threat-analysis/2020/04/new-agenttesla-variant-steals-wifi-credentials/
status: test
tags:
- attack.discovery
- attack.credential_access
- attack.t1040
