
title: Run Whoami as SYSTEM
author: Teymur Kheirkhabarov, Florian Roth
date: 2019/10/23
description: Detects a whoami.exe executed by LOCAL SYSTEM. This may be a sign of
  a successful local privilege escalation.
detection:
  SELECTION_1:
    User:
    - '*AUTHORI*'
    - '*AUTORI*'
  SELECTION_2:
    Image: '*\whoami.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Possible name overlap with NT AUHTORITY substring to cover all languages
id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/28
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033
