
title: Ncat Execution
author: frack113, Florian Roth
date: 2021/07/21
description: Adversaries may use a non-application layer protocol for communication
  between host and C2 server or among infected hosts within a network
detection:
  SELECTION_1:
    Image:
    - '*\ncat.exe'
    - '*\netcat.exe'
  SELECTION_2:
    CommandLine:
    - '* -lvp *'
    - '* -l -v -p *'
    - '* -lv -p *'
    - '* -l --proxy-type http *'
    - '* --exec cmd.exe *'
    - '* -vnl --exec *'
  condition: (SELECTION_1 or SELECTION_2)
falsepositives:
- Legitimate ncat use
id: e31033fc-33f0-4020-9a16-faf9b31cbf08
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/23
references:
- https://nmap.org/ncat/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1095/T1095.md
status: experimental
tags:
- attack.command_and_control
- attack.t1095
