title: Process Creation with Renamed BrowserCore.exe
ruletype: Sigma
author: Max Altgelt
date: 2022/06/02
description: Detects process creation with a renamed BrowserCore.exe (used to extract
    Azure tokens)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: BrowserCore.exe
    SELECTION_4:
        NewProcessName: '*\BrowserCore.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- Unknown
id: 8a4519e8-e64a-40b6-ae85-ba8ad2177559
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/mariuszbit/status/1531631015139102720
status: experimental
tags:
- attack.t1528
- attack.t1036.003
yml_filename: proc_creation_win_renamed_browsercore.yml
yml_path: rules/windows/process_creation
---

