
title: Suspicious Where Execution
ruletype: Sigma
author: frack113
date: 2021/12/13
description: |
  Adversaries may enumerate browser bookmarks to learn more about compromised hosts.
  Browser bookmarks may reveal personal information about users (ex: banking sites, interests, social media, etc.) as well as details about
  internal network resources such as servers, tools/dashboards, or other related infrastructure.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\where.exe'
  SELECTION_3:
    CommandLine:
    - '*Bookmarks*'
    - '*places.sqlite*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 725a9768-0f5e-4cb3-aec2-bc5719c6831a
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1217/T1217.md
status: experimental
tags:
- attack.discovery
- attack.t1217
