title: Suspicious Spool Service Child Process
ruletype: Sigma
author: Justin C. (@endisphotic), @dreadphones (detection), Thomas Patzke (Sigma rule)
date: 2021/07/11
description: Detects suspicious print spool service (spoolsv.exe) child processes.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        NewProcessName: '*\netsh.exe'
    SELECTION_11:
        CommandLine:
        - '*add portopening*'
        - '*rule name*'
    SELECTION_12:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_13:
        CommandLine: '*.spl*'
    SELECTION_14:
        NewProcessName: '*\rundll32.exe'
    SELECTION_15:
        CommandLine: '*rundll32.exe'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\spoolsv.exe'
    SELECTION_4:
        IntegrityLevel: System
    SELECTION_5:
        NewProcessName:
        - '*\gpupdate.exe'
        - '*\whoami.exe'
        - '*\nltest.exe'
        - '*\taskkill.exe'
        - '*\wmic.exe'
        - '*\taskmgr.exe'
        - '*\sc.exe'
        - '*\findstr.exe'
        - '*\curl.exe'
        - '*\wget.exe'
        - '*\certutil.exe'
        - '*\bitsadmin.exe'
        - '*\accesschk.exe'
        - '*\wevtutil.exe'
        - '*\bcdedit.exe'
        - '*\fsutil.exe'
        - '*\cipher.exe'
        - '*\schtasks.exe'
        - '*\write.exe'
        - '*\wuauclt.exe'
    SELECTION_6:
        NewProcessName: '*\net.exe'
    SELECTION_7:
        CommandLine: '*start*'
    SELECTION_8:
        NewProcessName: '*\cmd.exe'
    SELECTION_9:
        CommandLine:
        - '*.spl*'
        - '*route add*'
        - '*program files*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        (((((SELECTION_5 or (SELECTION_6 and  not (SELECTION_7))) or (SELECTION_8
        and  not (SELECTION_9))) or (SELECTION_10 and  not (SELECTION_11))) or (SELECTION_12
        and  not (SELECTION_13))) or (SELECTION_14 and SELECTION_15)))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
id: dcdbc940-0bff-46b2-95f3-2d73f848e33b
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Exploits/Print%20Spooler%20RCE/Suspicious%20Spoolsv%20Child%20Process.md
status: stable
tags:
- attack.execution
- attack.t1203
- attack.privilege_escalation
- attack.t1068
yml_filename: proc_creation_win_susp_spoolsv_child_processes.yml
yml_path: rules/windows/process_creation
---

