
title: Windows Defender Download Activity
author: Matthew Matchen
date: 2020/09/04
description: Detect the use of Windows Defender to download payloads
detection:
  SELECTION_1:
    CommandLine: '*MpCmdRun.exe*'
  SELECTION_2:
    Description: Microsoft Malware Protection Command Line Utility
  SELECTION_3:
    CommandLine: '*DownloadFile*'
  SELECTION_4:
    CommandLine: '*url*'
  condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 and SELECTION_4))
falsepositives:
- Unknown
fields:
- CommandLine
id: 46123129-1024-423e-9fae-43af4a0fa9a5
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://twitter.com/djmtshepana/status/1301608169496612866
- https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.command_and_control
- attack.t1105
