title: Winrar Compressing Dump Files
ruletype: Sigma
author: Florian Roth
date: 2022/01/04
description: Detects a suspicious winrar execution that involves a file with a .dmp
    extension, which could be a step in a process of dump file exfiltration
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\rar.exe'
        - '*\winrar.exe'
    SELECTION_4:
        Description: Command line RAR
    SELECTION_5:
        CommandLine: '*.dmp*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate use of WinRAR with a command line in which .dmp appears incidentally
id: 1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/06/17
references:
- https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
status: experimental
tags:
- attack.collection
- attack.t1560.001
yml_filename: proc_creation_win_susp_winrar_dmp.yml
yml_path: rules/windows/process_creation
---

