
title: Suspicious Dosfuscation Character in Commandline
ruletype: Sigma
author: frack113
date: 2022/02/15
description: Posssible Payload Obfuscation
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine:
    - '*^^*'
    - '*,;,*'
    - '*%COMSPEC:~*'
    - '* s^et *'
    - '* s^e^t *'
    - '* se^t *'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate use
id: a77c1610-fc73-4019-8e29-0f51efc04a51
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/dosfuscation-report.pdf
status: experimental
tags:
- attack.execution
- attack.t1059
