
title: Suspicious Use of PsLogList
author: Nasreddine Bencherchali @nas_bench
date: 2021/12/18
description: Threat actors can use the PsLogList utility to dump event log in order
  to extract admin accounts and perform account discovery.
detection:
  SELECTION_1:
    OriginalFileName: '*psloglist*'
  SELECTION_2:
    Image:
    - '*\psloglist.exe'
    - '*\psloglist64.exe'
  SELECTION_3:
    CommandLine:
    - '*-d*'
    - '*/d*'
    - '*-x*'
    - '*/x*'
    - '*-s*'
    - '*/s*'
  SELECTION_4:
    CommandLine: '*security*'
  SELECTION_5:
    CommandLine: '*accepteula*'
  condition: ((SELECTION_1 or SELECTION_2) or (SELECTION_3 and SELECTION_4 and SELECTION_5))
falsepositives:
- Another tool that uses the command line switches of PsLogList
- Legitimate use of PsLogList by an administrator
id: aae1243f-d8af-40d8-ab20-33fc6d0c55bc
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://research.nccgroup.com/2021/01/12/abusing-cloud-services-to-fly-under-the-radar/
- https://www.cybereason.com/blog/deadringer-exposing-chinese-threat-actors-targeting-major-telcos
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Sysinternals/PsLogList
status: experimental
tags:
- attack.discovery
- attack.t1087
- attack.t1087.001
- attack.t1087.002
