
title: Application Executed Non-Executable Extension
author: Tim Shelton, Florian Roth
date: 2022/01/13
description: Detects the execution of rundll32 with a command line that doesn't contain
  a .dll file
detection:
  SELECTION_1:
    Image: '*\rundll32.exe'
  SELECTION_2:
    CommandLine|re: ^$
  SELECTION_3:
    CommandLine: '*.dll*'
  SELECTION_4:
    CommandLine: ''
  SELECTION_5:
    ParentImage: '*:\Program Files\Internet Explorer\iexplore.exe'
  SELECTION_6:
    CommandLine: '*.cpl*'
  SELECTION_7:
    ParentImage: '*:\Windows\SysWOW64\msiexec.exe'
  SELECTION_8:
    CommandLine: C:\Windows\syswow64\MsiExec.exe -Embedding*
  condition: (SELECTION_1 and  not ((SELECTION_2) or (SELECTION_3 or SELECTION_4)
    or (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/25
references:
- https://twitter.com/mrd0x/status/1481630810495139841?s=12
status: experimental
