
title: Winword.exe Loads Suspicious DLL
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects Winword.exe loading of custmom dll via /l cmd switch
detection:
  SELECTION_1:
    Image: '*\winword.exe'
  SELECTION_2:
    CommandLine: '*/l*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
fields:
- CommandLine
id: 2621b3a6-3840-4810-ac14-a02426086171
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/LOLUtilz/OtherMSBinaries/Winword.yml
status: test
tags:
- attack.defense_evasion
- attack.t1202
