title: Winrar Execution in Non-Standard Folder
ruletype: Sigma
author: Florian Roth, Tigzy
date: 2021/11/17
description: Detects a suspicious winrar execution in a folder which is not the default
    installation folder
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\rar.exe'
        - '*\winrar.exe'
    SELECTION_4:
        Description: Command line RAR
    SELECTION_5:
        NewProcessName:
        - '*\WinRAR*'
        - '*C:\Windows\Temp*'
        - '*\UnRAR.exe*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Legitimate use of WinRAR in a folder of a software that bundles WinRAR
id: 4ede543c-e098-43d9-a28f-dd784a13132f
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/22
references:
- https://twitter.com/cyb3rops/status/1460978167628406785
status: experimental
tags:
- attack.collection
- attack.t1560.001
yml_filename: proc_creation_win_susp_winrar_execution.yml
yml_path: rules/windows/process_creation
---

