
title: UNC2452 Process Creation Patterns
author: Florian Roth
date: 2021/01/22
description: Detects a specific process creation patterns as seen used by UNC2452
  and provided by Microsoft as Microsoft Defender ATP queries
detection:
  SELECTION_1:
    CommandLine:
    - '*7z.exe a -v500m -mx9 -r0 -p*'
  SELECTION_10:
    CommandLine: '*rundll32 c:\windows\\*'
  SELECTION_11:
    CommandLine: '*.dll *'
  SELECTION_12:
    ParentImage: '*\rundll32.exe'
  SELECTION_13:
    Image: '*\dllhost.exe'
  SELECTION_14:
    CommandLine:
    - ' '
    - ''
  SELECTION_2:
    ParentCommandLine: '*wscript.exe*'
  SELECTION_3:
    ParentCommandLine: '*.vbs*'
  SELECTION_4:
    CommandLine: '*rundll32.exe*'
  SELECTION_5:
    CommandLine: '*C:\Windows*'
  SELECTION_6:
    CommandLine: '*.dll,Tk_*'
  SELECTION_7:
    ParentImage: '*\rundll32.exe'
  SELECTION_8:
    ParentCommandLine: '*C:\Windows*'
  SELECTION_9:
    CommandLine: '*cmd.exe /C *'
  condition: ((((SELECTION_1 or (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)) or (SELECTION_7 and SELECTION_8 and SELECTION_9)) or (SELECTION_10
    and SELECTION_11)) or ((SELECTION_12 and SELECTION_13) and  not (SELECTION_14)))
falsepositives:
- Unknown
id: 9be34ad0-b6a7-4fbd-91cf-fc7ec1047f5f
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/06/27
references:
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
status: experimental
tags:
- attack.execution
- attack.t1059.001
