title: Suspicious Encoded Obfuscated LOAD String
ruletype: Sigma
author: pH-T
date: 2022/03/01
description: Detects suspicious base64 encoded and obbfuscated LOAD string often used
    for reflection.assembly load
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*OgA6ACgAIgBMACIAKwAiAG8AYQBkACIAKQ*'
        - '*oAOgAoACIATAAiACsAIgBvAGEAZAAiACkA*'
        - '*6ADoAKAAiAEwAIgArACIAbwBhAGQAIgApA*'
        - '*OgA6ACgAIgBMAG8AIgArACIAYQBkACIAKQ*'
        - '*oAOgAoACIATABvACIAKwAiAGEAZAAiACkA*'
        - '*6ADoAKAAiAEwAbwAiACsAIgBhAGQAIgApA*'
        - '*OgA6ACgAIgBMAG8AYQAiACsAIgBkACIAKQ*'
        - '*oAOgAoACIATABvAGEAIgArACIAZAAiACkA*'
        - '*6ADoAKAAiAEwAbwBhACIAKwAiAGQAIgApA*'
        - '*OgA6ACgAJwBMACcAKwAnAG8AYQBkACcAKQ*'
        - '*oAOgAoACcATAAnACsAJwBvAGEAZAAnACkA*'
        - '*6ADoAKAAnAEwAJwArACcAbwBhAGQAJwApA*'
        - '*OgA6ACgAJwBMAG8AJwArACcAYQBkACcAKQ*'
        - '*oAOgAoACcATABvACcAKwAnAGEAZAAnACkA*'
        - '*6ADoAKAAnAEwAbwAnACsAJwBhAGQAJwApA*'
        - '*OgA6ACgAJwBMAG8AYQAnACsAJwBkACcAKQ*'
        - '*oAOgAoACcATABvAGEAJwArACcAZAAnACkA*'
        - '*6ADoAKAAnAEwAbwBhACcAKwAnAGQAJwApA*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
fields:
- CommandLine
id: 9c0295ce-d60d-40bd-bd74-84673b7592b1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/05/20
references:
- https://github.com/Neo23x0/Raccine/blob/20a569fa21625086433dcce8bb2765d0ea08dcb6/yara/mal_revil.yar
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
related:
-   id: 62b7ccc9-23b4-471e-aa15-6da3663c4d59
    type: similar
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1027
yml_filename: proc_creation_win_susp_base64_load.yml
yml_path: rules/windows/process_creation
---

