
title: Possible SPN Enumeration
author: Markus Neis, keepwatch
date: 2018/11/14
description: Detects Service Principal Name Enumeration used for Kerberoasting
detection:
  SELECTION_1:
    Image: '*\setspn.exe'
  SELECTION_2:
    Description: '*Query or reset the computer*'
  SELECTION_3:
    Description: '*SPN attribute*'
  SELECTION_4:
    CommandLine: '*-q*'
  condition: ((SELECTION_1 or (SELECTION_2 and SELECTION_3)) and SELECTION_4)
falsepositives:
- Administrator Activity
id: 1eeed653-dbc8-4187-ad0c-eeebb20e6599
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://p16.praetorian.com/blog/how-to-use-kerberoasting-t1208-for-privilege-escalation
status: test
tags:
- attack.credential_access
- attack.t1558.003
