
title: NirCmd Tool Execution
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali @nas_bench
date: 2022/01/24
description: Detects the use of NirCmd tool for command execution, which could be
  the result of legitimate administrative activity
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\nircmd.exe'
    - '*\nircmdc.exe'
  SELECTION_3:
    CommandLine:
    - '* execmd *'
    - '* exec2 *'
  SELECTION_4:
    CommandLine:
    - '* copy *'
    - '* del *'
  condition: (SELECTION_1 and (SELECTION_2 or (SELECTION_3 and SELECTION_4)))
falsepositives:
- Legitimate use by administrators
fields:
- CommandLine
- ParentCommandLine
id: 4e2ed651-1906-4a59-a78a-18220fca1b22
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.nirsoft.net/utils/nircmd.html
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
- https://www.nirsoft.net/utils/nircmd2.html#using
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
