title: Invoke-Obfuscation COMPRESS OBFUSCATION
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*new-object*'
    SELECTION_4:
        CommandLine: '*text.encoding]::ascii*'
    SELECTION_5:
        CommandLine:
        - '*system.io.compression.deflatestream*'
        - '*system.io.streamreader*'
    SELECTION_6:
        CommandLine: '*readtoend'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 7eedcc9d-9fdb-4d94-9c54-474e8affc0c7
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/03/07
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
yml_filename: proc_creation_win_invoke_obfuscation_via_compress.yml
yml_path: rules/windows/process_creation
---

