title: Use of Forfiles For Execution
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/14
description: Execute commands and binaries from the context of "forfiles". This is
    used as a LOLBIN for example to bypass application whitelisting.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\forfiles.exe'
    SELECTION_4:
        OriginalFileName: forfiles.exe
    SELECTION_5:
        CommandLine:
        - '* /p *'
        - '* -p *'
    SELECTION_6:
        CommandLine:
        - '* /m *'
        - '* -m *'
    SELECTION_7:
        CommandLine:
        - '* /c *'
        - '* -c *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate use by a via a batch script or by an administrator.
id: 9aa5106d-bce3-4b13-86df-3a20f1d5cf0b
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
- https://pentestlab.blog/2020/07/06/indirect-command-execution/
status: experimental
tags:
- attack.execution
- attack.t1059
yml_filename: proc_creation_win_lolbin_forfiles.yml
yml_path: rules/windows/process_creation
---

