
title: Run Once Task Execution as Configured in Registry
author: Avneet Singh @v3t0_, oscd.community
date: 2020/10/18
description: This rule detects the execution of Run Once task as configured in the
  registry
detection:
  SELECTION_1:
    Image:
    - '*\runonce.exe'
  SELECTION_2:
    Description:
    - Run Once Wrapper
  SELECTION_3:
    CommandLine:
    - '* /AlternateShellStartup*'
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- Unknown
id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Runonce.yml
status: test
tags:
- attack.defense_evasion
- attack.t1112
