
title: Dism Remove Online Package
author: frack113
date: 2022/01/16
description: Deployment Image Servicing and Management tool. DISM is used to enumerate,
  install, uninstall, configure, and update features and packages in Windows images
detection:
  SELECTION_1:
    Image: '*\DismHost.exe'
  SELECTION_10:
    CommandLine: '*/Remove*'
  SELECTION_2:
    ParentCommandLine: '*/online*'
  SELECTION_3:
    ParentCommandLine: '*/Disable-Feature*'
  SELECTION_4:
    ParentCommandLine: '*/FeatureName:*'
  SELECTION_5:
    ParentCommandLine: '*/Remove*'
  SELECTION_6:
    Image: '*\Dism.exe'
  SELECTION_7:
    CommandLine: '*/online*'
  SELECTION_8:
    CommandLine: '*/Disable-Feature*'
  SELECTION_9:
    CommandLine: '*/FeatureName:*'
  condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9 and SELECTION_10))
falsepositives:
- Legitim script
id: 43e32da2-fdd0-4156-90de-50dfd62636f9
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-26---disable-windows-defender-with-dism
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
