
title: Explorer NOUACCHECK Flag
author: Florian Roth
date: 2022/02/23
description: Detects suspicious starts of explorer.exe that use the /NOUACCHECK flag
  that allows to run all sub processes of that newly started explorer.exe without
  any UAC checks
detection:
  SELECTION_1:
    Image: '*\explorer.exe'
  SELECTION_2:
    CommandLine: '*/NOUACCHECK*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown how many legitimate software products use that method
id: 534f2ef7-e8a2-4433-816d-c91bccde289b
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/ORCA6665/status/1496478087244095491
status: test
tags:
- attack.defense_evasion
- attack.t1548.002
