title: PrintBrm ZIP Creation of Extraction
ruletype: Sigma
author: frack113
date: 2022/05/02
description: Detects the execution of the LOLBIN PrintBrm.exe, which can be used to
    create or extract ZIP files. PrintBrm.exe should not be run on a normal workstation.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\PrintBrm.exe'
    SELECTION_4:
        CommandLine: '* -f*'
    SELECTION_5:
        CommandLine: '*.zip*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: cafeeba3-01da-4ab4-b6c4-a31b1d9730c7
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/PrintBrm/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
- attack.defense_evasion
- attack.t1564.004
yml_filename: proc_creation_win_lolbin_printbrm.yml
yml_path: rules/windows/process_creation
---

