
title: Suspicious DIR Execution
ruletype: Sigma
author: frack113
date: 2021/12/13
description: Use dir to collect information
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*dir *'
  SELECTION_3:
    CommandLine: '* /s*'
  SELECTION_4:
    CommandLine: '* /b*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1217/T1217.md
status: experimental
tags:
- attack.discovery
- attack.t1217
