
title: PurpleSharp Indicator
author: Florian Roth
date: 2021/06/18
description: Detects the execution of the PurpleSharp adversary simulation tool
detection:
  SELECTION_1:
    CommandLine:
    - '*xyz123456.exe*'
    - '*PurpleSharp*'
  SELECTION_2:
    OriginalFileName: PurpleSharp.exe
  condition: (SELECTION_1 or SELECTION_2)
falsepositives:
- Unlikely
id: ff23ffbc-3378-435e-992f-0624dcf93ab4
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/01/12
references:
- https://github.com/mvelazc0/PurpleSharp
status: experimental
tags:
- attack.t1587
- attack.resource_development
