title: WMIC Service Start/Stop
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/20
description: Detects usage of wmic to start or stop a service
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: wmic.exe
    SELECTION_4:
        NewProcessName: '*\WMIC.exe'
    SELECTION_5:
        CommandLine: '* service *'
    SELECTION_6:
        CommandLine: '* call *'
    SELECTION_7:
        CommandLine:
        - '*stopservice*'
        - '*startservice*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
id: 0b7163dc-7eee-4960-af17-c0cd517f92da
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
status: experimental
tags:
- attack.execution
- attack.t1047
yml_filename: proc_creation_win_wmic_service.yml
yml_path: rules/windows/process_creation
---

