
title: Sysinternals SDelete Delete File
author: frack113
date: 2021/06/03
description: Use of SDelete to erase a file not the free space
detection:
  SELECTION_1:
    OriginalFileName: sdelete.exe
  SELECTION_2:
    CommandLine:
    - '* -h*'
    - '* -c*'
    - '* -z*'
    - '* /?*'
  condition: (SELECTION_1 and  not (SELECTION_2))
falsepositives:
- System administrator Usage
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: a4824fca-976f-4964-b334-0621379e84c4
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.md
status: experimental
tags:
- attack.impact
- attack.t1485
