
title: Invoke-Obfuscation Via Use Rundll32
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2019/10/08
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*&&*'
  SELECTION_3:
    CommandLine: '*rundll32*'
  SELECTION_4:
    CommandLine: '*shell32.dll*'
  SELECTION_5:
    CommandLine: '*shellexec_rundll*'
  SELECTION_6:
    CommandLine:
    - '*value*'
    - '*invoke*'
    - '*comspec*'
    - '*iex*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 36c5146c-d127-4f85-8e21-01bf62355d5a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/08
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
