title: Wusa Extracting Cab Files From Suspicious Paths
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/05
description: Detects usage of the "wusa.exe" (Windows Update Standalone Installer)
    utility to extract cab using the "/extract" argument from suspicious paths
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wusa.exe'
    SELECTION_4:
        CommandLine: '*/extract:*'
    SELECTION_5:
        CommandLine:
        - '*C:\Users\Public\\*'
        - '*\Desktop\\*'
        - '*\Downloads\\*'
        - '*\Appdata\Local\Temp\\*'
        - '*\Windows\Temp\\*'
        - '*\PerfLogs\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: c74c0390-3e20-41fd-a69a-128f0275a5ea
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
- https://www.echotrail.io/insights/search/wusa.exe/
status: experimental
tags:
- attack.execution
yml_filename: proc_creation_win_wusa_susp_cap_extraction_from_susp_paths.yml
yml_path: rules/windows/process_creation
---

