
title: Suspicious Add Scheduled Task From User AppData Temp
ruletype: Sigma
author: frack113
date: 2021/11/03
description: schtasks.exe create task from user AppData\Local\Temp
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*schtasks.exe'
  SELECTION_3:
    CommandLine: '*/Create *'
  SELECTION_4:
    CommandLine: '*\AppData\Local\Temp*'
  SELECTION_5:
    CommandLine: '*/Create /TN "klcp_update" /XML *'
  SELECTION_6:
    CommandLine: '*\klcp_update_task.xml*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: 43f487f0-755f-4c2a-bce7-d6d2eec2fcf8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/09
references:
- malware analyse https://www.joesandbox.com/analysis/514608/0/html#324415FF7D8324231381BAD48A052F85DF04
status: experimental
tags:
- attack.execution
- attack.t1053.005
