
title: Renamed ProcDump
author: Florian Roth
date: 2019/11/18
description: Detects the execution of a renamed ProcDump executable often used by
  attackers or malware
detection:
  SELECTION_1:
    OriginalFileName: procdump
  SELECTION_2:
    CommandLine: '* -ma *'
  SELECTION_3:
    CommandLine: '* -accepteula *'
  SELECTION_4:
    CommandLine: '* -ma *'
  SELECTION_5:
    CommandLine: '*.dmp*'
  SELECTION_6:
    Image:
    - '*\procdump.exe'
    - '*\procdump64.exe'
  condition: (((SELECTION_1 or (SELECTION_2 and SELECTION_3)) or (SELECTION_4 and
    SELECTION_5)) and  not (SELECTION_6))
falsepositives:
- Procdump illegaly bundled with legitimate software
- Weird admins who renamed binaries
id: 4a0b2c7e-7cb2-495d-8b63-5f268e7bfd67
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/08/16
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003
