title: Suspicious Listing of Network Connections
ruletype: Sigma
author: frack113
date: 2021/12/10
description: Adversaries may attempt to get a listing of network connections to or
    from the compromised system they are currently accessing or from remote systems
    by querying for information over the network.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*netstat*'
    SELECTION_4:
        CommandLine: '*net *'
    SELECTION_5:
        CommandLine:
        - '* use'
        - '* sessions'
    SELECTION_6:
        CommandLine:
        - '* use *'
        - '* sessions *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        (SELECTION_5 or SELECTION_6))))
falsepositives:
- Unknown
id: 1c67a717-32ba-409b-a45d-0fb704a73a81
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1049/T1049.md#atomic-test-1---system-network-connections-discovery
status: experimental
tags:
- attack.discovery
- attack.t1049
yml_filename: proc_creation_win_susp_network_listing_connections.yml
yml_path: rules/windows/process_creation
---

