
title: Renamed PowerShell
author: Florian Roth, frack113
date: 2019/08/22
description: Detects the execution of a renamed PowerShell often used by attackers
  or malware
detection:
  SELECTION_1:
    Description:
    - Windows PowerShell*
    - pwsh*
  SELECTION_2:
    Company: Microsoft Corporation
  SELECTION_3:
    Image:
    - '*\powershell.exe'
    - '*\powershell_ise.exe'
    - '*\pwsh.exe'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Unknown
id: d178a2d7-129a-4ba4-8ee6-d6e1fecd5d20
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/07/03
references:
- https://twitter.com/christophetd/status/1164506034720952320
status: test
tags:
- car.2013-05-009
- attack.defense_evasion
- attack.t1036.003
