
title: Registry Parse with Pypykatz
ruletype: Sigma
author: frack113
date: 2022/01/05
description: Adversaries may attempt to extract credential material from the Security
  Account Manager (SAM) database either through Windows Registry where the SAM database
  is stored
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\pypykatz.exe'
    - '*\python.exe'
  SELECTION_3:
    CommandLine: '*live*'
  SELECTION_4:
    CommandLine: '*registry*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: a29808fd-ef50-49ff-9c7a-59a9b040b404
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/skelsec/pypykatz
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-2---registry-parse-with-pypykatz
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
