
title: Encoded PowerShell Command Line
ruletype: Sigma
author: Teymur Kheirkhabarov (idea), Vasiliy Burov (rule), oscd.community
date: 2020/10/11
description: Detects specific combinations of encoding methods in the PowerShell command
  lines
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_10:
    CommandLine: '*join*'
  SELECTION_11:
    Image: '*\powershell.exe'
  SELECTION_12:
    CommandLine: '*ForEach*'
  SELECTION_13:
    CommandLine: '*Xor*'
  SELECTION_14:
    Image: '*\powershell.exe'
  SELECTION_15:
    CommandLine:
    - '*cOnvErTTO-SECUreStRIng*'
  SELECTION_2:
    Image: '*\powershell.exe'
  SELECTION_3:
    CommandLine:
    - '*ToInt*'
    - '*ToDecimal*'
    - '*ToByte*'
    - '*ToUint*'
    - '*ToSingle*'
    - '*ToSByte*'
  SELECTION_4:
    CommandLine:
    - '*ToChar*'
    - '*ToString*'
    - '*String*'
  SELECTION_5:
    Image: '*\powershell.exe'
  SELECTION_6:
    CommandLine: '*char*'
  SELECTION_7:
    CommandLine: '*join*'
  SELECTION_8:
    Image: '*\powershell.exe'
  SELECTION_9:
    CommandLine: '*split*'
  condition: (SELECTION_1 and (((((SELECTION_2 and SELECTION_3 and SELECTION_4) or
    (SELECTION_5 and SELECTION_6 and SELECTION_7)) or (SELECTION_8 and SELECTION_9
    and SELECTION_10)) or (SELECTION_11 and SELECTION_12 and SELECTION_13)) or (SELECTION_14
    and SELECTION_15)))
falsepositives:
- Unlikely
id: cdf05894-89e7-4ead-b2b0-0a5f97a90f2f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=65
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
