
title: Suspicious Curl Change User Agents
author: frack113
date: 2022/01/23
description: Detects a suspicious curl process start on Windows with set useragent
  options
detection:
  SELECTION_1:
    Image: '*\curl.exe'
  SELECTION_2:
    Product: The curl executable
  SELECTION_3:
    CommandLine:
    - '* -A *'
    - '* --user-agent *'
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3)
falsepositives:
- Scripts created by developers and admins
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: 3286d37a-00fd-41c2-a624-a672dcd34e60
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://curl.se/docs/manpage.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1071.001/T1071.001.md#atomic-test-2---malicious-user-agents---cmd
status: experimental
tags:
- attack.command_and_control
- attack.t1071.001
