
title: TA505 Dropper Load Pattern
author: Florian Roth
date: 2020/12/08
description: Detects mshta loaded by wmiprvse as parent as used by TA505 malicious
  documents
detection:
  SELECTION_1:
    Image: '*\mshta.exe'
  SELECTION_2:
    ParentImage: '*\wmiprvse.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- unknown
id: 18cf6cf0-39b0-4c22-9593-e244bdc9a2d4
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
references:
- https://twitter.com/ForensicITGuy/status/1334734244120309760
status: test
tags:
- attack.execution
- attack.g0092
- attack.t1106
