
title: Suspicious Svchost Process
author: Florian Roth
date: 2017/08/15
description: Detects a suspicious svchost process start
detection:
  SELECTION_1:
    Image: '*\svchost.exe'
  SELECTION_2:
    ParentImage:
    - '*\services.exe'
    - '*\MsMpEng.exe'
    - '*\Mrt.exe'
    - '*\rpcnet.exe'
    - '*\svchost.exe'
    - '*\ngen.exe'
    - '*\TiWorker.exe'
  SELECTION_3:
    ParentImage|re: ^$
  SELECTION_4:
    ParentImage: ''
  SELECTION_5:
    ParentImage: '-'
  condition: (SELECTION_1 and  not ((SELECTION_2) or (SELECTION_3) or (SELECTION_4)
    or (SELECTION_5)))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/02/09
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.005
