
title: Redirect Output in CommandLine
author: frack113
date: 2022/01/22
description: Use ">" to redicrect information in commandline
detection:
  SELECTION_1:
    Image: '*\cmd.exe'
  SELECTION_2:
    CommandLine: '*>*'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Unknown
id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://ss64.com/nt/syntax-redirection.html
status: experimental
tags:
- attack.discovery
- attack.t1082
