
title: File Download with Headless Browser
ruletype: Sigma
author: Sreeman, Florian Roth
date: 2022/01/04
description: This is an unusual method to download files. It starts a browser headless
  and downloads a file from a location. This can be used by threat actors to download
  files.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image:
    - '*\msedge.exe'
    - '*\chrome.exe'
  SELECTION_3:
    CommandLine: '*--headless*'
  SELECTION_4:
    CommandLine: '*dump-dom*'
  SELECTION_5:
    CommandLine: '*http*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 0e8cfe08-02c9-4815-a2f8-0d157b7ed33e
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mrd0x/status/1478234484881436672?s=12
tags:
- attack.command_and_control
- attack.t1105
