title: MSTSC Shadowing
ruletype: Sigma
author: Florian Roth
date: 2020/01/24
description: Detects RDP session hijacking by using MSTSC shadowing
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*noconsentprompt*'
    SELECTION_4:
        CommandLine: '*shadow:*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 6ba5a05f-b095-4f0a-8654-b825f4f16334
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://twitter.com/kmkz_security/status/1220694202301976576
- https://github.com/kmkz/Pentesting/blob/47592e5e160d3b86c2024f09ef04ceb87d204995/Post-Exploitation-Cheat-Sheet
status: test
tags:
- attack.lateral_movement
- attack.t1563.002
yml_filename: proc_creation_win_rdp_hijack_shadowing.yml
yml_path: rules/windows/process_creation
---

