title: OpenWith.exe Executes Specified Binary
ruletype: Sigma
author: Beyu Denis, oscd.community (rule), @harr0ey (idea)
date: 2019/10/12
description: The OpenWith.exe executes other binary
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\OpenWith.exe'
    SELECTION_4:
        CommandLine: '*/c*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of OpenWith.exe by legitimate user
id: cec8e918-30f7-4e2d-9bfa-a59cc97ae60f
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OSBinaries/Openwith.yml
- https://twitter.com/harr0ey/status/991670870384021504
status: test
tags:
- attack.defense_evasion
- attack.t1218
yml_filename: proc_creation_win_susp_openwith.yml
yml_path: rules/windows/process_creation
---

