title: Grabbing Sensitive Hives via Reg Utility
ruletype: Sigma
author: Teymur Kheirkhabarov, Endgame, JHasenbusch, Daniil Yugoslavskiy, oscd.community
date: 2019/10/22
description: Dump sam, system or security hives using REG.exe utility
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\reg.exe'
    SELECTION_4:
        CommandLine:
        - '*save*'
        - '*export*'
        - "*\u02E2ave*"
        - "*e\u02E3port*"
    SELECTION_5:
        CommandLine:
        - '*hklm*'
        - "*hk\u02EAm*"
        - '*hkey_local_machine*'
        - "*hkey_\u02EAocal_machine*"
        - "*hkey_loca\u02EA_machine*"
        - "*hkey_\u02EAoca\u02EA_machine*"
    SELECTION_6:
        CommandLine:
        - '*\system'
        - '*\sam'
        - '*\security'
        - "*\\\u02E2ystem"
        - "*\\sy\u02E2tem"
        - "*\\\u02E2y\u02E2tem"
        - "*\\\u02E2am"
        - "*\\\u02E2ecurity"
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Dumping hives for legitimate purpouse i.e. backup or forensic investigation
id: fd877b94-9bb5-4191-bb25-d79cbd93c167
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://eqllib.readthedocs.io/en/latest/analytics/aed95fc6-5e3f-49dc-8b35-06508613f979.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003/T1003.md
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
status: test
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- car.2013-07-001
yml_filename: proc_creation_win_grabbing_sensitive_hives_via_reg.yml
yml_path: rules/windows/process_creation
---

