
title: Password Cracking with Hashcat
ruletype: Sigma
author: frack113
date: 2021/12/27
description: Execute Hashcat.exe with provided SAM file from registry of Windows and
  Password list to crack against
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\hashcat.exe'
  SELECTION_3:
    CommandLine: '*-a *'
  SELECTION_4:
    CommandLine: '*-m 1000 *'
  SELECTION_5:
    CommandLine: '*-r *'
  condition: (SELECTION_1 and (SELECTION_2 or (SELECTION_3 and SELECTION_4 and SELECTION_5)))
falsepositives:
- Tools that accidentally use the same command line flags and values
id: 39b31e81-5f5f-4898-9c0e-2160cfc0f9bf
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/03/30
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1110.002/T1110.002.md#atomic-test-1---password-cracking-with-hashcat
- https://hashcat.net/wiki/doku.php?id=hashcat
status: experimental
tags:
- attack.credential_access
- attack.t1110.002
