
title: Suspicious GUP Usage
author: Florian Roth
date: 2019/02/06
description: Detects execution of the Notepad++ updater in a suspicious directory,
  which is often used in DLL side-loading attacks
detection:
  SELECTION_1:
    Image: '*\GUP.exe'
  SELECTION_2:
    Image:
    - '*\Users\\*\AppData\Local\Notepad++\updater\GUP.exe'
    - '*\Users\\*\AppData\Roaming\Notepad++\updater\GUP.exe'
    - '*\Program Files\Notepad++\updater\GUP.exe'
    - '*\Program Files (x86)\Notepad++\updater\GUP.exe'
  condition: (SELECTION_1 and  not (SELECTION_2))
falsepositives:
- Execution of tools named GUP.exe and located in folders different than Notepad++\updater
id: 0a4f6091-223b-41f6-8743-f322ec84930b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://www.fireeye.com/blog/threat-research/2018/09/apt10-targeting-japanese-corporations-using-updated-ttps.html
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
