
title: Suspicious Shells Spawn by Java
author: Andreas Hunkeler (@Karneades), Florian Roth
date: 2021/12/17
description: Detects suspicious shell spawn from Java host process (e.g. log4j exploitation)
detection:
  SELECTION_1:
    ParentImage: '*\java.exe'
  SELECTION_2:
    Image:
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\powershell.exe'
    - '*\schtasks.exe'
    - '*\certutil.exe'
    - '*\whoami.exe'
    - '*\bitsadmin.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\scrcons.exe'
    - '*\regsvr32.exe'
    - '*\hh.exe'
    - '*\wmic.exe'
    - '*\mshta.exe'
    - '*\rundll32.exe'
    - '*\forfiles.exe'
    - '*\scriptrunner.exe'
    - '*\mftrace.exe'
    - '*\AppVLP.exe'
    - '*\curl.exe'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/12/22
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
