
title: Suspicious AdvancedRun Execution
ruletype: Sigma
author: Florian Roth
date: 2022/01/20
description: Detects the execution of AdvancedRun utitlity
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\AdvancedRun.exe'
  SELECTION_3:
    CommandLine: '* /EXEFilename *'
  SELECTION_4:
    CommandLine: '* /Run*'
  SELECTION_5:
    CommandLine: '* /WindowState 0*'
  SELECTION_6:
    CommandLine: '* /RunAs *'
  SELECTION_7:
    CommandLine: '* /CommandLine *'
  condition: (SELECTION_1 and (SELECTION_2 or (SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: d2b749ee-4225-417e-b20e-a8d2193cbb84
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
status: experimental
