
title: LSASS Memory Dumping
author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
date: 2019/10/24
description: Detect creation of dump files containing the memory space of lsass.exe,
  which contains sensitive credentials. Identifies usage of Sysinternals procdump.exe
  to export the memory space of lsass.exe which contains sensitive credentials.
detection:
  SELECTION_1:
    CommandLine: '*lsass*'
  SELECTION_2:
    CommandLine: '*.dmp*'
  SELECTION_3:
    Image: '*\werfault.exe'
  SELECTION_4:
    Image: '*\procdump*'
  SELECTION_5:
    Image: '*.exe'
  SELECTION_6:
    CommandLine: '*lsass*'
  condition: (((SELECTION_1 and SELECTION_2) and  not (SELECTION_3)) or (SELECTION_4
    and SELECTION_5 and SELECTION_6))
falsepositives:
- Unlikely
fields:
- ComputerName
- User
- CommandLine
id: ffa6861c-4461-4f59-8a41-578c39f3f23e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://eqllib.readthedocs.io/en/latest/analytics/1e1ef6be-12fc-11e9-8d76-4d6bb837cda4.html
- https://eqllib.readthedocs.io/en/latest/analytics/210b4ea4-12fc-11e9-8d76-4d6bb837cda4.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003/T1003.md
status: test
tags:
- attack.credential_access
- attack.t1003.001
