title: Discovery of a System Time
ruletype: Sigma
author: E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2019/10/24
description: Identifies use of various commands to query a systems time. This technique
    may be used before executing a scheduled task or to discover the time zone of
    a target system.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_4:
        CommandLine: '*time*'
    SELECTION_5:
        NewProcessName: '*\w32tm.exe'
    SELECTION_6:
        CommandLine: '*tz*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Legitimate use of the system utilities to discover system time for legitimate reason
id: b243b280-65fe-48df-ba07-6ddea7646427
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/06/28
references:
- https://eqllib.readthedocs.io/en/latest/analytics/fcdb99c2-ac3c-4bde-b664-4b336329bed2.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1124/T1124.md
status: test
tags:
- attack.discovery
- attack.t1124
yml_filename: proc_creation_win_remote_time_discovery.yml
yml_path: rules/windows/process_creation
---

