
title: Windows 10 Scheduled Task SandboxEscaper 0-day
author: Olaf Hartong
date: 2019/05/22
description: Detects Task Scheduler .job import arbitrary DACL write\par
detection:
  SELECTION_1:
    Image: '*\schtasks.exe'
  SELECTION_2:
    CommandLine: '*/change*'
  SELECTION_3:
    CommandLine: '*/TN*'
  SELECTION_4:
    CommandLine: '*/RU*'
  SELECTION_5:
    CommandLine: '*/RP*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 931b6802-d6a6-4267-9ffa-526f57f22aaf
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/SandboxEscaper/polarbearrepo/tree/master/bearlpe
status: test
tags:
- attack.privilege_escalation
- attack.t1053.005
- car.2013-08-001
