
title: Netsh RDP Port Opening
author: Sander Wiebing
date: 2020/05/23
description: Detects netsh commands that opens the port 3389 used for RDP, used in
  Sarwent Malware
detection:
  SELECTION_1:
    CommandLine: '*netsh*'
  SELECTION_2:
    CommandLine: '*firewall add portopening*'
  SELECTION_3:
    CommandLine: '*tcp 3389*'
  SELECTION_4:
    CommandLine: '*advfirewall firewall add rule*'
  SELECTION_5:
    CommandLine: '*action=allow*'
  SELECTION_6:
    CommandLine: '*protocol=TCP*'
  SELECTION_7:
    CommandLine: '*localport=3389*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)))
falsepositives:
- Legitimate administration
id: 01aeb693-138d-49d2-9403-c4f52d7d3d62
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
