title: Renamed MegaSync
ruletype: Sigma
author: Sittikorn S
date: 2021/06/22
description: Detects the execution of a renamed meg.exe of MegaSync during incident
    response engagements associated with ransomware families like Nefilim, Sodinokibi,
    Pysa, and Conti.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\explorer.exe'
    SELECTION_4:
        CommandLine: '*C:\Windows\Temp\meg.exe*'
    SELECTION_5:
        OriginalFileName: meg.exe
    SELECTION_6:
        NewProcessName: '*\meg.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and  not (SELECTION_6))))
falsepositives:
- Software that illegaly integrates MegaSync in a renamed form
- Administrators that have renamed MegaSync
id: 643bdcac-8b82-49f4-9fd9-25a90b929f3b
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://redcanary.com/blog/rclone-mega-extortion/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
yml_filename: proc_creation_win_renamed_megasync.yml
yml_path: rules/windows/process_creation
---

