
title: Use of PktMon.exe
ruletype: Sigma
author: frack113
date: 2022/03/17
description: Tools to Capture Network Packets on the windows 10 with October 2018
  Update or later.
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*PktMon.exe'
  SELECTION_3:
    OriginalFileName: PktMon.exe
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Legitimate use
id: f956c7c1-0f60-4bc5-b7d7-b39ab3c08908
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Pktmon/
status: experimental
tags:
- attack.credential_access
- attack.t1040
