
title: CobaltStrike Process Patterns
author: Florian Roth
date: 2021/07/27
description: Detects process patterns found in Cobalt Strike beacon activity (see
  reference for more details)
detection:
  SELECTION_1:
    CommandLine: '*\cmd.exe /C whoami*'
  SELECTION_2:
    ParentImage: C:\Temp*
  SELECTION_3:
    CommandLine: '*conhost.exe 0xffffffff -ForceV1*'
  SELECTION_4:
    ParentCommandLine:
    - '*/C whoami*'
    - '*cmd.exe /C echo*'
    - '* > \\\\.\\pipe*'
  SELECTION_5:
    CommandLine:
    - '*cmd.exe /c echo*'
    - '*> \\\\.\\pipe*'
    - '*\whoami.exe*'
  SELECTION_6:
    ParentImage: '*\dllhost.exe'
  SELECTION_7:
    Image: '*\cmd.exe'
  SELECTION_8:
    ParentImage: '*\runonce.exe'
  SELECTION_9:
    ParentCommandLine: '*\runonce.exe'
  condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9))
falsepositives:
- Other programs that cause these patterns (please report)
id: f35c5d71-b489-4e22-a115-f003df287317
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/05
references:
- https://hausec.com/2021/07/26/cobalt-strike-and-tradecraft/
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
status: experimental
tags:
- attack.execution
- attack.t1059
