
title: Hiding Files with Attrib.exe
author: Sami Ruohonen
date: 2019/01/16
description: Detects usage of attrib.exe to hide files from users.
detection:
  SELECTION_1:
    Image: '*\attrib.exe'
  SELECTION_2:
    CommandLine: '* +h *'
  SELECTION_3:
    CommandLine: '*\desktop.ini *'
  SELECTION_4:
    ParentImage: '*\cmd.exe'
  SELECTION_5:
    CommandLine: +R +H +S +A \\*.cui
  SELECTION_6:
    ParentCommandLine: C:\WINDOWS\system32\\*.bat
  condition: ((SELECTION_1 and SELECTION_2) and  not ((SELECTION_3 or (SELECTION_4
    and SELECTION_5 and SELECTION_6))))
falsepositives:
- igfxCUIService.exe hiding *.cui files via .bat script (attrib.exe a child of cmd.exe
  and igfxCUIService.exe is the parent of the cmd.exe)
- msiexec.exe hiding desktop.ini
fields:
- CommandLine
- ParentCommandLine
- User
id: 4281cb20-2994-4580-aa63-c8b86d019934
level: low
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
status: test
tags:
- attack.defense_evasion
- attack.t1564.001
