
title: WMI Spawning Windows PowerShell
author: Markus Neis / @Karneades
date: 2019/04/03
description: Detects WMI spawning PowerShell
detection:
  SELECTION_1:
    ParentImage:
    - '*\wmiprvse.exe'
  SELECTION_2:
    Image:
    - '*\powershell.exe'
  SELECTION_3:
    CommandLine: 'null'
  SELECTION_4:
    CommandLine|re: ^$
  condition: (((SELECTION_1 and SELECTION_2) and  not (SELECTION_3)) and  not (SELECTION_4))
falsepositives:
- AppvClient
- CCM
id: 692f0bec-83ba-4d04-af7e-e884a96059b6
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/02/24
references:
- https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_shell_spawn_susp_program.yml
- https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e
status: experimental
tags:
- attack.execution
- attack.t1047
- attack.t1059.001
