title: PowerShell SAM Copy
ruletype: Sigma
author: Florian Roth
date: 2021/07/29
description: Detects suspicious PowerShell scripts accessing SAM hives
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*\HarddiskVolumeShadowCopy*'
    SELECTION_4:
        CommandLine: '*ystem32\config\sam*'
    SELECTION_5:
        CommandLine:
        - '*Copy-Item*'
        - '*cp $_.*'
        - '*cpi $_.*'
        - '*copy $_.*'
        - '*.File]::Copy(*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Some rare backup scenarios
- PowerShell scripts fixing HiveNightmare / SeriousSAM ACLs
id: 1af57a4b-460a-4738-9034-db68b880c665
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/12/02
references:
- https://twitter.com/splinter_code/status/1420546784250769408
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
yml_filename: proc_creation_win_susp_powershell_sam_access.yml
yml_path: rules/windows/process_creation
---

