title: Redirect Output in CommandLine
ruletype: Sigma
author: frack113
date: 2022/01/22
description: Use ">" to redicrect information in commandline
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\cmd.exe'
    SELECTION_4:
        CommandLine: '*>*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
level: low
logsource:
    category: process_creation
    product: windows
references:
- https://ss64.com/nt/syntax-redirection.html
status: experimental
tags:
- attack.discovery
- attack.t1082
yml_filename: proc_creation_win_cmd_redirect.yml
yml_path: rules/windows/process_creation
---

