title: Use of LogMeIn Remote Access Software
ruletype: Sigma
author: frack113
date: 2022/02/11
description: |
    An adversary may use legitimate desktop support and remote access software, such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive command and control channel to target systems within networks.
    These services are commonly used as legitimate technical support software, and may be allowed by application control within a target environment.
    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared with other legitimate software commonly used by adversaries. (Citation: Symantec Living off the Land)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Description: LMIGuardianSvc
    SELECTION_4:
        Product: LMIGuardianSvc
    SELECTION_5:
        Company: LogMeIn, Inc.
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Legitimate use
id: d85873ef-a0f8-4c48-a53a-6b621f11729d
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md#atomic-test-3---logmein-files-detected-test-on-windows
status: experimental
tags:
- attack.command_and_control
- attack.t1219
yml_filename: proc_creation_win_logmein.yml
yml_path: rules/windows/process_creation
---

