
title: Control Panel Items
author: Kyaw Min Thein, Furkan Caliskan (@caliskanfurkan_)
date: 2020/06/22
description: Detects the malicious use of a control panel item
detection:
  SELECTION_1:
    CommandLine: '*.cpl'
  SELECTION_2:
    CommandLine:
    - '*\System32\\*'
    - '*%System%*'
  SELECTION_3:
    Image: '*\reg.exe'
  SELECTION_4:
    CommandLine: '*add*'
  SELECTION_5:
    CommandLine:
    - '*CurrentVersion\\Control Panel\\CPLs*'
  condition: ((SELECTION_1 and  not (SELECTION_2)) or (SELECTION_3 and SELECTION_4
    and SELECTION_5))
falsepositives:
- Unknown
id: 0ba863e6-def5-4e50-9cea-4dd8c7dc46a4
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
references:
- https://attack.mitre.org/techniques/T1196/
- https://ired.team/offensive-security/code-execution/code-execution-through-control-panel-add-ins
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218.002
- attack.persistence
- attack.t1546
