title: Finger.exe Suspicious Invocation
ruletype: Sigma
author: Florian Roth, omkar72, oscd.community
date: 2021/02/24
description: Detects suspicious aged finger.exe tool execution often used in malware
    attacks nowadays
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\finger.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Admin activity (unclear what they do nowadays with finger.exe)
id: af491bca-e752-4b44-9c86-df5680533dbc
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/bigmacjpg/status/1349727699863011328?s=12
- https://app.any.run/tasks/40115012-a919-4208-bfed-41e82cb3dadf/
- http://hyp3rlinx.altervista.org/advisories/Windows_TCPIP_Finger_Command_C2_Channel_and_Bypassing_Security_Software.txt
status: experimental
tags:
- attack.command_and_control
- attack.t1105
yml_filename: proc_creation_win_susp_finger_usage.yml
yml_path: rules/windows/process_creation
---

