title: PsExec Tool Execution
ruletype: Sigma
author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
    Sysmon)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\PSEXESVC.exe'
    SELECTION_4:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/05/27
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
-   id: 42c575ea-e41e-41f1-b248-8093c3e82a28
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
yml_filename: proc_creation_win_tool_psexec.yml
yml_path: rules/windows/process_creation
---

