
title: Suspicious Kernel Dump Using Dtrace
ruletype: Sigma
author: Florian Roth
date: 2021/12/28
description: Detects suspicious way to dump the kernel on Windows systems using dtrace.exe,
  which is available on Windows systems since Windows 10 19H1
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\dtrace.exe'
  SELECTION_3:
    CommandLine: '*lkd(0)*'
  SELECTION_4:
    CommandLine: '*syscall:::return*'
  SELECTION_5:
    CommandLine: '*lkd(*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Unknown
id: 7124aebe-4cd7-4ccb-8df0-6d6b93c96795
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/0gtweet/status/1474899714290208777?s=12
- https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/dtrace
status: experimental
