
title: DumpStack.log Defender Evasion
ruletype: Sigma
author: Florian Roth
date: 2022/01/06
description: Detects the use of the filename DumpStack.log to evade Microsoft Defender
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\DumpStack.log'
  SELECTION_3:
    CommandLine: ' -o DumpStack.log'
  condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: 4f647cfa-b598-4e12-ad69-c68dd16caef8
level: critical
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/mrd0x/status/1479094189048713219
status: test
tags:
- attack.defense_evasion
