
title: Suspicious Msiexec Execute Arbitrary DLL
ruletype: Sigma
author: frack113
date: 2022/01/16
description: |
  Adversaries may abuse msiexec.exe to proxy execution of malicious payloads.
  Msiexec.exe is the command-line utility for the Windows Installer and is thus commonly associated with executing installation packages (.msi)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\msiexec.exe'
  SELECTION_3:
    CommandLine: '* /y*'
  SELECTION_4:
    CommandLine:
    - '*\MsiExec.exe" /Y "C:\Program Files\Bonjour\mdnsNSP.dll*'
    - '*\MsiExec.exe" /Y "C:\Program Files (x86)\Bonjour\mdnsNSP.dll*'
    - '*\MsiExec.exe" /Y "C:\Program Files (x86)\Apple Software Update\ScriptingObjectModel.dll*'
    - '*\MsiExec.exe" /Y "C:\Program Files (x86)\Apple Software Update\SoftwareUpdateAdmin.dll*'
    - '*\MsiExec.exe" /Y "C:\Windows\CCM\\*'
    - '*\MsiExec.exe" /Y C:\Windows\CCM\\*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not ((SELECTION_4)))
falsepositives:
- Legitimate script
id: 6f4191bb-912b-48a8-9ce7-682769541e6d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/03/28
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/msiexec
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.007
