
title: Renamed MegaSync
author: Sittikorn S
date: 2021/06/22
description: Detects the execution of a renamed meg.exe of MegaSync during incident
  response engagements associated with ransomware families like Nefilim, Sodinokibi,
  Pysa, and Conti.
detection:
  SELECTION_1:
    ParentImage: '*\explorer.exe'
  SELECTION_2:
    CommandLine: '*C:\Windows\Temp\meg.exe*'
  SELECTION_3:
    OriginalFileName: meg.exe
  SELECTION_4:
    Image: '*\meg.exe'
  condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and  not (SELECTION_4)))
falsepositives:
- Software that illegaly integrates MegaSync in a renamed form
- Administrators that have renamed MegaSync
id: 643bdcac-8b82-49f4-9fd9-25a90b929f3b
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://redcanary.com/blog/rclone-mega-extortion/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
