
title: Invoke-Obfuscation Via Use MSHTA
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/08
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    CommandLine: '*set*'
  SELECTION_3:
    CommandLine: '*&&*'
  SELECTION_4:
    CommandLine: '*mshta*'
  SELECTION_5:
    CommandLine: '*vbscript:createobject*'
  SELECTION_6:
    CommandLine: '*.run*'
  SELECTION_7:
    CommandLine: '*(window.close)*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: ac20ae82-8758-4f38-958e-b44a3140ca88
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/03/08
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
