
title: Abusing Findstr for Defense Evasion
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
date: 2020/10/05
description: Attackers can use findstr to hide their artifacts or search specific
  strings and evade defense mechanism
detection:
  SELECTION_1:
    CommandLine:
    - '*findstr*'
  SELECTION_2:
    CommandLine: '*/V*'
  SELECTION_3:
    CommandLine: '*/L*'
  SELECTION_4:
    CommandLine: '*/S*'
  SELECTION_5:
    CommandLine: '*/I*'
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3) or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Administrative findstr usage
id: bf6c39fc-e203-45b9-9538-05397c1b4f3f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Findstr.yml
- https://oddvar.moe/2018/04/11/putting-data-in-alternate-data-streams-and-how-to-execute-it-part-2/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.defense_evasion
- attack.t1218
