
title: Application Whitelisting Bypass via DLL Loaded by odbcconf.exe
author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community
date: 2019/10/25
description: Detects defence evasion attempt via odbcconf.exe execution to load DLL
detection:
  SELECTION_1:
    Image: '*\odbcconf.exe'
  SELECTION_2:
    CommandLine:
    - '*-f*'
    - '*regsvr*'
  SELECTION_3:
    ParentImage: '*\odbcconf.exe'
  SELECTION_4:
    Image: '*\rundll32.exe'
  condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and SELECTION_4))
falsepositives:
- Legitimate use of odbcconf.exe by legitimate user
id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Odbcconf.yml
- https://twitter.com/Hexacorn/status/1187143326673330176
status: test
tags:
- attack.defense_evasion
- attack.t1218.008
