
title: Regsvr32 Anomaly
author: Florian Roth, oscd.community
date: 2019/01/16
description: Detects various anomalies in relation to regsvr32.exe
detection:
  SELECTION_1:
    Image: '*\regsvr32.exe'
  SELECTION_10:
    CommandLine: '*scrobj.dll'
  SELECTION_11:
    Image: '*\wscript.exe'
  SELECTION_12:
    ParentImage: '*\regsvr32.exe'
  SELECTION_13:
    Image: '*\EXCEL.EXE'
  SELECTION_14:
    CommandLine: '*..\..\..\Windows\System32\regsvr32.exe *'
  SELECTION_15:
    ParentImage: '*\mshta.exe'
  SELECTION_16:
    Image: '*\regsvr32.exe'
  SELECTION_17:
    Image: '*\regsvr32.exe'
  SELECTION_18:
    CommandLine:
    - '*\AppData\Local*'
    - '*C:\Users\Public*'
  SELECTION_2:
    CommandLine: '*\Temp\\*'
  SELECTION_3:
    Image: '*\regsvr32.exe'
  SELECTION_4:
    ParentImage: '*\powershell.exe'
  SELECTION_5:
    Image: '*\regsvr32.exe'
  SELECTION_6:
    ParentImage: '*\cmd.exe'
  SELECTION_7:
    Image: '*\regsvr32.exe'
  SELECTION_8:
    CommandLine: '*/i:*'
  SELECTION_9:
    CommandLine:
    - '*http*'
    - '*ftp*'
  condition: ((SELECTION_1 and SELECTION_2) or (SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9 and SELECTION_10)
    or (SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14) or (SELECTION_15
    and SELECTION_16) or (SELECTION_17 and SELECTION_18))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 8e2b24c9-4add-46a0-b4bb-0057b4e6187d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/07/18
references:
- https://subt0x10.blogspot.de/2017/04/bypass-application-whitelisting-script.html
- https://app.any.run/tasks/34221348-072d-4b70-93f3-aa71f6ebecad/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.010
- car.2019-04-002
- car.2019-04-003
