
title: Application Executed Non-Executable Extension
ruletype: Sigma
author: Tim Shelton, Florian Roth
date: 2022/01/13
description: Detects the execution of rundll32 with a command line that doesn't contain
  a .dll file
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    Image: '*\rundll32.exe'
  SELECTION_3:
    CommandLine|re: ^$
  SELECTION_4:
    CommandLine: '*.dll*'
  SELECTION_5:
    CommandLine: ''
  SELECTION_6:
    ParentImage: '*:\Program Files\Internet Explorer\iexplore.exe'
  SELECTION_7:
    CommandLine: '*.cpl*'
  condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3) or (SELECTION_4
    or SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/27
references:
- https://twitter.com/mrd0x/status/1481630810495139841?s=12
status: experimental
