
title: Suspicious SYSTEM User Process Creation
ruletype: Sigma
author: Florian Roth (rule), David ANDRE (additional keywords)
date: 2021/12/20
description: Detects a suspicious process creation as SYSTEM user (suspicious program
  or command line parameter)
detection:
  SELECTION_1:
    EventID: 1
  SELECTION_2:
    IntegrityLevel: System
  SELECTION_3:
    User: '*AUT*'
  SELECTION_4:
    User: '*SYSTEM*'
  SELECTION_5:
    Image:
    - '*\calc.exe'
    - '*\wscript.exe'
    - '*\cscript.exe'
    - '*\hh.exe'
    - '*\mshta.exe'
    - '*\forfiles.exe'
    - '*\ping.exe'
  SELECTION_6:
    CommandLine:
    - '*sc stop *'
    - '* -NoP *'
    - '* -W Hidden *'
    - '* -decode *'
    - '* /decode *'
    - '* /urlcache *'
    - '* -urlcache *'
    - '* -e* JAB*'
    - '* -e* SUVYI*'
    - '* -e* SQBFAFgA*'
    - '* -e* aWV4I*'
    - '* -e* IAB*'
    - '* -e* PAA*'
    - '* -e* aQBlAHgA*'
    - '*vssadmin delete shadows*'
    - '*reg SAVE HKLM*'
    - '* -ma *'
    - '*Microsoft\Windows\CurrentVersion\Run*'
    - '*.downloadstring(*'
    - '*.downloadfile(*'
    - '* /ticket:*'
    - '*sekurlsa::logonpasswords*'
    - '*crypto::capi*'
    - '*crypto::certificates*'
    - '*crypto::certtohw*'
    - '*crypto::cng*'
    - '*crypto::extract*'
    - '*crypto::hash*'
    - '*crypto::keys*'
    - '*crypto::providers*'
    - '*crypto::sc*'
    - '*crypto::scauth*'
    - '*crypto::stores*'
    - '*crypto::system*'
    - '*crypto::tpminfo*'
    - '*dpapi::blob*'
    - '*dpapi::cache*'
    - '*dpapi::capi*'
    - '*dpapi::chrome*'
    - '*dpapi::cloudapkd*'
    - '*dpapi::cloudapreg*'
    - '*dpapi::cng*'
    - '*dpapi::create*'
    - '*dpapi::cred*'
    - '*dpapi::credhist*'
    - '*dpapi::luna*'
    - '*dpapi::masterkey*'
    - '*dpapi::protect*'
    - '*dpapi::ps*'
    - '*dpapi::rdg*'
    - '*dpapi::sccm*'
    - '*dpapi::ssh*'
    - '*dpapi::tpm*'
    - '*dpapi::vault*'
    - '*dpapi::wifi*'
    - '*dpapi::wwman*'
    - '*event::clear*'
    - '*event::drop*'
    - '*id::modify*'
    - '*kerberos::ask*'
    - '*kerberos::clist*'
    - '*kerberos::golden*'
    - '*kerberos::hash*'
    - '*kerberos::list*'
    - '*kerberos::ptc*'
    - '*kerberos::ptt*'
    - '*kerberos::purge*'
    - '*kerberos::tgt*'
    - '*lsadump::backupkeys*'
    - '*lsadump::cache*'
    - '*lsadump::changentlm*'
    - '*lsadump::dcshadow*'
    - '*lsadump::dcsync*'
    - '*lsadump::lsa*'
    - '*lsadump::mbc*'
    - '*lsadump::netsync*'
    - '*lsadump::packages*'
    - '*lsadump::postzerologon*'
    - '*lsadump::RpData*'
    - '*lsadump::sam*'
    - '*lsadump::secrets*'
    - '*lsadump::setntlm*'
    - '*lsadump::trust*'
    - '*lsadump::zerologon*'
    - '*misc::aadcookie*'
    - '*misc::clip*'
    - '*misc::cmd*'
    - '*misc::compress*'
    - '*misc::detours*'
    - '*misc::efs*'
    - '*misc::lock*'
    - '*misc::memssp*'
    - '*misc::mflt*'
    - '*misc::ncroutemon*'
    - '*misc::ngcsign*'
    - '*misc::printnightmare*'
    - '*misc::regedit*'
    - '*misc::sccm*'
    - '*misc::shadowcopies*'
    - '*misc::skeleton*'
    - '*misc::spooler*'
    - '*misc::taskmgr*'
    - '*misc::wp*'
    - '*misc::xor*'
    - '*net::alias*'
    - '*net::deleg*'
    - '*net::group*'
    - '*net::if*'
    - '*net::serverinfo*'
    - '*net::session*'
    - '*net::share*'
    - '*net::stats*'
    - '*net::tod*'
    - '*net::trust*'
    - '*net::user*'
    - '*net::wsession*'
    - '*privilege::backup*'
    - '*privilege::debug*'
    - '*privilege::driver*'
    - '*privilege::id*'
    - '*privilege::name*'
    - '*privilege::restore*'
    - '*privilege::security*'
    - '*privilege::sysenv*'
    - '*privilege::tcb*'
    - '*process::exports*'
    - '*process::imports*'
    - '*process::list*'
    - '*process::resume*'
    - '*process::run*'
    - '*process::runp*'
    - '*process::start*'
    - '*process::stop*'
    - '*process::suspend*'
    - '*rpc::close*'
    - '*rpc::connect*'
    - '*rpc::enum*'
    - '*rpc::server*'
    - '*sekurlsa::backupkeys*'
    - '*sekurlsa::bootkey*'
    - '*sekurlsa::cloudap*'
    - '*sekurlsa::credman*'
    - '*sekurlsa::dpapi*'
    - '*sekurlsa::dpapisystem*'
    - '*sekurlsa::ekeys*'
    - '*sekurlsa::kerberos*'
    - '*sekurlsa::krbtgt*'
    - '*sekurlsa::livessp*'
    - '*sekurlsa::minidump*'
    - '*sekurlsa::msv*'
    - '*sekurlsa::process*'
    - '*sekurlsa::pth*'
    - '*sekurlsa::ssp*'
    - '*sekurlsa::tickets*'
    - '*sekurlsa::trust*'
    - '*sekurlsa::tspkg*'
    - '*sekurlsa::wdigest*'
    - '*service::me*'
    - '*service::preshutdown*'
    - '*service::remove*'
    - '*service::resume*'
    - '*service::shutdown*'
    - '*service::start*'
    - '*service::stop*'
    - '*service::suspend*'
    - '*sid::add*'
    - '*sid::clear*'
    - '*sid::lookup*'
    - '*sid::modify*'
    - '*sid::patch*'
    - '*sid::query*'
    - '*standard::answer*'
    - '*standard::base64*'
    - '*standard::cd*'
    - '*standard::cls*'
    - '*standard::coffee*'
    - '*standard::exit*'
    - '*standard::hostname*'
    - '*standard::localtime*'
    - '*standard::log*'
    - '*standard::sleep*'
    - '*standard::version*'
    - '*token::elevate*'
    - '*token::list*'
    - '*token::revert*'
    - '*token::run*'
    - '*token::whoami*'
    - '*ts::logonpasswords*'
    - '*ts::mstsc*'
    - '*ts::multirdp*'
    - '*ts::remote*'
    - '*ts::sessions*'
    - '*vault::cred*'
    - '*vault::list*'
    - '* p::d *'
    - '*;iex(*'
    - '*MiniDump*'
    - '*net user *'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and (SELECTION_5
    or SELECTION_6))
falsepositives:
- Administrative activity
- Scripts and administrative tools used in the monitored environment
- Monitoring activity
id: 2617e7ed-adb7-40ba-b0f3-8f9945fe6c09
level: high
logsource:
  category: process_creation
  product: windows
references:
- Internal Research
- https://tools.thehacker.recipes/mimikatz/modules
status: experimental
