title: Sysmon Process Hollowing Detection
ruletype: Sigma
author: Christopher Peacock '@securepeacock', SCYTHE '@scythe_io', Sittikorn S
date: 2022/01/25
description: Detects when a memory process image does not match the disk image, indicative
    of process hollowing.
detection:
    SELECTION_1:
        EventID: 25
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Type: Image is replaced
    SELECTION_4:
        Image:
        - '*:\Program Files\\*'
        - '*:\Program Files (x86)*'
    SELECTION_5:
        Image:
        - '*\chrome.exe'
        - '*\opera.exe'
        - '*\firefox.exe'
        - '*\MicrosoftEdge.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4
        and SELECTION_5))
falsepositives:
- There are no known false positives at this time
id: c4b890e5-8d8c-4496-8c66-c805753817cd
level: high
logsource:
    category: process_tampering
    product: windows
modified: 2022/02/01
references:
- https://twitter.com/SecurePeacock/status/1486054048390332423?s=20
- https://www.bleepingcomputer.com/news/microsoft/microsoft-sysmon-now-detects-malware-process-tampering-attempts/
status: experimental
tags:
- attack.process_injection
- attack.t1055.012

