title: Sysmon Blocked Executable
id: 23b71bc5-953e-4971-be4c-c896cda73fc2
status: experimental
description: Triggers on any Sysmon file block executable event. Which should indicates
    a violation of the block policy set
references:
    - https://medium.com/@olafhartong/sysmon-14-0-fileblockexecutable-13d7ba3dff3e
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/16
modified: 2022/09/12
tags:
    - attack.defense_evasion
logsource:
    product: windows
    category: file_block
detection:
    file_block:
        EventID: 27
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        EventID: 27
    condition: file_block and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
