title: Sysmon Configuration Change
id: 8ac03a65-6c84-4116-acad-dc1558ff7a77
status: test
description: Detects a Sysmon configuration change, which could be the result of a
    legitimate reconfiguration or someone trying manipulate the configuration
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon
author: frack113
date: 2022/01/12
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    product: windows
    service: sysmon
detection:
    sysmon:
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        EventID: 16
    condition: sysmon and selection
falsepositives:
    - Legitimate administrative action
level: medium
ruletype: Sigma
