title: Sysmon Configuration Change
ruletype: Sigma
author: frack113
date: 2022/01/12
description: Detects a Sysmon configuration change, which could be the result of a
    legitimate reconfiguration or someone trying manipulate the configuration
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_2:
        EventID: 16
    condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitimate administrative action
id: 8ac03a65-6c84-4116-acad-dc1558ff7a77
level: medium
logsource:
    product: windows
    service: sysmon
modified: 2023/01/25
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/sysmon
status: test
tags:
- attack.defense_evasion

