title: Unusual File Modification by dns.exe
id: f1b70b86-3772-c2b6-9b57-16a6f0b57e98
related:
    - id: 8f0b1fb1-9bd4-4e74-8cdf-a8de4d2adfd0 # FileDelete version
      type: similar
    - id: 9f383dc0-fdeb-4d56-acbc-9f9f4f8f20f3
      type: derived
status: test
description: Detects an unexpected file being modified by dns.exe which my indicate activity related to remote code execution or other forms of exploitation as seen in CVE-2020-1350 (SigRed)
references:
    - https://www.elastic.co/guide/en/security/current/unusual-file-modification-by-dns-exe.html
author: Tim Rauch (Nextron Systems), Elastic (idea)
date: 2022-09-27
tags:
    - attack.initial-access
    - attack.t1133
    - sysmon
logsource:
    category: file_change
    product: windows
detection:
    file_change:
        EventID: 2
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \dns.exe
    filter:
        TargetFilename|endswith: \dns.log
    condition: file_change and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
