title: File Creation Date Changed to Another Year
ruletype: Sigma
author: frack113, Florian Roth (Nextron Systems)
date: 2022/08/12
description: 'Attackers may change the file creation time of a backdoor to make it
    look like it was installed with the operating system.

    Note that many processes legitimately change the creation time of a file; it does
    not necessarily indicate malicious activity.

    '
detection:
    SELECTION_1:
        EventID: 2
    SELECTION_10:
        Image: C:\WINDOWS\\*
    SELECTION_11:
        Image: '*\TiWorker.exe'
    SELECTION_12:
        TargetFilename: '*.cab'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        PreviousCreationUtcTime: 2022*
    SELECTION_4:
        CreationUtcTime: 2022*
    SELECTION_5:
        PreviousCreationUtcTime: 202*
    SELECTION_6:
        CreationUtcTime: 202*
    SELECTION_7:
        Image:
        - C:\Windows\system32\ProvTool.exe
        - C:\Windows\System32\usocoreworker.exe
        - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
    SELECTION_8:
        TargetFilename: C:\ProgramData\USOPrivate\UpdateStore\\*
    SELECTION_9:
        TargetFilename:
        - '*.tmp'
        - '*.temp'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and  not (SELECTION_4))
        or (SELECTION_5 and  not (SELECTION_6))) and  not ((SELECTION_7 or SELECTION_8
        or SELECTION_9) or (SELECTION_10 and SELECTION_11 and SELECTION_12)))
falsepositives:
- Changes made to or by the local NTP service
id: 558eebe5-f2ba-4104-b339-36f7902bcc1a
level: high
logsource:
    category: file_change
    product: windows
modified: 2022/10/25
references:
- https://www.inversecos.com/2022/04/defence-evasion-technique-timestomping.html
status: experimental
tags:
- attack.t1070.006
- attack.defense_evasion

