title: NTLM Brute Force
id: b7a0fd59-bab8-fec2-28ad-548b2635d87f
related:
    - id: 9c8acf1a-cbf9-4db6-b63c-74baabe03e59
      type: derived
status: test
description: Detects common NTLM brute force device names
references:
    - https://www.varonis.com/blog/investigate-ntlm-brute-force
author: Jerry Shockley '@jsh0x'
date: 2022-02-02
tags:
    - attack.credential-access
    - attack.t1110
logsource:
    product: windows
    service: ntlm
    definition: Requires events from Microsoft-Windows-NTLM/Operational
detection:
    ntlm:
        Channel: Microsoft-Windows-NTLM/Operational
    selection:
        EventID: 8004
    devicename:
        WorkstationName:
            - Rdesktop
            - Remmina
            - Freerdp
            - Windows7
            - Windows8
            - Windows2012
            - Windows2016
            - Windows2019
    condition: ntlm and (selection and devicename)
falsepositives:
    - Systems with names equal to the spoofed ones used by the brute force tools
level: medium
ruletype: Sigma
