title: test
id: 00000000-0000-0000-0000-000000000000
description: |
    all of them
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 
            - 3
            - 7
        UserName: abc
    selection2:
        process: nnn
        parentprocess: sss
    selection3:
        uuu: zzzz
        xxxx: yyyyy
    condition: all of them
falsepositives:
    - Unknown
level: medium
