title: test
id: 000000000-0000-0000-0000-000000000000
description: |
    list test
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        EventID: 
            - 4100
            - 9000
            - 8000
            - "aaaa"
        ObjectType: 'Key'
    condition: selection
falsepositives:
    - Unknown
level: medium
