title: test
id: 000000000-0000-0000-0000-000000000000
description: |
    endswith pipe modifier and startswith pipe modifier
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        - UserName|endswith: hogehoge_end
        - TargetUserName|startswith: test_start
    condition: selection
falsepositives:
    - Unknown
level: medium
