title: test
id: 00000000-0000-0000-0000-000000000000
description: |
    condition not
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 3
    condition: not selection1
falsepositives:
    - Unknown
level: medium
