title: test
id: 00000000-0000-0000-0000-000000000000
description: |
    list test
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        - 2
        - dee
        - testtesttest
    SELECTION_2:
        EventID:
            - 22
            - 33
    condition: selection and SELECTION_2
falsepositives:
    - Unknown
level: medium
