title: test
id: 00000000-0000-0000-0000-000000000000
description: |
    () 
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 3
    selection2:
        aaa: bbb
    selection3:
        ccc: ddd
    selection4:
        eee: fff
    selection5:
        ggg: hhh
    condition: selection1 and ( selection2 or (selection3 and selection4) ) or selection5
falsepositives:
    - Unknown
level: medium
