title: test
id: 000000000-0000-0000-0000-000000000000
description: |
    timeflame 
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection1:
        EventID: 3
    timeflame: 2d
    condition: selection1
falsepositives:
    - Unknown
level: medium
