title: test
id: 00000000-0000-0000-0000-000000000000
description: |
    contains modifier
status: experimental
date: 2021/12/4
author: test
logsource:
    product: windows
    service: security
detection:
    selection:
        - UserName|contains: hogehoge
        - TargetUserName|contains: testest2
    condition: selection
falsepositives:
    - Unknown
level: medium
