title: Windows Credential Editor Registry
ruletype: Sigma
author: Florian Roth
date: 2019/12/31
description: Detects the use of Windows Credential Editor (WCE)
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - New registry value created
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject: '*Services\WCESERVICE\Start*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: a6b33c02-8305-488f-8585-03cb2a7763f2
level: critical
logsource:
    category: registry_event
    product: windows
modified: 2021/11/27
references:
- https://www.ampliasecurity.com/research/windows-credentials-editor/
status: test
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0005
yml_filename: registry_event_hack_wce_reg.yml
yml_path: rules/windows/registry/registry_event
---

