title: Atbroker Registry Change
ruletype: Sigma
author: Mateusz Wydra, oscd.community
date: 2020/10/13
description: Detects creation/modification of Assisitive Technology applications and
    persistence with usage of ATs
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - New registry value created
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject:
        - '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs*'
        - '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Creation of non-default, legitimate AT.
id: 9577edbb-851f-4243-8c91-1d5b50c1a39b
level: high
logsource:
    category: registry_event
    product: windows
modified: 2021/05/24
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.persistence
- attack.t1547
yml_filename: registry_event_susp_atbroker_change.yml
yml_path: rules/windows/registry/registry_event
---

