title: Leviathan Registry Key Activity
ruletype: Sigma
author: Aidan Bracher
date: 2020/07/07
description: Detects registry key used by Leviathan APT in Malaysian focused campaign
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - New registry value created
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject: HKCU\Software\Microsoft\Windows\CurrentVersion\Run\ntkd
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
id: 70d43542-cd2d-483c-8f30-f16b436fd7db
level: critical
logsource:
    category: registry_event
    product: windows
modified: 2021/09/13
references:
- https://www.elastic.co/blog/advanced-techniques-used-in-malaysian-focused-apt-campaign
status: experimental
tags:
- attack.persistence
- attack.t1547.001
yml_filename: registry_event_apt_leviathan.yml
yml_path: rules/windows/registry/registry_event
---

