title: Windows Credential Editor Registry
id: 092a900e-c6b2-7064-f7b5-699f1b3be49d
related:
    - id: a6b33c02-8305-488f-8585-03cb2a7763f2
      type: derived
status: test
description: Detects the use of Windows Credential Editor (WCE)
references:
    - https://www.ampliasecurity.com/research/windows-credentials-editor/
author: Florian Roth (Nextron Systems)
date: 2019-12-31
modified: 2021-11-27
tags:
    - attack.credential-access
    - attack.t1003.001
    - attack.s0005
logsource:
    category: registry_event
    product: windows
detection:
    registry_event:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: Services\WCESERVICE\Start
    condition: registry_event and selection
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
