title: Registry Persistence Mechanisms in Recycle Bin
ruletype: Sigma
author: frack113
date: 2021/11/18
description: Detects persistence registry keys for Recycle Bin
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - New registry value created
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: RenameKey
    SELECTION_5:
        NewName: HKCR\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open
    SELECTION_6:
        EventType: SetValue
    SELECTION_7:
        TargetObject: HKCR\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open\command\(Default)
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 277efb8f-60be-4f10-b4d3-037802f37167
level: high
logsource:
    category: registry_event
    product: windows
references:
- https://github.com/vxunderground/VXUG-Papers/blob/751edb8d50f95bd7baa730adf2c6c3bb1b034276/The%20Persistence%20Series/Persistence%20via%20Recycle%20Bin/Persistence_via_Recycle_Bin.pdf
status: experimental
tags:
- attack.persistence
- attack.t1547

