title: HybridConnectionManager Service Installation - Registry
id: ac8866c7-ce44-46fd-8c17-b24acff96ca8
status: test
description: Detects the installation of the Azure Hybrid Connection Manager service to allow remote code execution from Azure function.
references:
    - https://twitter.com/Cyb3rWard0g/status/1381642789369286662
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2021/04/12
modified: 2022/11/27
tags:
    - attack.resource_development
    - attack.t1608
logsource:
    category: registry_event
    product: windows
detection:
    registry_event:
        EventID: 4657
        Channel: Security
    selection1:
        ObjectName|contains: \Services\HybridConnectionManager
    selection2:
        OperationType: '%%1905'
        NewValue|contains: Microsoft.HybridConnectionManager.Listener.exe
    condition: registry_event and (selection1 or selection2)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
