title: OilRig APT Registry Persistence
id: e3b2e8dd-18aa-f9bc-9af7-bc31d7717574
status: test
description: Detects OilRig registry persistence as reported by Nyotron in their March 2018 report
references:
    - https://web.archive.org/web/20180402134442/https://nyotron.com/wp-content/uploads/2018/03/Nyotron-OilRig-Malware-Report-March-2018C.pdf
author: Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy, oscd.community
date: 2018/03/23
modified: 2023/03/08
tags:
    - attack.persistence
    - attack.g0049
    - attack.t1053.005
    - attack.s0111
    - attack.t1543.003
    - attack.defense_evasion
    - attack.t1112
    - attack.command_and_control
    - attack.t1071.004
    - sysmon
logsource:
    category: registry_event
    product: windows
detection:
    registry_event:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|endswith:
            - SOFTWARE\Microsoft\Windows\CurrentVersion\UMe
            - SOFTWARE\Microsoft\Windows\CurrentVersion\UT
    condition: registry_event and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
