title: Atbroker Registry Change
ruletype: Sigma
author: Mateusz Wydra, oscd.community
date: 2020/10/13
description: Detects creation/modification of Assistive Technology applications and
    persistence with usage of 'at'
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - New registry value created
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject:
        - '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs*'
        - '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration*'
    SELECTION_5:
        NewProcessName: C:\Windows\system32\atbroker.exe
    SELECTION_6:
        TargetObject: '*\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration*'
    SELECTION_7:
        NewValue: (Empty)
    SELECTION_8:
        NewProcessName: C:\Windows\Installer\MSI*
    SELECTION_9:
        TargetObject: '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and SELECTION_4 and  not
        ((SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Creation of non-default, legitimate at usage
id: 9577edbb-851f-4243-8c91-1d5b50c1a39b
level: medium
logsource:
    category: registry_event
    product: windows
modified: 2023/01/19
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.persistence
- attack.t1547

