title: Suspicious Run Key from Download
id: f81b1344-1639-27dc-c1e1-577c4e6c8e19
related:
    - id: 9c5037d1-c568-49b3-88c7-9846a5bdc2be
      type: derived
status: test
description: Detects the suspicious RUN keys created by software located in Download or temporary Outlook/Internet Explorer directories
references:
    - https://app.any.run/tasks/c5bef5b7-f484-4c43-9cf3-d5c5c7839def/
author: Florian Roth (Nextron Systems)
date: 2019-10-01
modified: 2021-11-27
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    category: registry_event
    product: windows
detection:
    registry_event:
        EventID: 4657
        Channel: Security
    selection:
        ProcessName|contains:
            - \Downloads\
            - \Temporary Internet Files\Content.Outlook\
            - \Local Settings\Temporary Internet Files\
        ObjectName|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Run\
    condition: registry_event and selection
falsepositives:
    - Software installers downloaded and used by users
level: high
ruletype: Sigma
