title: Invoke-Obfuscation Via Use MSHTA
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath: '*set*'
    SELECTION_4:
        ImagePath: '*&&*'
    SELECTION_5:
        ImagePath: '*mshta*'
    SELECTION_6:
        ImagePath: '*vbscript:createobject*'
    SELECTION_7:
        ImagePath: '*.run*'
    SELECTION_8:
        ImagePath: '*(window.close)*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: a4e82ad2-7430-4ee8-b858-6ad6099773fa
level: high
logsource:
    category: driver_load
    product: windows
modified: 2022/03/08
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4
    type: derived
status: unsupported
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

