title: Tap Driver Installation
ruletype: Sigma
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunnelling techniques
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath: '*tap0901*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 8bd47424-53e9-41ea-8a6a-a1f97b1bb0eb
level: medium
logsource:
    category: driver_load
    product: windows
modified: 2021/09/21
related:
-   id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
    type: derived
status: unsupported
tags:
- attack.exfiltration
- attack.t1048

