title: Invoke-Obfuscation Via Use Clip
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath: '*(Clipboard|i*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 1fc02cb5-8acf-4d2c-bf9c-a28b6e0ad851
level: high
logsource:
    category: driver_load
    product: windows
modified: 2022/04/26
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 63e3365d-4824-42d8-8b82-e56810fefa0c
    type: derived
status: unsupported
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

