title: Invoke-Obfuscation Via Use Rundll32
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath: '*&&*'
    SELECTION_4:
        ImagePath: '*rundll32*'
    SELECTION_5:
        ImagePath: '*shell32.dll*'
    SELECTION_6:
        ImagePath: '*shellexec_rundll*'
    SELECTION_7:
        ImagePath:
        - '*value*'
        - '*invoke*'
        - '*comspec*'
        - '*iex*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 4e1518d9-2136-4015-ab49-c31d7c8588e1
level: high
logsource:
    category: driver_load
    product: windows
modified: 2022/03/08
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
    type: derived
status: unsupported
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

