title: Invoke-Obfuscation RUNDLL LAUNCHER
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
    SELECTION_1:
        EventID: 6
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ImagePath: '*rundll32.exe*'
    SELECTION_4:
        ImagePath: '*shell32.dll*'
    SELECTION_5:
        ImagePath: '*shellexec_rundll*'
    SELECTION_6:
        ImagePath: '*powershell*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 03b024c6-aad1-4da5-9f60-e9e8c00fa64c
level: medium
logsource:
    category: driver_load
    product: windows
modified: 2022/03/08
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
-   id: 11b52f18-aaec-4d60-9143-5dd8cc4706b9
    type: derived
status: unsupported
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

