title: Silence.Downloader V3
id: 170901d1-de11-4de7-bccb-8fa13678d857
status: unsupported
description: Detects Silence downloader. These commands are hardcoded into the binary.
author: Alina Stepchenkova, Roman Rezvukhin, Group-IB, oscd.community
date: 2019/11/01
modified: 2023/02/24
tags:
    - attack.persistence
    - attack.t1547.001
    - attack.discovery
    - attack.t1057
    - attack.t1082
    - attack.t1016
    - attack.t1033
    - attack.g0091
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_recon:
        Image|endswith:
            - \tasklist.exe
            - \qwinsta.exe
            - \ipconfig.exe
            - \hostname.exe
        CommandLine|contains: '>>'
        CommandLine|endswith: temps.dat
    selection_persistence:
        CommandLine|contains: /C REG ADD "HKCU\Software\Microsoft\Windows\CurrentVersion\Run" /v "WinNetworkSecurity" /t REG_SZ /d
    condition: process_creation and (selection_recon | near selection_persistence)
fields:
    - ComputerName
    - User
    - Image
    - CommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
