title: BITS Transfer Job Download To Potential Suspicious Folder
id: 26844668-ef48-7a97-5687-9533e59288b7
related:
    - id: f8a56cb7-a363-44ed-a82f-5926bb44cd05
      type: derived
status: test
description: Detects new BITS transfer job where the LocalName/Saved file is stored in a potentially suspicious location
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
author: Florian Roth (Nextron Systems)
date: 2022-06-28
modified: 2023-03-27
tags:
    - attack.defense-evasion
    - attack.persistence
    - attack.t1197
logsource:
    product: windows
    service: bits-client
detection:
    bits_client:
        Channel: Microsoft-Windows-Bits-Client/Operational
    selection:
        EventID: 16403
        LocalName|contains:
            # TODO: Add more interesting suspicious paths
            - \Desktop\
            - C:\Users\Public\
            - C:\PerfLogs\
    condition: bits_client and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
