title: Potential Proxy Execution Via Explorer.EXE From Shell Process
id: 8d4e21c0-9bec-56e9-925f-1657e2356ac5
related:
    - id: 9eb271b9-24ae-4cd4-9465-19cfc1047f3e
      type: derived
status: test
description: |
    Detects the creation of a child "explorer.exe" process from a shell like process such as "cmd.exe" or "powershell.exe".
    Attackers can use "explorer.exe" for evading defense mechanisms by proxying the execution through the latter.
    While this is often a legitimate action, this rule can be use to hunt for anomalies.
    Muddy Waters threat actor was seeing using this technique.
references:
    - https://twitter.com/CyberRaiju/status/1273597319322058752
    - https://app.any.run/tasks/9a8fd563-4c54-4d0a-9ad8-1fe08339cbc3/
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
date: '2020-10-05'
modified: '2024-06-21'
tags:
    - attack.defense-evasion
    - attack.t1218
    - detection.threat-hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
        Image|endswith: \explorer.exe
        CommandLine|contains: explorer.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate explorer.exe run from a shell host like "cmd.exe" or "powershell.exe"
level: low
ruletype: Sigma
