title: Remote Access Tool - Ammy Admin Agent Execution
id: dee65756-05fe-76c8-c68e-2c9d2a496f2d
related:
    - id: 7da7809e-f3d5-47a3-9d5d-fc9d019caf14
      type: derived
status: test
description: Detects the execution of the Ammy Admin RMM agent for remote management.
references:
    - https://www.ammyy.com/en/admin_features.html
author: '@kostastsale'
date: 2024-08-05
tags:
    - attack.execution
    - attack.persistence
    - detection.threat-hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \rundll32.exe
        CommandLine|contains: AMMYY\aa_nts.dll",run
    condition: process_creation and selection
falsepositives:
    - Legitimate use of Ammy Admin RMM agent for remote management by admins.
level: medium
ruletype: Sigma
