title: Remote Access Tool - Cmd.EXE Execution via AnyViewer
id: 03b8a169-fcba-2d4e-06f2-9366229041ee
related:
    - id: bc533330-fc29-44c0-b245-7dc6e5939c87
      type: derived
status: test
description: |
    Detects execution of "cmd.exe" via the AnyViewer RMM agent on a remote management sessions.
references:
    - https://www.anyviewer.com/help/remote-technical-support.html
author: '@kostastsale'
date: '2024-08-03'
tags:
    - attack.execution
    - attack.persistence
    - detection.threat-hunting
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \AVCore.exe
        ParentCommandLine|contains: AVCore.exe" -d
        Image|endswith: \cmd.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use for admin activity.
level: medium
ruletype: Sigma
