
title: Alternate PowerShell Hosts Pipe
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
date: 2019/09/12
description: Detects alternate PowerShell hosts potentially bypassing detections looking
  for powershell.exe
detection:
  SELECTION_1:
    EventID: 17
  SELECTION_2:
    EventID: 18
  SELECTION_3:
    PipeName: \PSHost*
  SELECTION_4:
    Image:
    - '*\powershell.exe'
    - '*\powershell_ise.exe'
    - '*\WINDOWS\System32\sdiagnhost.exe'
    - '*\WINDOWS\System32\wsmprovhost.exe'
    - '*\Windows\system32\dsac.exe'
    - '*\Windows\system32\wbem\wmiprvse.exe'
    - '*\ForefrontActiveDirectoryConnector.exe'
    - '*c:\windows\system32\inetsrv\w3wp.exe'
  SELECTION_5:
    Image|re: ^$
  SELECTION_6:
    Image: '*:\Program Files*'
  SELECTION_7:
    Image: '*\Microsoft SQL Server\\*'
  SELECTION_8:
    Image: '*\Tools\Binn\SQLPS.exe'
  SELECTION_9:
    Image:
    - C:\Program Files\Citrix\\*
    - C:\Program Files\Microsoft\Exchange Server\\*
  condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
    or (SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9)))
falsepositives:
- Programs using PowerShell directly without invocation of a dedicated interpreter.
fields:
- ComputerName
- User
- Image
- PipeName
id: 58cb02d5-78ce-4692-b3e1-dce850aae41a
level: medium
logsource:
  category: pipe_created
  product: windows
modified: 2022/02/16
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190815181010.html
status: test
tags:
- attack.execution
- attack.t1059.001
