title: Suspicious Usage of CVE_2021_34484 or CVE 2022_21919
ruletype: Sigma
author: Cybex
date: 2022/08/16
description: During exploitation of this vuln, two logs (providername:Microsoft-Windows-User
    Profiles Service) with eventid 1511 and 1515 (maybe lot of false positives with
    this event) are created. Moreover, it appears the directory \Users\TEMP is created
    may be created during the exploitation.Viewed on 2008 Server
detection:
    SELECTION_1:
        Channel: Application
    SELECTION_2:
        EventID: 1511
    SELECTION_3:
        ProviderName: Microsoft-Windows-User Profiles Service
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 52a85084-6989-40c3-8f32-091e12e17692
level: high
logsource:
    product: windows
    service: application
references:
- https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html
status: experimental
tags:
- attack.execution

