title: New Service Uses Double Ampersand in Path
ruletype: Sigma
author: Florian Roth
date: 2022/07/05
description: Detects a service installation that uses a suspicious double ampersand
    used in the image path value
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath: '*&&*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
level: high
logsource:
    product: windows
    service: system
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
yml_filename: win_service_install_susp_double_ampersand.yml
yml_path: rules/windows/builtin/system
---

