title: NTLMv1 Logon Between Client and Server
ruletype: Sigma
author: Tim Shelton
date: 2022/04/26
description: Detects the reporting of NTLMv1 being used between a client and server
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: LsaSrv
    SELECTION_3:
        EventID: 6038
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Environments that use NTLMv1
fields:
- EventID
- Provider_Name
id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
level: low
logsource:
    product: windows
    service: system
modified: 2022/05/02
references:
- https://attack.mitre.org/techniques/T1550/002/
status: experimental
tags:
- attack.execution
- attack.t1550.002
- attack.s0363
yml_filename: win_lsasrv_ntlmv1.yml
yml_path: rules/windows/builtin/system
---

