title: Mesh Agent Service Installation
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/11/28
description: Detects a Mesh Agent service installation. Mesh Agent is used to remotely
    manage computers
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath: '*MeshAgent.exe*'
    SELECTION_5:
        ServiceName: '*Mesh Agent*'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Legitimate use of the tool
id: e0d1ad53-c7eb-48ec-a87a-72393cc6cedc
level: medium
logsource:
    product: windows
    service: system
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
status: experimental
tags:
- attack.command_and_control
- attack.t1219

