
title: Invoke-Obfuscation Via Use Rundll32
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  SELECTION_1:
    Channel: System
  SELECTION_2:
    Provider_Name: Service Control Manager
  SELECTION_3:
    EventID: 7045
  SELECTION_4:
    ImagePath: '*&&*'
  SELECTION_5:
    ImagePath: '*rundll32*'
  SELECTION_6:
    ImagePath: '*shell32.dll*'
  SELECTION_7:
    ImagePath: '*shellexec_rundll*'
  SELECTION_8:
    ImagePath:
    - '*value*'
    - '*invoke*'
    - '*comspec*'
    - '*iex*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/07
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
