title: Invoke-Obfuscation VAR+ Launcher - System
ruletype: Sigma
author: Jonathan Cheong, oscd.community
date: 2020/10/15
description: Detects Obfuscated use of Environment Variables to execute PowerShell
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath: '*cmd*'
    SELECTION_5:
        ImagePath: '*"set*'
    SELECTION_6:
        ImagePath: '*-f*'
    SELECTION_7:
        ImagePath:
        - '*/c*'
        - '*/r*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 8ca7004b-e620-4ecb-870e-86129b5b8e75
level: high
logsource:
    product: windows
    service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

