
title: Exploit SamAccountName Spoofing with Kerberos
ruletype: Sigma
author: frack113
date: 2021/12/15
description: |
  The attacker creates a computer object using those permissions with a password known to her.
  After that she clears the attribute ServicePrincipalName on the computer object.
  Because she created the object (CREATOR OWNER), she gets granted additional permissions and can do many changes to the object.
detection:
  SELECTION_1:
    Provider_Name: Microsoft-Windows-Kerberos-Key-Distribution-Center
  SELECTION_2:
    EventID: 35
  SELECTION_3:
    EventID: 36
  SELECTION_4:
    EventID: 37
  SELECTION_5:
    EventID: 38
  SELECTION_6:
    Provider_Name: Microsoft-Windows-Directory-Services-SAM
  SELECTION_7:
    EventID: 16990
  SELECTION_8:
    EventID: 16991
  condition: ((SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4 or SELECTION_5))
    or (SELECTION_6 and (SELECTION_7 or SELECTION_8)))
falsepositives:
- Unknown
fields:
- samAccountName
id: 44bbff3e-4ca3-452d-a49a-6efa4cafa06f
level: medium
logsource:
  product: windows
  service: system
references:
- https://cloudbrothers.info/en/exploit-kerberos-samaccountname-spoofing/?utm_source=Social&utm_medium=post&utm_campaign=log4j
status: experimental
tags:
- attack.credential_access
- attack.t1558.003
