title: Important Windows Eventlog Cleared
ruletype: Sigma
author: Florian Roth, Tim Shelton
date: 2022/05/17
description: Detects the clearing of one of the Windows Core Eventlogs. e.g. caused
    by "wevtutil cl" command execution
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        EventID: 104
    SELECTION_3:
        Provider_Name: Microsoft-Windows-Eventlog
    SELECTION_4:
        Channel:
        - System
        - Security
        - Application
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Rollout of log collection agents (the setup routine often includes a reset of the
    local Eventlog)
- System provisioning (system reset before the golden image creation)
id: 100ef69e-3327-481c-8e5c-6d80d9507556
level: high
logsource:
    product: windows
    service: system
modified: 2023/01/18
references:
- https://twitter.com/deviouspolack/status/832535435960209408
- https://www.hybrid-analysis.com/sample/027cc450ef5f8c5f653329641ec1fed91f694e0d229928963b30f6b0d7d3a745?environmentId=100
related:
-   id: a62b37e0-45d3-48d9-a517-90c1a1b0186b
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.001
- car.2016-04-002

