title: Hacktool Service Registration or Execution
ruletype: Sigma
author: Florian Roth
date: 2022/03/21
description: Detects PsExec service installation and execution events (service and
    Sysmon)
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        EventID: 7036
    SELECTION_5:
        ServiceName:
        - '*WCESERVICE*'
        - '*WCE SERVICE*'
        - '*winexesvc*'
        - '*DumpSvc*'
        - '*pwdump*'
        - '*gsecdump*'
        - '*cachedump*'
    SELECTION_6:
        ImagePath: '*bypass*'
    condition: (SELECTION_1 and (SELECTION_2 and (SELECTION_3 or SELECTION_4)) and
        (SELECTION_5 or SELECTION_6))
falsepositives:
- Unknown
id: d26ce60c-2151-403c-9a42-49420d87b5e4
level: high
logsource:
    product: windows
    service: system
references:
- Internal Research
status: test
tags:
- attack.execution
- attack.t1569.002
- attack.s0029

