title: Windows Update Error
ruletype: Sigma
author: frack113
date: 2021/12/04
description: Windows Update get some error Check if need a 0-days KB
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Microsoft-Windows-WindowsUpdateClient
    SELECTION_3:
        EventID: 16
    SELECTION_4:
        EventID: 20
    SELECTION_5:
        EventID: 24
    SELECTION_6:
        EventID: 213
    SELECTION_7:
        EventID: 217
    condition: (SELECTION_1 and SELECTION_2 and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
id: 13cfeb75-9e33-4d04-b0f7-ab8faaa95a59
level: low
logsource:
    definition: Other error are in Microsoft-Windows-WindowsUpdateClient/Operational
    product: windows
    service: system
status: experimental
tags:
- attack.impact
- attack.resource_development
- attack.t1584
yml_filename: win_susp_system_update_error.yml
yml_path: rules/windows/builtin/system
---

