
title: Invoke-Obfuscation Via Use MSHTA
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
  SELECTION_1:
    Channel: System
  SELECTION_2:
    Provider_Name: Service Control Manager
  SELECTION_3:
    EventID: 7045
  SELECTION_4:
    ImagePath: '*set*'
  SELECTION_5:
    ImagePath: '*&&*'
  SELECTION_6:
    ImagePath: '*mshta*'
  SELECTION_7:
    ImagePath: '*vbscript:createobject*'
  SELECTION_8:
    ImagePath: '*.run*'
  SELECTION_9:
    ImagePath: '*(window.close)*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9)
falsepositives:
- Unknown
id: 7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/06
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
