
title: PsExec Tool Execution
ruletype: Sigma
author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events (service and
  Sysmon)
detection:
  SELECTION_1:
    Channel: System
  SELECTION_2:
    Provider_Name: Service Control Manager
  SELECTION_3:
    EventID: 7045
  SELECTION_4:
    ServiceName: PSEXESVC
  SELECTION_5:
    ImagePath: '*\PSEXESVC.exe'
  SELECTION_6:
    EventID: 7036
  SELECTION_7:
    ServiceName: PSEXESVC
  condition: (SELECTION_1 and ((SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: 42c575ea-e41e-41f1-b248-8093c3e82a28
level: low
logsource:
  product: windows
  service: system
modified: 2022/03/21
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
