title: KDC RC4-HMAC Downgrade CVE-2022-37966
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/11/09
description: Detects the exploitation of a security bypass and elevation of privilege
    vulnerability with Authentication Negotiation by using weak RC4-HMAC negotiation
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        EventID: 42
    SELECTION_3:
        Provider_Name: Kerberos-Key-Distribution-Center
    SELECTION_4:
        Level: 2
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: e6f81941-b1cd-4766-87db-9fc156f658ee
level: high
logsource:
    product: windows
    service: system
references:
- https://support.microsoft.com/en-us/topic/kb5021131-how-to-manage-the-kerberos-protocol-changes-related-to-cve-2022-37966-fd837ac3-cdec-4e76-a6ec-86e67501407d
status: experimental
tags:
- attack.privilege_escalation

