
title: Invoke-Obfuscation COMPRESS OBFUSCATION
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ImagePath: '*new-object*'
  SELECTION_4:
    ImagePath: '*text.encoding]::ascii*'
  SELECTION_5:
    ImagePath: '*readtoend*'
  SELECTION_6:
    ImagePath:
    - '*:system.io.compression.deflatestream*'
    - '*system.io.streamreader*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 175997c5-803c-4b08-8bb0-70b099f47595
level: medium
logsource:
  product: windows
  service: system
modified: 2022/03/06
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
