title: PAExec Service Installation
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/10/26
description: Detects PAExec service installation
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ServiceName: PAExec-*
    SELECTION_5:
        ImagePath: C:\WINDOWS\PAExec-*
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: de7ce410-b3fb-4e8a-b38c-3b999e2c3420
level: medium
logsource:
    product: windows
    service: system
references:
- https://www.poweradmin.com/paexec/
status: experimental
tags:
- attack.execution
- attack.t1569.002

