
title: Suspicious Service Installation Script
ruletype: Sigma
author: pH-T
date: 2022/03/18
description: Detects suspicious service installation scripts
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ImagePath: '* /C *'
  SELECTION_4:
    ImagePath:
    - '*powershell*'
    - '*wscript*'
    - '*cscript*'
    - '*mshta*'
    - '*rundll32*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 70f00d10-60b2-4f34-b9a0-dc3df3fe762a
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/24
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
