
title: Service Installation with Suspicious Folder Pattern
ruletype: Sigma
author: pH-T
date: 2022/03/18
description: Detects service installation with suspicious folder patterns
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ImagePath|re: ^[Cc]:\\[Pp]rogram[Dd]ata\\.{1,9}\.exe
  SELECTION_4:
    ImagePath|re: ^[Cc]:\\.{1,9}\.exe
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: 1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/24
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
