
title: Invoke-Obfuscation RUNDLL LAUNCHER
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via RUNDLL LAUNCHER
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ImagePath: '*rundll32.exe*'
  SELECTION_4:
    ImagePath: '*shell32.dll*'
  SELECTION_5:
    ImagePath: '*shellexec_rundll*'
  SELECTION_6:
    ImagePath: '*powershell*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 11b52f18-aaec-4d60-9143-5dd8cc4706b9
level: medium
logsource:
  product: windows
  service: system
modified: 2022/03/07
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
