title: Local Privilege Escalation Indicator TabTip
ruletype: Sigma
author: Florian Roth
date: 2022/10/07
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG
    is used on a system in brute force mode
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        EventID: 10001
    SELECTION_3:
        param1: C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe
    SELECTION_4:
        param2: 2147943140
    SELECTION_5:
        param3: '{054AAE20-4BEA-4347-8A35-64A533254A9D}'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
level: high
logsource:
    product: windows
    service: system
modified: 2022/12/04
references:
- https://github.com/antonioCoco/JuicyPotatoNG
status: experimental
tags:
- attack.execution
- attack.t1557.001

