title: Sliver C2 Default Service Installation
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2022/08/25
description: Detects known malicious service installation that appear in cases in
    which a Sliver implants execute the PsExec commands
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath|re: ^[a-zA-Z]:\\windows\\temp\\[a-zA-Z0-9]{10}\.exe
    SELECTION_5:
        ServiceName:
        - Sliver
        - Sliver implant
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: 31c51af6-e7aa-4da7-84d4-8f32cc580af2
level: high
logsource:
    product: windows
    service: system
references:
- https://github.com/BishopFox/sliver/blob/79f2d48fcdfc2bee4713b78d431ea4b27f733f30/client/command/commands.go#L1231
- https://www.microsoft.com/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
status: experimental
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1543.003
- attack.t1569.002

