
title: New PDQDeploy Service - Client Side
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/22
description: Detects PDQDeploy service installation on the target system. When a pakcage
  is deployed via PDQDeploy it installs a remote service on the target machine with
  the name "PDQDeployRunner-X" where "X" is an integer starting from 1
detection:
  SELECTION_1:
    Channel: System
  SELECTION_2:
    Provider_Name: Service Control Manager
  SELECTION_3:
    EventID: 7045
  SELECTION_4:
    ImagePath: '*PDQDeployRunner-*'
  SELECTION_5:
    ServiceName: PDQDeployRunner-*
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or SELECTION_5))
falsepositives:
- Legitimate use of the tool
id: b98a10af-1e1e-44a7-bab2-4cc026917648
level: medium
logsource:
  product: windows
  service: system
references:
- https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm
status: experimental
tags:
- attack.privilege_escalation
- attack.t1543.003
