
title: Suspicious Service Installation
ruletype: Sigma
author: pH-T
date: 2022/03/18
description: Detects suspicious service installation commands
detection:
  SELECTION_1:
    Provider_Name: Service Control Manager
  SELECTION_2:
    EventID: 7045
  SELECTION_3:
    ImagePath:
    - '* -w hidden *'
    - '* -nop *'
    - '* -sta *'
    - '*\Users\Public\\*'
    - '*\Windows\Temp\\*'
    - '*\Perflogs\\*'
    - '*\\\\.\\pipe*'
    - '*\ADMIN$\\*'
    - '*.downloadstring(*'
    - '*.downloadfile(*'
  SELECTION_4:
    ImagePath: '* -e*'
  SELECTION_5:
    ImagePath:
    - '* JAB*'
    - '* SUVYI*'
    - '* SQBFAFgA*'
    - '* aWV4I*'
    - '* IAB*'
    - '* PAA*'
    - '* aQBlAHgA*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and SELECTION_5)))
falsepositives:
- Unknown
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/24
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
