title: Invoke-Obfuscation Via Use MSHTA - System
ruletype: Sigma
author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Service Control Manager
    SELECTION_3:
        EventID: 7045
    SELECTION_4:
        ImagePath: '*mshta*'
    SELECTION_5:
        ImagePath: '*vbscript:createobject*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4
level: high
logsource:
    product: windows
    service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: experimental
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001

