
title: Anydesk Remote Access Software Service Installation
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/11
description: Detects the installation of the anydesk software service. Which could
  be an indication of anydesk abuse if you the software isn't already used.
detection:
  SELECTION_1:
    Channel: System
  SELECTION_2:
    Provider_Name: Service Control Manager
  SELECTION_3:
    EventID: 7045
  SELECTION_4:
    ServiceName: AnyDesk Service
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate usage of the anydesk tool
id: 530a6faa-ff3d-4022-b315-50828e77eef5
level: medium
logsource:
  product: windows
  service: system
references:
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
status: experimental
tags:
- attack.persistence
