title: Volume Shadow Copy Mount
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/20
description: Detects volume shadow copy mount via windows event log
detection:
    SELECTION_1:
        Channel: System
    SELECTION_2:
        Provider_Name: Microsoft-Windows-Ntfs
    SELECTION_3:
        EventID: 98
    SELECTION_4:
        DeviceName: '*HarddiskVolumeShadowCopy*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of volume shadow copy mounts (backups maybe).
id: f512acbf-e662-4903-843e-97ce4652b740
level: low
logsource:
    product: windows
    service: system
modified: 2021/10/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
status: experimental
tags:
- attack.credential_access
- attack.t1003.002
yml_filename: win_volume_shadow_copy_mount.yml
yml_path: rules/windows/builtin/system
---

