title: Operation Wocao Activity - Security
ruletype: Sigma
author: Florian Roth (Nextron Systems), frack113
date: 2019/12/20
description: Detects activity mentioned in Operation Wocao report
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4799
    SELECTION_3:
        TargetUserName: Administr*
    SELECTION_4:
        CallerProcessName: '*\checkadmin.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrators that use checkadmin.exe tool to enumerate local administrators
id: 74ad4314-482e-4c3e-b237-3f7ed3b9ca8d
level: high
logsource:
    product: windows
    service: security
modified: 2022/11/27
references:
- https://web.archive.org/web/20200226212615/https://www.fox-it.com/en/news/whitepapers/operation-wocao-shining-a-light-on-one-of-chinas-hidden-hacking-groups/
- https://web.archive.org/web/20200226212615/https://resources.fox-it.com/rs/170-CAK-271/images/201912_Report_Operation_Wocao.pdf
- https://twitter.com/SBousseaden/status/1207671369963646976
status: test
tags:
- attack.discovery
- attack.t1012
- attack.defense_evasion
- attack.t1036.004
- attack.t1027
- attack.execution
- attack.t1053.005
- attack.t1059.001

