title: Turla Group Named Pipes
id: 739915e4-1e70-4778-8b8a-17db02f66db1
status: test
description: Detects a named pipe used by Turla group samples
references:
    - Internal Research
    - https://attack.mitre.org/groups/G0010/
author: Markus Neis
date: 2017/11/06
modified: 2021/11/27
tags:
    - attack.g0010
    - attack.execution
    - attack.t1106
    - detection.emerging_threats
    - sysmon
logsource:
    product: windows
    category: pipe_created
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
detection:
    pipe_created:
        EventID:
            - 17
            - 18
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        PipeName:
            - \atctl
            - \comnap
            - \iehelper
            - \sdlrpc
            - \userpipe
    condition: pipe_created and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
