title: Userdomain Variable Enumeration
id: 969363fe-fea1-1916-cb94-44b95abc731b
related:
    - id: 43311e65-84d8-42a5-b3d4-c94d9b67038f
      type: derived
status: test
description: Detects suspicious enumeration of the domain the user is associated with.
references:
    - https://www.arxiv-vanity.com/papers/2008.04676/
    - https://thedfirreport.com/2022/11/14/bumblebee-zeros-in-on-meterpreter/
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
date: 2023-02-09
modified: 2024-08-01
tags:
    - attack.discovery
    - attack.t1016
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        CommandLine|contains: 'echo '
        CommandLine|contains|expand: '%userdomain%'
    condition: process_creation and selection
falsepositives:
    - Certain scripts or applications may leverage this.
level: low
ruletype: Sigma
