
title: Suspicious Appended Extension
ruletype: Sigma
author: frack113
date: 2022/07/16
description: Detects possible ransomware adding a custom extension to the encrypted
  files, such as ".jpg.crypted", ".docx.locky" etc.
detection:
  SELECTION_1:
    OriginalFilename:
    - '*.lnk'
    - '*.rtf'
    - '*.pst'
    - '*.docx'
    - '*.jpg'
    - '*.pdf'
  SELECTION_2:
    TargetFilename:
    - '*.lnk.*'
    - '*.rtf.*'
    - '*.pst.*'
    - '*.docx.*'
    - '*.jpg.*'
    - '*.pdf.*'
  SELECTION_3:
    TargetFilename:
    - '*.tmp'
    - '*.bak'
    - '*.old'
  condition: ((SELECTION_1 and SELECTION_2) and  not (SELECTION_3))
falsepositives:
- Backup software
id: e3f673b3-65d1-4d80-9146-466f8b63fa99
level: medium
logsource:
  category: file_rename
  product: windows
references:
- https://app.any.run/tasks/d66ead5a-faf4-4437-93aa-65785afaf9e5/
- https://blog.cyble.com/2022/08/10/onyx-ransomware-renames-its-leak-site-to-vsop/
status: experimental
tags:
- attack.impact
- attack.t1486
