
title: Rare GrantedAccess Flags on LSASS Access
author: Florian Roth
date: 2022/03/13
description: Detects process access to LSASS memory with suspicious access flags 0x410
  and 0x01410 (spin-off of similar rule)
detection:
  SELECTION_1:
    TargetImage: '*\lsass.exe'
  SELECTION_10:
    SourceImage: '*\vmtoolsd.exe'
  SELECTION_11:
    SourceImage:
    - C:\Progra Files\\*
    - C:\Progra Files (x86)\\*
  SELECTION_12:
    SourceImage:
    - '*Antivirus*'
  SELECTION_13:
    SourceImage: C:\WINDOWS\system32\wbem\wmiprvse.exe
  SELECTION_14:
    SourceImage: C:\Windows\sysWOW64\wbem\wmiprvse.exe
  SELECTION_15:
    SourceImage: C:\Program Files\Common Files\McAfee\MMSSHost\MMSSHOST.exe
  SELECTION_16:
    SourceImage: C:\Windows\Temp\asgard2-agent\\*
  SELECTION_17:
    SourceImage:
    - '*\thor64.exe'
    - '*\thor.exe'
  SELECTION_18:
    SourceImage:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
    - C:\WINDOWS\system32\\*
  SELECTION_19:
    SourceImage: '*C:\Users\\*'
  SELECTION_2:
    GrantedAccess: '*10'
  SELECTION_20:
    SourceImage: '*\AppData\Local\\*'
  SELECTION_21:
    SourceImage:
    - '*\Microsoft VS Code\Code.exe'
    - '*\software_reporter_tool.exe'
    - '*\DropboxUpdate.exe'
    - '*\MBAMInstallerService.exe'
  SELECTION_3:
    SourceImage:
    - C:\WINDOWS\system32\taskmgr.exe
    - C:\Program Files\Malwarebytes\Anti-Malware\MBAMService.exe
    - C:\PROGRAMDATA\MALWAREBYTES\MBAMSERVICE\ctlrupdate\mbupdatr.exe
    - C:\WINDOWS\system32\taskhostw.exe
    - C:\Users\\*\AppData\Local\Programs\Microsoft VS Code\Code.exe
    - C:\Program Files\Windows Defender\MsMpEng.exe
    - C:\Windows\SysWOW64\msiexec.exe
    - C:\Windows\System32\msiexec.exe
    - C:\Windows\System32\lsass.exe
    - C:\WINDOWS\System32\perfmon.exe
  SELECTION_4:
    SourceImage: C:\ProgramData\Microsoft\Windows Defender\\*
  SELECTION_5:
    SourceImage: '*\MsMpEng.exe'
  SELECTION_6:
    SourceImage: C:\Program Files\WindowsApps\\*
  SELECTION_7:
    SourceImage: '*\GamingServices.exe'
  SELECTION_8:
    SourceImage:
    - '*\PROCEXP64.EXE'
    - '*\PROCEXP.EXE'
  SELECTION_9:
    SourceImage: C:\ProgramData\VMware\VMware Tools\\*
  condition: ((SELECTION_1 and SELECTION_2) and  not ((SELECTION_3) or (SELECTION_4
    and SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8) or (SELECTION_9
    and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13) or (SELECTION_14)
    or (SELECTION_15) or (SELECTION_16 and SELECTION_17) or (SELECTION_18) or (SELECTION_19
    and SELECTION_20 and SELECTION_21)))
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason
fields:
- User
- SourceImage
- GrantedAccess
id: 678dfc63-fefb-47a5-a04c-26bcf8cc9f65
level: medium
logsource:
  category: process_access
  product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
related:
- id: 32d0d3e2-e58d-4d41-926b-18b520b2b32d
  type: obsoletes
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
