
title: LSASS Access from Program in Suspicious Folder
ruletype: Sigma
author: Florian Roth
date: 2021/11/27
description: Detects process access to LSASS memory with suspicious access flags and
  from a suspicious folder
detection:
  SELECTION_1:
    EventID: 10
  SELECTION_10:
    SourceImage:
    - '*\thor64.exe'
    - '*\thor.exe'
  SELECTION_11:
    GrantedAccess:
    - '0x1fffff'
    - '0x1010'
  SELECTION_2:
    TargetImage: '*\lsass.exe'
  SELECTION_3:
    GrantedAccess:
    - '*10'
    - '*30'
    - '*50'
    - '*70'
    - '*90'
    - '*B0'
    - '*D0'
    - '*F0'
    - '*18'
    - '*38'
    - '*58'
    - '*78'
    - '*98'
    - '*B8'
    - '*D8'
    - '*F8'
    - '*1A'
    - '*3A'
    - '*5A'
    - '*7A'
    - '*9A'
    - '*BA'
    - '*DA'
    - '*FA'
    - '*0x14C2'
    - '*FF'
  SELECTION_4:
    SourceImage:
    - '*\Temp\\*'
    - '*\Users\Public\\*'
    - '*\PerfLogs\\*'
    - '*\AppData\\*'
    - '*\Temporary*'
  SELECTION_5:
    SourceImage: '*C:\Users\\*'
  SELECTION_6:
    SourceImage: '*\AppData\Local\\*'
  SELECTION_7:
    SourceImage:
    - '*\Microsoft VS Code\Code.exe'
    - '*\software_reporter_tool.exe'
    - '*\DropboxUpdate.exe'
    - '*\MBAMInstallerService.exe'
  SELECTION_8:
    GrantedAccess: '0x410'
  SELECTION_9:
    SourceImage: C:\Windows\Temp\asgard2-agent\\*
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
    and SELECTION_10 and SELECTION_11)))
falsepositives:
- Legitimate software accessing LSASS process for legitimate reason
fields:
- User
- SourceImage
- GrantedAccess
id: fa34b441-961a-42fa-a100-ecc28c886725
level: high
logsource:
  category: process_access
  product: windows
modified: 2022/02/27
references:
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
- https://onedrive.live.com/view.aspx?resid=D026B4699190F1E6!2843&ithint=file%2cpptx&app=PowerPoint&authkey=!AMvCRTKB_V1J5ow
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- http://security-research.dyndns.org/pub/slides/FIRST2017/FIRST-2017_Tom-Ueltschi_Sysmon_FINAL_notes.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
