
title: LSASS Memory Dump
ruletype: Sigma
author: Samir Bousseaden, Michael Haag
date: 2019/04/03
description: Detects process LSASS memory dump using Mimikatz, NanoDump, Invoke-Mimikatz,
  Procdump or Taskmgr based on the CallTrace pointing to ntdll.dll, dbghelp.dll or
  dbgcore.dll for win10, server2016 and up.
detection:
  SELECTION_1:
    EventID: 10
  SELECTION_2:
    TargetImage: '*\lsass.exe'
  SELECTION_3:
    GrantedAccess:
    - '*0x1038*'
    - '*0x1438*'
    - '*0x143a*'
  SELECTION_4:
    CallTrace:
    - '*dbghelp.dll*'
    - '*dbgcore.dll*'
    - '*ntdll.dll*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- False positives are present when looking for 0x1410. Exclusions may be required.
id: 5ef9853e-4d0e-4a70-846f-a9ca37d876da
level: high
logsource:
  category: process_access
  product: windows
modified: 2022/03/20
references:
- https://blog.menasec.net/2019/02/threat-hunting-21-procdump-or-taskmgr.html
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md
- https://research.splunk.com/endpoint/windows_possible_credential_dumping/
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
- attack.s0002
