title: CobaltStrike Named Pipe
ruletype: Sigma
author: Florian Roth (Nextron Systems), Wojciech Lesicki
date: 2021/05/25
description: Detects the creation of a named pipe as used by CobaltStrike
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_10:
        PipeName: \interprocess_*
    SELECTION_11:
        PipeName: \samr_*
    SELECTION_12:
        PipeName: \netlogon_*
    SELECTION_13:
        PipeName: \srvsvc_*
    SELECTION_14:
        PipeName: \lsarpc_*
    SELECTION_15:
        PipeName: \wkssvc_*
    SELECTION_2:
        EventID: 18
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        PipeName: '*\MSSE-*'
    SELECTION_5:
        PipeName: '*-server*'
    SELECTION_6:
        PipeName: \postex_*
    SELECTION_7:
        PipeName: \status_*
    SELECTION_8:
        PipeName: \msagent_*
    SELECTION_9:
        PipeName: \mojo_*
    condition: (((SELECTION_1 or SELECTION_2) and SELECTION_3) and ((SELECTION_4 and
        SELECTION_5) or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or
        SELECTION_10 or SELECTION_11 or SELECTION_12 or SELECTION_13 or SELECTION_14
        or SELECTION_15))
falsepositives:
- Unknown
id: d5601f8c-b26f-4ab0-9035-69e11a8d4ad2
level: critical
logsource:
    category: pipe_created
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can always use Cobalt Strike, but also you can check powershell script from
        this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
    product: windows
modified: 2022/10/31
references:
- https://twitter.com/d4rksystem/status/1357010969264873472
- https://labs.f-secure.com/blog/detecting-cobalt-strike-default-modules-via-named-pipe-analysis/
- https://github.com/SigmaHQ/sigma/issues/253
- https://blog.cobaltstrike.com/2021/02/09/learn-pipe-fitting-for-all-of-your-offense-projects/
- https://redcanary.com/threat-detection-report/threats/cobalt-strike/
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055

