title: Alternate PowerShell Hosts Pipe
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
date: 2019/09/12
description: Detects alternate PowerShell hosts potentially bypassing detections looking
    for powershell.exe
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_10:
        Image:
        - C:\Program Files\Citrix\\*
        - C:\Program Files\Microsoft\Exchange Server\\*
    SELECTION_11:
        Image:
        - C:\Windows\system32\ServerManager.exe
        - C:\Program Files\PowerShell\7\pwsh.exe
    SELECTION_2:
        EventID: 18
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        PipeName: \PSHost*
    SELECTION_5:
        Image:
        - '*\powershell.exe'
        - '*\powershell_ise.exe'
        - '*\WINDOWS\System32\sdiagnhost.exe'
        - '*\WINDOWS\System32\wsmprovhost.exe'
        - '*\Windows\system32\dsac.exe'
        - '*\Windows\system32\wbem\wmiprvse.exe'
        - '*\ForefrontActiveDirectoryConnector.exe'
        - '*c:\windows\system32\inetsrv\w3wp.exe'
    SELECTION_6:
        Image: null
    SELECTION_7:
        Image: '*:\Program Files*'
    SELECTION_8:
        Image: '*\Microsoft SQL Server\\*'
    SELECTION_9:
        Image: '*\Tools\Binn\SQLPS.exe'
    condition: (((SELECTION_1 or SELECTION_2) and SELECTION_3) and SELECTION_4 and  not
        ((SELECTION_5) or (SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)
        or (SELECTION_10) or (SELECTION_11)))
falsepositives:
- Programs using PowerShell directly without invocation of a dedicated interpreter.
fields:
- ComputerName
- User
- Image
- PipeName
id: 58cb02d5-78ce-4692-b3e1-dce850aae41a
level: medium
logsource:
    category: pipe_created
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
    product: windows
modified: 2022/10/10
references:
- https://threathunterplaybook.com/hunts/windows/190610-PwshAlternateHosts/notebook.html
- https://threathunterplaybook.com/hunts/windows/190410-LocalPwshExecution/notebook.html
status: test
tags:
- attack.execution
- attack.t1059.001

