title: PsExec Tool Execution From Suspicious Locations - PipeName
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/04
description: Detects PsExec default pipe creation where the image executed is located
    in a suspicious location. Which could indicate that the tool is being used in
    an attack
detection:
    SELECTION_1:
        EventID: 17
    SELECTION_2:
        EventID: 18
    SELECTION_3:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_4:
        PipeName: \PSEXESVC
    SELECTION_5:
        Image:
        - '*C:\Users\Public\\*'
        - '*\Desktop\\*'
        - '*\Downloads\\*'
        - '*\AppData\Local\Temp\\*'
        - '*C:\Windows\Temp\\*'
    condition: ((SELECTION_1 or SELECTION_2) and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Rare legitimate use of psexec from the locations mentioned above
fields:
- EventID
- CommandLine
- ParentCommandLine
- ServiceName
- ServiceFileName
- TargetFilename
- PipeName
id: 41504465-5e3a-4a5b-a5b4-2a0baadd4463
level: high
logsource:
    category: pipe_created
    definition: Note that you have to configure logging for Named Pipe Events in Sysmon
        config (Event ID 17 and Event ID 18). The basic configuration is in popular
        sysmon configuration (https://github.com/SwiftOnSecurity/sysmon-config), but
        it is worth verifying. You can also use other repo, e.g. https://github.com/Neo23x0/sysmon-config,
        https://github.com/olafhartong/sysmon-modular. How to test detection? You
        can check powershell script from this site https://svch0st.medium.com/guide-to-named-pipes-and-hunting-for-cobalt-strike-pipes-dc46b2c5f575
    product: windows
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
related:
-   id: f3f3a972-f982-40ad-b63c-bca6afdfad7c
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029

