title: Code Integrity Attempted DLL Load
id: f8931561-97f5-4c46-907f-0a4a592e47a7
description: Detects attempted DLL load events that didn't meet anti-malware or Windows
    signing level requirements. It often means the file's signature is revoked or
    expired
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali
status: experimental
references:
    - https://twitter.com/SBousseaden/status/1483810148602814466
    - https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log
date: 2022/01/20
modified: 2023/04/27
tags:
    - attack.execution
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    codeintegrity_operational:
        Channel: Microsoft-Windows-CodeIntegrity/Operational
    selection:
        EventID: 3033
    filter_dtrace:
        FileNameBuffer|endswith: \Program Files\DTrace\dtrace.dll
        ProcessNameBuffer|endswith: \Windows\System32\svchost.exe
        RequestedPolicy: 12
        ValidatedPolicy: 1
    filter_msmpeng:
        FileNameBuffer|contains: \Windows\System32\DriverStore\FileRepository\
        FileNameBuffer|endswith: \igd10iumd64.dll
        RequestedPolicy: 7
        ValidatedPolicy: 1
    filter_electron_based_app:
        FileNameBuffer|endswith: \Windows\System32\nvspcap64.dll
        ProcessNameBuffer|endswith:
            - \AppData\Local\Keybase\Gui\Keybase.exe
            - \Microsoft\Teams\stage\Teams.exe
        RequestedPolicy: 8
        ValidatedPolicy: 1
    filter_bonjour:
        FileNameBuffer|endswith: \Program Files\Bonjour\mdnsNSP.dll
        ProcessNameBuffer|endswith:
            - \Windows\System32\svchost.exe
            - \Windows\System32\SIHClient.exe
        RequestedPolicy:
            - 8
            - 12
        ValidatedPolicy: 1
    filter_msoffice:
        FileNameBuffer|contains: \Microsoft Office\root\vfs\ProgramFilesCommonX64\Microsoft
            Shared\OFFICE
        FileNameBuffer|endswith: \MSOXMLMF.DLL
        RequestedPolicy: 7
        ValidatedPolicy: 1
    filter_slack:
        FileNameBuffer|endswith: \Windows\System32\nvspcap64.dll
        ProcessNameBuffer|contains: \AppData\Local\slack\app-
        ProcessNameBuffer|endswith: \slack.exe
        RequestedPolicy: 8
        ValidatedPolicy: 1
    filter_firefox:
        FileNameBuffer|endswith:
            - \Mozilla Firefox\mozavcodec.dll
            - \Mozilla Firefox\mozavutil.dll
        ProcessNameBuffer|endswith: \Mozilla Firefox\firefox.exe
        RequestedPolicy: 8
    filter_avast:
        FileNameBuffer|endswith:
            - \Program Files\Avast Software\Avast\aswAMSI.dll
            - \Program Files (x86)\Avast Software\Avast\aswAMSI.dll
        RequestedPolicy:
            - 8
            - 12
        ValidatedPolicy: 1
    filter_gac:
        FileNameBuffer|contains: \Windows\assembly\GAC\
        ProcessNameBuffer|endswith: \mscorsvw.exe
        ProcessNameBuffer|contains: \Windows\Microsoft.NET\
        RequestedPolicy: 8
        ValidatedPolicy:
            - 1
            - 2
    filter_google_drive:
        FileNameBuffer|contains: \Program Files\Google\Drive File Stream\
        FileNameBuffer|endswith: \crashpad_handler.exe
        ProcessNameBuffer|endswith: \Windows\ImmersiveControlPanel\SystemSettings.exe
        RequestedPolicy: 8
        ValidatedPolicy: 1
    condition: codeintegrity_operational and (selection and not 1 of filter_*)
falsepositives:
    - Antivirus products
level: high
ruletype: Sigma
