title: CodeIntegrity - Unsigned Kernel Module Loaded
id: 23f17a2b-73ca-e465-e823-bb1d47543f6d
related:
    - id: 951f8d29-f2f6-48a7-859f-0673ff105e6f
      type: derived
status: test
description: Detects the presence of a loaded unsigned kernel module on the system.
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-id-explanations
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/event-tag-explanations
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-06
tags:
    - attack.privilege-escalation
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    codeintegrity_operational:
        Channel: Microsoft-Windows-CodeIntegrity/Operational
    selection:
        EventID: 3001 # Code Integrity determined an unsigned kernel module %2 is loaded into the system. Check with the publisher to see if a signed version of the kernel module is available
    condition: codeintegrity_operational and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
