title: Code Integrity Attempted DLL Load
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2022/01/20
description: Detects attempted DLL load events that didn't meet anti-malware or Windows
    signing level requirements. It often means the file's signature is revoked or
    expired
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-CodeIntegrity/Operational
    SELECTION_10:
        ValidatedPolicy: 1
    SELECTION_11:
        FileNameBuffer: '*\Windows\System32\nvspcap64.dll'
    SELECTION_12:
        ProcessNameBuffer:
        - '*\AppData\Local\Keybase\Gui\Keybase.exe'
        - '*\Microsoft\Teams\stage\Teams.exe'
    SELECTION_13:
        RequestedPolicy: 8
    SELECTION_14:
        ValidatedPolicy: 1
    SELECTION_15:
        FileNameBuffer: '*\Program Files\Bonjour\mdnsNSP.dll'
    SELECTION_16:
        ProcessNameBuffer:
        - '*\Windows\System32\svchost.exe'
        - '*\Windows\System32\SIHClient.exe'
    SELECTION_17:
        RequestedPolicy: 8
    SELECTION_18:
        RequestedPolicy: 12
    SELECTION_19:
        ValidatedPolicy: 1
    SELECTION_2:
        EventID: 3033
    SELECTION_20:
        FileNameBuffer: '*\Microsoft Office\root\vfs\ProgramFilesCommonX64\Microsoft
            Shared\OFFICE*'
    SELECTION_21:
        FileNameBuffer: '*\MSOXMLMF.DLL'
    SELECTION_22:
        RequestedPolicy: 7
    SELECTION_23:
        ValidatedPolicy: 1
    SELECTION_24:
        FileNameBuffer: '*\Windows\System32\nvspcap64.dll'
    SELECTION_25:
        ProcessNameBuffer: '*\AppData\Local\slack\app-*'
    SELECTION_26:
        ProcessNameBuffer: '*\slack.exe'
    SELECTION_27:
        RequestedPolicy: 8
    SELECTION_28:
        ValidatedPolicy: 1
    SELECTION_29:
        FileNameBuffer:
        - '*\Mozilla Firefox\mozavcodec.dll'
        - '*\Mozilla Firefox\mozavutil.dll'
    SELECTION_3:
        FileNameBuffer: '*\Program Files\DTrace\dtrace.dll'
    SELECTION_30:
        ProcessNameBuffer: '*\Mozilla Firefox\firefox.exe'
    SELECTION_31:
        RequestedPolicy: 8
    SELECTION_32:
        FileNameBuffer:
        - '*\Program Files\Avast Software\Avast\aswAMSI.dll'
        - '*\Program Files (x86)\Avast Software\Avast\aswAMSI.dll'
    SELECTION_33:
        RequestedPolicy: 8
    SELECTION_34:
        RequestedPolicy: 12
    SELECTION_35:
        ValidatedPolicy: 1
    SELECTION_36:
        FileNameBuffer:
        - '*\stdole.dll'
        - '*\msdatasrc.dll'
    SELECTION_37:
        ProcessNameBuffer: '*\mscorsvw.exe'
    SELECTION_38:
        ProcessNameBuffer: '*\Windows\Microsoft.NET\\*'
    SELECTION_39:
        RequestedPolicy: 8
    SELECTION_4:
        ProcessNameBuffer: '*\Windows\System32\svchost.exe'
    SELECTION_40:
        ValidatedPolicy: 2
    SELECTION_41:
        FileNameBuffer: '*\Program Files\Google\Drive File Stream\\*'
    SELECTION_42:
        FileNameBuffer: '*\crashpad_handler.exe'
    SELECTION_43:
        ProcessNameBuffer: '*\Windows\ImmersiveControlPanel\SystemSettings.exe'
    SELECTION_44:
        RequestedPolicy: 8
    SELECTION_45:
        ValidatedPolicy: 1
    SELECTION_5:
        RequestedPolicy: 12
    SELECTION_6:
        ValidatedPolicy: 1
    SELECTION_7:
        FileNameBuffer: '*\Windows\System32\DriverStore\FileRepository\\*'
    SELECTION_8:
        FileNameBuffer: '*\igd10iumd64.dll'
    SELECTION_9:
        RequestedPolicy: 7
    condition: (SELECTION_1 and SELECTION_2 and  not ((SELECTION_3 and SELECTION_4
        and SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16 and (SELECTION_17 or SELECTION_18) and SELECTION_19)
        or (SELECTION_20 and SELECTION_21 and SELECTION_22 and SELECTION_23) or (SELECTION_24
        and SELECTION_25 and SELECTION_26 and SELECTION_27 and SELECTION_28) or (SELECTION_29
        and SELECTION_30 and SELECTION_31) or (SELECTION_32 and (SELECTION_33 or SELECTION_34)
        and SELECTION_35) or (SELECTION_36 and SELECTION_37 and SELECTION_38 and SELECTION_39
        and SELECTION_40) or (SELECTION_41 and SELECTION_42 and SELECTION_43 and SELECTION_44
        and SELECTION_45)))
falsepositives:
- Antivirus products
id: f8931561-97f5-4c46-907f-0a4a592e47a7
level: high
logsource:
    product: windows
    service: codeintegrity-operational
modified: 2022/12/12
references:
- https://twitter.com/SBousseaden/status/1483810148602814466
- https://github.com/MicrosoftDocs/windows-itpro-docs/blob/40fe118976734578f83e5e839b9c63ae7a4af82d/windows/security/threat-protection/windows-defender-application-control/event-id-explanations.md#windows-codeintegrity-operational-log
status: experimental
tags:
- attack.execution

