
title: Running Chrome VPN Extensions via the Registry 2 VPN Extension
ruletype: Sigma
author: frack113
date: 2021/12/28
description: Running Chrome VPN Extensions via the Registry install 2 vpn extension
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    TargetObject: '*Software\Wow6432Node\Google\Chrome\Extensions*'
  SELECTION_3:
    TargetObject: '*update_url'
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject:
    - '*fdcgdnkidjaadafnichfpabhfomcebme*'
    - '*fcfhplploccackoneaefokcmbjfbkenj*'
    - '*bihmplhobchoageeokmgbdihknkjbknd*'
    - '*gkojfkhlekighikafcpjkiklfbnlmeio*'
    - '*jajilbjjinjmgcibalaakngmkilboobh*'
    - '*gjknjjomckknofjidppipffbpoekiipm*'
    - '*nabbmpekekjknlbkgpodfndbodhijjem*'
    - '*kpiecbcckbofpmkkkdibbllpinceiihk*'
    - '*nlbejmccbhkncgokjcmghpfloaajcffj*'
    - '*omghfjlpggmjjaagoclmmobgdodcjboh*'
    - '*bibjcjfmgapbfoljiojpipaooddpkpai*'
    - '*mpcaainmfjjigeicjnlkdfajbioopjko*'
    - '*jljopmgdobloagejpohpldgkiellmfnc*'
    - '*lochiccbgeohimldjooaakjllnafhaid*'
    - '*nhnfcgpcbfclhfafjlooihdfghaeinfc*'
    - '*ookhnhpkphagefgdiemllfajmkdkcaim*'
    - '*namfblliamklmeodpcelkokjbffgmeoo*'
    - '*nbcojefnccbanplpoffopkoepjmhgdgh*'
    - '*majdfhpaihoncoakbjgbdhglocklcgno*'
    - '*lnfdmdhmfbimhhpaeocncdlhiodoblbd*'
    - '*eppiocemhmnlbhjplcgkofciiegomcon*'
    - '*cocfojppfigjeefejbpfmedgjbpchcng*'
    - '*foiopecknacmiihiocgdjgbjokkpkohc*'
    - '*hhdobjgopfphlmjbmnpglhfcgppchgje*'
    - '*jgbaghohigdbgbolncodkdlpenhcmcge*'
    - '*inligpkjkhbpifecbdjhmdpcfhnlelja*'
    - '*higioemojdadgdbhbbbkfbebbdlfjbip*'
    - '*hipncndjamdcmphkgngojegjblibadbe*'
    - '*iolonopooapdagdemdoaihahlfkncfgg*'
    - '*nhfjkakglbnnpkpldhjmpmmfefifedcj*'
    - '*jpgljfpmoofbmlieejglhonfofmahini*'
    - '*fgddmllnllkalaagkghckoinaemmogpe*'
    - '*ejkaocphofnobjdedneohbbiilggdlbi*'
    - '*keodbianoliadkoelloecbhllnpiocoi*'
    - '*hoapmlpnmpaehilehggglehfdlnoegck*'
    - '*poeojclicodamonabcabmapamjkkmnnk*'
    - '*dfkdflfgjdajbhocmfjolpjbebdkcjog*'
    - '*kcdahmgmaagjhocpipbodaokikjkampi*'
    - '*klnkiajpmpkkkgpgbogmcgfjhdoljacg*'
    - '*lneaocagcijjdpkcabeanfpdbmapcjjg*'
    - '*pgfpignfckbloagkfnamnolkeaecfgfh*'
    - '*jplnlifepflhkbkgonidnobkakhmpnmh*'
    - '*jliodmnojccaloajphkingdnpljdhdok*'
    - '*hnmpcagpplmpfojmgmnngilcnanddlhb*'
    - '*ffbkglfijbcbgblgflchnbphjdllaogb*'
    - '*kcndmbbelllkmioekdagahekgimemejo*'
    - '*jdgilggpfmjpbodmhndmhojklgfdlhob*'
    - '*bihhflimonbpcfagfadcnbbdngpopnjb*'
    - '*ppajinakbfocjfnijggfndbdmjggcmde*'
    - '*oofgbpoabipfcfjapgnbbjjaenockbdp*'
    - '*bhnhkdgoefpmekcgnccpnhjfdgicfebm*'
    - '*knmmpciebaoojcpjjoeonlcjacjopcpf*'
    - '*dhadilbmmjiooceioladdphemaliiobo*'
    - '*jedieiamjmoflcknjdjhpieklepfglin*'
    - '*mhngpdlhojliikfknhfaglpnddniijfh*'
    - '*omdakjcmkglenbhjadbccaookpfjihpa*'
    - '*npgimkapccfidfkfoklhpkgmhgfejhbj*'
    - '*akeehkgglkmpapdnanoochpfmeghfdln*'
    - '*gbmdmipapolaohpinhblmcnpmmlgfgje*'
    - '*aigmfoeogfnljhnofglledbhhfegannp*'
    - '*cgojmfochfikphincbhokimmmjenhhgk*'
    - '*ficajfeojakddincjafebjmfiefcmanc*'
    - '*ifnaibldjfdmaipaddffmgcmekjhiloa*'
    - '*jbnmpdkcfkochpanomnkhnafobppmccn*'
    - '*apcfdffemoinopelidncddjbhkiblecc*'
    - '*mjolnodfokkkaichkcjipfgblbfgojpa*'
    - '*oifjbnnafapeiknapihcmpeodaeblbkn*'
    - '*plpmggfglncceinmilojdkiijhmajkjh*'
    - '*mjnbclmflcpookeapghfhapeffmpodij*'
    - '*bblcccknbdbplgmdjnnikffefhdlobhp*'
    - '*aojlhgbkmkahabcmcpifbolnoichfeep*'
    - '*lcmammnjlbmlbcaniggmlejfjpjagiia*'
    - '*knajdeaocbpmfghhmijicidfcmdgbdpm*'
    - '*bdlcnpceagnkjnjlbbbcepohejbheilk*'
    - '*edknjdjielmpdlnllkdmaghlbpnmjmgb*'
    - '*eidnihaadmmancegllknfbliaijfmkgo*'
    - '*ckiahbcmlmkpfiijecbpflfahoimklke*'
    - '*macdlemfnignjhclfcfichcdhiomgjjb*'
    - '*chioafkonnhbpajpengbalkececleldf*'
    - '*amnoibeflfphhplmckdbiajkjaoomgnj*'
    - '*llbhddikeonkpbhpncnhialfbpnilcnc*'
    - '*pcienlhnoficegnepejpfiklggkioccm*'
    - '*iocnglnmfkgfedpcemdflhkchokkfeii*'
    - '*igahhbkcppaollcjeaaoapkijbnphfhb*'
    - '*njpmifchgidinihmijhcfpbdmglecdlb*'
    - '*ggackgngljinccllcmbgnpgpllcjepgc*'
    - '*kchocjcihdgkoplngjemhpplmmloanja*'
    - '*bnijmipndnicefcdbhgcjoognndbgkep*'
    - '*lklekjodgannjcccdlbicoamibgbdnmi*'
    - '*dbdbnchagbkhknegmhgikkleoogjcfge*'
    - '*egblhcjfjmbjajhjhpmnlekffgaemgfh*'
    - '*ehbhfpfdkmhcpaehaooegfdflljcnfec*'
    - '*bkkgdjpomdnfemhhkalfkogckjdkcjkg*'
    - '*almalgbpmcfpdaopimbdchdliminoign*'
    - '*akkbkhnikoeojlhiiomohpdnkhbkhieh*'
    - '*gbfgfbopcfokdpkdigfmoeaajfmpkbnh*'
    - '*bniikohfmajhdcffljgfeiklcbgffppl*'
    - '*lejgfmmlngaigdmmikblappdafcmkndb*'
    - '*ffhhkmlgedgcliajaedapkdfigdobcif*'
    - '*gcknhkkoolaabfmlnjonogaaifnjlfnp*'
    - '*pooljnboifbodgifngpppfklhifechoe*'
    - '*fjoaledfpmneenckfbpdfhkmimnjocfa*'
    - '*aakchaleigkohafkfjfjbblobjifikek*'
    - '*dpplabbmogkhghncfbfdeeokoefdjegm*'
    - '*padekgcemlokbadohgkifijomclgjgif*'
    - '*bfidboloedlamgdmenmlbipfnccokknp*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: b64a026b-8deb-4c1d-92fd-98893209dff1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1133/T1133.md#atomic-test-1---running-chrome-vpn-extensions-via-the-registry-2-vpn-extension
status: experimental
tags:
- attack.persistence
- attack.t1133
