title: Office Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_10:
        NewProcessName:
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
        - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
    SELECTION_11:
        NewProcessName: '*\OfficeClickToRun.exe'
    SELECTION_12:
        NewProcessName: C:\Program Files\AVG\Antivirus\RegSvr.exe
    SELECTION_13:
        TargetObject: '*\Microsoft\Office\Outlook\Addins\Antivirus.AsOutExt\\*'
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject:
        - '*\Software\Wow6432Node\Microsoft\Office*'
        - '*\Software\Microsoft\Office*'
    SELECTION_6:
        TargetObject:
        - '*\Word\Addins*'
        - '*\PowerPoint\Addins*'
        - '*\Outlook\Addins*'
        - '*\Onenote\Addins*'
        - '*\Excel\Addins*'
        - '*\Access\Addins*'
        - '*test\Special\Perf*'
    SELECTION_7:
        NewValue: (Empty)
    SELECTION_8:
        TargetObject:
        - '*\Excel\Addins\AdHocReportingExcelClientLib.AdHocReportingExcelClientAddIn.1\\*'
        - '*\Excel\Addins\ExcelPlugInShell.PowerMapConnect\\*'
        - '*\Excel\Addins\NativeShim\\*'
        - '*\Excel\Addins\NativeShim.InquireConnector.1\\*'
        - '*\Excel\Addins\PowerPivotExcelClientAddIn.NativeEntry.1\\*'
    SELECTION_9:
        TargetObject:
        - '*\Outlook\AddIns\AccessAddin.DC\\*'
        - '*\Outlook\AddIns\ColleagueImport.ColleagueImportAddin\\*'
        - '*\Outlook\AddIns\EvernoteCC.EvernoteContactConnector\\*'
        - '*\Outlook\AddIns\EvernoteOLRD.Connect\\*'
        - '*\Outlook\Addins\Microsoft.VbaAddinForOutlook.1\\*'
        - '*\Outlook\Addins\OcOffice.OcForms\\*'
        - '*\Outlook\Addins\OscAddin.Connect\\*'
        - '*\Outlook\Addins\OutlookChangeNotifier.Connect\\*'
        - '*\Outlook\Addins\UCAddin.LyncAddin.1*'
        - '*\Outlook\Addins\UCAddin.UCAddin.1*'
        - '*\Outlook\Addins\UmOutlookAddin.FormRegionAddin\\*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8) or (SELECTION_9)
        or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: baecf8fb-edbf-429f-9ade-31fc3f22b970
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/06/10
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
-   id: 17f878b8-9968-4578-b814-c4217fc5768c
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
yml_filename: registry_set_asep_reg_keys_modification_office.yml
yml_path: rules/windows/registry/registry_set
---

