
title: Registry Persitence via Service in Safe Mode
ruletype: Sigma
author: frack113
date: 2022/04/04
description: Detects the modification of the registry to allow a driver or service
  to persist in Safe Mode.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    TargetObject:
    - HKLM\SYSTEM\CurrentControlSet\Control\SafeBoot\Minimal\\*
    - HKLM\SYSTEM\CurrentControlSet\Control\SafeBoot\Network\\*
  SELECTION_3:
    TargetObject: '*\(Default)'
  SELECTION_4:
    Details: Service
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 1547e27c-3974-43e2-a7d7-7f484fb928ec
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-33---windows-add-registry-value-to-load-service-in-safe-mode-without-network
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md#atomic-test-34---windows-add-registry-value-to-load-service-in-safe-mode-with-network
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
