
title: Classes Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*\Software\Classes*'
  SELECTION_4:
    TargetObject:
    - '*\Folder\ShellEx\ExtShellFolderViews*'
    - '*\Folder\ShellEx\DragDropHandlers*'
    - '*\Folder\Shellex\ColumnHandlers*'
    - '*\Filter*'
    - '*\Exefile\Shell\Open\Command\(Default)*'
    - '*\Directory\Shellex\DragDropHandlers*'
    - '*\Directory\Shellex\CopyHookHandlers*'
    - '*\CLSID\{AC757296-3522-4E11-9862-C17BE5A1767E}\Instance*'
    - '*\CLSID\{ABE3B9A4-257D-4B97-BD1A-294AF496222E}\Instance*'
    - '*\CLSID\{7ED96837-96F0-4812-B211-F13C24117ED3}\Instance*'
    - '*\CLSID\{083863F1-70DE-11d0-BD40-00A0C911CE86}\Instance*'
    - '*\Classes\AllFileSystemObjects\ShellEx\DragDropHandlers*'
    - '*\.exe*'
    - '*\.cmd*'
    - '*\ShellEx\PropertySheetHandlers*'
    - '*\ShellEx\ContextMenuHandlers*'
  SELECTION_5:
    Details: (Empty)
  SELECTION_6:
    Details: '{807583E5-5146-11D5-A672-00B0D022E945}'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5) or (SELECTION_6)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: 9df5f547-c86a-433e-b533-f2794357e242
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
