title: Change User Account Associated with the FAX Service
ruletype: Sigma
author: frack113
date: 2022/07/17
description: Detect change of the user account associated with the FAX service to
    avoid the escalation problem.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        TargetObject: HKLM\System\CurrentControlSet\Services\Fax\ObjectName
    SELECTION_5:
        details: '*NetworkService*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and SELECTION_4 and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: e3fdf743-f05b-4051-990a-b66919be1743
level: high
logsource:
    category: registry_set
    product: windows
references:
- https://twitter.com/dottor_morte/status/1544652325570191361
- https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
yml_filename: registry_set_fax_change_service_user.yml
yml_path: rules/windows/registry/registry_set
---

