
title: CurrentControlSet Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*\SYSTEM\CurrentControlSet\Control*'
  SELECTION_4:
    TargetObject:
    - '*\Terminal Server\WinStations\RDP-Tcp\InitialProgram*'
    - '*\Terminal Server\Wds\rdpwd\StartupPrograms*'
    - '*\SecurityProviders\SecurityProviders*'
    - '*\SafeBoot\AlternateShell*'
    - '*\Print\Providers*'
    - '*\Print\Monitors*'
    - '*\NetworkProvider\Order*'
    - '*\Lsa\Notification Packages*'
    - '*\Lsa\Authentication Packages*'
    - '*\BootVerificationProgram\ImagePath*'
  SELECTION_5:
    Details: (Empty)
  SELECTION_6:
    Image: C:\Windows\System32\spoolsv.exe
  SELECTION_7:
    TargetObject: '*\Print\Monitors\CutePDF Writer Monitor*'
  SELECTION_8:
    Details:
    - cpwmon64_v40.dll
    - CutePDF Writer
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: f674e36a-4b91-431e-8aef-f8a96c2aca35
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
