
title: UAC Bypass via Event Viewer
ruletype: Sigma
author: Florian Roth
date: 2017/03/19
description: Detects UAC bypass method using Windows event viewer
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    TargetObject: HKCU\\*
  SELECTION_3:
    TargetObject: '*\mscfile\shell\open\command'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 7c81fec3-1c1d-43b0-996a-46753041b1b6
level: critical
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
- https://www.hybrid-analysis.com/sample/e122bc8bf291f15cab182a5d2d27b8db1e7019e4e96bb5cdbd1dfe7446f3f51f?environmentId=100
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- car.2019-04-001
