title: System Scripts Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
    oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\Software\Policies\Microsoft\Windows\System\Scripts*'
    SELECTION_6:
        TargetObject:
        - '*\Startup*'
        - '*\Shutdown*'
        - '*\Logon*'
        - '*\Logoff*'
    SELECTION_7:
        NewValue: (Empty)
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not (SELECTION_7))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
    keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: e7a2fd40-3ae1-4a85-bf80-15cf624fb1b1
level: medium
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
-   id: 17f878b8-9968-4578-b814-c4217fc5768c
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
yml_filename: registry_set_asep_reg_keys_modification_system_scripts.yml
yml_path: rules/windows/registry/registry_set
---

