title: Enabling COR Profiler Environment Variables
ruletype: Sigma
author: Jose Rodriguez (@Cyb3rPandaH), OTR (Open Threat Research)
date: 2020/09/10
description: This rule detects cor_enable_profiling and cor_profiler environment variables
    being set and configured.
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: Setvalue
    SELECTION_5:
        TargetObject:
        - '*\COR_ENABLE_PROFILING'
        - '*\COR_PROFILER'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
id: ad89044a-8f49-4673-9a55-cbd88a1b374f
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/06/26
references:
- https://twitter.com/jamieantisocial/status/1304520651248668673
- https://www.slideshare.net/JamieWilliams130/started-from-the-bottom-exploiting-data-sources-to-uncover-attck-behaviors
- https://www.sans.org/cyber-security-summit/archives
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1574.012
yml_filename: registry_set_enabling_cor_profiler_env_variables.yml
yml_path: rules/windows/registry/registry_set
---

