title: UAC Bypass via Sdclt
ruletype: Sigma
author: Omer Yampel, Christian Burkard
date: 2017/03/17
description: Detects the pattern of UAC Bypass using registry key manipulation of
    sdclt.exe (e.g. UACMe 53)
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*Software\Classes\exefile\shell\runas\command\isolatedCommand'
    SELECTION_6:
        EventType: SetValue
    SELECTION_7:
        TargetObject: '*Software\Classes\Folder\shell\open\command\SymbolicLinkValue'
    SELECTION_8:
        NewValue: '*-1???\Software\Classes\\*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 5b872a46-3b90-45c1-8419-f675db8053aa
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/06/26
references:
- https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- car.2019-04-001
yml_filename: registry_set_uac_bypass_sdclt.yml
yml_path: rules/windows/registry/registry_set
---

