
title: RDP Registry Modification
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: Detects potential malicious modification of the property value of fDenyTSConnections
  and UserAuthentication to enable remote desktop connections.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject:
    - '*\CurrentControlSet\Control\Terminal Server\WinStations\RDP-Tcp\UserAuthentication'
    - '*\CurrentControlSet\Control\Terminal Server\fDenyTSConnections'
  SELECTION_4:
    Details: DWORD (0x00000000)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- Image
- EventType
- TargetObject
id: 41904ebe-d56c-4904-b9ad-7a77bdf154b3
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://threathunterplaybook.com/notebooks/windows/05_defense_evasion/WIN-190407183310.html
status: test
tags:
- attack.defense_evasion
- attack.t1112
