
title: Disable UAC Using Registry
ruletype: Sigma
author: frack113
date: 2022/01/05
description: Disable User Account Conrol (UAC) by changing its registry key HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA
  from 1 to 0
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA
  SELECTION_4:
    Details: DWORD (0x00000000)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 48437c39-9e5f-47fb-af95-3d663c3f2919
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1548.002/T1548.002.md#atomic-test-8---disable-uac-using-regexe
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1548.002
