
title: Wow6432Node CurrentVersion Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_10:
    Image:
    - C:\Program Files\Microsoft Office\root\integration\integrator.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  SELECTION_11:
    TargetObject: '*\Explorer\Browser Helper Objects\{31D09BA0-12F5-4CCE-BE8A-2923E76605DA}\\*'
  SELECTION_12:
    Details: '*-A251-47B7-93E1-CDD82E34AF8B}'
  SELECTION_13:
    Details: grpconv -o
  SELECTION_14:
    Details: '*C:\Program Files*'
  SELECTION_15:
    Details: '*\Dropbox\Client\Dropbox.exe*'
  SELECTION_16:
    Details: '* /systemstartup*'
  SELECTION_17:
    TargetObject: '*\Explorer\Browser Helper Objects\{92EF2EAD-A7CE-4424-B0DB-499CF856608E}\NoExplorer'
  SELECTION_18:
    Image: '*\windowsdesktop-runtime-*'
  SELECTION_19:
    TargetObject:
    - '*\WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}'
    - '*\WOW6432Node\Microsoft\Windows\CurrentVersion\RunOnce\{7037b699-7382-448c-89a7-4765961d2537}'
  SELECTION_2:
    EventType: SetValue
  SELECTION_20:
    Details:
    - '"C:\ProgramData\Package Cache\{7037b699-7382-448c-89a7-4765961d2537}\windowsdesktop-runtime-*'
    - '"C:\ProgramData\Package Cache\{e2d1ae32-dd1d-4ad7-a298-10e42e7840fc}\windowsdesktop-runtime-*'
  SELECTION_21:
    Details: '*.exe" /burn.runonce'
  SELECTION_22:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_23:
    Image: '*\OfficeClickToRun.exe'
  SELECTION_24:
    Details: '"C:\ProgramData\Package Cache\{d21a4f20-968a-4b0c-bf04-a38da5f06e41}\windowsdesktop-runtime-*'
  SELECTION_3:
    TargetObject: '*\SOFTWARE\Wow6432Node\Microsoft\Windows\CurrentVersion*'
  SELECTION_4:
    TargetObject:
    - '*\ShellServiceObjectDelayLoad*'
    - '*\Run\\*'
    - '*\RunOnce\\*'
    - '*\Explorer\ShellServiceObjects*'
    - '*\Explorer\ShellIconOverlayIdentifiers*'
    - '*\Explorer\ShellExecuteHooks*'
    - '*\Explorer\SharedTaskScheduler*'
    - '*\Explorer\Browser Helper Objects*'
  SELECTION_5:
    Details: (Empty)
  SELECTION_6:
    Image: '*C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\{*'
  SELECTION_7:
    Image: '*\setup.exe*'
  SELECTION_8:
    Image: C:\Program Files\Common Files\Microsoft Shared\ClickToRun\OfficeClickToRun.exe
  SELECTION_9:
    TargetObject: '*\Office\ClickToRun\REGISTRY\MACHINE\Software\Wow6432Node\\*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)
    or (SELECTION_10 and SELECTION_11) or (SELECTION_12 or SELECTION_13 or SELECTION_14
    and SELECTION_15 and SELECTION_16) or (SELECTION_17) or (SELECTION_18 and SELECTION_19
    and SELECTION_20 and SELECTION_21) or (SELECTION_22 and SELECTION_23) or (SELECTION_24)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: b29aed60-ebd1-442b-9cb5-16a1d0324adb
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/04/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
