
title: Disable Tamper Protection on Windows Defender
ruletype: Sigma
author: Austin Songer @austinsonger
date: 2021/08/04
description: Detects disabling Windows Defender Tamper Protection
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*\Microsoft\Windows Defender\Features\TamperProtection*'
  SELECTION_4:
    Details: DWORD (0x00000000)
  SELECTION_5:
    Image: C:\ProgramData\Microsoft\Windows Defender\Platform\\*
  SELECTION_6:
    Image: '*\MsMpEng.exe'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 93d298a1-d28f-47f1-a468-d971e7796679
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/04/07
references:
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
