
title: GlobalFlags Registry Persistence Mechanisms
ruletype: Sigma
author: Karneades, Jonhnathan Ribeiro
date: 2018/04/11
description: Detects persistence registry keys
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    TargetObject:
    - '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion*'
  SELECTION_3:
    TargetObject: '*\Image File Execution Options\\*'
  SELECTION_4:
    TargetObject: '*\GlobalFlag*'
  SELECTION_5:
    TargetObject: '*SilentProcessExit\\*'
  SELECTION_6:
    TargetObject: '*\ReportingMode*'
  SELECTION_7:
    TargetObject: '*SilentProcessExit\\*'
  SELECTION_8:
    TargetObject: '*\MonitorProcess*'
  condition: (SELECTION_1 and SELECTION_2 and ((SELECTION_3 and SELECTION_4) or (SELECTION_5
    and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 36803969-5421-41ec-b92f-8500f79c23b0
level: critical
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
status: test
tags:
- attack.privilege_escalation
- attack.persistence
- attack.defense_evasion
- attack.t1546.012
- car.2013-01-002
