
title: Registry Persistence via Explorer Run Key
ruletype: Sigma
author: Florian Roth, oscd.community
date: 2018/07/18
description: Detects a possible persistence mechanism using RUN key for Windows Explorer
  and pointing to a suspicious folder
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*\Microsoft\Windows\CurrentVersion\Policies\Explorer\Run'
  SELECTION_4:
    Details:
    - C:\Windows\Temp\\*
    - C:\ProgramData\\*
    - C:\$Recycle.bin\\*
    - C:\Temp\\*
    - C:\Users\Public\\*
    - C:\Users\Default\\*
  SELECTION_5:
    Details:
    - '*\AppData\\*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and (SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
fields:
- Image
- ParentImage
id: b7916c2a-fa2f-4795-9477-32b731f70f11
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://researchcenter.paloaltonetworks.com/2018/07/unit42-upatre-continues-evolve-new-anti-analysis-techniques/
status: test
tags:
- attack.persistence
- attack.t1547.001
