
title: Office Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject:
    - '*\Software\Wow6432Node\Microsoft\Office*'
    - '*\Software\Microsoft\Office*'
  SELECTION_4:
    TargetObject:
    - '*\Word\Addins*'
    - '*\PowerPoint\Addins*'
    - '*\Outlook\Addins*'
    - '*\Onenote\Addins*'
    - '*\Excel\Addins*'
    - '*\Access\Addins*'
    - '*test\Special\Perf*'
  SELECTION_5:
    Details: (Empty)
  SELECTION_6:
    TargetObject:
    - '*\Excel\Addins\AdHocReportingExcelClientLib.AdHocReportingExcelClientAddIn.1\\*'
    - '*\Excel\Addins\ExcelPlugInShell.PowerMapConnect\\*'
    - '*\Excel\Addins\NativeShim\\*'
    - '*\Excel\Addins\NativeShim.InquireConnector.1\\*'
    - '*\Excel\Addins\PowerPivotExcelClientAddIn.NativeEntry.1\\*'
  SELECTION_7:
    TargetObject:
    - '*\Outlook\AddIns\AccessAddin.DC\\*'
    - '*\Outlook\AddIns\ColleagueImport.ColleagueImportAddin\\*'
    - '*\Outlook\AddIns\EvernoteCC.EvernoteContactConnector\\*'
    - '*\Outlook\AddIns\EvernoteOLRD.Connect\\*'
    - '*\Outlook\Addins\Microsoft.VbaAddinForOutlook.1\\*'
    - '*\Outlook\Addins\OcOffice.OcForms\\*'
    - '*\Outlook\Addins\OscAddin.Connect\\*'
    - '*\Outlook\Addins\OutlookChangeNotifier.Connect\\*'
    - '*\Outlook\Addins\UCAddin.LyncAddin.1*'
    - '*\Outlook\Addins\UCAddin.UCAddin.1*'
    - '*\Outlook\Addins\UmOutlookAddin.FormRegionAddin\\*'
  SELECTION_8:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_9:
    Image: '*\OfficeClickToRun.exe'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: baecf8fb-edbf-429f-9ade-31fc3f22b970
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
