title: UAC Bypass Abusing Winsat Path Parsing - Registry
ruletype: Sigma
author: Christian Burkard
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
    (UACMe 52)
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\Root\InventoryApplicationFile\winsat.exe|*'
    SELECTION_6:
        TargetObject: '*\LowerCaseLongPath'
    SELECTION_7:
        NewValue: c:\users\\*
    SELECTION_8:
        NewValue: '*\appdata\local\temp\system32\winsat.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7 and SELECTION_8)
falsepositives:
- Unknown
id: 6597be7b-ac61-4ac8-bef4-d3ec88174853
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/03/26
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
yml_filename: registry_set_uac_bypass_winsat.yml
yml_path: rules/windows/registry/registry_set
---

