
title: CobaltStrike Service Installations in Registry
ruletype: Sigma
author: Wojciech Lesicki
date: 2021/06/29
description: Detects known malicious service installs that appear in cases in which
  a Cobalt Strike beacon elevates privileges or lateral movement. We can also catch
  this by system log 7045 (https://github.com/SigmaHQ/sigma/blob/master/rules/windows/builtin/win_cobaltstrike_service_installs.yml)
  In some SIEM you can catch those events also in HKLM\System\ControlSet001\Services
  or HKLM\System\ControlSet002\Services, however, this rule is based on a regular
  sysmon's events.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*HKLM\System\CurrentControlSet\Services*'
  SELECTION_4:
    Details: '*ADMIN$*'
  SELECTION_5:
    Details: '*.exe*'
  SELECTION_6:
    Details: '*%COMSPEC%*'
  SELECTION_7:
    Details: '*start*'
  SELECTION_8:
    Details: '*powershell*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and ((SELECTION_4 and
    SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 61a7697c-cb79-42a8-a2ff-5f0cdfae0130
level: critical
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://www.sans.org/webcasts/tech-tuesday-workshop-cobalt-strike-detection-log-analysis-119395
status: experimental
tags:
- attack.execution
- attack.privilege_escalation
- attack.lateral_movement
- attack.t1021.002
- attack.t1543.003
- attack.t1569.002
