title: Persistence Via Disk Cleanup Handler - Autorun
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/21
description: "Detects when an attacker modifies values of the Disk Cleanup Handler\
    \ in the registry to achieve persistence via autorun.\nThe disk cleanup manager\
    \ is part of the operating system. It displays the dialog box [\u2026] The user\
    \ has the option of enabling or disabling individual handlers by selecting or\
    \ clearing their check box in the disk cleanup manager's UI. Although Windows\
    \ comes with a number of disk cleanup handlers, they aren't designed to handle\
    \ files produced by other applications. Instead, the disk cleanup manager is designed\
    \ to be flexible and extensible by enabling any developer to implement and register\
    \ their own disk cleanup handler. Any developer can extend the available disk\
    \ cleanup services by implementing and registering a disk cleanup handler.\n"
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\VolumeCaches\\*'
    SELECTION_6:
        TargetObject: '*\Autorun*'
    SELECTION_7:
        NewValue: DWORD (0x00000001)
    SELECTION_8:
        Targetobject:
        - '*\CleanupString*'
        - '*\PreCleanupString*'
    SELECTION_9:
        NewValue:
        - '*cmd*'
        - '*powershell*'
        - '*rundll32*'
        - '*mshta*'
        - '*cscript*'
        - '*wscript*'
        - '*wsl*'
        - '*\Users\Public\\*'
        - '*\Windows\TEMP\\*'
        - '*\Microsoft\Windows\Start Menu\Programs\Startup\\*'
    condition: ((SELECTION_1 and SELECTION_2 and SELECTION_3) and (SELECTION_4 and
        SELECTION_5) and ((SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: d4e2745c-f0c6-4bde-a3ab-b553b3f693cc
level: medium
logsource:
    category: registry_set
    product: windows
references:
- https://persistence-info.github.io/Data/diskcleanuphandler.html
- https://www.hexacorn.com/blog/2018/09/02/beyond-good-ol-run-key-part-86/
status: experimental
tags:
- attack.persistence
yml_filename: registry_set_disk_cleanup_handler_autorun_persistence.yml
yml_path: rules/windows/registry/registry_set
---

