title: Disable PUA Protection on Windows Defender
ruletype: Sigma
author: Austin Songer @austinsonger
date: 2021/08/04
description: Detects disabling Windows Defender PUA protection
detection:
    SELECTION_1:
        EventID: 4657
    SELECTION_2:
        OperationType:
        - Existing registry value modified
    SELECTION_3:
        Channel: Security
    SELECTION_4:
        EventType: SetValue
    SELECTION_5:
        TargetObject: '*\Policies\Microsoft\Windows Defender\PUAProtection*'
    SELECTION_6:
        NewValue: DWORD (0x00000000)
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 8ffc5407-52e3-478f-9596-0a7371eafe13
level: high
logsource:
    category: registry_set
    product: windows
modified: 2022/07/04
references:
- https://www.tenforums.com/tutorials/32236-enable-disable-microsoft-defender-pua-protection-windows-10-a.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
yml_filename: registry_set_disabled_pua_protection_on_microsoft_defender.yml
yml_path: rules/windows/registry/registry_set
---

