
title: Registry Persistence Mechanism via Windows Telemetry
ruletype: Sigma
author: Lednyov Alexey, oscd.community
date: 2020/10/16
description: Detects persistence method using windows telemetry
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    EventType: SetValue
  SELECTION_3:
    TargetObject: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\TelemetryController\\*'
  SELECTION_4:
    TargetObject: '*\Command*'
  SELECTION_5:
    Details: '*.exe*'
  SELECTION_6:
    Details:
    - '*\system32\CompatTelRunner.exe*'
    - '*\system32\DeviceCensus.exe*'
  condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not (SELECTION_6))
falsepositives:
- Unknown
id: 73a883d0-0348-4be4-a8d8-51031c2564f8
level: critical
logsource:
  category: registry_set
  definition: 'Requirements: Sysmon config that monitors \SOFTWARE\Microsoft\Windows
    NT\CurrentVersion\AppCompatFlags\TelemetryController subkey of the HKLU hives'
  product: windows
modified: 2022/03/26
references:
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence/
status: test
tags:
- attack.persistence
- attack.t1053.005
