title: Mint Sandstorm - Log4J Wstomcat Process Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), MSTIC (idea)
date: 2023/04/20
description: Detects Log4J Wstomcat process execution as seen in Mint Sandstorm activity
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        ParentImage: '*\ws_tomcatservice.exe'
    SELECTION_4:
        Image: '*\repadmin.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 7c97c625-0350-4f0a-8943-f6cadc88125e
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/18/nation-state-threat-actor-mint-sandstorm-refines-tradecraft-to-attack-high-value-targets/
status: test
tags:
- attack.execution

