title: Remote Registry Management Using Reg Utility
ruletype: Sigma
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Remote registry management using REG utility from non-admin workstation
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 5145
    SELECTION_3:
        RelativeTargetName: '*\winreg*'
    SELECTION_4:
        IpAddress: '%Admins_Workstations%'
    condition: (SELECTION_1 and (SELECTION_2 and SELECTION_3) and  not (SELECTION_4))
falsepositives:
- Legitimate usage of remote registry management by administrator
id: 68fcba0d-73a5-475e-a915-e8b4c576827e
level: medium
logsource:
    product: windows
    service: security
modified: 2023/04/25
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: test
tags:
- attack.credential_access
- attack.defense_evasion
- attack.discovery
- attack.s0075
- attack.t1012
- attack.t1112
- attack.t1552.002

