title: Outgoing Logon with New Credentials
ruletype: Sigma
author: Max Altgelt
date: 2022/04/06
description: Detects logon events that specify new credentials
detection:
  SELECTION_1:
    Channel: Security
  SELECTION_2:
    EventID: 4624
  SELECTION_3:
    LogonType: 9
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate remote administration activity
id: def8b624-e08f-4ae1-8612-1ba21190da6b
level: low
logsource:
  product: windows
  service: security
references:
- https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
status: experimental
