title: Successful Account Login Via WMI
id: c310cab1-252e-1d98-6b6f-e6e60c88a374
related:
    - id: 5af54681-df95-4c26-854f-2565e13cfab0
      type: derived
status: stable
description: Detects successful logon attempts performed with WMI
references:
    - Internal Research
author: Thomas Patzke
date: 2019-12-04
modified: 2024-01-17
tags:
    - attack.execution
    - attack.t1047
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 4624
        ProcessName|endswith: \WmiPrvSE.exe
    condition: security and selection
falsepositives:
    - Monitoring tools
    - Legitimate system administration
level: low
ruletype: Sigma
