title: A Member Was Removed From a Security-Enabled Global Group
ruletype: Sigma
author: Alexandr Yampolskyi, SOC Prime
date: 2023/04/26
description: Detects activity when a member is removed from a security-enabled global
    group
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 633
    SELECTION_3:
        EventID: 4729
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: 02c39d30-02b5-45d2-b435-8aebfe5a8629
level: low
logsource:
    product: windows
    service: security
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4729
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=633
related:
-   id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
    type: obsoletes
status: stable

