title: Outgoing Logon with New Credentials
id: 897e25ba-f935-3fd3-c6d5-f9abf379e831
related:
    - id: def8b624-e08f-4ae1-8612-1ba21190da6b
      type: derived
status: test
description: Detects logon events that specify new credentials
references:
    - https://go.recordedfuture.com/hubfs/reports/mtp-2021-0914.pdf
author: Max Altgelt (Nextron Systems)
date: 2022-04-06
tags:
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.t1550
logsource:
    product: windows
    service: security
detection:
    security:
        Channel: Security
    selection:
        EventID: 4624
        LogonType: 9
    condition: security and selection
falsepositives:
    - Legitimate remote administration activity
level: low
ruletype: Sigma
