title: A Member Was Added to a Security-Enabled Global Group
ruletype: Sigma
author: Alexandr Yampolskyi, SOC Prime
date: 2023/04/26
description: Detects activity when a member is added to a security-enabled global
    group
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4728
    SELECTION_3:
        EventID: 632
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3))
falsepositives:
- Unknown
id: c43c26be-2e87-46c7-8661-284588c5a53e
level: low
logsource:
    product: windows
    service: security
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4728
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=632
related:
-   id: 9cf01b6c-e723-4841-a868-6d7f8245ca6e
    type: obsoletes
status: stable

