title: Admin User Remote Logon
id: de5d0dd7-b73e-7f18-02b0-6b1acb7e9f52
related:
    - id: 0f63e1ef-1eb9-4226-9d54-8927ca08520a
      type: derived
status: test
description: Detect remote login by Administrator user (depending on internal pattern).
references:
    - https://car.mitre.org/wiki/CAR-2016-04-005
author: juju4
date: 2017-10-29
modified: 2022-10-09
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.defense-evasion
    - attack.lateral-movement
    - attack.initial-access
    - attack.t1078.001
    - attack.t1078.002
    - attack.t1078.003
    - car.2016-04-005
logsource:
    product: windows
    service: security
    definition: 'Requirements: Identifiable administrators usernames (pattern or special unique character. ex: "Admin-*"), internal policy mandating use only as secondary account'
detection:
    security:
        Channel: Security
    selection:
        EventID: 4624
        LogonType: 10
        AuthenticationPackageName: Negotiate
        TargetUserName|startswith: Admin
    condition: security and selection
falsepositives:
    - Legitimate administrative activity.
level: low
ruletype: Sigma
