title: RDP Login from Localhost
ruletype: Sigma
author: Thomas Patzke
date: 2019/01/28
description: RDP login with localhost source address may be a tunnelled login
detection:
    SELECTION_1:
        Channel: Security
    SELECTION_2:
        EventID: 4624
    SELECTION_3:
        LogonType: 10
    SELECTION_4:
        IpAddress:
        - ::1
        - 127.0.0.1
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 51e33403-2a37-4d66-a574-1fda1782cc31
level: high
logsource:
    product: windows
    service: security
modified: 2022/10/09
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
status: test
tags:
- attack.lateral_movement
- car.2013-07-002
- attack.t1021.001

