title: Registry Persistence Mechanisms in Recycle Bin
ruletype: Sigma
author: frack113
date: 2021/11/18
description: Detects persistence registry keys for Recycle Bin
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_5:
        EventType: RenameKey
    SELECTION_6:
        NewName: '*\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open*'
    SELECTION_7:
        EventType: SetValue
    SELECTION_8:
        TargetObject: '*\CLSID\{645FF040-5081-101B-9F08-00AA002F954E}\shell\open\command\(Default)*'
    condition: (((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 277efb8f-60be-4f10-b4d3-037802f37167
level: high
logsource:
    category: registry_event
    product: windows
modified: 2022/12/06
references:
- https://github.com/vxunderground/VXUG-Papers/blob/751edb8d50f95bd7baa730adf2c6c3bb1b034276/The%20Persistence%20Series/Persistence%20via%20Recycle%20Bin/Persistence_via_Recycle_Bin.pdf
- https://persistence-info.github.io/Data/recyclebin.html
- https://www.hexacorn.com/blog/2018/05/28/beyond-good-ol-run-key-part-78-2/
status: experimental
tags:
- attack.persistence
- attack.t1547

