title: Potential Credential Dumping Via LSASS SilentProcessExit Technique
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/02/26
description: Detects changes to the Registry in which a monitor program gets registered
    to dump the memory of the lsass.exe process
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_5:
        TargetObject: '*Microsoft\Windows NT\CurrentVersion\SilentProcessExit\lsass.exe*'
    condition: ((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4 and SELECTION_5)
falsepositives:
- Unlikely
id: 55e29995-75e7-451a-bef0-6225e2f13597
level: critical
logsource:
    category: registry_event
    product: windows
modified: 2022/12/19
references:
- https://www.deepinstinct.com/2021/02/16/lsass-memory-dumps-are-stealthier-than-ever-before-part-2/
- https://oddvar.moe/2018/04/10/persistence-using-globalflags-in-image-file-execution-options-hidden-from-autoruns-exe/
related:
-   id: 36803969-5421-41ec-b92f-8500f79c23b0
    type: similar
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

