title: Office Application Startup - Office Test
id: 3d27f6dd-1c74-4687-b4fa-ca849d128d1c
status: test
description: Detects the addition of office test registry that allows a user to specify
    an arbitrary DLL that will be executed every time an Office application is started
references:
    - https://unit42.paloaltonetworks.com/unit42-technical-walkthrough-office-test-persistence-method-used-in-recent-sofacy-attacks/
author: omkar72
date: 2020/10/25
modified: 2022/10/09
tags:
    - attack.persistence
    - attack.t1137.002
    - sysmon
logsource:
    category: registry_event
    product: windows
detection:
    registry_event:
        EventID:
            - 12
            - 13
            - 14
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_registry:
        TargetObject:
            - HKCU\Software\Microsoft\Office test\Special\Perf
            - HKLM\Software\Microsoft\Office test\Special\Perf
    condition: registry_event and selection_registry
falsepositives:
    - Unlikely
level: medium
ruletype: Sigma
