title: Atbroker Registry Change
ruletype: Sigma
author: Mateusz Wydra, oscd.community
date: 2020/10/13
description: Detects creation/modification of Assistive Technology applications and
    persistence with usage of 'at'
detection:
    SELECTION_1:
        EventID: 12
    SELECTION_10:
        TargetObject: '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs*'
    SELECTION_2:
        EventID: 13
    SELECTION_3:
        EventID: 14
    SELECTION_4:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_5:
        TargetObject:
        - '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs*'
        - '*Software\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration*'
    SELECTION_6:
        Image: C:\Windows\system32\atbroker.exe
    SELECTION_7:
        TargetObject: '*\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration*'
    SELECTION_8:
        Details: (Empty)
    SELECTION_9:
        Image: C:\Windows\Installer\MSI*
    condition: (((SELECTION_1 or SELECTION_2 or SELECTION_3) and SELECTION_4) and
        SELECTION_5 and  not ((SELECTION_6 and SELECTION_7 and SELECTION_8) or (SELECTION_9
        and SELECTION_10)))
falsepositives:
- Creation of non-default, legitimate at usage
id: 9577edbb-851f-4243-8c91-1d5b50c1a39b
level: medium
logsource:
    category: registry_event
    product: windows
modified: 2023/01/19
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.persistence
- attack.t1547

