title: HackTool - SecurityXploded Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2018/12/19
description: Detects the execution of SecurityXploded Tools
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Company: SecurityXploded
    SELECTION_4:
        NewProcessName: '*PasswordDump.exe'
    SELECTION_5:
        OriginalFileName: '*PasswordDump.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unlikely
id: 7679d464-4f74-45e2-9e01-ac66c5eb041a
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://securityxploded.com/
- https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/
status: stable
tags:
- attack.credential_access
- attack.t1555

