title: Potentially Suspicious Regsvr32 HTTP/FTP Pattern
id: 2f7ca8a6-7f75-cecd-494a-76a83910eac9
status: experimental
description: Detects regsvr32 execution to download/install/register new DLLs that are hosted on Web or FTP servers.
references:
    - https://twitter.com/mrd0x/status/1461041276514623491
    - https://twitter.com/tccontre18/status/1480950986650832903
    - https://lolbas-project.github.io/lolbas/Binaries/Regsvr32/
author: Florian Roth (Nextron Systems)
date: 2023/05/24
modified: 2023/05/26
tags:
    - attack.defense_evasion
    - attack.t1218.010
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \regsvr32.exe
        - OriginalFileName: REGSVR32.EXE
    selection_flag:
        CommandLine|contains:
            - ' /i'
            - ' -i'
    selection_protocol:
        CommandLine|contains:
            - ftp
            - http
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
