title: Execute MSDT.EXE Using Diagcab File
ruletype: Sigma
author: GossiTheDog (rule), frack113 (sigma version)
date: 2022/06/09
description: Detects diagcab leveraging the "ms-msdt" handler or the "msdt.exe" binary
    to execute arbitrary commands as seen in CVE-2022-30190
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\msdt.exe'
    SELECTION_4:
        OriginalFileName: msdt.exe
    SELECTION_5:
        CommandLine: '*/cab*'
    SELECTION_6:
        CommandLine: '*.diagcab*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Legitimate usage of ".diagcab" files
id: 6545ce61-a1bd-4119-b9be-fcbee42c0cf3
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

