title: Suspicious Runscripthelper.exe
id: f93df83e-4e70-cffa-f5d8-2b7c77d7bb45
related:
    - id: eca49c87-8a75-4f13-9c73-a5a29e845f03
      type: derived
status: test
description: Detects execution of powershell scripts via Runscripthelper.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Runscripthelper/
author: Victor Sergeev, oscd.community
date: 2020-10-09
modified: 2022-07-11
tags:
    - attack.execution
    - attack.t1059
    - attack.defense-evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: surfacecheck
        NewProcessName|endswith: \Runscripthelper.exe
    condition: process_creation and selection
fields:
    - CommandLine
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
