title: Use of VSIISExeLauncher.exe
id: 98e8d981-f4c4-0375-e252-80c62c6ff415
related:
    - id: 18749301-f1c5-4efc-a4c3-276ff1f5b6f8
      type: derived
status: test
description: The "VSIISExeLauncher.exe" binary part of the Visual Studio/VS Code can be used to execute arbitrary binaries
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/VSIISExeLauncher/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-09
tags:
    - attack.defense-evasion
    - attack.t1127
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \VSIISExeLauncher.exe
        - OriginalFileName: VSIISExeLauncher.exe
    selection_cli:
        CommandLine|contains:
            - ' -p '
            - ' -a '
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
