title: Suspicious Provlaunch.EXE Child Process
id: 325e649b-61c6-7c91-88ba-f2873675b355
status: test
description: Detects suspicious child processes of "provlaunch.exe" which might indicate potential abuse to proxy execution.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/08
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \provlaunch.exe
    selection_child:
        - NewProcessName|endswith:
              - \calc.exe
              - \cmd.exe
              - \cscript.exe
              - \mshta.exe
              - \notepad.exe
              - \powershell.exe
              - \pwsh.exe
              - \regsvr32.exe
              - \rundll32.exe
              - \wscript.exe
        - NewProcessName|contains:
              - :\PerfLogs\
              - :\Temp\
              - :\Users\Public\
              - \AppData\Temp\
              - \Windows\System32\Tasks\
              - \Windows\Tasks\
              - \Windows\Temp\
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
