title: Suspicious Diantz Alternate Data Stream Execution
id: 555c9e0e-bd1c-accd-f824-11a77ca76819
related:
    - id: 6b369ced-4b1d-48f1-b427-fdc0de0790bd
      type: derived
status: test
description: Compress target file into a cab file stored in the Alternate Data Stream (ADS) of the target file.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Diantz/
author: frack113
date: 2021-11-26
modified: 2022-12-31
tags:
    - attack.defense-evasion
    - attack.t1564.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - diantz.exe
            - .cab
        CommandLine|re: :[^\\]
    condition: process_creation and selection
falsepositives:
    - Very Possible
level: medium
ruletype: Sigma
