title: HackTool - HollowReaper Execution
id: 4620f95a-0964-646b-6b21-78a838f03ac3
related:
    - id: 85d23b42-9a9d-4f8f-b3d7-d2733c1d58f5
      type: derived
status: experimental
description: |
    Detects usage of HollowReaper, a process hollowing shellcode launcher used for stealth payload execution through process hollowing.
    It replaces the memory of a legitimate process with custom shellcode, allowing the attacker to execute payloads under the guise of trusted binaries.
references:
    - https://github.com/vari-sh/RedTeamGrimoire/tree/b5e7635d34db6e1f0398d8847e8f293186e947c5/HollowReaper
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-07-01
tags:
    - attack.privilege-escalation
    - attack.defense-evasion
    - attack.t1055.012
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \HollowReaper.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
