title: Exports Registry Key To a File
id: 033b2a23-2b9c-4ad7-db96-f2f2a509169c
status: test
description: Detects the export of the target Registry key to a file.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Regedit/
    - https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/07
modified: 2024/03/13
tags:
    - attack.exfiltration
    - attack.t1012
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \regedit.exe
        - OriginalFileName: REGEDIT.EXE
    selection_cli:
        CommandLine|contains:
            - ' -E '
            - ' /E '
    filter_1:   # filters to avoid intersection with critical keys rule
        CommandLine|contains:
            - hklm
            - hkey_local_machine
    filter_2:
        CommandLine|endswith:
            - \system
            - \sam
            - \security
    condition: process_creation and (all of selection_* and not all of filter_*)
fields:
    - ParentProcessName
    - CommandLine
falsepositives:
    - Legitimate export of keys
level: low
ruletype: Sigma
