title: Potentially Suspicious Execution From Parent Process In Public Folder
id: cd36cd3c-17cb-d0c6-1e77-c74a5a6e96fe
related:
    - id: 69bd9b97-2be2-41b6-9816-fb08757a4d1a
      type: derived
status: test
description: |
    Detects a potentially suspicious execution of a parent process located in the "\Users\Public" folder executing a child process containing references to shell or scripting binaries and commandlines.
references:
    - https://redcanary.com/blog/blackbyte-ransomware/
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-02-25
modified: 2024-07-12
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1564
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|contains: :\Users\Public\
    selection_child:
        - NewProcessName|endswith:
              - \bitsadmin.exe
              - \certutil.exe
              - \cmd.exe
              - \cscript.exe
              - \mshta.exe
              - \powershell.exe
              - \pwsh.exe
              - \regsvr32.exe
              - \rundll32.exe
              - \wscript.exe
        - CommandLine|contains:
              - bitsadmin
              - certutil
              - cscript
              - mshta
              - powershell
              - regsvr32
              - rundll32
              - wscript
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
