title: PowerShell Set-Acl On Windows Folder
id: 401fb350-d891-c9ac-1ba7-13d9cce53c20
status: test
description: Detects PowerShell scripts to set the ACL to a file in the Windows folder
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-acl?view=powershell-5.1
    - https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/18
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
    selection_cmdlet:
        CommandLine|contains|all:
            - 'Set-Acl '
            - '-AclObject '
    selection_paths:
        # Note: Add more suspicious paths
        CommandLine|contains:
            - -Path "C:\Windows
            - -Path 'C:\Windows
            - -Path %windir%
            - -Path $env:windir
    selection_permissions:
        # Note: Add more suspicious permissions
        CommandLine|contains:
            - FullControl
            - Allow
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
