title: Stop Windows Service Via Sc.EXE
ruletype: Sigma
author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/05
description: Detects the stopping of a Windows service
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: sc.exe
    SELECTION_4:
        NewProcessName: '*\sc.exe'
    SELECTION_5:
        CommandLine: '* stop *'
    SELECTION_6:
        CommandLine:
        - sc  stop KSCWebConsoleMessageQueue
        - sc  stop LGHUBUpdaterService
    SELECTION_7:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6 and SELECTION_7)))
falsepositives:
- There are many legitimate reasons to stop a service. This rule isn't looking for
    any suspicious behaviour in particular. Filter legitimate activity accordingly
id: 81bcb81b-5b1f-474b-b373-52c871aaa7b1
level: low
logsource:
    category: process_creation
    product: windows
related:
-   id: eb87818d-db5d-49cc-a987-d5da331fbd90
    type: obsoletes
status: experimental
tags:
- attack.impact
- attack.t1489

