title: Suspicious CustomShellHost Execution
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/19
description: Detects the execution of CustomShellHost binary where the child isn't
    located in 'C:\Windows\explorer.exe'
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\CustomShellHost.exe'
    SELECTION_4:
        NewProcessName: C:\Windows\explorer.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
id: 84b14121-9d14-416e-800b-f3b829c5a14d
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/180
status: experimental
tags:
- attack.defense_evasion
- attack.t1216

