title: Potentially Over Permissive Permissions Granted Using Dsacls.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/20
description: Detects usage of Dsacls to grant over permissive permissions
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\dsacls.exe'
    SELECTION_4:
        OriginalFileName: DSACLS.EXE
    SELECTION_5:
        CommandLine: '* /G *'
    SELECTION_6:
        CommandLine:
        - '*GR*'
        - '*GE*'
        - '*GW*'
        - '*GA*'
        - '*WP*'
        - '*WD*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Legitimate administrators granting over permissive permissions to users
id: 01c42d3c-242d-4655-85b2-34f1739632f7
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://ss64.com/nt/dsacls.html
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
status: experimental
tags:
- attack.execution
- attack.t1218

