title: Potentially Suspicious Office Document Executed From Trusted Location
id: f99abdf0-6283-4e71-bd2b-b5c048a94743
status: experimental
description: Detects the execution of an Office application that points to a document
    that is located in a trusted location. Attackers often used this to avoid macro
    security and execute their malicious code.
references:
    - Internal Research
    - https://twitter.com/Max_Mal_/status/1633863678909874176
    - https://techcommunity.microsoft.com/t5/microsoft-365-blog/new-security-hardening-policies-for-trusted-documents/ba-p/3023465
    - https://twitter.com/_JohnHammond/status/1588155401752788994
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/21
modified: 2023/10/18
tags:
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith:
            - \explorer.exe
            - \dopus.exe
    selection_img:
        -   NewProcessName|endswith:
                - \EXCEL.EXE
                - \POWERPNT.EXE
                - \WINWORD.exe
        -   OriginalFileName:
                - Excel.exe
                - POWERPNT.EXE
                - WinWord.exe
    selection_trusted_location:
        CommandLine|contains:
            - \AppData\Roaming\Microsoft\Templates
            - \AppData\Roaming\Microsoft\Word\Startup\
            - \Microsoft Office\root\Templates\
            - \Microsoft Office\Templates\
    filter_main_dotx:
        CommandLine|endswith:
            - .dotx
            - .xltx
            - .potx
    condition: process_creation and (all of selection_* and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
