title: Potential MsiExec Masquerading
id: c043e0b2-a5f8-ebe1-e99b-54303aa6f2ad
related:
    - id: e22a6eb2-f8a5-44b5-8b44-a2dbd47b1144
      type: derived
status: test
description: Detects the execution of msiexec.exe from an uncommon directory
references:
    - https://twitter.com/200_okay_/status/1194765831911215104
author: Florian Roth (Nextron Systems)
date: 2019-11-14
modified: 2023-02-21
tags:
    - attack.defense-evasion
    - attack.t1036.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \msiexec.exe
        - OriginalFileName: \msiexec.exe
    filter:
        NewProcessName|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
            - C:\Windows\WinSxS\
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
