
title: Psr.exe Capture Screenshots
ruletype: Sigma
author: Beyu Denis, oscd.community
date: 2019/10/12
description: The psr.exe captures desktop screenshots and saves them on the local
  machine
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\Psr.exe'
  SELECTION_4:
    CommandLine: '*/start*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 2158f96f-43c2-43cb-952a-ab4580f32382
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://lolbas-project.github.io/lolbas/Binaries/Psr/
- https://www.sans.org/summit-archives/file/summit-archive-1493861893.pdf
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
status: test
tags:
- attack.collection
- attack.t1113
