title: Suspicious Characters in CommandLine
ruletype: Sigma
author: Florian Roth
date: 2022/04/27
description: Detects suspicious Unicode characters in the command line, which could
    be a sign of obfuscation or defense evasion
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - "*\u02E3*"
        - "*\u02EA*"
        - "*\u02E2*"
    SELECTION_4:
        CommandLine:
        - "*\u2215*"
        - "*\u2044*"
    SELECTION_5:
        CommandLine:
        - "*\u2015*"
        - "*\u2014*"
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
id: 2c0d2d7b-30d6-4d14-9751-7b9113042ab9
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
status: experimental

