title: Nslookup PowerShell Download Cradle - ProcessCreation
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/05
description: Detects suspicious powershell download cradle using nslookup. This cradle
    uses nslookup to extract payloads from DNS records
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\nslookup.exe*'
    SELECTION_4:
        OriginalFileName: \nslookup.exe
    SELECTION_5:
        ParentProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_6:
        CommandLine:
        - '* -q=txt *'
        - '* -querytype=txt *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 1b3b01c7-84e9-4072-86e5-fc285a41ff23
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/19
references:
- https://twitter.com/Alh4zr3d/status/1566489367232651264
related:
-   id: 72671447-4352-4413-bb91-b85569687135
    type: obsoletes
-   id: 999bff6d-dc15-44c9-9f5c-e1051bfc86e1
    type: similar
status: experimental
tags:
- attack.defense_evasion

