title: Nimgrab File Download
ruletype: Sigma
author: frack113
date: 2022/08/28
description: Detects usage of nimgrab, a tool bundled with the Nim programming framework,
    downloading a file. This can be normal behaviour on developer systems.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\nimgrab.exe'
    SELECTION_4:
        Hashes:
        - '*MD5=2DD44C3C29D667F5C0EF5F9D7C7FFB8B*'
        - '*SHA256=F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559*'
        - '*IMPHASH=C07FDDD21D123EA9B3A08EEF44AAAC45*'
    SELECTION_5:
        md5: 2DD44C3C29D667F5C0EF5F9D7C7FFB8B
    SELECTION_6:
        sha256: F266609E91985F0FE3E31C5E8FAEEEC4FFA5E0322D8B6F15FE69F4C5165B9559
    SELECTION_7:
        Imphash: C07FDDD21D123EA9B3A08EEF44AAAC45
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Legitimate use of Nim on developer systems
id: 74a12f18-505c-4114-8d0b-8448dd5485c6
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/30
references:
- https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
status: experimental
tags:
- attack.command_and_control
- attack.t1105

