title: Suspicious Extrac32 Alternate Data Stream Execution
id: 5df3c3b4-3daf-3385-fdf0-4b5612003633
related:
    - id: 4b13db67-0c45-40f1-aba8-66a1a7198a1e
      type: derived
status: test
description: Extract data from cab file and hide it in an alternate data stream
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
author: frack113
date: 2021-11-26
modified: 2022-12-30
tags:
    - attack.defense-evasion
    - attack.t1564.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - extrac32.exe
            - .cab
        CommandLine|re: :[^\\]
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
