title: Potentially Suspicious ASP.NET Compilation Via AspNetCompiler
id: 7ba37b73-d32a-9fdc-27f1-372220985b67
status: experimental
description: Detects execution of "aspnet_compiler.exe" with potentially suspicious paths for compilation.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
    - https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/14
tags:
    - attack.defense_evasion
    - attack.t1127
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            # Note: add other potential suspicious paths
            - \Users\Public\
            - \AppData\Local\Temp\
            - \AppData\Local\Roaming\
            - :\Temp\
            - :\Windows\Temp\
            - :\Windows\System32\Tasks\
            - :\Windows\Tasks\
        NewProcessName|contains:
            - C:\Windows\Microsoft.NET\Framework\
            - C:\Windows\Microsoft.NET\Framework64\
        NewProcessName|endswith: \aspnet_compiler.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
