title: Potential Renamed Rundll32 Execution
id: 04f5d1ee-1b2f-dc73-a3fd-a7277cb56195
status: test
description: Detects when 'DllRegisterServer' is called in the commandline and the image is not rundll32. This could mean that the 'rundll32' utility has been renamed in order to avoid detection
references:
    - https://twitter.com/swisscom_csirt/status/1331634525722521602?s=20
    - https://app.any.run/tasks/f74c5157-8508-4ac6-9805-d63fe7b0d399/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/22
modified: 2023/02/03
tags:
    - attack.execution
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: DllRegisterServer
    filter:
        NewProcessName|endswith: \rundll32.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
