title: Run PowerShell Script from ADS
id: d6a5fc1c-e0e9-bcc2-daed-22823802b707
related:
    - id: 45a594aa-1fbd-4972-a809-ff5a99dd81b8
      type: derived
status: test
description: Detects PowerShell script execution from Alternate Data Stream (ADS)
references:
    - https://github.com/p0shkatz/Get-ADS/blob/1c3a3562e713c254edce1995a7d9879c687c7473/Get-ADS.ps1
author: Sergey Soldatov, Kaspersky Lab, oscd.community
date: 2019-10-30
modified: 2022-07-14
tags:
    - attack.defense-evasion
    - attack.t1564.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - Get-Content
            - -Stream
        ParentProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
