title: Potential Reconnaissance For Cached Credentials Via Cmdkey.EXE
id: e1b669ee-98b7-25ba-818f-8198fdb19b0d
related:
    - id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
      type: derived
status: test
description: Detects usage of cmdkey to look for cached credentials on the system
references:
    - https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
    - https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
    - https://github.com/redcanaryco/atomic-red-team/blob/b27a3cb25025161d49ac861cb216db68c46a3537/atomics/T1003.005/T1003.005.md#atomic-test-1---cached-credential-dump-via-cmdkey
author: jmallette, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2019-01-16
modified: 2024-03-05
tags:
    - attack.credential-access
    - attack.t1003.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \cmdkey.exe
        - OriginalFileName: cmdkey.exe
    selection_cli:
        CommandLine|contains|windash: ' -l'
    condition: process_creation and (all of selection*)
fields:
    - SubjectUserName
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate administrative tasks
level: high
ruletype: Sigma
