title: Non Interactive PowerShell Process Spawned
id: f4bbd493-b796-416e-bbf2-121235348529
status: test
description: Detects non-interactive PowerShell activity by looking at the "powershell" process with a non-user GUI process such as "explorer.exe" as a parent.
references:
    - https://web.archive.org/web/20200925032237/https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
author: Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)
date: 2019/09/12
modified: 2023/09/07
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
    filter_main_generic:
        ParentProcessName|endswith:
            - :\Windows\explorer.exe
            - :\Windows\System32\CompatTelRunner.exe
            - :\Windows\SysWOW64\explorer.exe
    filter_main_windows_update:
        ParentProcessName: :\$WINDOWS.~BT\Sources\SetupHost.exe
    filter_optional_vscode:
        # Triggered by VsCode when you open a Shell inside the workspace
        ParentCommandLine|contains: ' --ms-enable-electron-run-as-node '
        ParentProcessName|endswith: \AppData\Local\Programs\Microsoft VS Code\Code.exe
    filter_optional_terminal:
        ParentProcessName|contains: :\Program Files\WindowsApps\Microsoft.WindowsTerminal_
        ParentProcessName|endswith: \WindowsTerminal.exe
    condition: process_creation and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Likely. Many admin scripts and tools leverage PowerShell in their BAT or VB scripts which may trigger this rule often. It is best to add additional filters or use this to hunt for anomalies
level: low
ruletype: Sigma
