title: PUA - CleanWipe Execution
id: 3e89a33f-127c-1329-d332-0d836db05ad7
related:
    - id: f44800ac-38ec-471f-936e-3fa7d9c53100
      type: derived
status: test
description: Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.
references:
    - https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe
author: Nasreddine Bencherchali (Nextron Systems)
date: 2021-12-18
modified: 2023-02-14
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        NewProcessName|endswith: \SepRemovalToolNative_x64.exe
    selection2:
        CommandLine|contains: --uninstall
        NewProcessName|endswith: \CATClean.exe
    selection3:
        CommandLine|contains: -r
        NewProcessName|endswith: \NetInstaller.exe
    selection4:
        CommandLine|contains|all:
            - /uninstall
            - /enterprise
        NewProcessName|endswith: \WFPUnins.exe
    condition: process_creation and (1 of selection*)
falsepositives:
    - Legitimate administrative use (Should be investigated either way)
level: high
ruletype: Sigma
