
title: Jlaive Usage For Assembly Execution In-Memory
ruletype: Sigma
author: Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)
date: 2022/05/24
description: Detect the use of Jlaive to execute assemblies in a copied PowerShell
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_10:
    CommandLine: '*+h*'
  SELECTION_11:
    CommandLine: '*.bat.exe*'
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\cmd.exe'
  SELECTION_4:
    ParentCommandLine: '*.bat'
  SELECTION_5:
    NewProcessName: '*\xcopy.exe'
  SELECTION_6:
    CommandLine: '*powershell.exe*'
  SELECTION_7:
    CommandLine: '*.bat.exe*'
  SELECTION_8:
    NewProcessName: '*\attrib.exe'
  SELECTION_9:
    CommandLine: '*+s*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
    ((SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
    and SELECTION_10 and SELECTION_11)))
falsepositives:
- Unknown
id: 0a99eb3e-1617-41bd-b095-13dc767f3def
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/24
references:
- https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool
- https://github.com/ch2sh/Jlaive
status: experimental
tags:
- attack.execution
- attack.t1059.003
