title: Execution Of Non-Existing File
id: 5385a182-a453-d329-5d89-d768e2b73e28
related:
    - id: 71158e3f-df67-472b-930e-7d287acaa3e1
      type: derived
status: test
description: |
    Detects process creation events where the Image field lacks an absolute path,
    which occurs when the backing file no longer exists on disk at the time of
    logging - commonly caused by Process Ghosting or other unorthodox process creation techniques.
references:
    - https://pentestlaboratories.com/2021/12/08/process-ghosting/
    - https://www.elastic.co/blog/process-ghosting-a-new-executable-image-tampering-attack
author: Max Altgelt (Nextron Systems)
date: 2021-12-09
modified: 2026-07-05
tags:
    - attack.stealth
    - attack.privilege-escalation
    - attack.t1055
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    filter_main_image_absolute_path:
        NewProcessName|contains: \
    filter_optional_null:
        NewProcessName: null
    filter_optional_empty:
        NewProcessName:
            - '-'
            - ''
    filter_optional_4688:
        - NewProcessName:
              - MemCompression
              - Registry
              - System
              - vmmem
              - vmmemWSL
        - CommandLine:
              - MemCompression
              - Registry
              - vmmem
              - vmmemWSL
    condition: process_creation and (not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
