title: Visual Studio NodejsTools PressAnyKey Arbitrary Binary Execution
id: a5a31ba8-6ecb-ba33-f271-5a50afc76d9b
related:
    - id: 65c3ca2c-525f-4ced-968e-246a713d164f
      type: similar
    - id: a20391f8-76fb-437b-abc0-dba2df1952c6
      type: derived
status: test
description: Detects child processes of Microsoft.NodejsTools.PressAnyKey.exe that can be used to execute any other binary
references:
    - https://twitter.com/mrd0x/status/1463526834918854661
    - https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022-01-11
modified: 2023-04-11
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \Microsoft.NodejsTools.PressAnyKey.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use by developers as part of NodeJS development with Visual Studio Tools
level: medium
ruletype: Sigma
