title: SharpLdapWhoami
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/08/29
description: Detects SharpLdapWhoami, a whoami alternative by asking the LDAP service
    on a domain controller
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\SharpLdapWhoami.exe'
    SELECTION_4:
        OriginalFileName: '*SharpLdapWhoami*'
    SELECTION_5:
        Product: SharpLdapWhoami
    SELECTION_6:
        CommandLine:
        - '* /method:ntlm'
        - '* /method:kerb'
        - '* /method:nego'
        - '* /m:nego'
        - '* /m:ntlm'
        - '* /m:kerb'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6))
falsepositives:
- Programs that use the same command line flags
id: d9367cbb-c2e0-47ce-bdc0-128cb6da898d
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/bugch3ck/SharpLdapWhoami
status: experimental
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001

