title: Remote Access Tool - ScreenConnect Server Web Shell Execution
id: e8e1c7ac-50e7-03e1-c3d6-e1192efc4260
related:
    - id: b19146a3-25d4-41b4-928b-1e2a92641b1b
      type: derived
status: test
description: Detects potential web shell execution from the ScreenConnect server process.
references:
    - https://blackpointcyber.com/resources/blog/breaking-through-the-screen/
    - https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
author: Jason Rathbun (Blackpoint Cyber)
date: 2024-02-26
tags:
    - attack.initial-access
    - attack.t1190
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \ScreenConnect.Service.exe
        NewProcessName|endswith:
            - \cmd.exe
            - \csc.exe
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
