title: Modifies the Registry From a ADS
ruletype: Sigma
author: Eli Salem, Sander Wiebing, oscd.community
date: 2020/10/12
description: Detects the import of an alternate data stream with regini.exe, regini.exe
    can be used to modify registry keys.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\regini.exe'
    SELECTION_4:
        OriginalFileName: REGINI.EXE
    SELECTION_5:
        CommandLine|re: :[^ \\\\]
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
fields:
- ParentImage
- CommandLine
id: 77946e79-97f1-45a2-84b4-f37b5c0d8682
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/05/09
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regini/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regini
status: experimental
tags:
- attack.t1112
- attack.defense_evasion

