title: Execution of Suspicious File Type Extension
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
status: experimental
description: |
    Detects whether the image specified in a process creation event doesn't refer to an ".exe" (or other known executable extension) file. This can be caused by process ghosting or other unorthodox methods to start a process.
    This rule might require some initial baselining to align with some third party tooling in the user environment.
references:
    - https://pentestlaboratories.com/2021/12/08/process-ghosting/
author: Max Altgelt (Nextron Systems)
date: 2021/12/09
modified: 2023/11/23
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    known_image_extension:
        NewProcessName|endswith:
            - .bin
            - .cgi
            - .com
            - .exe
            - .scr
            - .tmp   # sadly many installers use this extension
    filter_main_image: # Windows utilities without extension
        NewProcessName:
            - System
            - Registry
            - MemCompression
            - vmmem
    filter_main_msi_installers:
        NewProcessName|contains: :\Windows\Installer\MSI
    filter_main_driver_store:
        NewProcessName|contains: :\Windows\System32\DriverStore\FileRepository\
    filter_main_msi_rollbackfiles:
        NewProcessName|contains: :\Config.Msi\
        NewProcessName|endswith:
            - .rbf
            - .rbs
    filter_main_windows_temp:
        - ParentProcessName|contains: :\Windows\Temp\
        - NewProcessName|contains: :\Windows\Temp\
    filter_main_deleted:
        NewProcessName|contains: :\$Extend\$Deleted\
    filter_main_empty:
        NewProcessName:
            - '-'
            - ''
    filter_main_null:
        NewProcessName:
    filter_optional_avira:
        ParentProcessName|contains: :\ProgramData\Avira\
    filter_optional_nvidia:
        NewProcessName|contains: NVIDIA\NvBackend\
        NewProcessName|endswith: .dat
    filter_optional_winpakpro:
        NewProcessName|contains:
            - :\Program Files (x86)\WINPAKPRO\
            - :\Program Files\WINPAKPRO\
        NewProcessName|endswith: .ngn
    filter_optional_myq_server:
        NewProcessName|endswith:
            - :\Program Files (x86)\MyQ\Server\pcltool.dll
            - :\Program Files\MyQ\Server\pcltool.dll
    filter_optional_wsl:
        NewProcessName|contains|all:
            - \AppData\Local\Packages\
            - \LocalState\rootfs\
    filter_optional_lzma_exe:
        NewProcessName|endswith: \LZMA_EXE
    filter_optional_firefox:
        NewProcessName|contains: :\Program Files\Mozilla Firefox\
    filter_optional_docker:
        ParentProcessName: C:\Windows\System32\services.exe
        NewProcessName|endswith: com.docker.service
    condition: process_creation and (not known_image_extension and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
