title: New Process Created Via Wmic.EXE
ruletype: Sigma
author: Michael Haag, Florian Roth (Nextron Systems), juju4, oscd.community
date: 2019/01/16
description: Detects new process creation using WMIC via the "process call create"
    flag
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wmic.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        CommandLine: '*process*'
    SELECTION_6:
        CommandLine: '*call*'
    SELECTION_7:
        CommandLine: '*create*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
id: 526be59f-a573-4eea-b5f7-f0973207634d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://www.sans.org/blog/wmic-for-incident-response/
related:
-   id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
    type: derived
status: test
tags:
- attack.execution
- attack.t1047
- car.2016-03-002

