title: Conhost Spawned By Suspicious Parent Process
ruletype: Sigma
author: Tim Rauch
date: 2022/09/28
description: Detects when the Console Window Host (conhost.exe) process is spawned
    by a suspicious parent process, which could be indicative of code injection.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\conhost.exe'
    SELECTION_4:
        ParentProcessName:
        - '*\svchost.exe'
        - '*\lsass.exe'
        - '*\services.exe'
        - '*\smss.exe'
        - '*\winlogon.exe'
        - '*\explorer.exe'
        - '*\rundll32.exe'
        - '*\regsvr32.exe'
        - '*\userinit.exe'
        - '*\wininit.exe'
        - '*\spoolsv.exe'
        - '*\ctfmon.exe'
    SELECTION_5:
        ParentCommandLine:
        - '*-k apphost -s AppHostSvc*'
        - '*-k imgsvc*'
        - '*-k netsvcs -p -s NetSetupSvc*'
        - '*-k LocalSystemNetworkRestricted -p -s NgcSvc*'
        - '*-k wsappx -p -s ClipSVC*'
        - '*-k netsvcs -p -s wlidsvc*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: cbb9e3d1-2386-4e59-912e-62f1484f7a89
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/31
references:
- https://www.elastic.co/guide/en/security/current/conhost-spawned-by-suspicious-parent-process.html
status: experimental
tags:
- attack.execution
- attack.t1059

