title: Suspicious Microsoft OneNote Child Process
ruletype: Sigma
author: Tim Rauch (rule), Elastic (idea)
date: 2022/10/21
description: Detects suspicious child processes of the Microsoft OneNote application.
    This may indicate an attempt to execute malicious embedded objects from a .one
    file.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\onenote.exe'
    SELECTION_4:
        OriginalFileName:
        - RUNDLL32.exe
        - REGSVR32.exe
        - bitsadmin.exe
        - CertUtil.exe
        - InstallUtil.exe
        - schtasks.exe
        - wmic.exe
        - cscript.exe
        - wscript.exe
        - CMSTP.EXE
        - Microsoft.Workflow.Compiler.exe
        - RegAsm.exe
        - RegSvcs.exe
        - MSHTA.EXE
        - Msxsl.exe
        - IEExec.exe
        - Cmd.Exe
        - PowerShell.EXE
        - HH.exe
        - javaw.exe
        - pcalua.exe
        - curl.exe
        - ScriptRunner.exe
        - CertOC.exe
        - WorkFolders.exe
        - odbcconf.exe
        - msiexec.exe
        - msdt.exe
    SELECTION_5:
        NewProcessName:
        - '*\rundll32.exe'
        - '*\regsvr32.exe'
        - '*\bitsadmin.exe'
        - '*\certutil.exe'
        - '*\installutil.exe'
        - '*\schtasks.exe'
        - '*\wmic.exe'
        - '*\cscript.exe'
        - '*\wscript.exe'
        - '*\cmstp.exe'
        - '*\Microsoft.Workflow.Compiler.exe'
        - '*\regasm.exe'
        - '*\regsvcs.exe'
        - '*\mshta.exe'
        - '*\msxsl.exe'
        - '*\ieexec.exe'
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\hh.exe'
        - '*\javaw.exe'
        - '*\pcalua.exe'
        - '*\curl.exe'
        - '*\scriptrunner.exe'
        - '*\certoc.exe'
        - '*\workfolders.exe'
        - '*\odbcconf.exe'
        - '*\msiexec.exe'
        - '*\msdt.exe'
    SELECTION_6:
        NewProcessName: '*\explorer.exe'
    SELECTION_7:
        CommandLine:
        - '*.hta*'
        - '*.vb*'
        - '*.wsh*'
        - '*.js*'
        - '*.ps*'
        - '*.scr*'
        - '*.pif*'
        - '*.bat*'
        - '*.cmd*'
    SELECTION_8:
        NewProcessName:
        - '*\AppData\\*'
        - '*\Users\Public\\*'
        - '*\ProgramData\\*'
        - '*\Windows\Tasks\\*'
        - '*\Windows\Temp\\*'
        - '*\Windows\System32\Tasks\\*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and ((SELECTION_4 or
        SELECTION_5) or (SELECTION_6 and SELECTION_7) or SELECTION_8))
falsepositives:
- File located in the AppData folder with trusted signature
id: c27515df-97a9-4162-8a60-dc0eeb51b775
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/30
references:
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-e34e43eb5666427602ddf488b2bf3b545bd9aae81af3e6f6c7949f9652abdf18
related:
-   id: 438025f9-5856-4663-83f7-52f878a70a50
    type: derived
status: experimental
tags:
- attack.t1566
- attack.t1566.001
- attack.initial_access

