title: CHCP CodePage Locale Lookup
ruletype: Sigma
author: _pete_0, TheDFIRReport
date: 2022/02/21
description: Detects use of chcp to look up the system locale value as part of host
    discovery
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\cmd.exe'
    SELECTION_4:
        ParentCommandLine:
        - '* /c *'
        - '* /k *'
    SELECTION_5:
        NewProcessName: '*\chcp.com'
    SELECTION_6:
        CommandLine:
        - '*chcp'
        - '*chcp '
        - '*chcp  '
    SELECTION_7:
        GrandparentCommandLine: '*/c C:\ProgramData\Anaconda3*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7)))
falsepositives:
- During Anaconda update the 'conda.exe' process will eventually launch the command
    described in the detection section
fields:
- CommandLine
- ParentCommandLine
id: 7090adee-82e2-4269-bd59-80691e7c6338
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/21
references:
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/chcp
status: experimental
tags:
- attack.discovery
- attack.t1614.001

