
title: Suspicious WMI Execution
ruletype: Sigma
author: Michael Haag, Florian Roth, juju4, oscd.community
date: 2019/01/16
description: Detects WMI executing suspicious commands
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_10:
    CommandLine: '* path *'
  SELECTION_11:
    CommandLine:
    - '*AntiVirus*'
    - '*Firewall*'
  SELECTION_12:
    CommandLine: '*Product*'
  SELECTION_13:
    CommandLine: '* get *'
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\wmic.exe'
  SELECTION_4:
    OriginalFileName: wmic.exe
  SELECTION_5:
    CommandLine: '*process*'
  SELECTION_6:
    CommandLine: '*call*'
  SELECTION_7:
    CommandLine: '*create *'
  SELECTION_8:
    NewProcessName: '*\wmic.exe'
  SELECTION_9:
    OriginalFileName: wmic.exe
  condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or SELECTION_4) and
    (SELECTION_5 and SELECTION_6 and SELECTION_7)) or ((SELECTION_8 or SELECTION_9)
    and SELECTION_10 and SELECTION_11 and (SELECTION_12 and SELECTION_13))))
falsepositives:
- If using Splunk, we recommend | stats count by Computer,CommandLine following for
  easy hunting by Computer/CommandLine
fields:
- CommandLine
- ParentCommandLine
id: 526be59f-a573-4eea-b5f7-f0973207634d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
references:
- https://digital-forensics.sans.org/blog/2010/06/04/wmic-draft/
- https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
- https://blog.malwarebytes.com/threat-analysis/2016/04/rokku-ransomware/
status: test
tags:
- attack.execution
- attack.t1047
- car.2016-03-002
