title: Suspicious Cabinet File Execution Via Msdt.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), GossiTheDog, frack113
date: 2022/06/21
description: Detects execution of msdt.exe using the "cab" flag which could indicates
    suspicious diagcab files with embedded answer files leveraging CVE-2022-30190
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\msdt.exe'
    SELECTION_4:
        OriginalFileName: msdt.exe
    SELECTION_5:
        CommandLine:
        - '* /cab *'
        - '* -cab *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate usage of ".diagcab" files
id: dc4576d4-7467-424f-9eee-fd2b02855fe0
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/06
references:
- https://twitter.com/nas_bench/status/1537896324837781506
- https://github.com/GossiTheDog/ThreatHunting/blob/e85884abbf05d5b41efc809ea6532b10b45bd05c/AdvancedHuntingQueries/DogWalk-DiagCab
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-9015912909545e72ed42cbac4d1e96295e8964579c406d23fd9c47a8091576a0
- https://irsl.medium.com/the-trouble-with-microsofts-troubleshooters-6e32fc80b8bd
related:
-   id: 6545ce61-a1bd-4119-b9be-fcbee42c0cf3
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

