title: AspNetCompiler Execution
id: e20075e6-6784-9276-2205-4f452684a4cc
status: test
description: Detects execution of "aspnet_compiler.exe" which can be abused to compile and execute C# code.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
    - https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
author: frack113
date: 2021/11/24
modified: 2023/08/14
tags:
    - attack.defense_evasion
    - attack.t1127
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|contains:
            - C:\Windows\Microsoft.NET\Framework\
            - C:\Windows\Microsoft.NET\Framework64\
        NewProcessName|endswith: \aspnet_compiler.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
