title: Suspicious File Download From File Sharing Domain Via Curl.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/05
description: Detects file download using curl.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\curl.exe'
    SELECTION_4:
        OriginalFileName: curl.exe
    SELECTION_5:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    SELECTION_6:
        CommandLine:
        - '*anonfiles.com*'
        - '*cdn.discordapp.com/attachments/*'
        - '*ddns.net*'
        - '*ghostbin.co/*'
        - '*gist.githubusercontent.com*'
        - '*hastebin.com*'
        - '*mediafire.com*'
        - '*mega.nz*'
        - '*paste.ee*'
        - '*pastebin.com*'
        - '*pastebin.pl*'
        - '*pastetext.net*'
        - '*privatlab.com*'
        - '*privatlab.net*'
        - '*raw.githubusercontent.com*'
        - '*send.exploit.in*'
        - '*sendspace.com*'
        - '*storage.googleapis.com*'
        - '*temp.sh*'
        - '*transfer.sh*'
        - '*ufile.io*'
    SELECTION_7:
        CommandLine: '*http*'
    SELECTION_8:
        CommandLine:
        - '* -O*'
        - '*--remote-name*'
        - '*--output*'
    SELECTION_9:
        CommandLine:
        - '*.ps1'
        - '*.ps1'''
        - '*.ps1"'
        - '*.bat'
        - '*.bat'''
        - '*.bat"'
        - '*.exe'
        - '*.exe'''
        - '*.exe"'
        - '*.vbs'
        - '*.vbs'''
        - '*.vbs"'
        - '*.vbe'
        - '*.vbe'''
        - '*.vbe"'
        - '*.hta'
        - '*.hta'''
        - '*.hta"'
        - '*.dll'
        - '*.dll'''
        - '*.dll"'
        - '*.psm1'
        - '*.psm1'''
        - '*.psm1"'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or SELECTION_6) and SELECTION_7 and SELECTION_8 and SELECTION_9)
falsepositives:
- Unknown
id: 56454143-524f-49fb-b1c6-3fb8b1ad41fb
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
status: experimental
tags:
- attack.execution

