
title: WinRM Access with Evil-WinRM
ruletype: Sigma
author: frack113
date: 2022/01/07
description: Adversaries may use Valid Accounts to log into a computer using the Remote
  Desktop Protocol (RDP). The adversary may then perform actions as the logged-on
  user.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\ruby.exe'
  SELECTION_4:
    CommandLine: '*-i *'
  SELECTION_5:
    CommandLine: '*-u *'
  SELECTION_6:
    CommandLine: '*-p *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: a197e378-d31b-41c0-9635-cfdf1c1bb423
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1021.006/T1021.006.md#atomic-test-3---winrm-access-with-evil-winrm
- https://github.com/Hackplayers/evil-winrm
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.006
