title: Non Interactive PowerShell Process Spawned
id: f4bbd493-b796-416e-bbf2-121235348529
status: test
description: Detects non-interactive PowerShell activity by looking at powershell.exe
    with a non user process such as "explorer.exe" as a parent.
references:
    - https://web.archive.org/web/20200925032237/https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
author: Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)
date: 2019/09/12
modified: 2023/01/20
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        -   NewProcessName|endswith:
                - \powershell.exe
                - \pwsh.exe
        -   OriginalFileName:
                - PowerShell.EXE
                - pwsh.dll
    filter_generic:
        -   ParentProcessName|endswith:
                - \explorer.exe
                - \CompatTelRunner.exe
        -   ParentProcessName: C:\$WINDOWS.~BT\Sources\SetupHost.exe
    filter_vscode:
        ParentCommandLine|contains: ' --ms-enable-electron-run-as-node '
        ParentProcessName|startswith: C:\Users\
        ParentProcessName|endswith: \AppData\Local\Programs\Microsoft VS Code\Code.exe
    condition: process_creation and (selection and not 1 of filter_*)
falsepositives:
    - Legitimate programs executing PowerShell scripts
level: low
ruletype: Sigma
