title: Sysinternals PsSuspend Execution
id: c4cc0668-2b35-4884-9119-8a558a544a6d
status: test
description: Detects usage of Sysinternals PsSuspend which can be abused to suspend critical processes
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/pssuspend
    - https://twitter.com/0gtweet/status/1638069413717975046
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/23
tags:
    - attack.discovery
    - attack.persistence
    - attack.t1543.003
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - OriginalFileName: pssuspend.exe
        - NewProcessName|endswith:
              - \pssuspend.exe
              - \pssuspend64.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
