title: Download Arbitrary Files Via MSOHTMED.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/19
description: Detects usage of "MSOHTMED" to download arbitrary files
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\MSOHTMED.exe'
    SELECTION_4:
        OriginalFileName: MsoHtmEd.exe
    SELECTION_5:
        CommandLine:
        - '*http://*'
        - '*https://*'
        - '*ftp://*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 459f2f98-397b-4a4a-9f47-6a5ec2f1c69d
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/238/files
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1218

