title: Suspicious Del in CommandLine
ruletype: Sigma
author: frack113
date: 2021/12/02
description: Detects suspicious command line to remove and 'exe' or 'dll'
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*del *'
    SELECTION_4:
        CommandLine: '*\*.exe*'
    SELECTION_5:
        CommandLine: '*/f *'
    SELECTION_6:
        CommandLine: '*/q *'
    SELECTION_7:
        CommandLine: '*del *'
    SELECTION_8:
        CommandLine: '*\*.dll*'
    SELECTION_9:
        CommandLine: '*C:\ProgramData\\*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: 204b17ae-4007-471b-917b-b917b315c5db
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/24
references:
- https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004

