title: Suspicious Firewall Configuration Discovery Via Netsh.EXE
ruletype: Sigma
author: frack113, Christopher Peacock '@securepeacock', SCYTHE '@scythe_io'
date: 2021/12/07
description: Adversaries may look for details about the network configuration and
    settings of systems they access or through information discovery of remote systems
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\netsh.exe'
    SELECTION_4:
        OriginalFileName: netsh.exe
    SELECTION_5:
        CommandLine: '*netsh *'
    SELECTION_6:
        CommandLine: '*show *'
    SELECTION_7:
        CommandLine: '*firewall *'
    SELECTION_8:
        CommandLine:
        - '*config *'
        - '*state *'
        - '*rule *'
        - '*name=all*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8))
falsepositives:
- Administrative activity
id: 0e4164da-94bc-450d-a7be-a4b176179f1f
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1016/T1016.md#atomic-test-2---list-windows-firewall-rules
- https://ss64.com/nt/netsh.html
status: experimental
tags:
- attack.discovery
- attack.t1016

