title: Potential Suspicious Mofcomp Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
description: 'Detects execution of the "mofcomp" utility as a child of a suspicious
    shell or script running utility or by having a supsicious path in the commandline.

    The "mofcomp" utility parses a file containing MOF statements and adds the classes
    and class instances defined in the file to the WMI repository.

    Attackers abuse this utility to install malicious MOF scripts

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*C:\Windows\TEMP\\*'
    SELECTION_11:
        CommandLine: '*.mof'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\mofcomp.exe'
    SELECTION_4:
        OriginalFileName: mofcomp.exe
    SELECTION_5:
        ParentProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\wsl.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
    SELECTION_6:
        CommandLine:
        - '*\AppData\Local\Temp*'
        - '*\Users\Public\\*'
        - '*\WINDOWS\Temp\\*'
        - '*%temp%*'
        - '*%tmp%*'
        - '*%appdata%*'
    SELECTION_7:
        ParentProcessName: C:\Windows\System32\wbem\WmiPrvSE.exe
    SELECTION_8:
        CommandLine: '*C:\Windows\TEMP\\*'
    SELECTION_9:
        CommandLine: '*.mof'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8 and SELECTION_9)))
        and  not ((SELECTION_10 and SELECTION_11)))
falsepositives:
- Unknown
id: 1dd05363-104e-4b4a-b963-196a534b03a1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/11
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://github.com/The-DFIR-Report/Sigma-Rules/blob/75260568a7ffe61b2458ca05f6f25914efb44337/win_mofcomp_execution.yml
- https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
status: experimental
tags:
- attack.execution
- attack.t1218

