title: PsExec Service Execution
id: 063b6d5e-3f4e-c3a0-f506-0f8296b9eec4
related:
    - id: fa91cc36-24c9-41ce-b3c8-3bbc3f2f67ba
      type: obsolete
    - id: fdfcbd78-48f1-4a4b-90ac-d82241e368c5
      type: derived
status: test
description: Detects launch of the PSEXESVC service, which means that this system was the target of a psexec remote execution
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.youtube.com/watch?v=ro2QuZTIMBM
author: Thomas Patzke, Romaissa Adjailia, Florian Roth (Nextron Systems)
date: 2017-06-12
modified: 2023-02-28
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName: C:\Windows\PSEXESVC.exe
        - OriginalFileName: psexesvc.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate administrative tasks
level: medium
ruletype: Sigma
