title: Windows Processes Suspicious Parent Directory
ruletype: Sigma
author: vburov
date: 2019/02/23
description: Detect suspicious parent processes of well-known Windows processes
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\svchost.exe'
        - '*\taskhost.exe'
        - '*\lsm.exe'
        - '*\lsass.exe'
        - '*\services.exe'
        - '*\lsaiso.exe'
        - '*\csrss.exe'
        - '*\wininit.exe'
        - '*\winlogon.exe'
    SELECTION_4:
        ParentProcessName:
        - '*\SavService.exe'
        - '*\ngen.exe'
    SELECTION_5:
        ParentProcessName:
        - '*\System32\\*'
        - '*\SysWOW64\\*'
    SELECTION_6:
        ParentProcessName:
        - '*\Windows Defender\\*'
        - '*\Microsoft Security Client\\*'
    SELECTION_7:
        ParentProcessName: '*\MsMpEng.exe'
    SELECTION_8:
        ParentProcessName: null
    SELECTION_9:
        ParentProcessName: '-'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        or SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 or SELECTION_9)))
falsepositives:
- Some security products seem to spawn these
id: 96036718-71cc-4027-a538-d1587e0006a7
level: low
logsource:
    category: process_creation
    product: windows
modified: 2022/02/14
references:
- https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
- https://www.carbonblack.com/2014/06/10/screenshot-demo-hunt-evil-faster-than-ever-with-carbon-black/
- https://www.13cubed.com/downloads/windows_process_genealogy_v2.pdf
- https://attack.mitre.org/techniques/T1036/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003
- attack.t1036.005

