title: Remote File Download via Desktopimgdownldr Utility
ruletype: Sigma
author: Tim Rauch
date: 2022/09/27
description: Detects the desktopimgdownldr utility being used to download a remote
    file. An adversary may use desktopimgdownldr to download arbitrary files as an
    alternative to certutil.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\desktopimgdownldr.exe'
    SELECTION_4:
        ParentProcessName: '*\desktopimgdownldr.exe'
    SELECTION_5:
        CommandLine: '*/lockscreenurl:http*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 214641c2-c579-4ecb-8427-0cf19df6842e
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://www.elastic.co/guide/en/security/current/remote-file-download-via-desktopimgdownldr-utility.html
status: experimental
tags:
- attack.command_and_control
- attack.t1105

