title: Mimikatz Command Line
ruletype: Sigma
author: Teymur Kheirkhabarov, oscd.community, David ANDRE (additional keywords), Tim
    Shelton
date: 2019/10/22
description: Detection well-known mimikatz command line arguments
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*/d /s /c *'
    SELECTION_11:
        CommandLine: '*checkfilenameiocs --ioc-path *'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*DumpCreds*'
        - '*invoke-mimikatz*'
    SELECTION_4:
        CommandLine:
        - '*rpc*'
        - '*token*'
        - '*crypto*'
        - '*dpapi*'
        - '*sekurlsa*'
        - '*kerberos*'
        - '*lsadump*'
        - '*privilege*'
        - '*process*'
        - '*vault*'
    SELECTION_5:
        CommandLine: '*::*'
    SELECTION_6:
        CommandLine:
        - '*aadcookie*'
        - '*detours*'
        - '*memssp*'
        - '*mflt*'
        - '*ncroutemon*'
        - '*ngcsign*'
        - '*printnightmare*'
        - '*skeleton*'
        - '*preshutdown*'
        - '*mstsc*'
        - '*multirdp*'
    SELECTION_7:
        CommandLine: '*::*'
    SELECTION_8:
        CommandLine: '*function Convert-GuidToCompressedGuid*'
    SELECTION_9:
        ParentProcessName: '*\AppData\Local\Programs\Microsoft VS Code\Code.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or (SELECTION_4 and
        SELECTION_5)) or (SELECTION_6 and SELECTION_7)) and  not ((SELECTION_8) or
        (SELECTION_9 and SELECTION_10 and SELECTION_11)))
falsepositives:
- Legitimate Administrator using tool for password recovery
id: a642964e-bead-4bed-8910-1bb4d63e3b4d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/07
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://tools.thehacker.recipes/mimikatz/modules
status: test
tags:
- attack.credential_access
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- attack.t1003.006

