title: RestrictedAdminMode Registry Value Tampering - ProcCreation
id: ab4d23c2-9f69-e6fd-d546-041e823f0147
status: test
description: |
    Detects changes to the "DisableRestrictedAdmin" registry value in order to disable or enable RestrictedAdmin mode.
    RestrictedAdmin mode prevents the transmission of reusable credentials to the remote system to which you connect using Remote Desktop.
    This prevents your credentials from being harvested during the initial connection process if the remote server has been compromise
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/a8e3cf63e97b973a25903d3df9fd55da6252e564/atomics/T1112/T1112.md
    - https://social.technet.microsoft.com/wiki/contents/articles/32905.remote-desktop-services-enable-restricted-admin-mode.aspx
author: frack113
date: 2023/01/13
modified: 2023/12/15
tags:
    - attack.defense_evasion
    - attack.t1112
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - \System\CurrentControlSet\Control\Lsa\
            - DisableRestrictedAdmin
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
