title: HackTool - Dumpert Process Dumper Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2020/02/04
description: Detects the use of Dumpert process dumper, which dumps the lsass.exe
    process memory
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Hashes: '*09D278F9DE118EF09163C6140255C690*'
    SELECTION_4:
        CommandLine: '*Dumpert.dll*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Very unlikely
id: 2704ab9e-afe2-4854-a3b1-0c0706d03578
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://github.com/outflanknl/Dumpert
- https://unit42.paloaltonetworks.com/actors-still-exploiting-sharepoint-vulnerability/
status: test
tags:
- attack.credential_access
- attack.t1003.001

