title: New Root Certificate Installed Via CertMgr.EXE
ruletype: Sigma
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2023/03/05
description: 'Detects execution of "certmgr" with the "add" flag in order to install
    a new certificate on the system.

    Adversaries may install a root certificate on a compromised system to avoid warnings
    when connecting to adversary controlled web servers.

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\CertMgr.exe'
    SELECTION_4:
        OriginalFileName: CERTMGT.EXE
    SELECTION_5:
        CommandLine: '*/add*'
    SELECTION_6:
        CommandLine: '*root*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to
    test if GPO push doesn't trigger FP
id: ff992eac-6449-4c60-8c1d-91c9722a1d48
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
- https://securelist.com/to-crypt-or-to-mine-that-is-the-question/86307/
related:
-   id: 42821614-9264-4761-acfc-5772c3286f76
    type: derived
-   id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.t1553.004

