title: Suspicious Child Process Created as System
id: 590a5f4c-6c8c-4f10-8307-89afe9453a9d
status: test
description: Detection of child processes spawned with SYSTEM privileges by parents with LOCAL SERVICE or NETWORK SERVICE accounts
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://foxglovesecurity.com/2016/09/26/rotten-potato-privilege-escalation-from-service-accounts-to-system/
    - https://github.com/antonioCoco/RogueWinRM
    - https://twitter.com/Cyb3rWard0g/status/1453123054243024897
author: Teymur Kheirkhabarov, Roberto Rodriguez (@Cyb3rWard0g), Open Threat Research (OTR)
date: 2019/10/26
modified: 2022/12/15
tags:
    - attack.privilege_escalation
    - attack.t1134.002
logsource:
    category: process_creation
    product: windows
    definition: 'Requirements: ParentUser field needs sysmon >= 13.30'
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentUser|contains:
            - AUTHORI
            - AUTORI
        ParentUser|endswith:
            - \NETWORK SERVICE
            - \LOCAL SERVICE
        SubjectUserName|contains: # covers many language settings
            - AUTHORI
            - AUTORI
        SubjectUserName|endswith: # System
            - \SYSTEM
            - \Système
            - \СИСТЕМА
        MandatoryLabel: S-1-16-16384
    filter_rundll32:
        CommandLine|contains: DavSetCookie
        NewProcessName|endswith: \rundll32.exe
    condition: process_creation and (selection and not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
