title: Powershell AMSI Bypass via .NET Reflection
ruletype: Sigma
author: Markus Neis
date: 2018/08/17
description: Detects Request to "amsiInitFailed" that can be used to disable AMSI
    Scanning
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*System.Management.Automation.AmsiUtils*'
        - '*amsiInitFailed*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
id: 30edb182-aa75-42c0-b0a9-e998bb29067c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/02
references:
- https://s3cur3th1ssh1t.github.io/Bypass_AMSI_by_manual_modification/
status: test
tags:
- attack.defense_evasion
- attack.t1562.001

