title: Scheduled Task Creation Via Schtasks.EXE
id: c7b9e6e8-4212-b14e-b622-503d7c760107
related:
    - id: 92626ddd-662c-49e3-ac59-f6535f12d189
      type: derived
status: test
description: Detects the creation of scheduled tasks by user accounts via the "schtasks" utility.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
author: Florian Roth (Nextron Systems)
date: 2019-01-16
modified: 2024-01-18
tags:
    - attack.execution
    - attack.persistence
    - attack.privilege-escalation
    - attack.t1053.005
    - attack.s0111
    - car.2013-08-001
    - stp.1u
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: ' /create '
        NewProcessName|endswith: \schtasks.exe
    filter_main_system_user:
        SubjectUserName|contains: # covers many language settings
            - AUTHORI
            - AUTORI
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Administrative activity
    - Software installation
level: low
ruletype: Sigma
