title: Tor Client/Browser Execution
id: ef92722b-fb96-33d7-d77b-f6770ac84d0f
related:
    - id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
      type: derived
status: test
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
author: frack113
date: 2022-02-20
modified: 2025-10-27
tags:
    - attack.command-and-control
    - attack.t1090.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - Description: Tor Browser
        - Product: Tor Browser
        - NewProcessName|endswith:
              - \tor.exe
              - \Tor Browser\Browser\firefox.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_browsers_tor_execution/info.yml
ruletype: Sigma
