title: Suspicious Diantz Download and Compress Into a CAB File
id: 4657b559-a0fa-d23b-e35c-9cde37b20f8c
related:
    - id: 185d7418-f250-42d0-b72e-0c8b70661e93
      type: derived
status: test
description: Download and compress a remote file and store it in a cab file on local machine.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Diantz/
author: frack113
date: 2021-11-26
modified: 2022-08-13
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - diantz.exe
            - ' \\\\'
            - .cab
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
