title: Findstr GPP Passwords
id: 8a9278f4-40c8-30f3-c1ab-7dc224491477
related:
    - id: 91a2c315-9ee6-4052-a853-6f6a8238f90d
      type: derived
status: test
description: Look for the encrypted cpassword value within Group Policy Preference files on the Domain Controller. This value can be decrypted with gpp-decrypt.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.006/T1552.006.md#atomic-test-1---gpp-passwords-findstr
author: frack113
date: 2021-12-27
modified: 2023-11-11
tags:
    - attack.credential-access
    - attack.t1552.006
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \find.exe
              - \findstr.exe
        - OriginalFileName:
              - FIND.EXE
              - FINDSTR.EXE
    selection_cli:
        CommandLine|contains|all:
            - cpassword
            - \sysvol\
            - .xml
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_findstr_gpp_passwords/info.yml
simulation:
    - type: atomic-red-team
      name: GPP Passwords (findstr)
      technique: T1552.006
      atomic_guid: 870fe8fb-5e23-4f5f-b89d-dd7fe26f3b5f
ruletype: Sigma
