title: Rebuild Performance Counter Values Via Lodctr.EXE
id: 57428c1a-2716-80c7-6059-bb8408c50569
related:
    - id: cc9d3712-6310-4320-b2df-7cb408274d53
      type: derived
status: test
description: Detects the execution of "lodctr.exe" to rebuild the performance counter registry values. This can be abused by attackers by providing a malicious config file to overwrite performance counter configuration to confuse and evade monitoring and security solutions.
references:
    - https://learn.microsoft.com/en-us/windows/security/identity-protection/virtual-smart-cards/virtual-smart-card-tpmvscmgr
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-06-15
modified: 2024-03-05
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        OriginalFileName: LODCTR.EXE
        NewProcessName|endswith: \lodctr.exe
    selection_cli:
        CommandLine|contains|windash: ' -r'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate usage by an administrator
level: medium
ruletype: Sigma
