title: HackTool - HandleKatz LSASS Dumper Execution
id: e9ec99cd-f425-c533-3e51-bf39335dbe29
related:
    - id: ca621ba5-54ab-4035-9942-d378e6fcde3c
      type: derived
status: test
description: Detects the use of HandleKatz, a tool that demonstrates the usage of cloned handles to Lsass in order to create an obfuscated memory dump of the same
references:
    - https://github.com/codewhitesec/HandleKatz
author: Florian Roth (Nextron Systems)
date: 2022-08-18
modified: 2024-11-23
tags:
    - attack.credential-access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_loader_img:
        CommandLine|contains: '--pid:'
        NewProcessName|endswith: \loader.exe
    selection_loader_imphash:
        Hashes|contains:
            - IMPHASH=38D9E015591BBFD4929E0D0F47FA0055
            - IMPHASH=0E2216679CA6E1094D63322E3412D650
    selection_flags:
        CommandLine|contains|all:
            - '--pid:'
            - '--outfile:'
        CommandLine|contains:
            - .dmp
            - lsass
            - .obf
            - dump
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
