title: Potential Defense Evasion Via Right-to-Left Override
id: 7d442414-1318-9f2d-6f0c-65ff86c357de
related:
    - id: e0552b19-5a83-4222-b141-b36184bb8d79
      type: derived
    - id: 584bca0f-3608-4402-80fd-4075ff6072e3
      type: derived
    - id: ad691d92-15f2-4181-9aa4-723c74f9ddc3
      type: derived
status: test
description: |
    Detects the presence of the "u202+E" character, which causes a terminal, browser, or operating system to render text in a right-to-left sequence.
    This is used as an obfuscation and masquerading techniques.
references:
    - https://redcanary.com/blog/right-to-left-override/
    - https://www.malwarebytes.com/blog/news/2014/01/the-rtlo-method
    - https://unicode-explorer.com/c/202E
    - https://tria.ge/241015-l98snsyeje/behavioral2
author: Micah Babinski, @micahbabinski, Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2023-02-15
modified: 2025-02-06
tags:
    - attack.defense-evasion
    - attack.t1036.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - \u202e    # Unicode RTLO character
            - '[U+202E]'
    condition: process_creation and selection
falsepositives:
    - Commandlines that contains scriptures such as arabic or hebrew might make use of this character
level: high
ruletype: Sigma
