title: UAC Bypass Using DismHost
id: 2c256f43-053a-3f93-b183-27b3a5d312ed
related:
    - id: 853e74f9-9392-4935-ad3b-2e8c040dae86
      type: derived
status: test
description: Detects the pattern of UAC Bypass using DismHost DLL hijacking (UACMe 63)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-30
modified: 2024-12-01
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|contains|all:
            - C:\Users\
            - \AppData\Local\Temp\
            - \DismHost.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
            - None
            - None
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
