
title: UAC Bypass Using Consent and Comctl32 - Process
ruletype: Sigma
author: Christian Burkard
date: 2021/08/23
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll
  (UACMe 22)
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\consent.exe'
  SELECTION_4:
    NewProcessName: '*\werfault.exe'
  SELECTION_5:
    IntegrityLevel:
    - High
    - System
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 1ca6bd18-0ba0-44ca-851c-92ed89a61085
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
