title: Tasks Folder Evasion
ruletype: Sigma
author: Sreeman
date: 2020/01/13
description: "The Tasks folder in system32 and syswow64 are globally writable paths.\n\
    Adversaries can take advantage of this and load or influence any script hosts\
    \ or ANY .NET Application \nin Tasks to load and execute a custom assembly into\
    \ cscript, wscript, regsvr32, mshta, eventvwr\n"
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*echo *'
        - '*copy *'
        - '*type *'
        - '*file createnew*'
    SELECTION_4:
        CommandLine:
        - '* C:\Windows\System32\Tasks\\*'
        - '* C:\Windows\SysWow64\Tasks\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentProcess
id: cc4e02ba-9c06-48e2-b09e-2500cace9ae0
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/25
references:
- https://twitter.com/subTee/status/1216465628946563073
- https://gist.github.com/am0nsec/8378da08f848424e4ab0cc5b317fdd26
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.execution
- attack.t1574.002

