title: Suspicious WMI Execution Via Office Process
ruletype: Sigma
author: Vadim Khrykov (ThreatIntel), Cyb3rEng (Rule)
date: 2021/08/23
description: Office application called wmic to proxye execution through a LOLBIN process.
    This is often used to break suspicious parent-child chain (Office app spawns LOLBin).
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wbem\WMIC.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        ParentProcessName:
        - '*\winword.exe'
        - '*\excel.exe'
        - '*\powerpnt.exe'
    SELECTION_6:
        CommandLine: '*process*'
    SELECTION_7:
        CommandLine: '*create*'
    SELECTION_8:
        CommandLine: '*call*'
    SELECTION_9:
        CommandLine:
        - '*regsvr32*'
        - '*rundll32*'
        - '*msiexec*'
        - '*mshta*'
        - '*verclsid*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9))
falsepositives:
- Unknown
id: e1693bc8-7168-4eab-8718-cdcaa68a1738
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/30
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
related:
-   id: 518643ba-7d9c-4fa5-9f37-baed36059f6a
    type: derived
-   id: 9d1c72f5-43f0-4da5-9320-648cf2099dd0
    type: obsoletes
-   id: c0e1c3d5-4381-4f18-8145-2583f06a1fe5
    type: obsoletes
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion

