title: Execution via stordiag.exe
ruletype: Sigma
author: Austin Songer (@austinsonger)
date: 2021/10/21
description: Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe
    and fltmc.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\stordiag.exe'
    SELECTION_4:
        NewProcessName:
        - '*\schtasks.exe'
        - '*\systeminfo.exe'
        - '*\fltmc.exe'
    SELECTION_5:
        ParentProcessName:
        - c:\windows\system32\\*
        - c:\windows\syswow64\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Legitimate usage of stordiag.exe.
id: 961e0abb-1b1e-4c84-a453-aafe56ad0d34
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/25
references:
- https://strontic.github.io/xcyclopedia/library/stordiag.exe-1F08FC87C373673944F6A7E8B18CD845.html
- https://twitter.com/eral4m/status/1451112385041911809
status: test
tags:
- attack.defense_evasion
- attack.t1218

