title: UAC Bypass Using Consent and Comctl32 - Process
id: fae361cc-c4b0-0935-1b15-79113e3f6198
related:
    - id: 1ca6bd18-0ba0-44ca-851c-92ed89a61085
      type: derived
status: test
description: Detects the pattern of UAC Bypass using consent.exe and comctl32.dll (UACMe 22)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-23
modified: 2024-12-01
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \consent.exe
        NewProcessName|endswith: \werfault.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
            - None
            - None
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
