title: Potentially Suspicious Usage Of Qemu
id: ecd9d96b-cb0c-0ae0-cdc4-1614f22b8e06
related:
    - id: 5fc297ae-25b6-488a-8f25-cc12ac29b744
      type: derived
status: test
description: |
    Detects potentially suspicious execution of the Qemu utility in a Windows environment.
    Threat actors have leveraged this utility and this technique for achieving network access as reported by Kaspersky.
references:
    - https://securelist.com/network-tunneling-with-qemu/111803/
    - https://www.qemu.org/docs/master/system/invocation.html#hxtool-5
author: Muhammad Faisal (@faisalusuf), Hunter Juhan (@threatHNTR)
date: 2024-06-03
tags:
    - attack.command-and-control
    - attack.t1090
    - attack.t1572
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - -m 1M   # VM with just 1MB of ram is insufficient this is a suspicious flag
            - -m 2M
            - -m 3M
        CommandLine|contains|all:
            - restrict=off
            - '-netdev '
            - connect=
            - -nographic   # This is also a key detection no one invoke without UI from console usually its a flag.
    filter_main_normal_usecase:
        CommandLine|contains:
            - ' -cdrom ' # Normal usage cases
            - ' type=virt '
            - ' -blockdev '
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
