title: Renamed ProcDump Execution
id: a6320654-afe9-8fa6-7fdc-3270c5a552d2
status: test
description: Detects the execution of a renamed ProcDump executable often used by attackers or malware
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/procdump
author: Florian Roth (Nextron Systems)
date: 2019/11/18
modified: 2022/12/08
tags:
    - attack.defense_evasion
    - attack.t1036.003
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_org:
        OriginalFileName: procdump
    selection_args_ma:
        CommandLine|contains:
            - ' -ma '
            - ' /ma '
    selection_args_other:
        CommandLine|contains:
            - ' -accepteula '
            - ' /accepteula '
    filter:
        NewProcessName|endswith:
            - \procdump.exe
            - \procdump64.exe
    condition: process_creation and ((selection_org or all of selection_args_*) and not filter)
falsepositives:
    - Procdump illegaly bundled with legitimate software
    - Administrators who rename binaries (should be investigated)
level: high
ruletype: Sigma
