title: Execute Code with Pester.bat
id: f9558484-5f9f-17f3-06a0-774afccc35e1
related:
    - id: 59e938ff-0d6d-4dc3-b13f-36cc28734d4e
      type: derived
status: test
description: Detects code execution via Pester.bat (Pester - Powershell Modulte for testing)
references:
    - https://twitter.com/Oddvarmoe/status/993383596244258816
    - https://github.com/api0cradle/LOLBAS/blob/d148d278f5f205ce67cfaf49afdfb68071c7252a/OSScripts/pester.md
author: Julia Fomina, oscd.community
date: 2020-10-08
modified: 2023-11-09
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    powershell_module:
        CommandLine|contains|all:
            - Pester
            - Get-Help
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    cmd_execution:
        CommandLine|contains|all:
            - pester
            - ;
        NewProcessName|endswith: \cmd.exe
    get_help:
        CommandLine|contains:
            - help
            - \?
    condition: process_creation and (powershell_module or (cmd_execution and get_help))
falsepositives:
    - Legitimate use of Pester for writing tests for Powershell scripts and modules
level: medium
ruletype: Sigma
