title: Data Copied To Clipboard Via Clip.EXE
ruletype: Sigma
author: frack113
date: 2021/07/27
description: Detects the execution of clip.exe in order to copy data to the clipboard.
    Adversaries may collect data stored in the clipboard from users copying information
    within or between applications.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\clip.exe'
    SELECTION_4:
        OriginalFileName: clip.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: ddeff553-5233-4ae9-bbab-d64d2bd634be
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/clip
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1115/T1115.md
status: test
tags:
- attack.collection
- attack.t1115

