title: Taskmgr as LOCAL_SYSTEM
id: d2fc7f9b-7773-8c83-5bf3-d977a655e6e0
related:
    - id: 9fff585c-c33e-4a86-b3cd-39312079a65f
      type: derived
status: test
description: Detects the creation of taskmgr.exe process in context of LOCAL_SYSTEM
references:
    - Internal Research
author: Florian Roth (Nextron Systems)
date: 2018-03-18
modified: 2022-05-27
tags:
    - attack.defense-evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        SubjectUserName|contains: # covers many language settings
            - AUTHORI
            - AUTORI
        NewProcessName|endswith: \taskmgr.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
