title: Potential RDP Session Hijacking Activity
ruletype: Sigma
author: '@juju4'
date: 2022/12/27
description: Detects RDP Session Hijacking on Windows systems
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\tscon.exe'
    SELECTION_4:
        OriginalFileName: tscon.exe
    SELECTION_5:
        IntegrityLevel: SYSTEM
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Administrative activity
id: 224f140f-3553-4cd1-af78-13d81bf9f7cc
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/Moti_B/status/909449115477659651
status: experimental
tags:
- attack.execution

