title: Suspect Svchost Activity
id: bb0ae7bd-c963-0404-061e-ae3c6b866830
related:
    - id: 16c37b52-b141-42a5-a3ea-bbe098444397
      type: derived
status: test
description: It is extremely abnormal for svchost.exe to spawn without any CLI arguments and is normally observed when a malicious process spawns the process and injects code into the process memory space.
references:
    - https://web.archive.org/web/20180718061628/https://securitybytes.io/blue-team-fundamentals-part-two-windows-processes-759fe15965e2
author: David Burkett, @signalblur
date: 2019-12-28
modified: 2022-06-27
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1055
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|endswith: svchost.exe
        NewProcessName|endswith: \svchost.exe
    filter:
        - ParentProcessName|endswith:
              - \rpcnet.exe
              - \rpcnetp.exe
        - CommandLine: null  # no CommandLine value available
    condition: process_creation and (selection and not filter)
falsepositives:
    - Rpcnet.exe / rpcnetp.exe which is a lojack style software. https://www.blackhat.com/docs/us-14/materials/us-14-Kamlyuk-Kamluk-Computrace-Backdoor-Revisited.pdf
level: high
ruletype: Sigma
