title: Arbitrary Binary Execution Using GUP Utility
id: d65aee4d-2292-4cea-b832-83accd6cfa43
status: test
description: Detects execution of the Notepad++ updater (gup) to launch other commands or executables
references:
    - https://twitter.com/nas_bench/status/1535322445439180803
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/10
modified: 2023/03/02
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \gup.exe
        NewProcessName|endswith: \explorer.exe
    filter:
        CommandLine|contains: \Notepad++\notepad++.exe
        NewProcessName|endswith: \explorer.exe
    filter_parent:
        ParentProcessName|contains: \Notepad++\updater\
    filter_null:
        CommandLine:
    condition: process_creation and (selection and not 1 of filter*)
falsepositives:
    - Other parent binaries using GUP not currently identified
level: medium
ruletype: Sigma
