title: Suspicious Process By Web Server Process
id: 8202070f-edeb-4d31-a010-a26c72ac5600
status: test
description: |
    Detects potentially suspicious processes being spawned by a web server process which could be the result of a successfully placed web shell or exploitation
references:
    - https://media.defense.gov/2020/Jun/09/2002313081/-1/-1/0/CSI-DETECT-AND-PREVENT-WEB-SHELL-MALWARE-20200422.PDF
author: Thomas Patzke, Florian Roth (Nextron Systems), Zach Stanford @svch0st, Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
date: 2019/01/16
modified: 2023/11/11
tags:
    - attack.persistence
    - attack.t1505.003
    - attack.t1190
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_webserver_image:
        ParentProcessName|endswith:
            - \caddy.exe
            - \httpd.exe
            - \nginx.exe
            - \php-cgi.exe
            - \php.exe
            - \tomcat.exe
            - \UMWorkerProcess.exe    # https://www.fireeye.com/blog/threat-research/2021/03/detection-response-to-exploitation-of-microsoft-exchange-zero-day-vulnerabilities.html
            - \w3wp.exe
            - \ws_TomcatService.exe
    selection_webserver_characteristics_tomcat1:
        ParentProcessName|endswith:
            - \java.exe
            - \javaw.exe
        ParentProcessName|contains:
            - -tomcat-
            - \tomcat
    selection_webserver_characteristics_tomcat2:
        ParentCommandLine|contains:
            - CATALINA_HOME
            - catalina.home
            - catalina.jar
        ParentProcessName|endswith:
            - \java.exe
            - \javaw.exe
    selection_anomaly_children:
        NewProcessName|endswith:
            - \arp.exe
            - \at.exe
            - \bash.exe
            - \bitsadmin.exe
            - \certutil.exe
            - \cmd.exe
            - \cscript.exe
            - \dsget.exe
            - \hostname.exe
            - \nbtstat.exe
            - \net.exe
            - \net1.exe
            - \netdom.exe
            - \netsh.exe
            - \nltest.exe
            - \ntdutil.exe
            - \powershell_ise.exe
            - \powershell.exe
            - \pwsh.exe
            - \qprocess.exe
            - \query.exe
            - \qwinsta.exe
            - \reg.exe
            - \rundll32.exe
            - \sc.exe
            - \sh.exe
            - \wmic.exe
            - \wscript.exe
            - \wusa.exe
    filter_main_fp_1:
        CommandLine|endswith: Windows\system32\cmd.exe /c C:\ManageEngine\ADManager "Plus\ES\bin\elasticsearch.bat -Enode.name=RMP-NODE1 -pelasticsearch-pid.txt
        ParentProcessName|endswith: \java.exe
    filter_main_fp_2:
        CommandLine|contains|all:
            - sc query
            - ADManager Plus
        ParentProcessName|endswith: \java.exe
    condition: process_creation and (1 of selection_webserver_* and selection_anomaly_children and not 1 of filter_main_*)
falsepositives:
    - Particular web applications may spawn a shell process legitimately
level: high
ruletype: Sigma
