title: Curl Download And Execute Combination
id: 637e9594-8499-4a83-1fec-53dd2ff90147
related:
    - id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
      type: derived
status: test
description: Adversaries can use curl to download payloads remotely and execute them. Curl is included by default in Windows 10 build 17063 and later.
references:
    - https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983 # Dead Link
author: Sreeman, Nasreddine Bencherchali (Nextron Systems)
date: 2020-01-13
modified: 2024-03-05
tags:
    - attack.defense-evasion
    - attack.t1218
    - attack.command-and-control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|windash: ' -c '
        CommandLine|contains|all:
            - 'curl '
            - http
            - -o
            - '&'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
