title: DirLister Execution
ruletype: Sigma
author: frack113
date: 2022/08/20
description: Detect the usage of "DirLister.exe" a utility for quickly listing folder
    or drive contents. It was seen used by BlackCat ransomware to create a list of
    accessible directories and files.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: DirLister.exe
    SELECTION_4:
        NewProcessName: '*\dirlister.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use by users
id: b4dc61f5-6cce-468e-a608-b48b469feaa2
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1083/T1083.md
- https://news.sophos.com/en-us/2022/07/14/blackcat-ransomware-attacks-not-merely-a-byproduct-of-bad-luck/
status: experimental
tags:
- attack.discovery
- attack.t1083

