title: DumpMinitool Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022/04/06
description: Detects the use of "DumpMinitool.exe" a tool that allows the dump of
    process memory via the use of the "MiniDumpWriteDump"
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\DumpMinitool.exe'
        - '*\DumpMinitool.x86.exe'
        - '*\DumpMinitool.arm64.exe'
    SELECTION_4:
        OriginalFileName:
        - DumpMinitool.exe
        - DumpMinitool.x86.exe
        - DumpMinitool.arm64.exe
    SELECTION_5:
        CommandLine:
        - '* Full*'
        - '* Mini*'
        - '* WithHeap*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: dee0a7a3-f200-4112-a99b-952196d81e42
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/04/12
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/
- https://gist.github.com/nasbench/6d58c3c125e2fa1b8f7a09754c1b087f
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001

