title: Query Registry
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
description: Adversaries may interact with the Windows Registry to gather information
    about credentials, the system, configuration, and installed software.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\reg.exe'
    SELECTION_4:
        CommandLine:
        - '*query*'
        - '*save*'
        - '*export*'
    SELECTION_5:
        CommandLine:
        - '*currentVersion\windows*'
        - '*winlogon\\*'
        - '*currentVersion\shellServiceObjectDelayLoad*'
        - '*currentVersion\run*'
        - '*currentVersion\policies\explorer\run*'
        - '*currentcontrolset\services*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
fields:
- Image
- CommandLine
- User
- LogonGuid
- Hashes
- ParentProcessGuid
- ParentCommandLine
id: 970007b7-ce32-49d0-a4a4-fbef016950bd
level: low
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1012/T1012.md
status: test
tags:
- attack.discovery
- attack.t1012
- attack.t1007

