title: Suspicious Elevated System Shell
ruletype: Sigma
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
description: Detects when a shell program such as the windows Command Prompt or PowerShell
    is launched with system privileges.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        NewProcessName: '*\cmd.exe'
    SELECTION_11:
        ParentProcessName: C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\\*
    SELECTION_12:
        ParentProcessName: '*\CitrixReceiverUpdater.exe'
    SELECTION_13:
        NewProcessName: '*\cmd.exe'
    SELECTION_14:
        ParentProcessName: '*\python.exe'
    SELECTION_15:
        CommandLine: C:\WINDOWS\system32\cmd.exe /c "ver"
    SELECTION_16:
        CurrentDirectory: '*C:\WINDOWS\Temp\asgard2-agent\\*'
    SELECTION_17:
        ParentProcessName: C:\Windows\Temp*
    SELECTION_18:
        ParentProcessName: '*\invcol.exe'
    SELECTION_19:
        ParentCommandLine: '*C:\ProgramData\Dell\UpdateService\\*'
    SELECTION_2:
        Channel: Security
    SELECTION_20:
        NewProcessName: '*\cmd.exe'
    SELECTION_21:
        CommandLine: 'powershell.exe -ExecutionPolicy Restricted -Command Write-Host
            ''Final result: 1'';'
    SELECTION_22:
        NewProcessName: '*\cmd.exe'
    SELECTION_23:
        CommandLine: '*/d /c C:\Windows\system32\silcollector.cmd*'
    SELECTION_24:
        NewProcessName: '*\cmd.exe'
    SELECTION_25:
        CommandLine: '*cmd.exe /c btool server list replication_port --no-log'
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
        - Cmd.Exe
    SELECTION_5:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_6:
        SubjectLogonId: '0x3e7'
    SELECTION_7:
        ParentProcessName:
        - C:\Windows\System32\\*
        - C:\Program Files (x86)\\*
        - C:\Program Files\\*
    SELECTION_8:
        NewProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
    SELECTION_9:
        ParentProcessName: C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8) or
        (SELECTION_9 and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13)
        or (SELECTION_14 and SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18
        and SELECTION_19 and SELECTION_20) or (SELECTION_21) or (SELECTION_22 and
        SELECTION_23) or (SELECTION_24 and SELECTION_25)))
falsepositives:
- Unknown
id: 178e615d-e666-498b-9630-9ed363038101
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/21
references:
- https://github.com/Wh04m1001/SysmonEoP
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.execution
- attack.t1059

