
title: Use NTFS Short Name in Command Line
ruletype: Sigma
author: frack113, Nasreddine Bencherchali
date: 2022/08/05
description: Detect use of the Windows 8.3 short name. Which could be used as a method
  to avoid command-line detection
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine:
    - '*~1.exe*'
    - '*~1.bat*'
    - '*~1.msi*'
    - '*~1.vbe*'
    - '*~1.vbs*'
    - '*~1.dll*'
    - '*~1.ps1*'
    - '*~1.js*'
    - '*~1.hta*'
    - '*~2.exe*'
    - '*~2.bat*'
    - '*~2.msi*'
    - '*~2.vbe*'
    - '*~2.vbs*'
    - '*~2.dll*'
    - '*~2.ps1*'
    - '*~2.js*'
    - '*~2.hta*'
  SELECTION_4:
    ParentProcessName:
    - '*\WebEx\WebexHost.exe'
    - '*\thor\thor64.exe'
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Applications could use this notation occasionally which might generate some false
  positives. In that case Investigate the parent and child process.
id: dd6b39d9-d9be-4a3b-8fe0-fe3c6a5c1795
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/08/12
references:
- https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)?redirectedfrom=MSDN
- https://twitter.com/jonasLyk/status/1555914501802921984
related:
- id: 3ef5605c-9eb9-47b0-9a71-b727e6aa5c3b
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.004
