
title: Copy from Admin Share
ruletype: Sigma
author: Florian Roth, oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford
  @svch0st
date: 2019/12/30
description: Detects a suspicious copy command to or from an Admin share
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName:
    - '*\robocopy.exe'
    - '*\xcopy.exe'
  SELECTION_4:
    NewProcessName: '*\cmd.exe'
  SELECTION_5:
    CommandLine: '*copy*'
  SELECTION_6:
    NewProcessName: '*\powershell*'
  SELECTION_7:
    CommandLine:
    - '*copy-item*'
    - '*copy*'
    - '*cpi *'
    - '* cp *'
  SELECTION_8:
    CommandLine: '*\\\\\*'
  SELECTION_9:
    CommandLine: '*$*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or (SELECTION_4 and
    SELECTION_5)) or (SELECTION_6 and SELECTION_7)) and (SELECTION_8 and SELECTION_9))
falsepositives:
- Administrative scripts
fields:
- CommandLine
- ParentCommandLine
id: 855bc8b5-2ae8-402e-a9ed-b889e6df1900
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
references:
- https://twitter.com/SBousseaden/status/1211636381086339073
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
status: test
tags:
- attack.lateral_movement
- attack.collection
- attack.exfiltration
- attack.t1039
- attack.t1048
- attack.t1021.002
