title: Execute Files with Msdeploy.exe
id: c0cc4271-ed56-6236-e21a-e9db92f30d97
related:
    - id: 646bc99f-6682-4b47-a73a-17b1b64c9d34
      type: derived
status: test
description: Detects file execution using the msdeploy.exe lolbin
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msdeploy/
    - https://twitter.com/pabraeken/status/995837734379032576
    - https://twitter.com/pabraeken/status/999090532839313408
author: Beyu Denis, oscd.community
date: 2020-10-18
modified: 2021-11-27
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - verb:sync
            - -source:RunCommand
            - -dest:runCommand
        NewProcessName|endswith: \msdeploy.exe
    condition: process_creation and selection
fields:
    - SubjectUserName
    - ComputerName
    - CommandLine
    - ParentCommandLine
falsepositives:
    - System administrator Usage
level: medium
ruletype: Sigma
