title: Potential Manage-bde.wsf Abuse To Proxy Execution
id: 35e14148-f5cd-9d4d-90bb-e63d555a1a02
related:
    - id: c363385c-f75d-4753-a108-c1a8e28bdbda
      type: derived
status: test
description: Detects potential abuse of the "manage-bde.wsf" script as a LOLBIN to proxy execution
references:
    - https://lolbas-project.github.io/lolbas/Scripts/Manage-bde/
    - https://gist.github.com/bohops/735edb7494fe1bd1010d67823842b712
    - https://twitter.com/bohops/status/980659399495741441
    - https://twitter.com/JohnLaTwC/status/1223292479270600706
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1216/T1216.md
author: oscd.community, Natalia Shornikova, Nasreddine Bencherchali (Nextron Systems)
date: 2020-10-13
modified: 2023-02-03
tags:
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_wscript_img:
        - NewProcessName|endswith: \wscript.exe
        - OriginalFileName: wscript.exe
    selection_wscript_cli:
        CommandLine|contains: manage-bde.wsf
    selection_parent:
        ParentCommandLine|contains: manage-bde.wsf
        ParentProcessName|endswith:
            - \cscript.exe
            - \wscript.exe
    selection_filter_cmd:
        NewProcessName|endswith: \cmd.exe
    condition: process_creation and (all of selection_wscript_* or (selection_parent and not selection_filter_cmd))
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
