title: UAC Bypass Using MSConfig Token Modification - Process
id: ad92e3f9-7eb6-460e-96b1-582b0ccbb980
status: test
description: Detects the pattern of UAC Bypass using a msconfig GUI hack (UACMe 55)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021/08/30
modified: 2022/10/09
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine: '"C:\Windows\system32\msconfig.exe" -5'
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
        ParentProcessName|endswith: \AppData\Local\Temp\pkgmgr.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
