
title: WMIC Unquoted Services Path Lookup
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/20
description: Detects wmic known recon method to look for unquoted serivce paths, often
  used by pentest and attackers enum scripts
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    OriginalFileName: wmic.exe
  SELECTION_4:
    NewProcessName: '*\WMIC.exe'
  SELECTION_5:
    CommandLine: '* service *'
  SELECTION_6:
    CommandLine: '* get *'
  SELECTION_7:
    CommandLine:
    - '*name*'
    - '*displayname*'
    - '*pathname*'
    - '*startmode*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and (SELECTION_5
    and SELECTION_6 and SELECTION_7))
falsepositives:
- Unknown
id: 68bcd73b-37ef-49cb-95fc-edc809730be6
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/nccgroup/redsnarf/blob/master/redsnarf.py
- https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
status: experimental
tags:
- attack.execution
- attack.t1047
