title: PUA - AdvancedRun Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/20
description: Detects the execution of AdvancedRun utility
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: AdvancedRun.exe
    SELECTION_4:
        CommandLine: '* /EXEFilename *'
    SELECTION_5:
        CommandLine: '* /Run*'
    SELECTION_6:
        CommandLine: '* /WindowState 0*'
    SELECTION_7:
        CommandLine: '* /RunAs *'
    SELECTION_8:
        CommandLine: '* /CommandLine *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: d2b749ee-4225-417e-b20e-a8d2193cbb84
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://twitter.com/splinter_code/status/1483815103279603714
- https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
- https://elastic.github.io/security-research/malware/2022/01/01.operation-bleeding-bear/article/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
related:
-   id: fa00b701-44c6-4679-994d-5a18afa8a707
    type: similar
status: experimental

