title: Windows Share Mount Via Net.EXE
id: 3037cec2-08d0-f4a4-91c3-668db3535704
status: test
description: Detects when a share is mounted using the "net.exe" utility
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/02
modified: 2023/02/21
tags:
    - attack.lateral_movement
    - attack.t1021.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \net.exe
              - \net1.exe
        - OriginalFileName:
              - net.exe
              - net1.exe
    selection_cli:
        CommandLine|contains:
            - ' use '
            - ' \\\\'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate activity by administrators and scripts
level: low
ruletype: Sigma
