title: File or Folder Permissions Modifications
id: 37ae075c-271b-459b-8d7b-55ad5f993dd8
status: test
description: Detects a file or folder's permissions being modified or tampered with.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1222.001/T1222.001.md
    - https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/hh750728(v=ws.11)
    - https://github.com/swagkarna/Defeat-Defender-V1.2.0
author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali
date: 2019/10/23
modified: 2022/11/18
tags:
    - attack.defense_evasion
    - attack.t1222.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        CommandLine|contains:
            - /grant
            - /setowner
            - /inheritance:r
        NewProcessName|endswith:
            - \cacls.exe
            - \icacls.exe
            - \net.exe
            - \net1.exe
    selection2:
        CommandLine|contains: -r
        NewProcessName|endswith: \attrib.exe
    selection3:
        NewProcessName|endswith: \takeown.exe
    filter_reset:
        CommandLine|endswith: ICACLS C:\ProgramData\dynatrace\gateway\config\connectivity.history
            /reset
    filter_grant:
        CommandLine|contains|all:
            - 'ICACLS C:\ProgramData\dynatrace\gateway\config\config.properties /grant
                :r '
            - S-1-5-19:F
    filter_programs:
        -   CommandLine|contains: \AppData\Local\Programs\Microsoft VS Code
        -   ParentProcessName|endswith: \Microsoft VS Code\Code.exe
    condition: process_creation and (1 of selection* and not 1 of filter*)
fields:
    - SubjectUserName
    - ComputerName
    - CommandLine
falsepositives:
    - Users interacting with the files on their own (unlikely unless privileged users).
    - Dynatrace app
level: medium
ruletype: Sigma
