title: Mstsc.EXE Execution From Uncommon Parent
id: fdd2fe27-5f29-7b4f-0381-22bac2ea7c0a
related:
    - id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
      type: derived
status: test
description: Detects potential RDP connection via Mstsc using a local ".rdp" file located in suspicious locations.
references:
    - https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
    - https://web.archive.org/web/20230726144748/https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-04-18
tags:
    - attack.lateral-movement
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith:
            # Covers potential downloads/clicks from browsers
            - \brave.exe
            - \CCleanerBrowser.exe
            - \chrome.exe
            - \chromium.exe
            - \firefox.exe
            - \iexplore.exe
            - \microsoftedge.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
            - \whale.exe
            # Covers potential downloads/clicks from email clients
            - \outlook.exe
    selection_img:
        - NewProcessName|endswith: \mstsc.exe
        - OriginalFileName: mstsc.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
