title: Suspicious Curl Usage on Windows
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali (updated)
date: 2020/07/03
description: Detects a suspicious curl process start on Windows and outputs the requested
    document to a local file
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\curl.exe'
    SELECTION_4:
        Product: The curl executable
    SELECTION_5:
        CommandLine:
        - '*\AppData\\*'
        - '*\Users\Public\\*'
        - '*\Temp\\*'
        - '*%AppData%*'
        - '*%Temp%*'
        - '*%Public%*'
        - '*\Desktop\\*'
    SELECTION_6:
        CommandLine:
        - '*.jpg'
        - '*.jpeg'
        - '*.png'
        - '*.gif'
        - '*.tmp'
        - '*.temp'
        - '*.txt'
    SELECTION_7:
        CommandLine:
        - '* -O*'
        - '*--remote-name*'
        - '*--output*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/28
references:
- https://twitter.com/max_mal_/status/1542461200797163522
- https://web.archive.org/web/20200128160046/https://twitter.com/reegun21/status/1222093798009790464
- https://github.com/pr0xylife/Qakbot/blob/4f0795d79dabee5bc9dd69f17a626b48852e7869/Qakbot_AA_23.06.2022.txt
- https://www.volexity.com/blog/2022/07/28/sharptongue-deploys-clever-mail-stealing-browser-extension-sharpext/
status: experimental
tags:
- attack.command_and_control
- attack.t1105

