title: Uncommon FileSystem Load Attempt By Format.com
id: de9e4f46-8404-a8bb-7f5a-78bc21b25a9e
related:
    - id: 9fb6b26e-7f9e-4517-a48b-8cac4a1b6c60
      type: derived
status: test
description: |
    Detects the execution of format.com with an uncommon filesystem selection that could indicate a defense evasion activity in which "format.com" is used to load malicious DLL files or other programs.
references:
    - https://twitter.com/0gtweet/status/1477925112561209344
    - https://twitter.com/wdormann/status/1478011052130459653?s=20
author: Florian Roth (Nextron Systems)
date: 2022-01-04
modified: 2024-05-13
tags:
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: '/fs:'
        NewProcessName|endswith: \format.com
    filter_main_known_fs:
        CommandLine|contains:
            - /fs:exFAT
            - /fs:FAT
            - /fs:NTFS
            - /fs:ReFS
            - /fs:UDF
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
