title: Usage Of Web Request Commands And Cmdlets
id: 96951861-e068-11a1-bdd8-1fdc951102b8
status: test
description: Detects the use of various web request commands with commandline tools and Windows PowerShell cmdlets (including aliases) via CommandLine
references:
    - https://4sysops.com/archives/use-powershell-to-download-a-file-with-http-https-and-ftp/
    - https://blog.jourdant.me/post/3-ways-to-download-files-with-powershell
    - https://docs.microsoft.com/en-us/powershell/module/bitstransfer/add-bitsfile?view=windowsserver2019-ps
author: James Pemberton / @4A616D6573, Endgame, JHasenbusch, oscd.community, Austin Songer @austinsonger
date: 2019/10/24
modified: 2023/01/10
tags:
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - '[System.Net.WebRequest]::create'
            - 'curl '
            - Invoke-RestMethod
            - Invoke-WebRequest
            - 'iwr '
            - Net.WebClient
            - Resume-BitsTransfer
            - Start-BitsTransfer
            - 'wget '
            - WinHttp.WinHttpRequest
    condition: process_creation and selection
falsepositives:
    - Use of Get-Command and Get-Help modules to reference Invoke-WebRequest and Start-BitsTransfer.
level: medium
ruletype: Sigma
