title: HackTool - Empire PowerShell UAC Bypass
ruletype: Sigma
author: Ecco
date: 2019/08/30
description: Detects some Empire PowerShell UAC bypass methods
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '* -NoP -NonI -w Hidden -c $x=$((gp HKCU:Software\Microsoft\Windows Update).Update)*'
        - '* -NoP -NonI -c $x=$((gp HKCU:Software\Microsoft\Windows Update).Update);*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3268b746-88d8-4cd3-bffc-30077d02c787
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-EventVwrBypass.ps1#L64
- https://github.com/EmpireProject/Empire/blob/e37fb2eef8ff8f5a0a689f1589f424906fe13055/data/module_source/privesc/Invoke-FodHelperBypass.ps1#L64
status: stable
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- car.2019-04-001

