title: RemoteFXvGPUDisablement Abuse Via AtomicTestHarnesses
id: 88ecfa5d-38dc-041a-fc73-6a0436a3d27f
status: test
description: Detects calls to the AtomicTestHarnesses "Invoke-ATHRemoteFXvGPUDisablementCommand" which is designed to abuse the "RemoteFXvGPUDisablement.exe" binary to run custom PowerShell code via module load-order hijacking.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
    - https://github.com/redcanaryco/AtomicTestHarnesses/blob/7e1e4da116801e3d6fcc6bedb207064577e40572/TestHarnesses/T1218_SignedBinaryProxyExecution/InvokeRemoteFXvGPUDisablementCommand.ps1
author: frack113
date: 2021/07/13
modified: 2023/05/09
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - Invoke-ATHRemoteFXvGPUDisablementCommand
            - Invoke-ATHRemoteFXvGPUDisableme
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
