title: Quarks PwDump Usage
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/05
description: Detects usage of the Quarks PwDump tool via commandline arguments
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\QuarksPwDump.exe'
    SELECTION_4:
        CommandLine:
        - ' -dhl'
        - ' --dump-hash-local'
        - ' -dhdc'
        - ' --dump-hash-domain-cached'
        - ' --dump-bitlocker'
        - ' -dhd '
        - ' --dump-hash-domain '
        - --ntds-file
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
id: 0685b176-c816-4837-8e7b-1216f346636b
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/quarkslab/quarkspwdump
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/seedworm-apt-iran-middle-east
status: experimental
tags:
- attack.credential_access
- attack.t1003.002

