title: Potential Provlaunch.EXE Binary Proxy Execution Abuse
id: 0e400d25-3298-763d-1813-3fe64dbdb2b0
status: experimental
description: Detects child processes of "provlaunch.exe" which might indicate potential abuse to proxy execution.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2023/08/08
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \provlaunch.exe
    filter_main_covered_children:
        # Note: this filter is here to avoid duplicate alerting by f9999590-1f94-4a34-a91e-951e47bedefd
        - NewProcessName|endswith:
              - \calc.exe
              - \cmd.exe
              - \cscript.exe
              - \mshta.exe
              - \notepad.exe
              - \powershell.exe
              - \pwsh.exe
              - \regsvr32.exe
              - \rundll32.exe
              - \wscript.exe
        - NewProcessName|contains:
              - :\PerfLogs\
              - :\Temp\
              - :\Users\Public\
              - \AppData\Temp\
              - \Windows\System32\Tasks\
              - \Windows\Tasks\
              - \Windows\Temp\
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
