title: Domain Trust Discovery Via Dsquery
ruletype: Sigma
author: E.M. Anhaus, Tony Lambert, oscd.community, omkar72
date: 2019/10/24
description: Detects execution of "dsquery.exe" for domain trust discovery
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\dsquery.exe'
    SELECTION_4:
        OriginalFileName: dsquery.exe
    SELECTION_5:
        CommandLine: '*trustedDomain*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate use of the utilities by legitimate user for legitimate reason
id: 3bad990e-4848-4a78-9530-b427d854aac0
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/02
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1482/T1482.md
- https://posts.specterops.io/an-introduction-to-manual-active-directory-querying-with-dsquery-and-ldapsearch-84943c13d7eb?gi=41b97a644843
related:
-   id: b23fcb74-b1cb-4ff7-a31d-bfe2a7ba453b
    type: similar
-   id: 77815820-246c-47b8-9741-e0def3f57308
    type: obsoletes
status: test
tags:
- attack.discovery
- attack.t1482

