title: Add User to Local Administrators Group
ruletype: Sigma
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/12
description: Detects suspicious command line that adds an account to the local administrators/administrateurs
    group
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*localgroup *'
    SELECTION_4:
        CommandLine: '* /add*'
    SELECTION_5:
        CommandLine: '*Add-LocalGroupMember *'
    SELECTION_6:
        CommandLine: '* -Group *'
    SELECTION_7:
        CommandLine:
        - '* administrators *'
        - '* administrateur*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)) and SELECTION_7)
falsepositives:
- Administrative activity
id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/02
references:
- https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
related:
-   id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
    type: similar
status: experimental
tags:
- attack.persistence
- attack.t1098

