title: Pubprn.vbs Proxy Execution
id: b176b53d-4619-d65f-baf1-b3a4f1ec0b12
related:
    - id: 1fb76ab8-fa60-4b01-bddd-71e89bf555da
      type: derived
status: test
description: Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute commands.
references:
    - https://lolbas-project.github.io/lolbas/Scripts/Pubprn/
author: frack113
date: 2022-05-28
tags:
    - attack.defense-evasion
    - attack.t1216.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - \pubprn.vbs
            - 'script:'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
