title: HackTool - SecurityXploded Execution
id: 0cb1943b-75df-d254-4a36-58c1dc6a3f97
related:
    - id: 7679d464-4f74-45e2-9e01-ac66c5eb041a
      type: derived
status: stable
description: Detects the execution of SecurityXploded Tools
references:
    - https://securityxploded.com/
    - https://web.archive.org/web/20200601000524/https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/
author: Florian Roth (Nextron Systems)
date: 2018-12-19
modified: 2023-02-04
tags:
    - attack.credential-access
    - attack.t1555
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - Company: SecurityXploded
        - NewProcessName|endswith: PasswordDump.exe
        - OriginalFileName|endswith: PasswordDump.exe
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
