title: Suspicious Uninstall of Windows Defender Feature via PowerShell
id: 9610d848-8049-b860-c3ee-235db9eccfc4
related:
    - id: c443012c-7928-43bf-ac20-7eda5efe61ad
      type: derived
status: experimental
description: |
    Detects the use of PowerShell with Uninstall-WindowsFeature or Remove-WindowsFeature cmdlets to disable or remove the Windows Defender GUI feature, a common technique used by adversaries to evade defenses.
references:
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.windows.servermanager.migration/uninstall-windowsfeature
    - https://thedfirreport.com/2023/04/03/malicious-iso-file-leads-to-domain-wide-ransomware
author: yxinmiracle
date: 2025-08-22
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \powershell_ise.exe
              - \powershell.exe
              - \pwsh.exe
        - OriginalFileName:
              - PowerShell_ISE.EXE
              - PowerShell.EXE
              - pwsh.dll
    selection_cli_uninstall:
        CommandLine|contains:
            - Uninstall-WindowsFeature
            - Remove-WindowsFeature   # Only supported in Windows Server 2008 R2 and Windows 2012 R2
    selection_cli_defender_feature:
        CommandLine|contains: Windows-Defender
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
