title: Import PowerShell Modules From Suspicious Directories - ProcCreation
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/10
description: Detects powershell scripts that import modules from suspicious directories
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*Import-Module "$Env:Temp\\*'
        - '*Import-Module ''$Env:Temp\\*'
        - '*Import-Module $Env:Temp\\*'
        - '*Import-Module "$Env:Appdata\\*'
        - '*Import-Module ''$Env:Appdata\\*'
        - '*Import-Module $Env:Appdata\\*'
        - '*Import-Module C:\Users\Public\\*'
        - '*ipmo "$Env:Temp\\*'
        - '*ipmo ''$Env:Temp\\*'
        - '*ipmo $Env:Temp\\*'
        - '*ipmo "$Env:Appdata\\*'
        - '*ipmo ''$Env:Appdata\\*'
        - '*ipmo $Env:Appdata\\*'
        - '*ipmo C:\Users\Public\\*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: c31364f7-8be6-4b77-8483-dd2b5a7b69a3
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md
related:
-   id: 21f9162c-5f5d-4b01-89a8-b705bd7d10ab
    type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.001

