title: Potential Product Reconnaissance Via Wmic.EXE
ruletype: Sigma
author: Michael Haag, Florian Roth (Nextron Systems), juju4, oscd.community
date: 2023/02/14
description: Detects the execution of WMIC in order to get a list of firewall and
    antivirus products
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wmic.exe'
    SELECTION_4:
        OriginalFileName: wmic.exe
    SELECTION_5:
        CommandLine: '* path *'
    SELECTION_6:
        CommandLine:
        - '*AntiVirusProduct*'
        - '*FirewallProduct*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Asset management software
- During software installations
id: e568650b-5dcd-4658-8f34-ded0b1e13992
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/albertzsigovits/malware-notes/blob/c820c7fea76cf76a861b28ebc77e06100e20ec29/Ransomware/Maze.md
- https://www.hybrid-analysis.com/sample/4be06ecd234e2110bd615649fe4a6fa95403979acf889d7e45a78985eb50acf9?environmentId=1
status: experimental
tags:
- attack.execution
- attack.t1047
- car.2016-03-002

