title: Suspicious Outlook Child Process
id: 208748f7-881d-47ac-a29c-07ea84bf691d
related:
    -   id: 438025f9-5856-4663-83f7-52f878a70a50
        type: derived
    -   id: e212d415-0e93-435f-9e1a-f29005bb4723
        type: derived
status: test
description: Detects a suspicious process spawning from an Outlook process.
references:
    - https://www.hybrid-analysis.com/sample/465aabe132ccb949e75b8ab9c5bda36d80cf2fd503d52b8bad54e295f28bbc21?environmentId=100
    - https://mgreen27.github.io/posts/2018/04/02/DownloadCradle.html
author: Michael Haag, Florian Roth (Nextron Systems), Markus Neis, Elastic, FPT.EagleEye
    Team
date: 2022/02/28
modified: 2023/02/04
tags:
    - attack.execution
    - attack.t1204.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \OUTLOOK.EXE
        NewProcessName|endswith:
            - \AppVLP.exe
            - \bash.exe
            - \cmd.exe
            - \cscript.exe
            - \forfiles.exe
            - \hh.exe
            - \mftrace.exe
            - \msbuild.exe
            - \msdt.exe
            - \mshta.exe
            - \msiexec.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \schtasks.exe
            - \scrcons.exe
            - \scriptrunner.exe
            - \sh.exe
            - \svchost.exe
            - \wmic.exe
            - \wscript.exe
    condition: process_creation and selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
