title: Forfiles Command Execution
id: 140c6c67-8cac-1d16-5654-bf2221dc7542
status: test
description: |
    Detects the execution of "forfiles" with the "/c" flag.
    While this is an expected behavior of the tool, it can be abused in order to proxy execution through it with any binary.
    Can be used to bypass application whitelisting.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
    - https://pentestlab.blog/2020/07/06/indirect-command-execution/
author: Tim Rauch, Elastic, E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2022/06/14
modified: 2024/03/05
tags:
    - attack.execution
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \forfiles.exe
        - OriginalFileName: forfiles.exe
    selection_cli:
        CommandLine|contains:
            - ' -c '
            - ' /c '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate use via a batch script or by an administrator.
level: medium
ruletype: Sigma
