title: Add User to Local Administrators Group
id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
related:
    -   id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
        type: similar
status: experimental
description: Detects suspicious command line that adds an account to the local administrators/administrateurs
    group
references:
    - https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/12
modified: 2023/03/02
tags:
    - attack.persistence
    - attack.t1098
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_main:
        -   CommandLine|contains|all:
                - 'localgroup '
                - ' /add'
        -   CommandLine|contains|all:
                - 'Add-LocalGroupMember '
                - ' -Group '
    selection_group:
        CommandLine|contains:
            - ' administrators '
            - ' administrateur'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Administrative activity
level: medium
ruletype: Sigma
