title: New Root Certificate Installed Via CertMgr.EXE
id: 0ea4a0ee-5c69-9f71-3691-d203eb76c9fc
status: test
description: |
    Detects execution of "certmgr" with the "add" flag in order to install a new certificate on the system.
    Adversaries may install a root certificate on a compromised system to avoid warnings when connecting to adversary controlled web servers.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
    - https://securelist.com/to-crypt-or-to-mine-that-is-the-question/86307/
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2023/03/05
tags:
    - attack.defense_evasion
    - attack.t1553.004
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \CertMgr.exe
        - OriginalFileName: CERTMGT.EXE
    selection_cli:
        CommandLine|contains|all:
            - /add
            - root
    condition: process_creation and (all of selection_*)
falsepositives:
    - Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to test if GPO push doesn't trigger FP
level: medium
ruletype: Sigma
