title: Delete Important Scheduled Task
id: 7aeff814-b27b-e580-603c-4c71d478a677
related:
    - id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d # TaskScheduler EventLog
      type: similar
    - id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad # Security-Audting Eventlog
      type: similar
    - id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
      type: derived
status: test
description: Detects when adversaries stop services or processes by deleting their respective scheduled tasks in order to conduct data destructive activities
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-09
tags:
    - attack.impact
    - attack.t1489
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - /delete
            - /tn
        CommandLine|contains:
            # Add more important tasks
            - \Windows\BitLocker
            - \Windows\ExploitGuard
            - \Windows\SystemRestore\SR
            - \Windows\UpdateOrchestrator\
            - \Windows\Windows Defender\
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
        NewProcessName|endswith: \schtasks.exe
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
