title: New Remote Desktop Connection Initiated Via Mstsc.EXE
ruletype: Sigma
author: frack113
date: 2022/01/07
description: 'Detects the usage of "mstsc.exe" with the "/v" flag to initate a connection
    to a remote server.

    Adversaries may use valid accounts to log into a computer using the Remote Desktop
    Protocol (RDP). The adversary may then perform actions as the logged-on user.

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\mstsc.exe'
    SELECTION_4:
        OriginalFileName: mstsc.exe
    SELECTION_5:
        CommandLine: '* /v:*'
    SELECTION_6:
        ParentProcessName: C:\Windows\System32\lxss\wslhost.exe
    SELECTION_7:
        CommandLine: '*C:\ProgramData\Microsoft\WSL\wslg.rdp*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6 and SELECTION_7)))
falsepositives:
- WSL (Windows Sub System For Linux)
- Other currently unknown software
id: 954f0af7-62dd-418f-b3df-a84bc2c7a774
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/mstsc
status: experimental
tags:
- attack.lateral_movement
- attack.t1021.001

