title: Suspicious Regsvr32 Execution From Remote Share
id: 5b838545-abaf-44b0-643d-b363389ecb5e
related:
    - id: 88a87a10-384b-4ad7-8871-2f9bf9259ce5
      type: derived
status: test
description: Detects REGSVR32.exe to execute DLL hosted on remote shares
references:
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-10-31
tags:
    - attack.defense-evasion
    - attack.t1218.010
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \regsvr32.exe
        - OriginalFileName: \REGSVR32.EXE
    selection_cli:
        CommandLine|contains: ' \\\\'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
# Decrease to medium if this is something common in your org
level: high
ruletype: Sigma
