title: Suspicious WMIC Execution Via Office Process
ruletype: Sigma
author: Vadim Khrykov, Cyb3rEng
date: 2021/08/23
description: Office application called wmic to proxye execution through a LOLBIN process.
    This is often used to break suspicious parent-child chain (Office app spawns LOLBin).
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName:
        - '*\WINWORD.EXE'
        - '*\EXCEL.EXE'
        - '*\POWERPNT.exe'
        - '*\MSPUB.exe'
        - '*\VISIO.exe'
        - '*\MSACCESS.EXE'
        - '*\EQNEDT32.EXE'
        - '*\ONENOTE.EXE'
        - '*\wordpad.exe'
        - '*\wordview.exe'
    SELECTION_4:
        NewProcessName: '*\wbem\WMIC.exe'
    SELECTION_5:
        OriginalFileName: wmic.exe
    SELECTION_6:
        CommandLine: '*process*'
    SELECTION_7:
        CommandLine: '*create*'
    SELECTION_8:
        CommandLine: '*call*'
    SELECTION_9:
        CommandLine:
        - '*regsvr32*'
        - '*rundll32*'
        - '*msiexec*'
        - '*mshta*'
        - '*verclsid*'
        - '*wscript*'
        - '*cscript*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5) and (SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9))
falsepositives:
- Unknown
id: e1693bc8-7168-4eab-8718-cdcaa68a1738
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
related:
-   id: 438025f9-5856-4663-83f7-52f878a70a50
    type: derived
-   id: 518643ba-7d9c-4fa5-9f37-baed36059f6a
    type: obsoletes
-   id: 9d1c72f5-43f0-4da5-9320-648cf2099dd0
    type: obsoletes
-   id: c0e1c3d5-4381-4f18-8145-2583f06a1fe5
    type: obsoletes
-   id: 04f5363a-6bca-42ff-be70-0d28bf629ead
    type: obsoletes
status: experimental
tags:
- attack.t1204.002
- attack.t1047
- attack.t1218.010
- attack.execution
- attack.defense_evasion

