title: Windows Recall Feature Enabled Via Reg.EXE
id: 3be2ca2a-e70a-49c3-7d32-ac25c979e199
status: experimental
description: |
    Detects the enabling of the Windows Recall feature via registry manipulation.
    Windows Recall can be enabled by deleting the existing "DisableAIDataAnalysis" value, or setting it to 0.
    Adversaries may enable Windows Recall as part of post-exploitation discovery and collection activities.
    This rule assumes that Recall is already explicitly disabled on the host, and subsequently enabled by the adversary.
references:
    - https://learn.microsoft.com/en-us/windows/client-management/manage-recall
    - https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-windowsai#disableaidataanalysis
author: Sajid Nawaz Khan
date: 2024/06/02
tags:
    - attack.collection
    - attack.t1113
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \reg.exe
        - OriginalFileName: reg.exe
    selection_value:
        # HKEY_CURRENT_USER\Software\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
        # HKEY_LOCAL_MACHINE\SOFTWARE\Policies\Microsoft\Windows\WindowsAI\DisableAIDataAnalysis
        CommandLine|contains|all:
            - Microsoft\Windows\WindowsAI
            - DisableAIDataAnalysis
    selection_action_add:
        CommandLine|contains:
            - add
            - '0'
    selection_action_delete:
        CommandLine|contains: delete
    condition: process_creation and (selection_img and selection_value and 1 of selection_action_*)
falsepositives:
    - Legitimate use/activation of Windows Recall
level: medium
ruletype: Sigma
