title: User Discovery Via Get-ADUser Cmdlet
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/09
description: Detects usage of the Get-ADUser cmdlet to collect user information
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine: '*Get-ADUser *'
    SELECTION_6:
        CommandLine: '* -Filter \*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Legitimate admin scripts may use the same technique, it's better to exclude specific
    computers or users who execute these commands or scripts often
id: c2993223-6da8-4b1a-88ee-668b8bf315e9
level: medium
logsource:
    category: process_creation
    product: windows
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: experimental
tags:
- attack.discovery
- attack.t1033

