title: Renamed AdFind Detection
ruletype: Sigma
author: Florian Roth
date: 2022/08/21
description: Detects the use of a renamed Adfind.exe. AdFind continues to be seen
    across majority of breaches. It is used to domain trust discovery to plan out
    subsequent steps in the attack chain.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Imphash:
        - bca5675746d13a1f246e2da3c2217492
        - 53e117a96057eaf19c41380d0e87f1c2
    SELECTION_4:
        Hashes:
        - '*IMPHASH=BCA5675746D13A1F246E2DA3C2217492*'
        - '*IMPHASH=53E117A96057EAF19C41380D0E87F1C2*'
    SELECTION_5:
        NewProcessName: '*\AdFind.exe'
    SELECTION_6:
        OriginalFileName: AdFind.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: df55196f-f105-44d3-a675-e9dfb6cc2f2b
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.joeware.net/freetools/tools/adfind/
- https://thedfirreport.com/2020/05/08/adfind-recon/
- https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/bf62ece1c679b07b5fb49c4bae947fe24c81811f/fin6/Emulation_Plan/Phase1.md
status: test
tags:
- attack.discovery
- attack.t1018
- attack.t1087.002
- attack.t1482
- attack.t1069.002

