title: Non-privileged Usage of Reg or Powershell
id: 91dc62f7-9e6b-59c0-27d2-ccac03bed57c
related:
    - id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
      type: derived
status: test
description: Search for usage of reg or Powershell by non-privileged users to modify service configuration in registry
references:
    - https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
date: 2020-10-05
modified: 2024-12-01
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1112
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_cli:
        - CommandLine|contains|all:
              - 'reg '
              - add
        - CommandLine|contains:
              - powershell
              - set-itemproperty
              - ' sp '
              - new-itemproperty
    selection_data:
        CommandLine|contains|all:
            - ControlSet
            - Services
        CommandLine|contains:
            - ImagePath
            - FailureCommand
            - ServiceDLL
        MandatoryLabel:
            - S-1-16-8192
            - None
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
