title: Whoami.EXE Execution Anomaly
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/08/12
description: Detects the execution of whoami.exe with suspicious parent processes.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\whoami.exe'
    SELECTION_4:
        OriginalFileName: whoami.exe
    SELECTION_5:
        ParentProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\powershell_ise.exe'
    SELECTION_6:
        ParentProcessName: C:\Program Files\Microsoft Monitoring Agent\Agent\MonitoringHost.exe
    SELECTION_7:
        ParentProcessName: null
    SELECTION_8:
        ParentProcessName: ''
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8)))
falsepositives:
- Admin activity
- Scripts and administrative tools used in the monitored environment
- Monitoring activity
id: 8de1cbe8-d6f5-496d-8237-5f44a721c7a0
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/28
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
- https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s
status: experimental
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001

