title: Potential Recon Activity Via Nltest.EXE
ruletype: Sigma
author: Craig Young, oscd.community, Georg Lauenstein
date: 2021/07/24
description: Detects nltest commands that can be used for information discovery
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\nltest.exe'
    SELECTION_4:
        OriginalFileName: nltestrk.exe
    SELECTION_5:
        CommandLine: '*/server*'
    SELECTION_6:
        CommandLine: '*/query*'
    SELECTION_7:
        CommandLine:
        - '*/dclist:*'
        - '*/parentdomain*'
        - '*/domain_trusts*'
        - '*/all_trusts*'
        - '*/trusted_domains*'
        - '*/user*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or SELECTION_7))
falsepositives:
- Legitimate administration use but user and host must be investigated
fields:
- Image
- User
- CommandLine
- ParentCommandLine
id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
- https://thedfirreport.com/2021/08/16/trickbot-leads-up-to-fake-1password-installation/
- https://thedfirreport.com/2020/10/18/ryuk-in-5-hours/
- https://book.hacktricks.xyz/windows/basic-cmd-for-pentesters
- https://research.nccgroup.com/2022/08/19/back-in-black-unlocking-a-lockbit-3-0-ransomware-attack/
- https://eqllib.readthedocs.io/en/latest/analytics/03e231a6-74bc-467a-acb1-e5676b0fb55e.html
- https://redcanary.com/blog/how-one-hospital-thwarted-a-ryuk-ransomware-outbreak/
related:
-   id: 410ad193-a728-4107-bc79-4419789fcbf8
    type: similar
-   id: 903076ff-f442-475a-b667-4f246bcc203b
    type: similar
-   id: 77815820-246c-47b8-9741-e0def3f57308
    type: obsoletes
status: experimental
tags:
- attack.discovery
- attack.t1016
- attack.t1482

