title: Use of PDQ Deploy Remote Adminstartion Tool
ruletype: Sigma
author: frack113
date: 2022/10/01
description: Detect use of PDQ Deploy remote admin tool
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Description: PDQ Deploy Console
    SELECTION_4:
        Product: PDQ Deploy
    SELECTION_5:
        Company: PDQ.com
    SELECTION_6:
        OriginalFileName: PDQDeployConsole.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6))
falsepositives:
- Legitimate use
id: d679950c-abb7-43a6-80fb-2a480c4fc450
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1072/T1072.md
- https://www.pdq.com/pdq-deploy/
status: experimental
tags:
- attack.execution
- attack.lateral_movement
- attack.t1072

