title: Group Membership Reconnaissance Via Whoami.EXE
id: 4f9a9515-6240-4eb8-beb5-f86cb1f08036
related:
    - id: bd8b828d-0dca-48e1-8a63-8a58ecf2644f
      type: derived
status: test
description: Detects the execution of whoami.exe with the /group command line flag to show group membership for the current user, account type, security identifiers (SID), and attributes.
references:
    - https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/whoami
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-02-28
tags:
    - attack.discovery
    - attack.t1033
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \whoami.exe
        - OriginalFileName: whoami.exe
    selection_cli:
        CommandLine|contains:
            - ' /groups'
            - ' -groups'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
