
title: PsExec Service Execution with Different Name
ruletype: Sigma
author: FLorian Roth
date: 2022/07/21
description: Detects suspicious launch of the PSEXESVC service with a different service
  name, which is not often used by legitimate administrators
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    OriginalFileName: psexesvc.exe
  SELECTION_4:
    NewProcessName: C:\Windows\PSEXESVC.exe
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Legitimate administrative tasks
id: 51ae86a2-e2e1-4097-ad85-c46cb6851de4
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.youtube.com/watch?v=ro2QuZTIMBM
status: experimental
tags:
- attack.execution
