title: Potential Regsvr32 Commandline Flag Anomaly
id: 0b0db942-3c12-3469-b96f-420423d80dbb
related:
    - id: b236190c-1c61-41e9-84b3-3fe03f6d76b0
      type: derived
status: test
description: Detects a potential command line flag anomaly related to "regsvr32" in which the "/i" flag is used without the "/n" which should be uncommon.
references:
    - https://twitter.com/sbousseaden/status/1282441816986484737?s=12
author: Florian Roth (Nextron Systems)
date: 2019-07-13
modified: 2024-03-13
tags:
    - attack.defense-evasion
    - attack.t1218.010
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|windash: ' -i:'
        NewProcessName|endswith: \regsvr32.exe
    filter_main_flag:
        CommandLine|contains|windash: ' -n '
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Administrator typo might cause some false positives
level: medium
ruletype: Sigma
