title: Invoke-Obfuscation Via Stdin
id: e8fdfc6d-5256-c3f4-7858-a45724bce385
related:
    - id: 9c14c9fa-1a63-4a64-8e57-d19280559490
      type: derived
status: test
description: Detects Obfuscated Powershell via Stdin in Scripts
references:
    - https://github.com/SigmaHQ/sigma/issues/1009 # (Task28)
author: Nikita Nazarov, oscd.community
date: 2020-10-12
modified: 2024-04-16
tags:
    - attack.defense-evasion
    - attack.t1027
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|re: (?i)(set).*&&\s?set.*(environment|invoke|\$\{?input).*&&.*"
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
