title: Exchange PowerShell Snap-Ins Usage
ruletype: Sigma
author: FPT.EagleEye, Nasreddine Bencherchali (Nextron Systems)
date: 2021/03/03
description: Detects adding and using Exchange PowerShell snap-ins to export mailbox
    data. As seen used by HAFNIUM and APT27
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine: '*Add-PSSnapin*'
    SELECTION_6:
        CommandLine:
        - '*Microsoft.Exchange.Powershell.Snapin*'
        - '*Microsoft.Exchange.Management.PowerShell.SnapIn*'
    SELECTION_7:
        ParentProcessName: C:\Windows\System32\msiexec.exe
    SELECTION_8:
        CommandLine: '*$exitcode=0 $exserver=Get-ExchangeServer ([Environment]::MachineName)
            -ErrorVariable exerr*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 25676e10-2121-446e-80a4-71ff8506af47
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/14
references:
- https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities/
- https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers/
- https://www.intrinsec.com/apt27-analysis/
status: experimental
tags:
- attack.execution
- attack.t1059.001
- attack.collection
- attack.t1114

