title: Execution via WorkFolders.exe
id: f57976f9-310f-c36f-c17a-0efb253e7f94
related:
    - id: 0bbc6369-43e3-453d-9944-cae58821c173
      type: derived
status: test
description: Detects using WorkFolders.exe to execute an arbitrary control.exe
references:
    - https://twitter.com/elliotkillick/status/1449812843772227588
author: Maxime Thiebaut (@0xThiebaut)
date: 2021-10-21
modified: 2022-12-25
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \control.exe
        ParentProcessName|endswith: \WorkFolders.exe
    filter:
        NewProcessName: C:\Windows\System32\control.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Legitimate usage of the uncommon Windows Work Folders feature.
level: high
ruletype: Sigma
