title: New Firewall Rule Added Via Netsh.EXE
id: cd5cfd80-aa5f-44c0-9c20-108c4ae12e3c
status: test
description: Detects the addition of a new rule to the Windows firewall via netsh
references:
    - https://www.operationblockbuster.com/wp-content/uploads/2016/02/Operation-Blockbuster-RAT-and-Staging-Report.pdf
author: Markus Neis, Sander Wiebing
date: 2019/01/29
modified: 2023/02/10
tags:
    - attack.defense_evasion
    - attack.t1562.004
    - attack.s0246
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        -   NewProcessName|endswith: \netsh.exe
        -   OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - ' firewall '
            - ' add '
    filter_dropbox:
        CommandLine|contains:
            - \netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow
                "program=C:\Program Files (x86)\Dropbox\Client\Dropbox.exe" enable=yes
                profile=Any
            - \netsh.exe advfirewall firewall add rule name=Dropbox dir=in action=allow
                "program=C:\Program Files\Dropbox\Client\Dropbox.exe" enable=yes profile=Any
    filter_thor:
        CommandLine|contains: advfirewall firewall show rule name=all
        ParentProcessName|startswith: C:\Windows\Temp\asgard2-agent\
        ParentProcessName|endswith: \thor64.exe
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Legitimate administration activity
    - Software installations
level: medium
ruletype: Sigma
