title: Suspicious Reconnaissance Activity Using Get-LocalGroupMember Cmdlet
id: c8a180d6-47a3-4345-a609-53f9c3d834fc
related:
    -   id: cef24b90-dddc-4ae1-a09a-8764872f69fc
        type: similar
status: test
description: Detects suspicious reconnaissance command line activity on Windows systems
    using the PowerShell Get-LocalGroupMember Cmdlet
references:
    - https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/10
tags:
    - attack.discovery
    - attack.t1087.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_cmdlet:
        CommandLine|contains: 'Get-LocalGroupMember '
    selection_group:
        CommandLine|contains:
            - domain admins
            - ' administrator'
            - ' administrateur'
            - enterprise admins
            - Exchange Trusted Subsystem
            - Remote Desktop Users
            - "Utilisateurs du Bureau \xE0 distance"
            - Usuarios de escritorio remoto
    condition: process_creation and (all of selection_*)
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Administrative activity
level: medium
ruletype: Sigma
