title: Suspicious Command With Teams Objects Paths
id: d2eb17db-1d39-41dc-b57f-301f6512fa75
status: experimental
description: Detects an access to authentication tokens and accounts of Microsoft
    Teams desktop application.
references:
    - https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
    - https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens
author: '@SerkinValery'
date: 2022/09/16
modified: 2023/02/05
tags:
    - attack.credential_access
    - attack.t1528
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - \Microsoft\Teams\Cookies
            - \Microsoft\Teams\Local Storage\leveldb
    filter:
        NewProcessName|endswith: \Microsoft\Teams\current\Teams.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
