title: Winrar Compressing Dump Files
id: 4c7b96eb-1897-7935-762d-58700203bb94
status: experimental
description: Detects execution of WinRAR in order to compress a file with a ".dmp"/".dump" extension, which could be a step in a process of dump file exfiltration.
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
author: Florian Roth (Nextron Systems)
date: 2022/01/04
modified: 2023/09/12
tags:
    - attack.collection
    - attack.t1560.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \rar.exe
              - \winrar.exe
        - Description: Command line RAR
    selection_extension:
        CommandLine|contains:
            - .dmp
            - .dump
            - .hdmp
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate use of WinRAR with a command line in which ".dmp" or ".dump" appears accidentally
    - Legitimate use of WinRAR to compress WER ".dmp" files for troubleshooting
level: medium
ruletype: Sigma
