title: Suspicious Add Scheduled Command Pattern
id: f2c64357-b1d2-41b7-849f-34d2682c0fad
status: experimental
description: Detects suspicious scheduled task creations with commands that are uncommon
references:
    - https://app.any.run/tasks/512c1352-6380-4436-b27d-bb62f0c020d6/
author: Florian Roth (Nextron Systems)
date: 2022/02/23
modified: 2022/11/18
tags:
    - attack.execution
    - attack.t1053.005
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_schtasks:
        CommandLine|contains: '/Create '
        NewProcessName|endswith: \schtasks.exe
    selection_pattern1:
        CommandLine|contains:
            - '/sc minute '
            - '/ru system '
    selection_pattern2:
        CommandLine|contains:
            - 'cmd.exe /c '
            - cmd /c
            - 'cmd.exe /k '
            - cmd /k
            - 'cmd.exe /r '
            - cmd /r
    selection_rare:
        CommandLine|contains:
            - ' bypass '
            - .DownloadString
            - .DownloadFile
            - FromBase64String
            - ' -w hidden '
            - ' IEX'
            - ' -enc '
            - ' -decode '
            - '/c start /min '
            - ' curl '
    selection_anomaly:
        -   CommandLine|contains|all:
                - /xml C:\Users\
                - \AppData\Local\
        -   CommandLine|contains|all:
                - wscript.exe
                - \AppData\
    condition: process_creation and (selection_schtasks and ( all of selection_pattern*
        or selection_rare or selection_anomaly ))
falsepositives:
    - Software installers that run from temporary folders and also install scheduled
        tasks
level: high
ruletype: Sigma
