
title: Bypass UAC via Fodhelper.exe
ruletype: Sigma
author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
date: 2019/10/24
description: Identifies use of Fodhelper.exe to bypass User Account Control. Adversaries
  use this technique to execute privileged processes.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\fodhelper.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use of fodhelper.exe utility by legitimate user
fields:
- ComputerName
- User
- CommandLine
id: 7f741dcf-fc22-4759-87b4-9ae8376676a2
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://eqllib.readthedocs.io/en/latest/analytics/e491ce22-792f-11e9-8f5c-d46d6d62a49e.html
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1548.002/T1548.002.md
status: test
tags:
- attack.privilege_escalation
- attack.t1548.002
