title: Allow Service Access Using Security Descriptor Tampering Via Sc.EXE
id: 6c8fbee5-dee8-49bc-851d-c3142d02aa47
related:
    -   id: a537cfc3-4297-4789-92b5-345bfd845ad0
        type: similar
status: experimental
description: Detects suspicious DACL modifications to allow access to a service from
    a suspicious trustee. This can be used to override access restrictions set by
    previous ACLs.
references:
    - https://twitter.com/0gtweet/status/1628720819537936386
    - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
    - https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/28
tags:
    - attack.persistence
    - attack.t1543.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_sc:
        -   NewProcessName|endswith: \sc.exe
        -   OriginalFileName: sc.exe
    selection_sdset:
        CommandLine|contains|all:
            - sdset
            - A;
    selection_trustee:
        CommandLine|contains:
            - ;IU
            - ;SU
            - ;BA
            - ;SY
            - ;WD
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
