title: Always Install Elevated Windows Installer
id: cd951fdc-4b2f-47f5-ba99-a33bf61e3770
status: test
description: Detects Windows Installer service (msiexec.exe) trying to install MSI packages with SYSTEM privilege
references:
    - https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-48-638.jpg
author: Teymur Kheirkhabarov (idea), Mangatas Tondang (rule), oscd.community
date: 2020/10/13
modified: 2023/03/23
tags:
    - attack.privilege_escalation
    - attack.t1548.002
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_user:
        SubjectUserName|contains: # covers many language settings
            - AUTHORI
            - AUTORI
    selection_image_1:
        NewProcessName|contains|all:
            - \Windows\Installer\
            - msi
        NewProcessName|endswith: tmp
    selection_image_2:
        NewProcessName|endswith: \msiexec.exe
        MandatoryLabel: S-1-16-16384
    filter_installer:
        ParentProcessName: C:\Windows\System32\services.exe
    filter_repair:
        - CommandLine|endswith: \system32\msiexec.exe /V   # ignore "repair option"
        - ParentCommandLine|endswith: \system32\msiexec.exe /V   # ignore "repair option"
    filter_sophos:
        ParentProcessName|startswith: C:\ProgramData\Sophos\
    filter_avira:
        ParentProcessName|startswith: C:\ProgramData\Avira\
    filter_avast:
        ParentProcessName|startswith:
            - C:\Program Files\Avast Software\
            - C:\Program Files (x86)\Avast Software\
    filter_google_update:
        ParentProcessName|startswith:
            - C:\Program Files\Google\Update\
            - C:\Program Files (x86)\Google\Update\
    condition: process_creation and (1 of selection_image_* and selection_user and not 1 of filter_*)
falsepositives:
    - System administrator usage
    - Anti virus products
    - WindowsApps located in "C:\Program Files\WindowsApps\"
level: medium
ruletype: Sigma
