title: Use of VSIISExeLauncher.exe
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/09
description: The "VSIISExeLauncher.exe" binary part of the Visual Studio/VS Code can
    be used to execute arbitrary binaries
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\VSIISExeLauncher.exe'
    SELECTION_4:
        OriginalFileName: VSIISExeLauncher.exe
    SELECTION_5:
        CommandLine:
        - '* -p *'
        - '* -a *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 18749301-f1c5-4efc-a4c3-276ff1f5b6f8
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/VSIISExeLauncher/
status: experimental
tags:
- attack.defense_evasion
- attack.t1127

