title: Potential Privilege Escalation To LOCAL SYSTEM
id: 207b0396-3689-42d9-8399-4222658efc99
related:
    - id: 8834e2f7-6b4b-4f09-8906-d2276470ee23 # PsExec specific rule
      type: similar
status: test
description: Detects unknown program using commandline flags usually used by tools such as PsExec and PAExec to start programs with SYSTEM Privileges
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.poweradmin.com/paexec/
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2021/05/22
modified: 2024/03/05
tags:
    - attack.resource_development
    - attack.t1587.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        # Escalation to LOCAL_SYSTEM
        CommandLine|contains:
            - ' -s pwsh'
            - ' /i /s pwsh'
            - ' /s /i powershell'
            - ' /s pwsh'
            - ' -s cmd'
            - ' /s powershell'
            - ' -s -i cmd'
            - ' -i -s powershell'
            - ' -i -s cmd'
            - ' -s powershell'
            - ' /s /i pwsh'
            - ' /i /s cmd'
            - ' -i -s pwsh'
            - ' -s -i pwsh'
            - ' /s /i cmd'
            - ' /s cmd'
            - ' /i /s powershell'
            - ' -s -i powershell'
    filter_main_exclude_coverage:
        # This filter exclude strings covered by 8834e2f7-6b4b-4f09-8906-d2276470ee23
        CommandLine|contains:
            - paexec
            - PsExec
            - accepteula
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Weird admins that rename their tools
    - Software companies that bundle PsExec/PAExec with their software and rename it, so that it is less embarrassing
level: high
ruletype: Sigma
