title: Discover Private Keys
ruletype: Sigma
author: frack113
date: 2021/07/20
description: Adversaries may search for private key certificate files on compromised
    systems for insecurely stored credential
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*dir *'
        - '*findstr *'
    SELECTION_4:
        CommandLine:
        - '*.key*'
        - '*.pgp*'
        - '*.gpg*'
        - '*.ppk*'
        - '*.p12*'
        - '*.pem*'
        - '*.pfx*'
        - '*.cer*'
        - '*.p7b*'
        - '*.asc*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 213d6a77-3d55-4ce8-ba74-fcfef741974e
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.004/T1552.004.md
status: experimental
tags:
- attack.credential_access
- attack.t1552.004

