title: Suspicious aspnet_compiler.exe Execution
ruletype: Sigma
author: frack113
date: 2021/11/24
description: Execute C# code with the Build Provider and proper folder structure in
    place.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*C:\Windows\Microsoft.NET\Framework*'
    SELECTION_4:
        NewProcessName: '*aspnet_compiler.exe*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: a01b8329-5953-4f73-ae2d-aa01e1f35f00
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
status: experimental
tags:
- attack.defense_evasion
- attack.t1127

