title: Root Certificate Installed
ruletype: Sigma
author: oscd.community, @redcanary, Zach Stanford @svch0st
date: 2020/10/10
description: Adversaries may install a root certificate on a compromised system to
    avoid warnings when connecting to adversary controlled web servers.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\certutil.exe'
    SELECTION_4:
        CommandLine: '*-addstore*'
    SELECTION_5:
        CommandLine: '*root*'
    SELECTION_6:
        NewProcessName: '*\CertMgr.exe'
    SELECTION_7:
        CommandLine: '*/add*'
    SELECTION_8:
        CommandLine: '*root*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Help Desk or IT may need to manually add a corporate Root CA on occasion. Need to
    test if GPO push doesn't trigger FP
id: 46591fae-7a4c-46ea-aec3-dff5e6d785dc
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1553.004/T1553.004.md
related:
-   id: 42821614-9264-4761-acfc-5772c3286f76
    type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1553.004

