title: Whoami.EXE Execution From Privileged Process
id: b78e620c-3115-0c6d-ea3e-4ad5d55c1217
related:
    - id: 80167ada-7a12-41ed-b8e9-aa47195c66a1
      type: obsolete
    - id: 79ce34ca-af29-4d0e-b832-fc1b377020db
      type: derived
status: test
description: Detects the execution of "whoami.exe" by privileged accounts that are often abused by threat actors
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
    - https://web.archive.org/web/20221019044836/https://nsudo.m2team.org/en-us/
author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov
date: 2022-01-28
modified: 2023-12-04
tags:
    - attack.privilege-escalation
    - attack.discovery
    - attack.t1033
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName: whoami.exe
        - NewProcessName|endswith: \whoami.exe
    selection_user:
        SubjectUserName|contains:
            - AUTHORI
            - AUTORI
            - TrustedInstaller
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
