
title: Suspicious MsiExec Embedding Parent
ruletype: Sigma
author: frack113
date: 2022/04/16
description: Adversaries may abuse msiexec.exe to proxy the execution of malicious
  payloads
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName:
    - '*\powershell.exe'
    - '*\cmd.exe'
  SELECTION_4:
    ParentCommandLine: '*MsiExec.exe*'
  SELECTION_5:
    ParentCommandLine: '*-Embedding *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 4a2a2c3e-209f-4d01-b513-4155a540b469
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
status: experimental
tags:
- attack.t1218.007
- attack.defense_evasion
