title: Rundll32 UNC Path Execution
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/10
description: Detects rundll32 execution where the DLL is located on a remote location
    (share)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\rundll32.exe'
    SELECTION_4:
        OriginalFileName: RUNDLL32.EXE
    SELECTION_5:
        CommandLine: '*rundll32*'
    SELECTION_6:
        CommandLine: '* \\\\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and SELECTION_6)
falsepositives:
- Unlikely
id: 5cdb711b-5740-4fb2-ba88-f7945027afac
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.cybereason.com/blog/rundll32-the-infamous-proxy-for-executing-malicious-code
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1021.002
- attack.t1218.011

