title: PowerShell Download and Execution Cradles
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/03/24
description: Detects PowerShell download and execution cradles.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*.DownloadString(*'
        - '*.DownloadFile(*'
        - '*Invoke-WebRequest *'
        - '*iwr *'
    SELECTION_4:
        CommandLine:
        - '*;iex $*'
        - '*| IEX*'
        - '*|IEX *'
        - '*I`E`X*'
        - '*I`EX*'
        - '*IE`X*'
        - '*iex *'
        - '*IEX (*'
        - '*IEX(*'
        - '*Invoke-Expression*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Some PowerShell installers were seen using similar combinations. Apply filters accordingly
id: 85b0b087-eddf-4a2b-b033-d771fa2b9775
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/05/04
references:
- https://github.com/VirtualAlllocEx/Payload-Download-Cradles/blob/88e8eca34464a547c90d9140d70e9866dcbc6a12/Download-Cradles.cmd
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
status: experimental
tags:
- attack.execution
- attack.t1059

