title: Suspicious Csi.exe Usage
id: 655cb0fd-79c4-949b-b842-e1fcf2e1e527
related:
    - id: 40b95d31-1afc-469e-8d34-9a3a667d058e
      type: derived
status: test
description: Csi.exe is a signed binary from Microsoft that comes with Visual Studio and provides C# interactive capabilities. It can be used to run C# code from a file passed as a parameter in command line. Early version of this utility provided with Microsoft “Roslyn” Community Technology Preview was named 'rcsi.exe'
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Rcsi/
    - https://enigma0x3.net/2016/11/21/bypassing-application-whitelisting-by-using-rcsi-exe/
    - https://twitter.com/Z3Jpa29z/status/1317545798981324801
author: Konstantin Grishchenko, oscd.community
date: 2020-10-17
modified: 2022-07-11
tags:
    - attack.execution
    - attack.t1072
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \csi.exe
              - \rcsi.exe
        - OriginalFileName:
              - csi.exe
              - rcsi.exe
    selection_cli:
        Company: Microsoft Corporation
    condition: process_creation and (all of selection*)
fields:
    - SubjectUserName
    - ComputerName
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate usage by software developers
level: medium
ruletype: Sigma
