title: Uninstall Sysinternals Sysmon
id: e1344b7a-c6ce-4117-4e54-c1865cba57df
related:
    - id: 6a5f68d1-c4b5-46b9-94ee-5324892ea939
      type: derived
status: test
description: Detects the removal of Sysmon, which could be a potential attempt at defense evasion
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-11---uninstall-sysmon
author: frack113
date: 2022-01-12
modified: 2024-03-13
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_pe:
        - NewProcessName|endswith:
              - \Sysmon64.exe
              - \Sysmon.exe
        - Description: System activity monitor
    selection_cli:
        CommandLine|contains|windash: -u
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate administrators might use this command to remove Sysmon for debugging purposes
level: high
ruletype: Sigma
