title: DriverQuery.EXE Usage
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/19
description: Detect usage of the "driverquery" utility. Which can be used to perform
    reconnaissance on installed drivers
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*driverquery.exe'
    SELECTION_4:
        OriginalFileName: drvqry.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use by third party tools in order to investigate installed drivers
id: a20def93-0709-4eae-9bd2-31206e21e6b2
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
- https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/
- https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html
related:
-   id: 9fc3072c-dc8f-4bf7-b231-18950000fadd
    type: similar
status: experimental
tags:
- attack.discovery

