title: Potential DLL File Download Via PowerShell Invoke-WebRequest
id: 7b1d6a26-339a-db21-8b7d-55f848967cdd
related:
    - id: 0f0450f3-8b47-441e-a31b-15a91dc243e2
      type: derived
status: test
description: Detects potential DLL files being downloaded using the PowerShell Invoke-WebRequest or Invoke-RestMethod cmdlets.
references:
    - https://www.zscaler.com/blogs/security-research/onenote-growing-threat-malware-distribution
author: Florian Roth (Nextron Systems), Hieu Tran
date: 2023-03-13
modified: 2025-07-18
tags:
    - attack.command-and-control
    - attack.execution
    - attack.t1059.001
    - attack.t1105
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - 'Invoke-RestMethod '
            - 'Invoke-WebRequest '
            - 'IRM '
            - 'IWR '
        CommandLine|contains|all:
            - http
            - OutFile
            - .dll
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
