title: Tap Installer Execution
ruletype: Sigma
author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
    using tunneling techniques
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\tapinstall.exe'
    SELECTION_4:
        NewProcessName:
        - C:\Program Files\Avast Software\SecureLine VPN\tapinstall.exe
        - C:\Program Files (x86)\Avast Software\SecureLine VPN\tapinstall.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- Legitimate OpenVPN TAP insntallation
id: 99793437-3e16-439b-be0f-078782cf953d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/08/10
status: test
tags:
- attack.exfiltration
- attack.t1048

