title: CMD Shell Output Redirect
ruletype: Sigma
author: frack113
date: 2022/01/22
description: Detects the use of the redirection character ">" to redicrect information
    in commandline
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: Cmd.Exe
    SELECTION_4:
        NewProcessName: '*\cmd.exe'
    SELECTION_5:
        CommandLine: '*>*'
    SELECTION_6:
        CommandLine:
        - '*C:\Program Files (x86)\Internet Download Manager\IDMMsgHost.exe*'
        - '*chrome-extension://*'
        - '*\\.\pipe\chrome.nativeMessaging*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6)))
falsepositives:
- Internet Download Manager extensions use named pipes and redirection via CLI. Filter
    it out if you use it in your environment
id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/03/07
references:
- https://ss64.com/nt/syntax-redirection.html
related:
-   id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
    type: similar
status: experimental
tags:
- attack.discovery
- attack.t1082

