title: Suspicious CustomShellHost Execution
id: 5f438a3c-3bd7-d256-61ad-9ae6334543ec
related:
    - id: 84b14121-9d14-416e-800b-f3b829c5a14d
      type: derived
status: test
description: |
    Detects the execution of CustomShellHost.exe where the child isn't located in 'C:\Windows\explorer.exe'. CustomShellHost is a known LOLBin that can be abused by attackers for defense evasion techniques.
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/180
    - https://lolbas-project.github.io/lolbas/Binaries/CustomShellHost/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
modified: 2025-10-29
tags:
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \CustomShellHost.exe
    filter_main_explorer:
        NewProcessName: C:\Windows\explorer.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - False positives are unlikely, investigate matches carefully.
level: high
ruletype: Sigma
