title: Ilasm Lolbin Use Compile C-Sharp
ruletype: Sigma
author: frack113
date: 2022/05/07
description: Detect use of Ilasm.exe to compile c# code into dll or exe.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\ilasm.exe'
    SELECTION_4:
        OriginalFileName: ilasm.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: 850d55f9-6eeb-4492-ad69-a72338f65ba4
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/05/16
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ilasm/
- https://www.echotrail.io/insights/search/ilasm.exe
status: experimental
tags:
- attack.defense_evasion
- attack.t1127

