title: PowerShell Base64 Encoded IEX Keyword
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2019/08/23
description: Detects usage of a base64 encoded "IEX" string in a process command line
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine|base64offset|contains:
        - IEX ([
        - iex ([
        - iex (New
        - IEX (New
        - IEX([
        - iex([
        - iex(New
        - IEX(New
        - IEX(('
        - iex(('
    SELECTION_4:
        CommandLine:
        - '*SQBFAFgAIAAoAFsA*'
        - '*kARQBYACAAKABbA*'
        - '*JAEUAWAAgACgAWw*'
        - '*aQBlAHgAIAAoAFsA*'
        - '*kAZQB4ACAAKABbA*'
        - '*pAGUAeAAgACgAWw*'
        - '*aQBlAHgAIAAoAE4AZQB3A*'
        - '*kAZQB4ACAAKABOAGUAdw*'
        - '*pAGUAeAAgACgATgBlAHcA*'
        - '*SQBFAFgAIAAoAE4AZQB3A*'
        - '*kARQBYACAAKABOAGUAdw*'
        - '*JAEUAWAAgACgATgBlAHcA*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 88f680b8-070e-402c-ae11-d2914f2257f1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/18
status: test
tags:
- attack.execution
- attack.t1059.001

