title: New DNS ServerLevelPluginDll Installed Via Dnscmd.EXE
id: 125653c0-b2ab-c23a-d7aa-6a45f2add313
status: test
description: Detects the installation of a DNS plugin DLL via ServerLevelPluginDll parameter in registry, which can be used to execute code in context of the DNS server (restart required)
references:
    - https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
    - https://blog.3or.de/hunting-dns-server-level-plugin-dll-injection.html
author: Florian Roth (Nextron Systems)
date: 2017/05/08
modified: 2023/02/05
tags:
    - attack.defense_evasion
    - attack.t1574.002
    - attack.t1112
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - /config
            - /serverlevelplugindll
        NewProcessName|endswith: \dnscmd.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
