title: Detection of PowerShell Execution via Sqlps.exe
id: 550c629f-0dc6-83a7-efce-0afef9c45e4c
related:
    - id: 0152550d-3a26-4efd-9f0e-54a0b28ae2f3
      type: derived
status: test
description: |
    This rule detects execution of a PowerShell code through the sqlps.exe utility, which is included in the standard set of utilities supplied with the MSSQL Server.
    Script blocks are not logged in this case, so this utility helps to bypass protection mechanisms based on the analysis of these logs.
references:
    - https://learn.microsoft.com/en-us/sql/tools/sqlps-utility?view=sql-server-ver15
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqlps/
    - https://twitter.com/bryon_/status/975835709587075072
author: Agro (@agro_sev) oscd.community
date: 2020-10-10
modified: 2022-12-09
tags:
    - attack.execution
    - attack.t1059.001
    - attack.defense-evasion
    - attack.t1127
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \sqlps.exe
    selection_image:
        - NewProcessName|endswith: \sqlps.exe
        - OriginalFileName: sqlps.exe
    filter_image:
        ParentProcessName|endswith: \sqlagent.exe
    condition: process_creation and (selection_parent or (selection_image and not filter_image))
falsepositives:
    - Direct PS command execution through SQLPS.exe is uncommon, childprocess sqlps.exe spawned by sqlagent.exe is a legitimate action.
level: medium
ruletype: Sigma
