title: Uncommon Child Process Of AddinUtil.EXE
id: 3e94a11b-52b5-7f93-d623-5ba15ab8f4aa
related:
    - id: b5746143-59d6-4603-8d06-acbd60e166ee
      type: derived
status: test
description: |
    Detects uncommon child processes of the Add-In deployment cache updating utility (AddInutil.exe) which could be a sign of potential abuse of the binary to proxy execution via a custom Addins.Store payload.
references:
    - https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
date: 2023-09-18
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \addinutil.exe
    filter_main_werfault:
        NewProcessName|endswith:
            - :\Windows\System32\conhost.exe
            - :\Windows\System32\werfault.exe
            - :\Windows\SysWOW64\werfault.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
