title: Renamed SysInternals DebugView Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2020/05/28
description: Detects suspicious renamed SysInternals DebugView execution
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Product: Sysinternals DebugView
    SELECTION_4:
        OriginalFileName: Dbgview.exe
    SELECTION_5:
        NewProcessName: '*\Dbgview.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4
        and SELECTION_5))
falsepositives:
- Unknown
id: cd764533-2e07-40d6-a718-cfeec7f2da7f
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/14
references:
- https://www.epicturla.com/blog/sysinturla
status: test
tags:
- attack.resource_development
- attack.t1588.002

