
title: Suspicious IIS Module Registration
ruletype: Sigma
author: Florian Roth (rule), Microsoft (idea)
date: 2022/08/04
description: Detects a suspicious IIS module registration as described in Microsoft
  threat report on IIS backdoors
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*appcmd.exe add module*'
  SELECTION_4:
    ParentProcessName: '*\w3wp.exe'
  SELECTION_5:
    CommandLine: '* system.enterpriseservices.internal.publish*'
  SELECTION_6:
    ParentProcessName: '*\w3wp.exe'
  SELECTION_7:
    NewProcessName: '*\powershell.exe'
  SELECTION_8:
    CommandLine: '* \\gacutil.exe /I*'
  SELECTION_9:
    ParentProcessName: '*\w3wp.exe'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    (SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)))
falsepositives:
- Administrative activity
id: 043c4b8b-3a54-4780-9682-081cb6b8185c
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
status: test
