title: Uncommon One Time Only Scheduled Task At 00:00
ruletype: Sigma
author: pH-T (Nextron Systems)
date: 2022/07/15
description: Detects scheduled task creation events that include suspicious actions,
    and is run once at 00:00
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\schtasks.exe*'
    SELECTION_4:
        OriginalFileName: schtasks.exe
    SELECTION_5:
        CommandLine:
        - '*wscript*'
        - '*vbscript*'
        - '*cscript*'
        - '*wmic *'
        - '*wmic.exe*'
        - '*regsvr32.exe*'
        - '*powershell*'
        - '*\AppData\\*'
    SELECTION_6:
        CommandLine: '*once*'
    SELECTION_7:
        CommandLine: '*00:00*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and (SELECTION_6 and SELECTION_7))
falsepositives:
- Software installation
id: 970823b7-273b-460a-8afc-3a6811998529
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
status: experimental

