title: Sysinternals PsSuspend Suspicious Execution
id: 9bfa1ffb-5b30-0951-fa5a-9746a98f1a6a
status: test
description: Detects suspicious execution of Sysinternals PsSuspend, where the utility is used to suspend critical processes such as AV or EDR to bypass defenses
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/pssuspend
    - https://twitter.com/0gtweet/status/1638069413717975046
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/23
tags:
    - attack.defense_evasion
    - attack.t1562.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName: pssuspend.exe
        - NewProcessName|endswith:
              - \pssuspend.exe
              - \pssuspend64.exe
    selection_cli:
        # Add more interesting/critical processes
        CommandLine|contains: msmpeng.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
