title: Mavinject Inject DLL Into Running Process
ruletype: Sigma
author: frack113, Florian Roth
date: 2021/07/12
description: Detects process injection using the signed Windows tool "Mavinject" via
    the "INJECTRUNNING" flag or a renamed execution of the tool
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '* /INJECTRUNNING *'
    SELECTION_4:
        OriginalFileName:
        - mavinject32.exe
        - mavinject64.exe
    SELECTION_5:
        NewProcessName:
        - '*\mavinject32.exe'
        - '*\mavinject64.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and  not
        (SELECTION_5))))
falsepositives:
- Unlikely
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 4f73421b-5a0b-4bbf-a892-5a7fb99bea66
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/07
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.004/T1056.004.md
- https://posts.specterops.io/mavinject-exe-functionality-deconstructed-c29ab2cf5c0e
- https://twitter.com/gN3mes1s/status/941315826107510784
- https://reaqta.com/2017/12/mavinject-microsoft-injector/
- https://twitter.com/Hexacorn/status/776122138063409152
related:
-   id: 17eb8e57-9983-420d-ad8a-2c4976c22eb8
    type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055.001
- attack.t1218.013

