title: Potential CommandLine Path Traversal Via Cmd.EXE
ruletype: Sigma
author: xknow @xknow_infosec, Tim Shelton
date: 2020/06/11
description: Detects potential path traversal attempt via cmd.exe. Could indicate
    possible command/argument confusion/hijacking
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*\Tasktop\keycloak\bin\/../../jre\bin\java*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\cmd.exe'
    SELECTION_4:
        NewProcessName: '*\cmd.exe'
    SELECTION_5:
        OriginalFileName: cmd.exe
    SELECTION_6:
        ParentCommandLine:
        - '*/c*'
        - '*/k*'
        - '*/r*'
    SELECTION_7:
        CommandLine:
        - '*/c*'
        - '*/k*'
        - '*/r*'
    SELECTION_8:
        ParentCommandLine: /../../
    SELECTION_9:
        CommandLine: '*/../../*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4 or
        SELECTION_5) and (SELECTION_6 or SELECTION_7) and (SELECTION_8 or SELECTION_9))
        and  not ((SELECTION_10)))
falsepositives:
- Java tools are known to produce false-positive when loading libraries
id: 087790e3-3287-436c-bccf-cbd0184a7db1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/06
references:
- https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/
- https://twitter.com/Oddvarmoe/status/1270633613449723905
status: test
tags:
- attack.execution
- attack.t1059.003

