title: Potential Binary Proxy Execution Via Cdb.EXE
id: 67e63fd2-26a0-1961-477b-8f6b517ae20b
related:
    - id: b5c7395f-e501-4a08-94d4-57fe7a9da9d2
      type: derived
status: test
description: Detects usage of "cdb.exe" to launch arbitrary processes or commands from a debugger script file
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Cdb/
    - https://web.archive.org/web/20170715043507/http://www.exploit-monday.com/2016/08/windbg-cdb-shellcode-runner.html
    - https://twitter.com/nas_bench/status/1534957360032120833
author: Beyu Denis, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: 2019-10-26
modified: 2024-04-22
tags:
    - attack.execution
    - attack.t1106
    - attack.defense-evasion
    - attack.t1218
    - attack.t1127
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \cdb.exe
        - OriginalFileName: CDB.Exe
    selection_cli:
        CommandLine|contains:
            - ' -c ' # Using a debugger script
            - ' -cf '
    condition: process_creation and (all of selection*)
falsepositives:
    - Legitimate use of debugging tools
level: medium
ruletype: Sigma
