title: MpiExec Lolbin
ruletype: Sigma
author: Florian Roth
date: 2022/01/11
description: Detects a certain command line flag combination used by mpiexec.exe LOLBIN
    from HPC pack that can be used to execute any other binary
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\mpiexec.exe'
    SELECTION_4:
        Imphash: d8b52ef6aaa3a81501bdfff9dbb96217
    SELECTION_5:
        Hashes: '*IMPHASH=d8b52ef6aaa3a81501bdfff9dbb96217*'
    SELECTION_6:
        CommandLine:
        - '* /n 1 *'
        - '* -n 1 *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and SELECTION_6)
falsepositives:
- Unknown
id: 729ce0ea-5d8f-4769-9762-e35de441586d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/03/04
references:
- https://twitter.com/mrd0x/status/1465058133303246867
- https://docs.microsoft.com/en-us/powershell/high-performance-computing/mpiexec?view=hpc19-ps
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218

