title: Suspicious Calculator Usage
ruletype: Sigma
author: Florian Roth
date: 2019/02/09
description: Detects suspicious use of 'calc.exe' with command line parameters or
    in a suspicious directory, which is likely caused by some PoC or detection evasion
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*\calc.exe *'
    SELECTION_4:
        NewProcessName: '*\calc.exe'
    SELECTION_5:
        NewProcessName:
        - C:\Windows\System32\\*
        - C:\Windows\SysWOW64\\*
        - C:\Windows\WinSxS\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: 737e618a-a410-49b5-bec3-9e55ff7fbc15
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/04
references:
- https://twitter.com/ItsReallyNick/status/1094080242686312448
status: test
tags:
- attack.defense_evasion
- attack.t1036

