title: Suspicious Elevated System Shell
id: 178e615d-e666-498b-9630-9ed363038101
status: experimental
description: Detects when a shell program such as the Windows command prompt or PowerShell
    is launched with system privileges.
references:
    - https://github.com/Wh04m1001/SysmonEoP
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
modified: 2023/09/12
tags:
    - attack.privilege_escalation
    - attack.defense_evasion
    - attack.execution
    - attack.t1059
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_shell:
        -   NewProcessName|endswith:
                - \powershell.exe
                - \pwsh.exe
                - \cmd.exe
        -   OriginalFileName:
                - PowerShell.EXE
                - pwsh.dll
                - Cmd.Exe
    selection_user:
        SubjectUserName|contains:
            - AUTHORI
            - AUTORI
        SubjectLogonId: '0x3e7'
    filter_generic:
        ParentProcessName|startswith:
            - C:\Windows\System32\
            - C:\Program Files (x86)\
            - C:\Program Files\
        NewProcessName|endswith:
            - \cmd.exe
            - \powershell.exe
    filter_manageengine:
        ParentProcessName: C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
        NewProcessName|endswith: \cmd.exe
    filter_citrix:
        ParentProcessName|startswith: C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\
        ParentProcessName|endswith: \CitrixReceiverUpdater.exe
        NewProcessName|endswith: \cmd.exe
    filter_asgard:
        CommandLine|startswith: C:\WINDOWS\system32\cmd.exe /c "
        CurrentDirectory|contains: C:\WINDOWS\Temp\asgard2-agent\
    filter_dell_update:
        ParentCommandLine|contains: C:\ProgramData\Dell\UpdateService\
        ParentProcessName|startswith: C:\Windows\Temp
        ParentProcessName|endswith: \invcol.exe
        NewProcessName|endswith: \cmd.exe
    filter_compattelrunner:
        ParentCommandLine|startswith: C:\Windows\system32\CompatTelRunner.exe -m:appraiser.dll
            -f:DoScheduledTelemetryRun
        ParentProcessName|startswith: C:\Windows\WinSxS\
        ParentProcessName|endswith: \CompatTelRunner.exe
    filter_ibm_spectrumprotect:
        CommandLine|contains: C:\IBM\SpectrumProtect\webserver\scripts\
        ParentProcessName|startswith: C:\IBM\SpectrumProtect\webserver\scripts\
    filter_msiexec:
        ParentCommandLine|startswith: C:\Windows\syswow64\MsiExec.exe -Embedding
        CommandLine|contains: \RegisterMicrosoftUpdate.ps1
        ParentProcessName: C:\Windows\SysWOW64\msiexec.exe
    filter_empty_parent_1a:
        CommandLine: 'powershell.exe -ExecutionPolicy Restricted -Command Write-Host
            ''Final result: 1'';'
    filter_empty_parent_2b:
        CommandLine|startswith: powershell.exe -ExecutionPolicy Restricted -Command
            $Res = 0;
        CommandLine|endswith: Write-Host 'Final result:', $Res;
    filter_empty_parent_2:
        CommandLine|contains: /d /c C:\Windows\system32\silcollector.cmd
        NewProcessName|endswith: \cmd.exe
    filter_empty_parent_3:
        CommandLine|endswith:
            - cmd.exe /c btool server list replication_port --no-log
            - cmd.exe /c btool server list general --no-log
        NewProcessName|endswith: \cmd.exe
    filter_empty_parent_4:
        CommandLine|contains: C:\Windows\system32\reg.exe query hklm\software\microsoft\windows\softwareinventorylogging
            /v collectionstate /reg:64
        NewProcessName|endswith: \cmd.exe
    filter_empty_parent_5:
        CommandLine: C:\Windows\system32\cmd.exe /c PAUSE
        NewProcessName: C:\Windows\System32\cmd.exe
    filter_empty_parent_6:
        CommandLine|contains: powershell.exe -ExecutionPolicy Restricted -Command
            $Res = 0;
        CommandLine|endswith: '{ $Res = 1; break; } } Write-Host ''Final result:'',
            $Res;'
        NewProcessName|endswith: \powershell.exe
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
