title: Exports Registry Key To a File
ruletype: Sigma
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/07
description: Detects the export of the target Registry key to a file.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\regedit.exe'
    SELECTION_4:
        OriginalFileName: REGEDIT.EXE
    SELECTION_5:
        CommandLine:
        - '* /E *'
        - '* -E *'
    SELECTION_6:
        CommandLine:
        - '*hklm*'
        - '*hkey_local_machine*'
    SELECTION_7:
        CommandLine:
        - '*\system'
        - '*\sam'
        - '*\security'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6) and (SELECTION_7)))
falsepositives:
- Legitimate export of keys
fields:
- ParentImage
- CommandLine
id: f0e53e89-8d22-46ea-9db5-9d4796ee2f8a
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
related:
-   id: 82880171-b475-4201-b811-e9c826cd5eaa
    type: similar
status: test
tags:
- attack.exfiltration
- attack.t1012

