title: Suspicious File Downloaded From File-Sharing Website Via Certutil.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/15
description: Detects the execution of certutil with certain flags that allow the utility
    to download files from file-sharing websites.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\certutil.exe'
    SELECTION_4:
        OriginalFileName: CertUtil.exe
    SELECTION_5:
        CommandLine:
        - '*urlcache *'
        - '*verifyctl *'
    SELECTION_6:
        CommandLine:
        - '*.ghostbin.co/*'
        - '*.hastebin.com*'
        - '*.paste.ee*'
        - '*anonfiles.com*'
        - '*cdn.discordapp.com/attachments/*'
        - '*ddns.net*'
        - '*gist.githubusercontent.com*'
        - '*mediafire.com*'
        - '*mega.nz*'
        - '*paste.ee*'
        - '*pastebin.com*'
        - '*pastebin.pl*'
        - '*pastetext.net*'
        - '*privatlab.com*'
        - '*privatlab.net*'
        - '*raw.githubusercontent.com*'
        - '*send.exploit.in*'
        - '*sendspace.com*'
        - '*storage.googleapis.com*'
        - '*transfer.sh*'
        - '*ufile.io*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Unknown
id: 42a5f1e7-9603-4f6d-97ae-3f37d130d794
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
- https://forensicitguy.github.io/agenttesla-vba-certutil-download/
- https://news.sophos.com/en-us/2021/04/13/compromised-exchange-server-hosting-cryptojacker-targeting-other-exchange-servers/
- https://twitter.com/egre55/status/1087685529016193025
- https://lolbas-project.github.io/lolbas/Binaries/Certutil/
related:
-   id: 19b08b1c-861d-4e75-a1ef-ea0c1baf202b
    type: similar
-   id: 13e6fe51-d478-4c7e-b0f2-6da9b400a829
    type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1027

