title: Execution via Diskshadow.exe
id: 0c2f8629-7129-4a8a-9897-7e0768f13ff2
status: test
description: Detects using Diskshadow.exe to execute arbitrary code in text file
references:
    - https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
    - https://www.ired.team/offensive-security/credential-access-and-credential-dumping/ntds.dit-enumeration
author: Ivan Dyachkov, oscd.community
date: 2020/10/07
modified: 2021/11/27
tags:
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - /s
            - -s
        NewProcessName|endswith: \diskshadow.exe
    condition: process_creation and selection
fields:
    - CommandLine
falsepositives:
    - False postitve can be if administrators use diskshadow tool in their infrastructure
        as a main backup tool with scripts.
level: high
ruletype: Sigma
