title: Suspicious NT Resource Kit Auditpol Usage
ruletype: Sigma
author: Nasreddine Bencherchali @nas_bench
date: 2021/12/18
description: 'Threat actors can use an older version of the auditpol binary available
    inside the NT resource kit to change audit policy configuration to impair detection
    capability.

    This can be carried out by selectively disabling/removing certain audit policies
    as well as restoring a custom policy owned by the threat actor.

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*/logon:none*'
        - '*/system:none*'
        - '*/sam:none*'
        - '*/privilege:none*'
        - '*/object:none*'
        - '*/process:none*'
        - '*/policy:none*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: c6c56ada-612b-42d1-9a29-adad3c5c2c1e
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Windows%202000%20Resource%20Kit%20Tools/AuditPol
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002

