title: Potentially Suspicious Execution Of Regasm/Regsvcs With Uncommon Extension
id: ba17b43d-ff78-598e-3e48-6f7f77abce52
status: test
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities with an uncommon extension.
references:
    - https://www.fortiguard.com/threat-signal-report/4718?s=09
    - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
    - https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/13
tags:
    - attack.defense_evasion
    - attack.t1218.009
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \Regsvcs.exe
              - \Regasm.exe
        - OriginalFileName:
              - RegSvcs.exe
              - RegAsm.exe
    selection_extension:
        CommandLine|contains:
            # Note: Add more potentially uncommon extensions
            - .dat
            - .gif
            - .jpeg
            - .jpg
            - .png
            - .txt
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
