title: Cloudflared Portable Execution
id: c757a371-d2db-6f87-21a1-9951c4a5e35a
related:
    - id: fadb84f0-4e84-4f6d-a1ce-9ef2bffb6ccd
      type: derived
status: test
description: |
    Detects the execution of the "cloudflared" binary from a non standard location.
references:
    - https://developers.cloudflare.com/cloudflare-one/connections/connect-networks/do-more-with-tunnels/trycloudflare/
    - https://github.com/cloudflare/cloudflared
    - https://www.intrinsec.com/akira_ransomware/
    - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
    - https://github.com/cloudflare/cloudflared/releases
author: Nasreddine Bencherchali (Nextron Systems)
tags:
    - attack.command-and-control
    - attack.t1090.001
date: 2023-12-20
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \cloudflared.exe
    filter_main_admin_location:
        NewProcessName|contains:
            - :\Program Files (x86)\cloudflared\
            - :\Program Files\cloudflared\
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Legitimate usage of Cloudflared portable versions
level: medium
ruletype: Sigma
