title: Gpresult Display Group Policy Information
ruletype: Sigma
author: frack113
date: 2022/05/01
description: Detects cases in which a user uses the built-in Windows utility gpresult
    to display the Resultant Set of Policy (RSoP) information
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\gpresult.exe'
    SELECTION_4:
        CommandLine:
        - '*/z*'
        - '*/v*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: e56d3073-83ff-4021-90fe-c658e0709e72
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1615/T1615.md
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/gpresult
- https://unit42.paloaltonetworks.com/emissary-trojan-changelog-did-operation-lotus-blossom-cause-it-to-evolve/
- https://www.welivesecurity.com/wp-content/uploads/2020/05/ESET_Turla_ComRAT.pdf
status: experimental
tags:
- attack.discovery
- attack.t1615

