title: Suspicious Chromium Browser Instance Executed With Custom Extension
id: bb8639b3-534e-d193-84ff-570b4a6eb383
status: experimental
description: Detects a suspicious process spawning a Chromium based browser process with the 'load-extension' flag to start an instance with a custom extension
references:
    - https://redcanary.com/blog/chromeloader/
    - https://emkc.org/s/RJjuLa
    - https://www.mandiant.com/resources/blog/lnk-between-browsers
author: Aedan Russell, frack113, X__Junior (Nextron Systems)
date: 2022/06/19
modified: 2023/11/28
tags:
    - attack.persistence
    - attack.t1176
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: --load-extension=
        ParentProcessName|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \wscript.exe
        NewProcessName|endswith:
            - \brave.exe
            - \chrome.exe
            - \msedge.exe
            - \opera.exe
            - \vivaldi.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
