title: Windows Admin Share Mount Via Net.EXE
id: 70e8ecd5-c850-e676-1c25-2bdb4f5ef98c
status: test
description: Detects when an admin share is mounted using net.exe
references:
    - https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st, wagga
date: 2020/10/05
modified: 2023/02/21
tags:
    - attack.lateral_movement
    - attack.t1021.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \net.exe
              - \net1.exe
        - OriginalFileName:
              - net.exe
              - net1.exe
    selection_cli:
        CommandLine|contains|all:
            - ' use '
            - ' \\\\*\\*$'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Administrators
level: medium
ruletype: Sigma
