title: Use of FSharp Interpreters
id: 5c7dd694-d4dd-a0a8-ea44-8357ca998b69
related:
    - id: b96b2031-7c17-4473-afe7-a30ce714db29
      type: derived
status: test
description: |
    Detects the execution of FSharp Interpreters "FsiAnyCpu.exe" and "FSi.exe"
    Both can be used for AWL bypass and to execute F# code via scripts or inline.
references:
    - https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/design/applications-that-can-bypass-wdac
    - https://bohops.com/2020/11/02/exploring-the-wdac-microsoft-recommended-block-rules-part-ii-wfc-fsi/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/FsiAnyCpu/
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Fsi/
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
date: 2022-06-02
modified: 2024-04-23
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith:
              - \fsi.exe
              - \fsianycpu.exe
        - OriginalFileName:
              - fsi.exe
              - fsianycpu.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use by a software developer.
level: medium
ruletype: Sigma
