title: HackTool - Potential Impacket Lateral Movement Activity
id: 10c14723-61c7-4c75-92ca-9af245723ad2
related:
    -   id: e31f89f7-36fb-4697-8ab6-48823708353b
        type: obsoletes
status: stable
description: Detects wmiexec/dcomexec/atexec/smbexec from Impacket framework
references:
    - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/wmiexec.py
    - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/atexec.py
    - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/smbexec.py
    - https://github.com/SecureAuthCorp/impacket/blob/8b1a99f7c715702eafe3f24851817bb64721b156/examples/dcomexec.py
    - https://www.elastic.co/guide/en/security/current/suspicious-cmd-execution-via-wmi.html
author: Ecco, oscd.community, Jonhnathan Ribeiro, Tim Rauch
date: 2019/09/03
modified: 2023/02/21
tags:
    - attack.execution
    - attack.t1047
    - attack.lateral_movement
    - attack.t1021.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_other:
        CommandLine|contains|all:
            - cmd.exe
            - /Q
            - /c
            - \\\\127.0.0.1\\
            - '&1'
        ParentProcessName|endswith:
            - \wmiprvse.exe
            - \mmc.exe
            - \explorer.exe
            - \services.exe
    selection_atexec:
        ParentCommandLine|contains:
            - svchost.exe -k netsvcs
            - taskeng.exe
        CommandLine|contains|all:
            - cmd.exe
            - /C
            - Windows\Temp\
            - '&1'
    condition: process_creation and (1 of selection_*)
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
