title: Potential Arbitrary Command Execution Using MSDT.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (rule)
date: 2022/05/29
description: Detects processes leveraging the "ms-msdt" handler or the "msdt.exe"
    binary to execute arbitrary commands as seen in the follina (CVE-2022-30190) vulnerability
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\msdt.exe'
    SELECTION_4:
        OriginalFileName: msdt.exe
    SELECTION_5:
        CommandLine: '*IT_BrowseForFile=*'
    SELECTION_6:
        CommandLine: '* PCWDiagnostic*'
    SELECTION_7:
        CommandLine:
        - '* /af *'
        - '* -af *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 258fc8ce-8352-443a-9120-8a11e4857fa5
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/18
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
- https://twitter.com/_JohnHammond/status/1531672601067675648
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

