title: Potential Obfuscated Ordinal Call Via Rundll32
id: 43fa5350-db63-4b8f-9a01-789a427074e1
status: experimental
description: Detects execution of "rundll32" with potential obfuscated ordinal calls
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/17
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \rundll32.exe
        - OriginalFileName: RUNDLL32.EXE
        - CommandLine|contains: rundll32
    selection_cli:
        CommandLine|contains:
            - '#+'
            - '#-'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
