title: Microsoft IIS Service Account Password Dumped
ruletype: Sigma
author: Tim Rauch, Janantha Marasinghe
date: 2022/11/08
description: Detects the Internet Information Services (IIS) command-line tool, AppCmd,
    being used to list passwords
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\appcmd.exe'
    SELECTION_4:
        OriginalFilename: appcmd.exe
    SELECTION_5:
        CommandLine: '*list *'
    SELECTION_6:
        CommandLine:
        - '* /config*'
        - '* /xml*'
    SELECTION_7:
        CommandLine:
        - '* /@t*'
        - '* /text*'
        - '* /show*'
    SELECTION_8:
        CommandLine:
        - '*:\*'
        - '*password*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and (SELECTION_6 or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Unknown
id: 2d3cdeec-c0db-45b4-aa86-082f7eb75701
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/17
references:
- https://www.elastic.co/guide/en/security/current/microsoft-iis-service-account-password-dumped.html
- https://twitter.com/0gtweet/status/1588815661085917186?cxt=HHwWhIDUyaDbzYwsAAAA
- https://www.netspi.com/blog/technical/network-penetration-testing/decrypting-iis-passwords-to-break-out-of-the-dmz-part-2/
status: experimental
tags:
- attack.credential_access
- attack.t1003

