title: Suspicious Microsoft OneNote Child Process
ruletype: Sigma
author: Tim Rauch (Nextron Systems), Nasreddine Bencherchali (Nextron Systems), Elastic
    (idea)
date: 2022/10/21
description: Detects suspicious child processes of the Microsoft OneNote application.
    This may indicate an attempt to execute malicious embedded objects from a .one
    file.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*-Embedding'
    SELECTION_11:
        NewProcessName: '*\AppData\Local\Microsoft\OneDrive\\*'
    SELECTION_12:
        NewProcessName: '*\FileCoAuth.exe'
    SELECTION_13:
        CommandLine: '*-Embedding'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\onenote.exe'
    SELECTION_4:
        OriginalFileName:
        - bitsadmin.exe
        - CertOC.exe
        - CertUtil.exe
        - Cmd.Exe
        - CMSTP.EXE
        - cscript.exe
        - curl.exe
        - HH.exe
        - IEExec.exe
        - InstallUtil.exe
        - javaw.exe
        - Microsoft.Workflow.Compiler.exe
        - msdt.exe
        - MSHTA.EXE
        - msiexec.exe
        - Msxsl.exe
        - odbcconf.exe
        - pcalua.exe
        - PowerShell.EXE
        - RegAsm.exe
        - RegSvcs.exe
        - REGSVR32.exe
        - RUNDLL32.exe
        - schtasks.exe
        - ScriptRunner.exe
        - wmic.exe
        - WorkFolders.exe
        - wscript.exe
    SELECTION_5:
        NewProcessName:
        - '*\AppVLP.exe'
        - '*\bash.exe'
        - '*\bitsadmin.exe'
        - '*\certoc.exe'
        - '*\certutil.exe'
        - '*\cmd.exe'
        - '*\cmstp.exe'
        - '*\control.exe'
        - '*\cscript.exe'
        - '*\curl.exe'
        - '*\forfiles.exe'
        - '*\hh.exe'
        - '*\ieexec.exe'
        - '*\installutil.exe'
        - '*\javaw.exe'
        - '*\mftrace.exe'
        - '*\Microsoft.Workflow.Compiler.exe'
        - '*\msbuild.exe'
        - '*\msdt.exe'
        - '*\mshta.exe'
        - '*\msidb.exe'
        - '*\msiexec.exe'
        - '*\msxsl.exe'
        - '*\odbcconf.exe'
        - '*\pcalua.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\regasm.exe'
        - '*\regsvcs.exe'
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\schtasks.exe'
        - '*\scrcons.exe'
        - '*\scriptrunner.exe'
        - '*\sh.exe'
        - '*\svchost.exe'
        - '*\verclsid.exe'
        - '*\wmic.exe'
        - '*\workfolders.exe'
        - '*\wscript.exe'
    SELECTION_6:
        NewProcessName: '*\explorer.exe'
    SELECTION_7:
        CommandLine:
        - '*.hta*'
        - '*.vb*'
        - '*.wsh*'
        - '*.js*'
        - '*.ps*'
        - '*.scr*'
        - '*.pif*'
        - '*.bat*'
        - '*.cmd*'
    SELECTION_8:
        NewProcessName:
        - '*\AppData\\*'
        - '*\Users\Public\\*'
        - '*\ProgramData\\*'
        - '*\Windows\Tasks\\*'
        - '*\Windows\Temp\\*'
        - '*\Windows\System32\Tasks\\*'
    SELECTION_9:
        NewProcessName: '*\AppData\Local\Microsoft\Teams\current\Teams.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and ((SELECTION_4 or
        SELECTION_5) or (SELECTION_6 and SELECTION_7) or SELECTION_8)) and  not ((SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13)))
falsepositives:
- File located in the AppData folder with trusted signature
id: c27515df-97a9-4162-8a60-dc0eeb51b775
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/10
references:
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-e34e43eb5666427602ddf488b2bf3b545bd9aae81af3e6f6c7949f9652abdf18
- https://micahbabinski.medium.com/detecting-onenote-one-malware-delivery-407e9321ecf0
related:
-   id: 438025f9-5856-4663-83f7-52f878a70a50
    type: derived
status: experimental
tags:
- attack.t1566
- attack.t1566.001
- attack.initial_access

