title: Suspicious New Service Creation
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/14
description: Detects creation of a new service via "sc" command or the powershell
    "new-service" cmdlet with suspicious binary paths
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\sc.exe'
    SELECTION_4:
        CommandLine: '*create*'
    SELECTION_5:
        CommandLine: '*binPath=*'
    SELECTION_6:
        CommandLine: '*New-Service*'
    SELECTION_7:
        CommandLine: '*-BinaryPathName*'
    SELECTION_8:
        CommandLine:
        - '*powershell*'
        - '*mshta*'
        - '*wscript*'
        - '*cscript*'
        - '*svchost*'
        - '*dllhost*'
        - '*cmd *'
        - '*cmd.exe /c*'
        - '*cmd.exe /k*'
        - '*rundll32*'
        - '*C:\Users\Public*'
        - '*\Downloads\\*'
        - '*\Desktop\\*'
        - '*\Microsoft\Windows\Start Menu\Programs\Startup\\*'
        - '*C:\Windows\TEMP\\*'
        - '*\AppData\Local\Temp*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)) and SELECTION_8)
falsepositives:
- Unlikely
id: 17a1be64-8d88-40bf-b5ff-a4f7a50ebcc8
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/09
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
related:
-   id: 7fe71fc9-de3b-432a-8d57-8c809efc10ab
    type: derived
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003

