
title: UAC Bypass Using IDiagnostic Profile
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/03
description: Detects the "IDiagnosticProfileUAC" UAC bypass technique
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\DllHost.exe'
  SELECTION_4:
    ParentCommandLine: '* /Processid:{12C21EA7-2EB8-4B55-9249-AC243DA8C666}*'
  SELECTION_5:
    IntegrityLevel:
    - High
    - System
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 4cbef972-f347-4170-b62a-8253f6168e6d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/Wh04m1001/IDiagnosticProfileUAC
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
