title: Xwizard DLL Sideloading
ruletype: Sigma
author: Christian Burkard
date: 2021/09/20
description: Detects the execution of Xwizard tool from the non-default directory
    which can be used to sideload a custom xwizards.dll
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\xwizard.exe'
    SELECTION_4:
        NewProcessName: C:\Windows\System32\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Windows installed on non-C drive
id: 193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
status: test
tags:
- attack.defense_evasion
- attack.t1574.002

