title: Copying Sensitive Files with Credential Data
id: 1c39c2aa-7a13-2826-f8c5-48a453dfd562
related:
    - id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
      type: derived
status: test
description: Files with well-known filenames (sensitive files with credential data) copying
references:
    - https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
    - https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
    - https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
    - https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Esentutl.yml
author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: 2019-10-22
modified: 2024-06-04
tags:
    - attack.credential-access
    - attack.t1003.002
    - attack.t1003.003
    - car.2013-07-001
    - attack.s0404
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_esent_img:
        - NewProcessName|endswith: \esentutl.exe
        - OriginalFileName: \esentutl.exe
    selection_esent_cli:
        CommandLine|contains|windash:
            - vss
            - ' /m '
            - ' /y '
    selection_susp_paths:
        CommandLine|contains:
            - \config\RegBack\sam
            - \config\RegBack\security
            - \config\RegBack\system
            - \config\sam
            - \config\security
            - '\config\system '        # space needed to avoid false positives with \config\systemprofile\
            - \repair\sam
            - \repair\security
            - \repair\system
            - \windows\ntds\ntds.dit
    condition: process_creation and (all of selection_esent_* or selection_susp_paths)
falsepositives:
    - Copying sensitive files for legitimate use (eg. backup) or forensic investigation by legitimate incident responder or forensic investigator.
level: high
ruletype: Sigma
