title: Potential PowerShell Downgrade Attack
ruletype: Sigma
author: Harish Segar (rule)
date: 2020/03/20
description: Detects PowerShell downgrade attack by comparing the host versions with
    the actually used engine version 2.0
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\powershell.exe'
    SELECTION_4:
        CommandLine:
        - '* -version 2 *'
        - '* -versio 2 *'
        - '* -versi 2 *'
        - '* -vers 2 *'
        - '* -ver 2 *'
        - '* -ve 2 *'
        - '* -v 2 *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: b3512211-c67e-4707-bedc-66efc7848863
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/04
references:
- http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
- https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#bypass-or-avoid-amsi-by-version-downgrade-
related:
-   id: 6331d09b-4785-4c13-980f-f96661356249
    type: derived
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.001

