title: Suspicious XOR Encoded PowerShell Command Line
ruletype: Sigma
author: Sami Ruohonen, Harish Segar (improvement), Tim Shelton
date: 2018/09/05
description: Detects suspicious powershell process which includes bxor command, alternative
    obfuscation method to b64 encoded commands.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*ValueFromPipelineByPropertyName*'
    SELECTION_11:
        CommandLine: '*::ParseExact(*'
    SELECTION_12:
        CommandLine: '*KB[000000-999999]*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        Description: Windows PowerShell
    SELECTION_6:
        Product: PowerShell Core 6
    SELECTION_7:
        CommandLine:
        - '*bxor*'
        - '*-join *'
        - '*-join''*'
        - '*-join"*'
        - '*-join`*'
        - '*char*'
    SELECTION_8:
        ParentProcessName: C:\Program Files\Amazon\SSM\ssm-document-worker.exe
    SELECTION_9:
        CommandLine: '*function Convert-GuidToCompressedGuid*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4 or
        SELECTION_5 or SELECTION_6) and SELECTION_7) and  not ((SELECTION_8) or (SELECTION_9
        and SELECTION_10 and SELECTION_11 and SELECTION_12)))
falsepositives:
- Unknown
id: bb780e0c-16cf-4383-8383-1e5471db6cf9
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/16
status: test
tags:
- attack.defense_evasion
- attack.t1059.001
- attack.t1140
- attack.t1027

