title: Suspicious Usage Of ShellExec_RunDLL
id: 915fc7ae-b034-c5e8-9b05-e19566db49fb
status: test
description: Detects suspicious usage of the ShellExec_RunDLL function to launch other commands as seen in the the raspberry-robin attack
references:
    - https://redcanary.com/blog/raspberry-robin/
    - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
    - https://github.com/SigmaHQ/sigma/issues/1009
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/01
modified: 2022/12/30
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_openasrundll:
        CommandLine|contains: ShellExec_RunDLL
    selection_suspcli:
        CommandLine|contains:
            # Add more LOLBINs and Susp Paths
            - regsvr32
            - msiexec
            - \Users\Public\
            - odbcconf
            - \Desktop\
            - \Temp\
            - Invoke-
            - iex
            - comspec
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
