title: Active Directory Structure Export Via Ldifde.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/14
description: Detects the execution of "ldifde.exe" in order to export organizational
    Active Directory structure.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\ldifde.exe'
    SELECTION_4:
        OriginalFileName: ldifde.exe
    SELECTION_5:
        CommandLine: '*-f*'
    SELECTION_6:
        CommandLine: '* -i*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6)))
falsepositives:
- Unknown
id: 4f7a6757-ff79-46db-9687-66501a02d9ec
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://businessinsights.bitdefender.com/deep-dive-into-a-backdoordiplomacy-attack-a-study-of-an-attackers-toolkit
- https://www.documentcloud.org/documents/5743766-Global-Threat-Report-2019.html
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731033(v=ws.11)
status: experimental
tags:
- attack.exfiltration

