title: Use of Pcalua For Execution
id: 850febcc-7dad-d3e9-05e3-1c69b3ba2db3
related:
    - id: fa47597e-90e9-41cd-ab72-c3b74cfb0d02
      type: obsolete
    - id: 0955e4e1-c281-4fb9-9ee1-5ee7b4b754d2
      type: derived
status: test
description: Detects execition of commands and binaries from the context of The program compatibility assistant (Pcalua.exe). This can be used as a LOLBIN in order to bypass application whitelisting.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Pcalua/
    - https://pentestlab.blog/2020/07/06/indirect-command-execution/
author: Nasreddine Bencherchali (Nextron Systems), E.M. Anhaus (originally from Atomic Blue Detections, Endgame), oscd.community
date: 2022-06-14
modified: 2023-01-04
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: ' -a' # No space after the flag because it accepts anything as long as there a "-a"
        NewProcessName|endswith: \pcalua.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use by a via a batch script or by an administrator.
level: medium
ruletype: Sigma
