title: Suspicious Mofcomp Execution
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/07/12
description: |
    Detects execution of the "mofcomp" utility as a child of a suspicious shell or script running utility or by having a supsicious path in the commandline.
    The "mofcomp" utility parses a file containing MOF statements and adds the classes and class instances defined in the file to the WMI repository.
    Attackers abuse this utility to install malicious MOF scripts
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\mofcomp.exe'
    SELECTION_4:
        ParentProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\wsl.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
    SELECTION_5:
        CommandLine:
        - '*\AppData\Local\Temp*'
        - '*\Users\Public\\*'
        - '*\WINDOWS\Temp\\*'
        - '*%temp%*'
        - '*%appdata%*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unknown
id: 1dd05363-104e-4b4a-b963-196a534b03a1
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/07/14
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://github.com/The-DFIR-Report/Sigma-Rules/blob/75260568a7ffe61b2458ca05f6f25914efb44337/win_mofcomp_execution.yml
- https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
status: experimental
tags:
- attack.execution
- attack.t1218

