title: WMI Backdoor Exchange Transport Agent
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2019/10/11
description: Detects a WMI backdoor in Exchange Transport Agents via WMI event filters
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\EdgeTransport.exe'
    SELECTION_4:
        NewProcessName: C:\Windows\System32\conhost.exe
    SELECTION_5:
        NewProcessName: C:\Program Files\Microsoft\Exchange Server\\*
    SELECTION_6:
        NewProcessName: '*\Bin\OleConverter.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: 797011dc-44f4-4e6f-9f10-a8ceefbe566b
level: critical
logsource:
    category: process_creation
    product: windows
modified: 2023/02/08
references:
- https://twitter.com/cglyer/status/1182389676876980224
- https://twitter.com/cglyer/status/1182391019633029120
status: test
tags:
- attack.persistence
- attack.t1546.003

