title: Suspicious High IntegrityLevel Conhost Legacy Option
ruletype: Sigma
author: frack113
date: 2022/12/09
description: ForceV1 asks for information directly from the kernel space. Conhost
    connects to the console application. High IntegrityLevel means the process is
    running with elevated privileges, such as an Administrator context.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        IntegrityLevel: High
    SELECTION_4:
        CommandLine: '*conhost.exe*'
    SELECTION_5:
        CommandLine: '*0xffffffff*'
    SELECTION_6:
        CommandLine: '*-ForceV1*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Very Likely, including launching cmd.exe via Run As Administrator
id: 3037d961-21e9-4732-b27a-637bcc7bf539
level: informational
logsource:
    category: process_creation
    product: windows
references:
- https://cybercryptosec.medium.com/covid-19-cyber-infection-c615ead7c29
- https://thedfirreport.com/2022/04/04/stolen-images-campaign-ends-in-conti-ransomware/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/mandatory-integrity-control
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

