
title: Wab Execution From Non Default Location
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/08/12
description: Detects execution of wab.exe (Windows Contacts) from non default locations
  as seen with bumblebee activity
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\wab.exe'
  SELECTION_4:
    NewProcessName:
    - C:\Windows\WinSxS\\*
    - C:\Program Files\Windows Mail\\*
    - C:\Program Files (x86)\Windows Mail\\*
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unlikely
id: 395907ee-96e5-4666-af2e-2ca91688e151
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://thedfirreport.com/2022/08/08/bumblebee-roasts-its-way-to-domain-admin/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/bumblebee-loader-cybercrime
status: experimental
tags:
- attack.defense_evasion
- attack.execution
