title: Suspicious Rundll32 Without Any CommandLine Params
id: 1775e15e-b61b-4d14-a1a3-80981298085a
status: experimental
description: Detects suspicious start of rundll32.exe without any parameters as found
    in CobaltStrike beacon activity
references:
    - https://www.cobaltstrike.com/help-opsec
author: Florian Roth (Nextron Systems)
date: 2021/05/27
modified: 2022/10/06
tags:
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|endswith: \rundll32.exe
    filter1:
        ParentProcessName|endswith: \svchost.exe
    filter2:
        ParentProcessName|contains:
            - \AppData\Local\
            - \Microsoft\Edge\
    condition: process_creation and (selection and not 1 of filter*)
fields:
    - ParentProcessName
    - ParentCommandLine
falsepositives:
    - Possible but rare
level: high
ruletype: Sigma
