title: Invocation of Active Directory Diagnostic Tool (ntdsutil.exe)
id: 4b8e07ad-57d3-608d-6f9e-31047dfeb0de
related:
    - id: 2afafd61-6aae-4df4-baed-139fa1f4c345
      type: derived
status: test
description: Detects execution of ntdsutil.exe, which can be used for various attacks against the NTDS database (NTDS.DIT)
references:
    - https://jpcertcc.github.io/ToolAnalysisResultSheet/details/ntdsutil.htm
author: Thomas Patzke
date: 2019-01-16
modified: 2022-03-11
tags:
    - attack.credential-access
    - attack.t1003.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \ntdsutil.exe
    condition: process_creation and selection
falsepositives:
    - NTDS maintenance
level: medium
ruletype: Sigma
