title: Suspicious Process Execution From Fake Recycle.Bin Folder
id: 101d5724-f172-6946-1713-7b535e7c5af9
status: experimental
description: Detects process execution from a fake recycle bin folder, often used to avoid security solution.
references:
    - https://www.mandiant.com/resources/blog/infected-usb-steal-secrets
    - https://unit42.paloaltonetworks.com/cloaked-ursa-phishing/
author: X__Junior (Nextron Systems)
date: 2023/07/12
modified: 2023/12/11
tags:
    - attack.persistence
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|contains:
            # e.g. C:\$RECYCLER.BIN
            - RECYCLERS.BIN\
            - RECYCLER.BIN\
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
