title: Use of UltraVNC Remote Access Software
ruletype: Sigma
author: frack113
date: 2022/10/02
description: An adversary may use legitimate desktop support and remote access software,to
    establish an interactive command and control channel to target systems within
    networks
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Description: VNCViewer
    SELECTION_4:
        Product: UltraVNC VNCViewer
    SELECTION_5:
        Company: UltraVNC
    SELECTION_6:
        OriginalFileName: VNCViewer.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6))
falsepositives:
- Legitimate use
id: 145322e4-0fd3-486b-81ca-9addc75736d8
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/9e5b12c4912c07562aec7500447b11fa3e17e254/atomics/T1219/T1219.md
status: experimental
tags:
- attack.command_and_control
- attack.t1219

