title: Unusual Parent Process For Cmd.EXE
ruletype: Sigma
author: Tim Rauch
date: 2022/09/21
description: Detects suspicious parent process for cmd.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\cmd.exe'
    SELECTION_4:
        ParentProcessName:
        - '*\csrss.exe'
        - '*\ctfmon.exe'
        - '*\dllhost.exe'
        - '*\epad.exe'
        - '*\FlashPlayerUpdateService.exe'
        - '*\GoogleUpdate.exe'
        - '*\jucheck.exe'
        - '*\jusched.exe'
        - '*\LogonUI.exe'
        - '*\lsass.exe'
        - '*\regsvr32.exe'
        - '*\SearchIndexer.exe'
        - '*\SearchProtocolHost.exe'
        - '*\SIHClient.exe'
        - '*\sihost.exe'
        - '*\slui.exe'
        - '*\spoolsv.exe'
        - '*\sppsvc.exe'
        - '*\taskhostw.exe'
        - '*\unsecapp.exe'
        - '*\WerFault.exe'
        - '*\wergmgr.exe'
        - '*\wlanext.exe'
        - '*\WUDFHost.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 4b991083-3d0e-44ce-8fc4-b254025d8d4b
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/07
references:
- https://www.elastic.co/guide/en/security/current/unusual-parent-process-for-cmd.exe.html
status: experimental
tags:
- attack.execution
- attack.t1059

