title: Netsh RDP Port Forwarding
ruletype: Sigma
author: Florian Roth, oscd.community
date: 2019/01/29
description: Detects netsh commands that configure a port forwarding of port 3389
    used for RDP
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\netsh.exe'
    SELECTION_4:
        CommandLine: '*i*'
    SELECTION_5:
        CommandLine: '* p*'
    SELECTION_6:
        CommandLine: '*=3389*'
    SELECTION_7:
        CommandLine: '* c*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate administration
id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/01/07
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
status: test
tags:
- attack.lateral_movement
- attack.defense_evasion
- attack.command_and_control
- attack.t1090

