title: Persistence Via TypedPaths - CommandLine
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/22
description: Detects modification addition to the 'TypedPaths' key in the user or
    admin registry via the commandline. Which might indicate persistence attempt
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*\Software\Microsoft\Windows\CurrentVersion\Explorer\TypedPaths*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: ec88289a-7e1a-4cc3-8d18-bd1f60e4b9ba
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/dez_/status/1560101453150257154
- https://forensafe.com/blogs/typedpaths.html
status: experimental
tags:
- attack.persistence

