title: File Explorer Folder Opened Using Explorer Folder Shortcut Via Shell
id: 0c504797-106a-bd3f-6172-cebfb63391b1
related:
    - id: c3d76afc-93df-461e-8e67-9b2bad3f2ac4
      type: derived
status: test
description: |
    Detects the initial execution of "cmd.exe" which spawns "explorer.exe" with the appropriate command line arguments for opening the "My Computer" folder.
author: '@Kostastsale'
references:
    - https://ss64.com/nt/shell.html
date: 2022-12-22
modified: 2024-08-23
tags:
    - attack.discovery
    - attack.t1135
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: shell:mycomputerfolder
        ParentProcessName|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
        NewProcessName|endswith: \explorer.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_explorer_folder_shortcut_via_shell_binary/info.yml
ruletype: Sigma
