title: Suspicious Download from Office Domain
ruletype: Sigma
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali
date: 2021/12/27
description: Detects suspicious ways to download files from Microsoft domains that
    are used to store attachments in Emails or OneNote documents
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\curl.exe'
        - '*\wget.exe'
    SELECTION_4:
        CommandLine:
        - '*Invoke-WebRequest*'
        - '*iwr *'
        - '*curl *'
        - '*wget *'
        - '*Start-BitsTransfer*'
        - '*.DownloadFile(*'
        - '*.DownloadString(*'
    SELECTION_5:
        CommandLine:
        - '*https://attachment.outlook.live.net/owa/*'
        - '*https://onenoteonlinesync.onenote.com/onenoteonlinesync/*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Scripts or tools that download attachments from these domains (OneNote, Outlook
    365)
id: 00d49ed5-4491-4271-a8db-650a4ef6f8c1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/02
references:
- https://twitter.com/an0n_r0/status/1474698356635193346?s=12
- https://twitter.com/mrd0x/status/1475085452784844803?s=12
status: experimental

