title: Potential Commandline Obfuscation Using Unicode Characters
id: 1c28655b-a54c-2619-b61d-1b3307a9d6dd
status: test
description: |
    Detects potential commandline obfuscation using unicode characters.
    Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit.
references:
    - https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027/T1027.md#atomic-test-6---dlp-evasion-via-sensitive-data-in-vba-macro-over-http
author: frack113, Florian Roth (Nextron Systems)
date: 2022/01/15
modified: 2023/03/03
tags:
    - attack.defense_evasion
    - attack.t1027
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_spacing_modifiers:
        CommandLine|contains: # spacing modifier letters that get auto-replaced
            - ˣ   # 0x02E3
            - ˪   # 0x02EA
            - ˢ   # 0x02E2
    selection_unicode_slashes: # forward slash alternatives
        CommandLine|contains:
            - ∕   # 0x22FF
            - ⁄   # 0x206F
    selection_unicode_hyphens: # hyphen alternatives
        CommandLine|contains:
            - ―   # 0x2015
            - —   # 0x2014
    selection_other:
        CommandLine|contains:
            - â
            - €
            - £
            - ¯
            - ®
            - µ
            - ¶
    condition: process_creation and (1 of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
