title: UAC Bypass Using IEInstal - Process
id: 80fc36aa-945e-4181-89f2-2f907ab6775d
status: test
description: Detects the pattern of UAC Bypass using IEInstal.exe (UACMe 64)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021/08/30
modified: 2022/10/09
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
        ParentProcessName|endswith: \ieinstal.exe
        NewProcessName|contains: \AppData\Local\Temp\
        NewProcessName|endswith: consent.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
