title: InfDefaultInstall.exe .inf Execution
ruletype: Sigma
author: frack113
date: 2021/07/13
description: Executes SCT script using scrobj.dll from a command in entered into a
    specially prepared INF file.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*InfDefaultInstall.exe *'
    SELECTION_4:
        CommandLine: '*.inf*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: ce7cf472-6fcc-490a-9481-3786840b5d9b
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md#atomic-test-4---infdefaultinstallexe-inf-execution
- https://lolbas-project.github.io/lolbas/Binaries/Infdefaultinstall/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

