title: Stop Windows Service Via Sc.EXE
id: 115267f9-0227-94b2-f6ef-56939bd2c693
related:
    - id: eb87818d-db5d-49cc-a987-d5da331fbd90
      type: obsolete
    - id: 81bcb81b-5b1f-474b-b373-52c871aaa7b1
      type: derived
status: test
description: Detects the stopping of a Windows service via the "sc.exe" utility
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc742107(v=ws.11)
author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: 2023-03-05
modified: 2024-01-18
tags:
    - attack.impact
    - attack.t1489
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName: sc.exe
        - NewProcessName|endswith: \sc.exe
    selection_cli:
        CommandLine|contains: ' stop '
    condition: process_creation and (all of selection_*)
falsepositives:
    - There are many legitimate reasons to stop a service. This rule isn't looking for any suspicious behavior in particular. Filter legitimate activity accordingly
level: low
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_sc_stop_service/info.yml
ruletype: Sigma
