title: Suspicious WMIC Execution Via Office Process
id: 0e524b9d-1e47-2065-5827-2b8d0125307c
status: test
description: Office application called wmic to proxye execution through a LOLBIN process. This is often used to break suspicious parent-child chain (Office app spawns LOLBin).
references:
    - https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
    - https://github.com/vadim-hunter/Detection-Ideas-Rules/blob/02bcbfc2bfb8b4da601bb30de0344ae453aa1afe/Threat%20Intelligence/The%20DFIR%20Report/20210329_Sodinokibi_(aka_REvil)_Ransomware.yaml
author: Vadim Khrykov, Cyb3rEng
date: 2021/08/23
modified: 2023/02/14
tags:
    - attack.t1204.002
    - attack.t1047
    - attack.t1218.010
    - attack.execution
    - attack.defense_evasion
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith:
            - \WINWORD.EXE
            - \EXCEL.EXE
            - \POWERPNT.exe
            - \MSPUB.exe
            - \VISIO.exe
            - \MSACCESS.EXE
            - \EQNEDT32.EXE
            - \ONENOTE.EXE
            - \wordpad.exe
            - \wordview.exe
    selection_wmic_img:
        - NewProcessName|endswith: \wbem\WMIC.exe
        - OriginalFileName: wmic.exe
    selection_wmic_cli:
        CommandLine|contains|all:
            - process
            - create
            - call
        CommandLine|contains:
            # Add more suspicious LOLBINs as you see fit
            - regsvr32
            - rundll32
            - msiexec
            - mshta
            - verclsid
            - wscript
            - cscript
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
