title: Run PowerShell Script from Redirected Input Stream
id: 112d0b77-1699-f5e9-45f6-7e80e17de0a0
related:
    - id: c83bf4b5-cdf0-437c-90fa-43d734f7c476
      type: derived
status: test
description: Detects PowerShell script execution via input stream redirect
references:
    - https://github.com/LOLBAS-Project/LOLBAS/blob/4db780e0f0b2e2bb8cb1fa13e09196da9b9f1834/yml/LOLUtilz/OSBinaries/Powershell.yml
    - https://twitter.com/Moriarty_Meng/status/984380793383370752
author: Moriarty Meng (idea), Anton Kutepov (rule), oscd.community
date: 2020-10-17
modified: 2021-11-27
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|re: \s-\s*<
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
