title: PUA - System Informer Execution
id: 852227cc-1888-1ad5-93f1-633e3dc46869
status: test
description: Detects the execution of System Informer, a task manager tool to view and manipulate processes, kernel options and other low level operations
references:
    - https://github.com/winsiderss/systeminformer
author: Florian Roth (Nextron Systems)
date: 2023/05/08
tags:
    - attack.persistence
    - attack.privilege_escalation
    - attack.discovery
    - attack.defense_evasion
    - attack.t1082
    - attack.t1564
    - attack.t1543
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_image:
        - NewProcessName|endswith: \SystemInformer.exe
        - OriginalFileName: SystemInformer.exe
        - Description: System Informer
        - Product: System Informer
    selection_hashes:
        Hashes|contains:
            # Note: add other hashes as needed
            # 3.0.11077.6550
            - MD5=19426363A37C03C3ED6FEDF57B6696EC
            - SHA1=8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
            - SHA256=8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
            - IMPHASH=B68908ADAEB5D662F87F2528AF318F12
    selection_hash_values:
        - md5: 19426363A37C03C3ED6FEDF57B6696EC
        - sha1: 8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
        - sha256: 8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
        - Imphash: B68908ADAEB5D662F87F2528AF318F12
    condition: process_creation and (1 of selection_*)
falsepositives:
    - System Informer is regularly used legitimately by system administrators or developers. Apply additional filters accordingly
level: medium
ruletype: Sigma
