title: Ilasm Lolbin Use Compile C-Sharp
id: 5ea0b54f-98b4-7cc7-6c38-01a53470b4e4
related:
    - id: 850d55f9-6eeb-4492-ad69-a72338f65ba4
      type: derived
status: test
description: Detect use of Ilasm.exe to compile c# code into dll or exe.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ilasm/
    - https://www.echotrail.io/insights/search/ilasm.exe
author: frack113
date: 2022/05/07
modified: 2022/05/16
tags:
    - attack.defense_evasion
    - attack.t1127
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \ilasm.exe
        - OriginalFileName: ilasm.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
