title: Potential Recon Activity Using Wevtutil
id: beaa66d6-aa1b-4e3c-80f5-e0145369bfaf
status: experimental
description: Detects usage of the wevtutil utility to perform reconnaissance
references:
    - http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/09
modified: 2023/01/18
tags:
    - attack.discovery
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_cli:
        CommandLine|contains:
            - ' qe '
            - ' query-events '
        NewProcessName|endswith: \wevtutil.exe
    selection_logs:
        CommandLine|contains:
            - Microsoft-Windows-TerminalServices-LocalSessionManager/Operational
            - Microsoft-Windows-Terminal-Services-RemoteConnectionManager/Operational
            - Security
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate usage of the utility by administrators to query the event log
level: medium
ruletype: Sigma
