title: Potential PsExec Remote Execution
id: 06d1ba8b-f692-36bb-8b57-6c340c87d71b
related:
    - id: ea011323-7045-460b-b2d7-0f7442ea6b38
      type: derived
status: test
description: Detects potential psexec command that initiate execution on a remote systems via common commandline flags used by the utility
references:
    - https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
    - https://www.poweradmin.com/paexec/
    - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/28
tags:
    - attack.resource_development
    - attack.t1587.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        # Accepting EULA in commandline - often used in automated attacks
        CommandLine|contains|all:
            - accepteula
            - ' -u '
            - ' -p '
            - ' \\\\'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
