title: Deny Service Access Using Security Descriptor Tampering Via Sc.EXE
id: fd14e822-33da-bc04-253d-2c8cc8659a30
status: test
description: Detects suspicious DACL modifications to deny access to a service that affects critical trustees. This can be used to hide services or make them unstoppable.
references:
    - https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
    - https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
    - https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
author: Jonhnathan Ribeiro, oscd.community
date: 2020/10/16
modified: 2023/02/28
tags:
    - attack.persistence
    - attack.t1543.003
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_sc:
        - NewProcessName|endswith: \sc.exe
        - OriginalFileName: sc.exe
    selection_sdset:
        CommandLine|contains|all:
            - sdset
            - D;   # Deny Access
    selection_trustee:
        CommandLine|contains:
            - ;IU   # Interactively logged-on user
            - ;SU   # Service logon user
            - ;BA   # Built-in administrators
            - ;SY   # Local system
            - ;WD   # Everyone
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
