title: Potential RDP Tunneling Via SSH Plink
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/08/04
description: Execution of plink to perform data exfiltration and tunneling
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\plink.exe'
    SELECTION_4:
        CommandLine: '*:127.0.0.1:3389*'
    SELECTION_5:
        NewProcessName: '*\plink.exe'
    SELECTION_6:
        CommandLine: '*:3389*'
    SELECTION_7:
        CommandLine:
        - '* -P 443*'
        - '* -P 22*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6 and SELECTION_7)))
falsepositives:
- Administrative activity
id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/27
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
related:
-   id: f7d7ebd5-a016-46e2-9c54-f9932f2d386d
    type: similar
status: test
tags:
- attack.command_and_control
- attack.t1572

