title: CrackMapExec Process Patterns
ruletype: Sigma
author: Florian Roth
date: 2022/03/12
description: Detects suspicious process patterns found in logs when CrackMapExec is
    used
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*%%B*'
    SELECTION_11:
        CommandLine: '*tasklist /v /fo csv*'
    SELECTION_12:
        CommandLine: '*findstr /i "lsass"*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*cmd.exe /c *'
    SELECTION_4:
        CommandLine: '*tasklist /fi *'
    SELECTION_5:
        CommandLine: '*Imagename eq lsass.exe*'
    SELECTION_6:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_7:
        CommandLine: '*do rundll32.exe C:\windows\System32\comsvcs.dll, MiniDump*'
    SELECTION_8:
        CommandLine: '*\Windows\Temp\\*'
    SELECTION_9:
        CommandLine: '* full*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
        SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12)))
falsepositives:
- Unknown
id: f26307d8-14cd-47e3-a26b-4b4769f24af6
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/05/27
references:
- https://mpgn.gitbook.io/crackmapexec/smb-protocol/obtaining-credentials/dump-lsass
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

