title: Remove Windows Defender Definition Files
ruletype: Sigma
author: frack113
date: 2021/07/07
description: Adversaries may disable security tools to avoid possible detection of
    their tools and activities by removing Windows Defender Definition Files
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: MpCmdRun.exe
    SELECTION_4:
        CommandLine: '* -RemoveDefinitions*'
    SELECTION_5:
        CommandLine: '* -All*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
fields:
- ComputerName
- User
- CommandLine
- ParentCommandLine
id: 9719a8aa-401c-41af-8108-ced7ec9cd75c
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
status: test
tags:
- attack.defense_evasion
- attack.t1562.001

