
title: Suspicious AdFind Enumerate
ruletype: Sigma
author: frack113
date: 2021/12/13
description: Detects the execution of a AdFind for enumeration
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\adfind.exe'
  SELECTION_4:
    CommandLine:
    - '*lockoutduration*'
    - '*lockoutthreshold*'
    - '*lockoutobservationwindow*'
    - '*maxpwdage*'
    - '*minpwdage*'
    - '*minpwdlength*'
    - '*pwdhistorylength*'
    - '*pwdproperties*'
  SELECTION_5:
    CommandLine: '*-sc admincountdmp*'
  SELECTION_6:
    CommandLine: '*-sc exchaddresses*'
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or SELECTION_5
    or SELECTION_6))
falsepositives:
- Administrative activity
id: 455b9d50-15a1-4b99-853f-8d37655a4c1b
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://social.technet.microsoft.com/wiki/contents/articles/7535.adfind-command-examples.aspx
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1087.002/T1087.002.md
status: experimental
tags:
- attack.discovery
- attack.t1087.002
