title: File Download via CertOC.EXE
id: ae801fc7-f16f-247e-f3da-918f64136e9d
related:
    - id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
      type: similar
    - id: 70ad0861-d1fe-491c-a45f-fa48148a300d
      type: derived
status: test
description: Detects when a user downloads a file by using CertOC.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-05-16
modified: 2023-10-18
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \certoc.exe
        - OriginalFileName: CertOC.exe
    selection_cli:
        CommandLine|contains|all:
            - -GetCACAPS
            - http
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
