title: Windows AMSI Related Registry Tampering Via CommandLine
id: e821e181-409c-3690-fce1-d9cd60356420
related:
    - id: aa37cbb0-da36-42cb-a90f-fdf216fc7467 # AMSI Disabled via Registry Modification
      type: similar
    - id: 7dbbcac2-57a0-45ac-b306-ff30a8bd2981
      type: derived
status: experimental
description: |
    Detects tampering of AMSI (Anti-Malware Scan Interface) related registry values via command line tools such as reg.exe or PowerShell.
    AMSI provides a generic interface for applications and services to integrate with antimalware products.
    Adversaries may disable AMSI to evade detection of malicious scripts and code execution.
references:
    - https://github.com/arttoolkit/arttoolkit.github.io/blob/16d6230d009e58fd6f773f5317fd4d14c1f26004/_wadcoms/AMSI-Bypass-Jscript_amsienable.md
    - https://mostafayahiax.medium.com/hunting-for-amsi-bypassing-methods-9886dda0bf9d
    - https://www.mdsec.co.uk/2019/02/macros-and-more-with-sharpshooter-v2-0/
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-12-25
tags:
    - attack.defense-evasion
    - attack.t1562.001
    - attack.t1562.006
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_key:
        CommandLine|contains|all:
            - \Software\Microsoft\Windows Script\Settings
            - AmsiEnable
    selection_reg_img:
        - NewProcessName|endswith: \reg.exe
        - OriginalFileName: reg.exe
    selection_reg_cmd:
        CommandLine|contains: add
    selection_powershell_img:
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
    selection_powershell_cmd:
        CommandLine|contains:
            - Set-ItemProperty
            - New-ItemProperty
            - 'sp '
    condition: process_creation and (selection_key and (all of selection_powershell_* or all of selection_reg_*))
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_amsi_registry_tampering/info.yml
simulation:
    - type: atomic-red-team
      name: AMSI Bypass - Create AMSIEnable Reg Key
      technique: T1562.001
      atomic_guid: 728eca7b-0444-4f6f-ac36-437e3d751dc0
ruletype: Sigma
