title: File Decryption Using Gpg4win
id: f539aaee-c369-f209-b744-3e1b8b37c936
related:
    - id: 037dcd71-33a8-4392-bb01-293c94663e5a
      type: derived
status: test
description: Detects usage of Gpg4win to decrypt files
references:
    - https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
    - https://www.gpg4win.de/documentation.html
    - https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-08-09
tags:
    - attack.execution
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_metadata:
        - NewProcessName|endswith:
              - \gpg.exe
              - \gpg2.exe
        - Description: GnuPG’s OpenPGP tool
    selection_cli:
        CommandLine|contains|all:
            - ' -d '
            - passphrase
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
