title: GfxDownloadWrapper.exe Downloads File from Suspicious URL
id: eee00933-a761-4cd0-be70-c42fe91731e7
status: test
description: Detects when GfxDownloadWrapper.exe downloads file from non standard
    URL
references:
    - https://lolbas-project.github.io/lolbas/HonorableMentions/GfxDownloadWrapper/
author: Victor Sergeev, oscd.community
date: 2020/10/09
modified: 2022/01/06
tags:
    - attack.command_and_control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    image_path:
        NewProcessName|endswith: \GfxDownloadWrapper.exe
    filter:
        CommandLine|contains: gameplayapi.intel.com
        ParentProcessName|endswith:
            - \GfxDownloadWrapper.exe
            - \igfxEM.exe
    condition: process_creation and (image_path and not filter)
fields:
    - CommandLine
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
