title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
ruletype: Sigma
author: frack113
date: 2021/07/27
description: An adversary may compress or encrypt data that is collected prior to
    exfiltration using 3rd party utilities
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*7z.exe*'
        - '*7za.exe*'
    SELECTION_4:
        CommandLine: '* -p*'
    SELECTION_5:
        CommandLine:
        - '* a *'
        - '* u *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Command line parameter combinations that contain all included strings
fields:
- CommandLine
- ParentCommandLine
- CurrentDirectory
id: 9fbf5927-5261-4284-a71d-f681029ea574
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
status: test
tags:
- attack.collection
- attack.t1560.001

