title: DLL Injection with Tracker.exe
ruletype: Sigma
author: Avneet Singh @v3t0_, oscd.community
date: 2020/10/18
description: This rule detects DLL injection and execution via LOLBAS - Tracker.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\tracker.exe'
    SELECTION_4:
        Description: Tracker
    SELECTION_5:
        CommandLine:
        - '* /d *'
        - '* /c *'
    SELECTION_6:
        CommandLine: '* /ERRORREPORT:PROMPT *'
    SELECTION_7:
        ParentProcessName: '*\Msbuild\Current\Bin\MSBuild.exe'
    SELECTION_8:
        CommandLine: '*\VC\Tools\MSVC\\*'
    SELECTION_9:
        CommandLine: '*\bin\HostX86\x64\\*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: 148431ce-4b70-403d-8525-fcc2993f29ea
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/11/12
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/
status: test
tags:
- attack.defense_evasion
- attack.t1055.001

