title: Potentially Suspicious WebDAV LNK Execution
id: a2325ec9-0dd9-e21d-c39b-3e8dc0f36213
related:
    - id: f0507c0f-a3a2-40f5-acc6-7f543c334993
      type: similar
    - id: 1412aa78-a24c-4abd-83df-767dfb2c5bbe
      type: derived
status: test
description: Detects possible execution via LNK file accessed on a WebDAV server.
references:
    - https://www.trellix.com/en-us/about/newsroom/stories/research/beyond-file-search-a-novel-method.html
    - https://micahbabinski.medium.com/search-ms-webdav-and-chill-99c5b23ac462
author: Micah Babinski
date: 2023-08-21
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1204
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: \DavWWWRoot\
        ParentProcessName|endswith: \explorer.exe
        NewProcessName|endswith:
            - \cmd.exe
            - \cscript.exe
            - \mshta.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
