title: Pubprn.vbs Proxy Execution
ruletype: Sigma
author: frack113
date: 2022/05/28
description: Detects the use of the 'Pubprn.vbs' Microsoft signed script to execute
    commands.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*\pubprn.vbs*'
    SELECTION_4:
        CommandLine: '*script:*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 1fb76ab8-fa60-4b01-bddd-71e89bf555da
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Scripts/Pubprn/
status: experimental
tags:
- attack.defense_evasion
- attack.t1216.001

