title: Shell Process Spawned by Java.EXE
id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
related:
    - id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
      type: similar
status: test
description: Detects shell spawned from Java host process, which could be a sign of exploitation (e.g. log4j exploitation)
references:
    - https://www.lunasec.io/docs/blog/log4j-zero-day/
author: Andreas Hunkeler (@Karneades), Nasreddine Bencherchali
date: 2021/12/17
modified: 2024/01/18
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \java.exe
        NewProcessName|endswith:
            - \bash.exe
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
    filter_main_build:
        CommandLine|contains: build    # excluding CI build agents
        ParentProcessName|contains: build
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Legitimate calls to system binaries
    - Company specific internal usage
level: medium
ruletype: Sigma
