title: Use Short Name Path in Image
id: 813c544e-381d-625e-3470-9a243b7ce88e
related:
    - id: 349d891d-fef0-4fe4-bc53-eee623a15969
      type: similar
    - id: a96970af-f126-420d-90e1-d37bf25e50e1
      type: derived
status: test
description: Detect use of the Windows 8.3 short name. Which could be used as a method to avoid Image detection
references:
    - https://www.acunetix.com/blog/articles/windows-short-8-3-filenames-web-security-problem/
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-2000-server/cc959352(v=technet.10)
    - https://twitter.com/frack113/status/1555830623633375232
author: frack113, Nasreddine Bencherchali
date: 2022-08-07
modified: 2025-10-20
tags:
    - attack.defense-evasion
    - attack.t1564.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|contains:
            - ~1\
            - ~2\
    filter_main_system_process:
        ParentProcessName:
            - C:\Windows\System32\Dism.exe
            - C:\Windows\System32\cleanmgr.exe    # Spawns DismHost.exe with a shortened username (if too long)
    filter_main_installers:
        - NewProcessName|contains|all:
              - \AppData\
              - \Temp\
        - NewProcessName|endswith:
              - ~1\unzip.exe
              - ~1\7zG.exe
    filter_optional_webex:
        ParentProcessName|endswith: \WebEx\WebexHost.exe
    filter_optional_thor:
        ParentProcessName|endswith: \thor\thor64.exe
    filter_optional_installshield:
        - Product: InstallShield (R)
        - Description: InstallShield (R) Setup Engine
        - Company: InstallShield Software Corporation
    condition: process_creation and (selection and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Applications could use this notation occasionally which might generate some false positives. In that case Investigate the parent and child process.
level: medium
ruletype: Sigma
