title: Uncommon Svchost Parent Process
id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
status: test
description: Detects an uncommon svchost parent process
references:
    - Internal Research
author: Florian Roth (Nextron Systems)
date: 2017/08/15
modified: 2022/06/28
tags:
    - attack.defense_evasion
    - attack.t1036.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \svchost.exe
    filter_main_generic:
        ParentProcessName|endswith:
            - \Mrt.exe
            - \MsMpEng.exe
            - \ngen.exe
            - \rpcnet.exe
            - \services.exe
            - \TiWorker.exe
    filter_main_parent_null:
        ParentProcessName:
    filter_main_parent_empty:
        ParentProcessName:
            - '-'
            - ''
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
