title: Perl Inline Command Execution
id: 1c7255e9-5677-0dce-20d7-83f42f4a517c
related:
    - id: f426547a-e0f7-441a-b63e-854ac5bdf54d
      type: derived
status: test
description: Detects execution of perl using the "-e"/"-E" flags. This is could be used as a way to launch a reverse shell or execute live perl code.
references:
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
    - https://www.revshells.com/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-02
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \perl.exe
        - OriginalFileName: perl.exe   # Also covers perlX.XX.exe
    selection_cli:
        CommandLine|contains: ' -e'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
