title: Port Forwarding Attempt Via SSH
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/10/12
description: Detects suspicious SSH tunnel port forwarding to a local port
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\ssh.exe'
    SELECTION_4:
        CommandLine: '* -R *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrative activity using a remote port forwarding to a local port
id: 327f48c1-a6db-4eb8-875a-f6981f1b0183
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/25
references:
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
status: experimental
tags:
- attack.command_and_control
- attack.t1572
- attack.lateral_movement
- attack.t1021.001

