title: PUA - AdvancedRun Suspicious Execution
id: a407b6c9-ae1a-6fb2-a44d-24de12a2e2f7
related:
    - id: d2b749ee-4225-417e-b20e-a8d2193cbb84
      type: similar
    - id: fa00b701-44c6-4679-994d-5a18afa8a707
      type: derived
status: test
description: Detects the execution of AdvancedRun utility in the context of the TrustedInstaller, SYSTEM, Local Service or Network Service accounts
references:
    - https://twitter.com/splinter_code/status/1483815103279603714
    - https://medium.com/s2wblog/analysis-of-destructive-malware-whispergate-targeting-ukraine-9d5d158f19f3
    - https://www.elastic.co/security-labs/operation-bleeding-bear
    - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
author: Florian Roth (Nextron Systems)
date: 2022-01-20
modified: 2023-02-21
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1134.002
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - /EXEFilename
            - /CommandLine
    selection_runas:
        - CommandLine|contains:
              - ' /RunAs 8 '
              - ' /RunAs 4 '
              - ' /RunAs 10 '
              - ' /RunAs 11 '
        - CommandLine|endswith:
              - /RunAs 8
              - /RunAs 4
              - /RunAs 10
              - /RunAs 11
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: high
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_pua_advancedrun_priv_user/info.yml
ruletype: Sigma
