title: Password Provided In Command Line Of Net.EXE
id: 63b59ec7-e487-aef1-5cca-722ee215db7f
related:
    - id: d4498716-1d52-438f-8084-4a603157d131
      type: derived
status: test
description: Detects a when net.exe is called with a password in the command line
references:
    - Internal Research
author: Tim Shelton (HAWK.IO)
date: 2021-12-09
modified: 2023-02-21
tags:
    - attack.defense-evasion
    - attack.initial-access
    - attack.persistence
    - attack.privilege-escalation
    - attack.lateral-movement
    - attack.t1021.002
    - attack.t1078
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \net.exe
              - \net1.exe
        - OriginalFileName:
              - net.exe
              - net1.exe
    selection_cli:
        CommandLine|contains|all:
            - ' use '
            - :*\\
            - /USER:* *
    filter_main_empty:
        CommandLine|endswith: ' '
    condition: process_creation and (all of selection_* and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
