title: Python Spawning Pretty TTY on Windows
id: 4e16e266-e27d-ab29-fd78-e04352a8aee7
status: test
description: Detects python spawning a pretty tty
references:
    - https://www.volexity.com/blog/2022/06/02/zero-day-exploitation-of-atlassian-confluence/
author: Nextron Systems
date: 2022/06/03
tags:
    - attack.execution
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        NewProcessName|endswith:
            - python.exe   # no \ bc of e.g. ipython.exe
            - python3.exe
            - python2.exe
    selection_cli_1:
        CommandLine|contains|all:
            - import pty
            - .spawn(
    selection_cli_2:
        CommandLine|contains: from pty import spawn
    condition: process_creation and (selection_img and 1 of selection_cli_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
