title: Potentially Suspicious Child Process Of Regsvr32
id: 64533e2e-fc62-38e3-32ed-413f474d82c7
status: test
description: Detects potentially suspicious child processes of "regsvr32.exe".
references:
    - https://redcanary.com/blog/intelligence-insights-april-2022/
    - https://www.echotrail.io/insights/search/regsvr32.exe
    - https://www.ired.team/offensive-security/code-execution/t1117-regsvr32-aka-squiblydoo
author: elhoim, Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/05
modified: 2023/05/26
tags:
    - attack.defense_evasion
    - attack.t1218.010
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \regsvr32.exe
        NewProcessName|endswith:
            - \calc.exe
            - \cscript.exe
            - \explorer.exe
            - \mshta.exe
            - \net.exe
            - \net1.exe
            - \nltest.exe
            - \notepad.exe
            - \powershell.exe
            - \pwsh.exe
            - \reg.exe
            - \schtasks.exe
            - \werfault.exe
            - \wscript.exe
    filter_main_werfault:
        CommandLine|contains: ' -u -p '
        NewProcessName|endswith: \werfault.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unlikely, but can rarely occur. Apply additional filters accordingly.
level: high
ruletype: Sigma
