title: Meterpreter or Cobalt Strike Getsystem Service Start
ruletype: Sigma
author: Teymur Kheirkhabarov, Ecco, Florian Roth
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
    a specific service starting
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*echo*'
    SELECTION_11:
        CommandLine: '*\pipe\\*'
    SELECTION_12:
        CommandLine: '*cmd.exe*'
    SELECTION_13:
        CommandLine: '*/c*'
    SELECTION_14:
        CommandLine: '*echo*'
    SELECTION_15:
        CommandLine: '*\pipe\\*'
    SELECTION_16:
        CommandLine: '*rundll32*'
    SELECTION_17:
        CommandLine: '*.dll,a*'
    SELECTION_18:
        CommandLine: '*/p:*'
    SELECTION_19:
        CommandLine: '*MpCmdRun*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\services.exe'
    SELECTION_4:
        CommandLine: '*cmd*'
    SELECTION_5:
        CommandLine: '*/c*'
    SELECTION_6:
        CommandLine: '*echo*'
    SELECTION_7:
        CommandLine: '*\pipe\\*'
    SELECTION_8:
        CommandLine: '*%COMSPEC%*'
    SELECTION_9:
        CommandLine: '*/c*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and ((SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13 and SELECTION_14
        and SELECTION_15) or (SELECTION_16 and SELECTION_17 and SELECTION_18))) and  not
        (SELECTION_19))
falsepositives:
- Commandlines containing components like cmd accidentally
- Jobs and services started with cmd
fields:
- ComputerName
- User
- CommandLine
id: 15619216-e993-4721-b590-4c520615a67d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/05/20
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
status: experimental
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002

