title: XSL Script Processing
ruletype: Sigma
author: Timur Zinniatullin, oscd.community, Swachchhanda Shrawan Poudel
date: 2019/10/21
description: Extensible Stylesheet Language (XSL) files are commonly used to describe
    the processing and rendering of data within XML files. Rule detects when adversaries
    abuse this functionality to execute arbitrary files while potentially bypassing
    application whitelisting defenses.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wmic.exe'
    SELECTION_4:
        CommandLine:
        - '*/format*'
        - '*-format*'
    SELECTION_5:
        CommandLine:
        - '*Format:List*'
        - '*Format:htable*'
        - '*Format:hform*'
        - '*Format:table*'
        - '*Format:mof*'
        - '*Format:value*'
        - '*Format:rawxml*'
        - '*Format:xml*'
        - '*Format:csv*'
    SELECTION_6:
        NewProcessName: '*\msxsl.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 and SELECTION_4)
        and  not (SELECTION_5)) or SELECTION_6))
falsepositives:
- WMIC.exe FP depend on scripts and administrative methods used in the monitored environment.
- Msxsl.exe is not installed by default, so unlikely.
- Static format arguments - https://petri.com/command-line-wmi-part-3
id: 05c36dd6-79d6-4a9a-97da-3db20298ab2d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/04/21
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1220/T1220.md
status: test
tags:
- attack.defense_evasion
- attack.t1220

