title: Remote Access Tool - Team Viewer Session Started On Windows Host
id: 6ea28a10-22c9-94e3-ecf6-cd29b8bc75bd
status: experimental
description: |
    Detects the command line executed when TeamViewer starts a session started by a remote host.
    Once a connection has been started, an investigator can verify the connection details by viewing the "incoming_connections.txt" log file in the TeamViewer folder.
references:
    - Internal Research
author: Josh Nickels, Qi Nan
date: 2024/03/11
tags:
    - attack.initial_access
    - attack.t1133
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|endswith: TeamViewer_Desktop.exe --IPCport 5939 --Module 1
        NewProcessName: TeamViewer_Desktop.exe
        ParentProcessName: TeamViewer_Service.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate usage of TeamViewer
level: low
ruletype: Sigma
