title: Stop Windows Service Via Sc.EXE
id: 81bcb81b-5b1f-474b-b373-52c871aaa7b1
related:
    -   id: eb87818d-db5d-49cc-a987-d5da331fbd90
        type: obsoletes
status: test
description: Detects the stopping of a Windows service
author: Jakob Weinzettl, oscd.community, Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/05
tags:
    - attack.impact
    - attack.t1489
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        -   OriginalFileName: sc.exe
        -   NewProcessName|endswith: \sc.exe
    selection_cli:
        CommandLine|contains: ' stop '
    filter_kaspersky:
        CommandLine:
            - sc  stop KSCWebConsoleMessageQueue
            - sc  stop LGHUBUpdaterService
        SubjectUserName|contains:
            - AUTHORI
            - AUTORI
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - There are many legitimate reasons to stop a service. This rule isn't looking
        for any suspicious behaviour in particular. Filter legitimate activity accordingly
level: low
ruletype: Sigma
