title: Conhost Parent Process Executions
ruletype: Sigma
author: omkar72
date: 2020/10/25
description: Detects the conhost execution as parent process. Can be used to evaded
    defense mechanism.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\conhost.exe'
    SELECTION_4:
        Provider_Name: SystemTraceProvider-Process
    SELECTION_5:
        NewProcessName: '*\git.exe'
    SELECTION_6:
        ParentCommandLine: '* show *'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unlikely, conhost is a child less process
fields:
- Image
- CommandLine
- ParentCommandLine
id: 7dc2dedd-7603-461a-bc13-15803d132355
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/09/29
references:
- http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

