title: Potential Excel.EXE DCOM Lateral Movement Via ActivateMicrosoftApp
id: dfd2290c-5c82-62f3-7643-4df329d43ce1
related:
    - id: 551d9c1f-816c-445b-a7a6-7a3864720d60
      type: derived
status: test
description: |
    Detects suspicious child processes of Excel which could be an indicator of lateral movement leveraging the "ActivateMicrosoftApp" Excel DCOM object.
references:
    - https://posts.specterops.io/lateral-movement-abuse-the-power-of-dcom-excel-application-3c016d0d9922
    - https://github.com/grayhatkiller/SharpExShell
    - https://learn.microsoft.com/en-us/office/vba/api/excel.xlmsapplication
author: Aaron Stratton
date: 2023-11-13
tags:
    - attack.t1021.003
    - attack.lateral-movement
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \excel.exe
    selection_child:
        - OriginalFileName:
              - foxprow.exe
              - schdplus.exe
              - winproj.exe
        - NewProcessName|endswith:
              - \foxprow.exe
              - \schdplus.exe
              - \winproj.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
