title: Suspicious Remote Child Process From Outlook
ruletype: Sigma
author: Markus Neis, Nasreddine Bencherchali (Nextron Systems)
date: 2018/12/27
description: Detects a suspicious child process spawning from Outlook where the image
    is located in a remote location (SMB/WebDav shares).
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\outlook.exe'
    SELECTION_4:
        NewProcessName: \\\\\*
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: e212d415-0e93-435f-9e1a-f29005bb4723
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/09
references:
- https://github.com/sensepost/ruler
- https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=49
related:
-   id: 208748f7-881d-47ac-a29c-07ea84bf691d
    type: similar
status: test
tags:
- attack.execution
- attack.t1059
- attack.t1202

