title: Suspicious Child Process Of Wermgr.EXE
id: 65769ded-2258-284c-b61d-e79567f5efc0
status: experimental
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) child process
references:
    - https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
    - https://www.echotrail.io/insights/search/wermgr.exe
    - https://github.com/binderlabs/DirCreate2System
author: Florian Roth (Nextron Systems)
date: 2022/10/14
modified: 2023/08/23
tags:
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1055
    - attack.t1036
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \wermgr.exe
        NewProcessName|endswith:
            - \cmd.exe
            - \cscript.exe
            - \ipconfig.exe
            - \mshta.exe
            - \net.exe
            - \net1.exe
            - \netstat.exe
            - \nslookup.exe
            - \powershell_ise.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \systeminfo.exe
            - \whoami.exe
            - \wscript.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
