title: Potential Arbitrary File Download Via MSEdge.EXE
ruletype: Sigma
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/11
description: Detects usage of the "msedge.exe" binary as a LOLBIN to download arbitrary
    file via the CLI
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\msedge.exe'
    SELECTION_4:
        OriginalFileName: msedge.exe
    SELECTION_5:
        CommandLine:
        - '*.exe http*'
        - '*msedge http*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Software that uses MsEdge to download components in the background (see ParentImage,
    ParentCommandLine)
id: 94771a71-ba41-4b6e-a757-b531372eaab6
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/04/06
references:
- https://twitter.com/mrd0x/status/1478116126005641220
- https://lolbas-project.github.io/lolbas/Binaries/Msedge/
status: test
tags:
- attack.command_and_control
- attack.t1105

