title: ZOHO Dctask64 Process Injection
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2020/01/28
description: Detects suspicious process injection using ZOHO's dctask64.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\dctask64.exe'
    SELECTION_4:
        CommandLine: '*DesktopCentral_Agent\agent*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
- ParentImage
id: 6345b048-8441-43a7-9bed-541133633d7a
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://twitter.com/gN3mes1s/status/1222088214581825540
- https://twitter.com/gN3mes1s/status/1222095963789111296
- https://twitter.com/gN3mes1s/status/1222095371175911424
status: test
tags:
- attack.defense_evasion
- attack.t1055.001

