title: Potential Provisioning Registry Key Abuse For Binary Proxy Execution
id: 59996aa8-9ca2-1ef7-5102-ad18e12d4402
status: test
description: Detects potential abuse of the provisioning registry key for indirect command execution through "Provlaunch.exe".
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
    - https://twitter.com/0gtweet/status/1674399582162153472
author: Nasreddine Bencherchali (Nextron Systems), Swachchhanda Shrawan Poudel
date: 2023/08/08
tags:
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: SOFTWARE\Microsoft\Provisioning\Commands\
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
