title: Mstsc.EXE Execution From Uncommon Parent
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/18
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
    located in suspicious locations.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName:
        - '*\brave.exe'
        - '*\CCleanerBrowser.exe'
        - '*\chrome.exe'
        - '*\chromium.exe'
        - '*\firefox.exe'
        - '*\iexplore.exe'
        - '*\microsoftedge.exe'
        - '*\msedge.exe'
        - '*\opera.exe'
        - '*\vivaldi.exe'
        - '*\whale.exe'
        - '*\outlook.exe'
    SELECTION_4:
        NewProcessName: '*\mstsc.exe'
    SELECTION_5:
        OriginalFileName: mstsc.exe
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- Unlikely
id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/18
references:
- https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
- https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
status: experimental
tags:
- attack.lateral_movement

