title: Indirect Inline Command Execution Via Bash.EXE
id: 6068456f-1654-f0e0-1573-add14847b216
status: experimental
description: |
    Detects execution of Microsoft bash launcher with the "-c" flag.
    This can be used to potentially bypass defenses and execute Linux or Windows-based binaries directly via bash.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Bash/
author: frack113
date: 2021/11/24
modified: 2023/08/15
tags:
    - attack.defense_evasion
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - :\Windows\System32\bash.exe
              - :\Windows\SysWOW64\bash.exe
        - OriginalFileName: Bash.exe
    selection_cli:
        CommandLine|contains: ' -c '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
