title: Application Whitelisting Bypass via DLL Loaded by odbcconf.exe
ruletype: Sigma
author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community
date: 2019/10/25
description: Detects defence evasion attempt via odbcconf.exe execution to load DLL
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\odbcconf.exe'
    SELECTION_4:
        CommandLine:
        - '*-f*'
        - '*regsvr*'
    SELECTION_5:
        ParentProcessName: '*\odbcconf.exe'
    SELECTION_6:
        NewProcessName: '*\rundll32.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Legitimate use of odbcconf.exe by legitimate user
id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://twitter.com/Hexacorn/status/1187143326673330176
- https://redcanary.com/blog/raspberry-robin/
status: test
tags:
- attack.defense_evasion
- attack.t1218.008

