title: Suspicious Elevated System Shell
ruletype: Sigma
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
description: Detects when a shell program such as the windows Command Prompt or PowerShell
    is launched with system privileges.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*-ExecutionPolicy Restricted -Command Write-Host*'
    SELECTION_11:
        ParentProcessName: C:\Program Files\erl-*
    SELECTION_12:
        ParentProcessName: '*\bin\erl.exe'
    SELECTION_13:
        ParentProcessName: C:\Windows\System32\CompatTelRunner.exe
    SELECTION_14:
        CommandLine: '*get-vmswitch *'
    SELECTION_15:
        ParentProcessName: C:\Windows\System32\asgard2-agent\bin\generic.exe
    SELECTION_16:
        CommandLine: '* -taskid *'
    SELECTION_17:
        CommandLine: '* -name asgard2-agent *'
    SELECTION_18:
        ParentProcessName: C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
    SELECTION_19:
        NewProcessName: '*\cmd.exe'
    SELECTION_2:
        Channel: Security
    SELECTION_20:
        ParentProcessName: C:\Program Files (x86)\LANDesk\LDClient\sdistbat.exe
    SELECTION_21:
        NewProcessName: '*\cmd.exe'
    SELECTION_22:
        ParentProcessName: C:\Program Files (x86)\Varonis\DatAdvantage\GridCollector\VrnsRealTimeAlertsSvc.exe
    SELECTION_23:
        NewProcessName: '*\cmd.exe'
    SELECTION_24:
        ParentProcessName: C:\Program Files\Tenable\Nessus Agent\nessus-agent-module.exe
    SELECTION_25:
        NewProcessName: '*\cmd.exe'
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
        - Cmd.Exe
    SELECTION_5:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_6:
        SubjectLogonId: '0x3e7'
    SELECTION_7:
        ParentProcessName: C:\Windows\System32\CompatTelRunner.exe
    SELECTION_8:
        ParentCommandLine: '*-m:appraiser.dll -f:DoScheduledTelemetryRun*'
    SELECTION_9:
        OriginalFileName: PowerShell.EXE
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8 and
        SELECTION_9 and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13
        and SELECTION_14) or (SELECTION_15 and SELECTION_16 and SELECTION_17) or (SELECTION_18
        and SELECTION_19) or (SELECTION_20 and SELECTION_21) or (SELECTION_22 and
        SELECTION_23) or (SELECTION_24 and SELECTION_25)))
falsepositives:
- Unknown
id: 178e615d-e666-498b-9630-9ed363038101
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/04
references:
- https://github.com/Wh04m1001/SysmonEoP
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.execution
- attack.t1059

