title: NodejsTools PressAnyKey Lolbin
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/11
description: Detects a certain command line flag combination used by Microsoft.NodejsTools.PressAnyKey.exe
    that can be used to execute any other binary
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*Microsoft.NodejsTools.PressAnyKey.exe normal *'
    SELECTION_4:
        CommandLine: '*.exe normal *'
    SELECTION_5:
        CommandLine: '*.exe'
    SELECTION_6:
        NewProcessName: '*\Microsoft\NodeJsTools\NodeJsTools*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5)) and  not ((SELECTION_6)))
falsepositives:
- Other tools with the same command line flag combination
- Legitimate uses as part of Visual Studio development
id: a20391f8-76fb-437b-abc0-dba2df1952c6
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/mrd0x/status/1463526834918854661
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218

