title: Disabled Volume Snapshots
id: 1f7c1ba3-2f41-4b49-17f6-5a4719527d57
related:
    - id: dee4af55-1f22-4e1d-a9d2-4bdc7ecb472a
      type: derived
status: test
description: Detects commands that temporarily turn off Volume Snapshots
references:
    - https://twitter.com/0gtweet/status/1354766164166115331
author: Florian Roth (Nextron Systems)
date: 2021-01-28
modified: 2023-12-15
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - \Services\VSS\Diag
            - /d Disabled
    condition: process_creation and selection
falsepositives:
    - Legitimate administration
level: high
ruletype: Sigma
