title: Use of PktMon.exe
ruletype: Sigma
author: frack113
date: 2022/03/17
description: Tools to Capture Network Packets on the windows 10 with October 2018
    Update or later.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*PktMon.exe'
    SELECTION_4:
        OriginalFileName: PktMon.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate use
id: f956c7c1-0f60-4bc5-b7d7-b39ab3c08908
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Pktmon/
status: test
tags:
- attack.credential_access
- attack.t1040

