title: Potential Persistence Via VMwareToolBoxCmd.EXE VM State Change Script
id: 3223b8fb-0180-c340-24b5-fc4699287906
status: test
description: Detects execution of the "VMwareToolBoxCmd.exe" with the "script" and "set" flag to setup a specific script to run for a specific VM state
references:
    - https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/
    - https://www.hexacorn.com/blog/2017/01/14/beyond-good-ol-run-key-part-53/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/14
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \VMwareToolBoxCmd.exe
        - OriginalFileName: toolbox-cmd.exe
    selection_cli:
        CommandLine|contains|all:
            - ' script '
            - ' set '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
