title: Password Provided In Command Line Of Net.EXE
ruletype: Sigma
author: Tim Shelton (HAWK.IO)
date: 2021/12/09
description: Detects a when net.exe is called with a password in the command line
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_4:
        OriginalFileName:
        - net.exe
        - net1.exe
    SELECTION_5:
        CommandLine: '* use *'
    SELECTION_6:
        CommandLine: '*:*\\\*'
    SELECTION_7:
        CommandLine: '*/USER:* *'
    SELECTION_8:
        CommandLine: '* '
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7)) and  not ((SELECTION_8)))
falsepositives:
- Unknown
id: d4498716-1d52-438f-8084-4a603157d131
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- Internal Research
status: test

