title: Suspicious PowerShell Download and Execute Pattern
id: 20f83d4c-6338-a0c0-b882-c4c1997c025f
status: test
description: Detects suspicious PowerShell download patterns that are often used in malicious scripts, stagers or downloaders (make sure that your backend applies the strings case-insensitive)
references:
    - https://gist.github.com/jivoi/c354eaaf3019352ce32522f916c03d70
    - https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
author: Florian Roth (Nextron Systems)
date: 2022/02/28
modified: 2022/03/01
tags:
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains: # make sure that your backend applies the strings case-insensitive
            - IEX ((New-Object Net.WebClient).DownloadString
            - IEX (New-Object Net.WebClient).DownloadString
            - IEX((New-Object Net.WebClient).DownloadString
            - IEX(New-Object Net.WebClient).DownloadString
            - ' -command (New-Object System.Net.WebClient).DownloadFile('
            - ' -c (New-Object System.Net.WebClient).DownloadFile('
    condition: process_creation and selection
falsepositives:
    - Software installers that pull packages from remote systems and execute them
level: high
ruletype: Sigma
