title: SQLite Firefox Profile Data DB Access
ruletype: Sigma
author: frack113
date: 2022/04/08
description: Detect usage of the "sqlite" binary to query databases in Firefox and
    other Gecko-based browsers for potential data stealing.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Product: SQLite
    SELECTION_4:
        NewProcessName:
        - '*\sqlite.exe'
        - '*\sqlite3.exe'
    SELECTION_5:
        CommandLine:
        - '*cookies.sqlite*'
        - '*places.sqlite*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 4833155a-4053-4c9c-a997-777fcea0baa7
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/19
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1539/T1539.md#atomic-test-1---steal-firefox-cookies-windows
- https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/
status: experimental
tags:
- attack.credential_access
- attack.t1539
- attack.collection
- attack.t1005

