
title: Suspicious Execution of Systeminfo
ruletype: Sigma
author: frack113
date: 2022/01/01
description: Detects usage of the "systeminfo" command to retrieve information
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\systeminfo.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 0ef56343-059e-4cb6-adc1-4c3c967c5e46
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1082/T1082.md#atomic-test-1---system-information-discovery
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/systeminfo
status: experimental
tags:
- attack.discovery
- attack.t1082
