title: Suspicious CustomShellHost Execution
id: 5f438a3c-3bd7-d256-61ad-9ae6334543ec
related:
    - id: 84b14121-9d14-416e-800b-f3b829c5a14d
      type: derived
status: test
description: Detects the execution of CustomShellHost binary where the child isn't located in 'C:\Windows\explorer.exe'
references:
    - https://github.com/LOLBAS-Project/LOLBAS/pull/180
    - https://lolbas-project.github.io/lolbas/Binaries/CustomShellHost/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-08-19
tags:
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \CustomShellHost.exe
    filter:
        NewProcessName: C:\Windows\explorer.exe
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
