title: HackTool - SafetyKatz Execution
id: b1876533-4ed5-4a83-90f3-b8645840a413
status: test
description: Detects the execution of the hacktool SafetyKatz via PE information and default Image name
references:
    - https://github.com/GhostPack/SafetyKatz
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/20
modified: 2023/02/04
tags:
    - attack.credential_access
    - attack.t1003.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \SafetyKatz.exe
        - OriginalFileName: SafetyKatz.exe
        - Description: SafetyKatz
    condition: process_creation and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
