title: Potentially Suspicious Execution Of Regasm/Regsvcs From Uncommon Location
id: d14f893b-1931-f274-ce30-147d8cca81fb
status: test
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities from a potentially suspicious location
references:
    - https://www.fortiguard.com/threat-signal-report/4718?s=09
    - https://lolbas-project.github.io/lolbas/Binaries/Regasm/
    - https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/25
modified: 2023/02/13
tags:
    - attack.defense_evasion
    - attack.t1218.009
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \Regsvcs.exe
              - \Regasm.exe
        - OriginalFileName:
              - RegSvcs.exe
              - RegAsm.exe
    selection_dir:
        CommandLine|contains:
            # Note: Add more potentially suspicious directories
            - \AppData\Local\Temp\
            - \Microsoft\Windows\Start Menu\Programs\Startup\
            - \PerfLogs\
            - \Users\Public\
            - \Windows\Temp\
            # - '\Desktop\'
            # - '\Downloads\'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
