title: Suspicious Remote Child Process From Outlook
id: f94fdc78-2a2f-b107-8abe-c68c288a8e0c
status: test
description: Detects a suspicious child process spawning from Outlook where the image is located in a remote location (SMB/WebDav shares).
references:
    - https://github.com/sensepost/ruler
    - https://www.fireeye.com/blog/threat-research/2018/12/overruled-containing-a-potentially-destructive-adversary.html
    - https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=49
author: Markus Neis, Nasreddine Bencherchali (Nextron Systems)
date: 2018/12/27
modified: 2023/02/09
tags:
    - attack.execution
    - attack.t1059
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \outlook.exe
        NewProcessName|startswith: \\\\
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
