title: UtilityFunctions.ps1 Proxy Dll
ruletype: Sigma
author: frack113
date: 2022/05/28
description: Detects the use of a Microsoft signed script executing a managed DLL
    with PowerShell.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*UtilityFunctions.ps1*'
        - '*RegSnapin *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 0403d67d-6227-4ea8-8145-4e72db7da120
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Scripts/UtilityFunctions/
status: experimental
tags:
- attack.defense_evasion
- attack.t1216

