title: Logon Scripts (UserInitMprLogonScript)
ruletype: Sigma
author: Tom Ueltschi (@c_APT_ure), Tim Shelton
date: 2019/01/12
description: Detects creation or execution of UserInitMprLogonScript persistence method
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\userinit.exe'
    SELECTION_4:
        NewProcessName:
        - '*explorer.exe'
        - '*\proquota.exe'
    SELECTION_5:
        CommandLine:
        - '*netlogon*.bat*'
        - '*UsrLogon.cmd*'
        - '*C:\WINDOWS\Explorer.EXE*'
    SELECTION_6:
        NewProcessName: '*\Citrix\System32\icast.exe'
    SELECTION_7:
        CommandLine: '*UserInitMprLogonScript*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6))) or SELECTION_7))
falsepositives:
- Exclude legitimate logon scripts
id: 0a98a10c-685d-4ab0-bddc-b6bdd1d48458
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/05/31
references:
- https://cocomelonc.github.io/persistence/2022/12/09/malware-pers-20.html
status: test
tags:
- attack.t1037.001
- attack.persistence

