title: Potential RDP Tunneling Via Plink
id: 2eaa1baa-a2c9-b59b-efa8-825ca75ad2d8
status: test
description: Execution of plink to perform data exfiltration and tunneling
references:
    - https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
author: Florian Roth (Nextron Systems)
date: 2022/08/04
modified: 2023/01/27
tags:
    - attack.command_and_control
    - attack.t1572
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_a:
        CommandLine|contains: :127.0.0.1:3389
        NewProcessName|endswith: \plink.exe
    selection_b1:
        CommandLine|contains: :3389
        NewProcessName|endswith: \plink.exe
    selection_b2:
        CommandLine|contains:
            - ' -P 443'
            - ' -P 22'
    condition: process_creation and (selection_a or all of selection_b*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
