title: Use of Wfc.exe
id: 735b333c-168f-1517-ce6e-44604578243f
related:
    - id: 49be8799-7b4d-4fda-ad23-cafbefdebbc5
      type: derived
status: test
description: The Workflow Command-line Compiler can be used for AWL bypass and is listed in Microsoft's recommended block rules.
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wfc/
    - https://docs.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/microsoft-recommended-block-rules
author: Christopher Peacock @SecurePeacock, SCYTHE @scythe_io
date: 2022/06/01
tags:
    - attack.defense_evasion
    - attack.t1127
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \wfc.exe
        - OriginalFileName: wfc.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use by a software developer
level: medium
ruletype: Sigma
