title: Delete Important Scheduled Task
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/09
description: Detects when adversaries stop services or processes by deleting their
    respective schdueled tasks in order to conduct data destructive activities
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\schtasks.exe'
    SELECTION_4:
        CommandLine: '*/delete*'
    SELECTION_5:
        CommandLine: '*/tn*'
    SELECTION_6:
        CommandLine:
        - '*\Windows\SystemRestore\SR*'
        - '*\Windows\Windows Defender\\*'
        - '*\Windows\BitLocker*'
        - '*\Windows\WindowsBackup\\*'
        - '*\Windows\WindowsUpdate\\*'
        - '*\Windows\UpdateOrchestrator\\*'
        - '*\Windows\ExploitGuard*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unlikely
id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
level: high
logsource:
    category: process_creation
    product: windows
references:
- Internal Research
related:
-   id: 9ac94dc8-9042-493c-ba45-3b5e7c86b980
    type: derived
-   id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
    type: similar
status: experimental
tags:
- attack.impact
- attack.t1489

