title: RDP Port Forwarding Rule Added Via Netsh.EXE
id: 351d47d4-a048-9463-4aea-54964c77adee
related:
    - id: 782d6f3e-4c5d-4b8c-92a3-1d05fed72e63
      type: derived
status: test
description: Detects the execution of netsh to configure a port forwarding of port 3389 (RDP) rule
references:
    - https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
author: Florian Roth (Nextron Systems), oscd.community
date: 2019-01-29
modified: 2023-02-13
tags:
    - attack.lateral-movement
    - attack.defense-evasion
    - attack.command-and-control
    - attack.t1090
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \netsh.exe
        - OriginalFileName: netsh.exe
    selection_cli:
        CommandLine|contains|all:
            - ' i'
            - ' p'
            - =3389
            - ' c'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate administration activity
level: high
ruletype: Sigma
