title: C# IL Code Compilation Via Ilasm.EXE
id: 5ea0b54f-98b4-7cc7-6c38-01a53470b4e4
related:
    - id: 850d55f9-6eeb-4492-ad69-a72338f65ba4
      type: derived
status: test
description: Detects the use of "Ilasm.EXE" in order to compile C# intermediate (IL) code to EXE or DLL.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Ilasm/
    - https://www.echotrail.io/insights/search/ilasm.exe
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2022-05-07
modified: 2022-05-16
tags:
    - attack.defense-evasion
    - attack.t1127
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \ilasm.exe
        - OriginalFileName: ilasm.exe
    selection_cli:
        CommandLine|contains:
            - ' /dll'
            - ' /exe'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
