title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
ruletype: Sigma
author: frack113
date: 2021/07/27
description: An adversary may compress or encrypt data that is collected prior to
    exfiltration using 3rd party utilities
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Description: '*7-Zip*'
    SELECTION_4:
        NewProcessName:
        - '*\7z.exe'
        - '*\7zr.exe'
        - '*\7za.exe'
    SELECTION_5:
        OriginalFileName:
        - 7z.exe
        - 7za.exe
    SELECTION_6:
        CommandLine: '* -p*'
    SELECTION_7:
        CommandLine:
        - '* a *'
        - '* u *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and SELECTION_6 and SELECTION_7)
falsepositives:
- Legitimate activity is expected since compressing files with a password is common.
id: 9fbf5927-5261-4284-a71d-f681029ea574
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
status: test
tags:
- attack.collection
- attack.t1560.001

