title: Suspicious Use of CSharp Interactive Console
id: a9e416a8-e613-4f8b-88b8-a7d1d1af2f61
status: test
description: Detects the execution of CSharp interactive console by PowerShell
references:
    - https://redcanary.com/blog/detecting-attacks-leveraging-the-net-framework/
author: Michael R. (@nahamike01)
date: 2020/03/08
modified: 2022/07/14
tags:
    - attack.execution
    - attack.t1127
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        OriginalFileName: csi.exe
        NewProcessName|endswith: \csi.exe
        ParentProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \powershell_ise.exe
    condition: process_creation and selection
falsepositives:
    - Possible depending on environment. Pair with other factors such as net connections,
        command-line args, etc.
level: high
ruletype: Sigma
