title: ShimCache Flush
id: 3681f000-5b6c-d6a6-3a0f-8240c1325dc3
related:
    - id: b0524451-19af-4efa-a46f-562a977f792e
      type: derived
status: stable
description: Detects actions that clear the local ShimCache and remove forensic evidence
references:
    - https://medium.com/@blueteamops/shimcache-flush-89daff28d15e
author: Florian Roth (Nextron Systems)
date: 2021-02-01
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.t1112
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1a:
        CommandLine|contains|all:
            - rundll32
            - apphelp.dll
    selection1b:
        CommandLine|contains:
            - ShimFlushCache
            - '#250'
    selection2a:
        CommandLine|contains|all:
            - rundll32
            - kernel32.dll
    selection2b:
        CommandLine|contains:
            - BaseFlushAppcompatCache
            - '#46'
    condition: process_creation and (( selection1a and selection1b ) or ( selection2a and selection2b ))
falsepositives:
    - Unknown
level: high
ruletype: Sigma
