title: Potential LethalHTA Technique Execution
id: f9884b6b-0ac3-139d-1ebe-a5587c9a51fd
related:
    - id: ed5d72a6-f8f4-479d-ba79-02f6a80d7471
      type: derived
status: test
description: Detects potential LethalHTA technique where the "mshta.exe" is spawned by an "svchost.exe" process
references:
    - https://codewhitesec.blogspot.com/2018/07/lethalhta.html
author: Markus Neis
date: 2018-06-07
modified: 2023-02-07
tags:
    - attack.defense-evasion
    - attack.t1218.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \svchost.exe
        NewProcessName|endswith: \mshta.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
