title: HackTool - Covenant PowerShell Launcher
id: 12b4859c-0eeb-091f-3b96-09ffcd5e9a9a
related:
    - id: c260b6db-48ba-4b4a-a76f-2f67644e99d2
      type: derived
status: test
description: Detects suspicious command lines used in Covenant luanchers
references:
    - https://posts.specterops.io/covenant-v0-5-eee0507b85ba
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: 2020-06-04
modified: 2023-02-21
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1059.001
    - attack.t1564.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_1:
        CommandLine|contains|all:
            - -Sta
            - -Nop
            - -Window
            - Hidden
        CommandLine|contains:
            - -Command
            - -EncodedCommand
    selection_2:
        CommandLine|contains:
            - 'sv o (New-Object IO.MemorySteam);sv d '
            - mshta file.hta
            - GruntHTTP
            - -EncodedCommand cwB2ACAAbwAgA
    condition: process_creation and (1 of selection_*)
level: high
ruletype: Sigma
