title: Imports Registry Key From a File
ruletype: Sigma
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/07
description: Detects the import of the specified file to the registry with regedit.exe.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\regedit.exe'
    SELECTION_4:
        OriginalFileName: REGEDIT.EXE
    SELECTION_5:
        CommandLine:
        - '* /i *'
        - '* /s *'
        - '*.reg*'
    SELECTION_6:
        CommandLine:
        - '* /e *'
        - '* /a *'
        - '* /c *'
        - '* -e *'
        - '* -a *'
        - '* -c *'
    SELECTION_7:
        CommandLine|re: :[^ \\]
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6) and (SELECTION_7)))
falsepositives:
- Legitimate import of keys
- Evernote
fields:
- ParentImage
- CommandLine
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://lolbas-project.github.io/lolbas/Binaries/Regedit/
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
related:
-   id: 0b80ade5-6997-4b1d-99a1-71701778ea61
    type: similar
status: test
tags:
- attack.t1112
- attack.defense_evasion

