title: Raccine Uninstall
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2021/01/21
description: Detects commands that indicate a Raccine removal from an end system.
    Raccine is a free ransomware protection tool.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*Raccine Rules Updater*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*taskkill *'
    SELECTION_4:
        CommandLine: '*RaccineSettings.exe*'
    SELECTION_5:
        CommandLine: '*reg.exe*'
    SELECTION_6:
        CommandLine: '*delete*'
    SELECTION_7:
        CommandLine: '*Raccine Tray*'
    SELECTION_8:
        CommandLine: '*schtasks*'
    SELECTION_9:
        CommandLine: '*/DELETE*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10)))
falsepositives:
- Legitimate deinstallation by administrative staff
id: a31eeaed-3fd5-478e-a8ba-e62c6b3f9ecc
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://github.com/Neo23x0/Raccine
status: test
tags:
- attack.defense_evasion
- attack.t1562.001

