title: Shells Spawned by Java
id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
status: experimental
description: Detects shell spawned from Java host process, which could be a sign of
    exploitation (e.g. log4j exploitation)
author: Andreas Hunkeler (@Karneades), Nasreddine Bencherchali
date: 2021/12/17
modified: 2022/07/27
tags:
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \java.exe
        NewProcessName|endswith:
            - \cmd.exe
            - \powershell.exe
            - \pwsh.exe
    filter:
        CommandLine|contains: build
        ParentProcessName|contains: build
    condition: process_creation and (selection and not filter)
falsepositives:
    - Legitimate calls to system binaries
    - Company specific internal usage
level: medium
ruletype: Sigma
