title: Visual Studio NodejsTools PressAnyKey Renamed Execution
id: ca91ea6e-7289-790d-989d-7f4bc5dedf2b
status: test
description: Detects renamed execution of "Microsoft.NodejsTools.PressAnyKey.exe", which can be abused as a LOLBIN to execute arbitrary binaries
references:
    - https://twitter.com/mrd0x/status/1463526834918854661
    - https://gist.github.com/nasbench/a989ce64cefa8081bd50cf6ad8c491b5
author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2023/04/11
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        OriginalFileName: Microsoft.NodejsTools.PressAnyKey.exe
    filter_main_legit_name:
        NewProcessName|endswith: \Microsoft.NodejsTools.PressAnyKey.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
