title: Suspicious Cabinet File Expansion
id: 9f107a84-532c-41af-b005-8d12a607639f
status: test
description: Adversaries can use the built-in expand utility to decompress cab files
    as seen in recent Iranian MeteorExpress attack
references:
    - https://labs.sentinelone.com/meteorexpress-mysterious-wiper-paralyzes-iranian-trains-with-epic-troll
    - https://blog.malwarebytes.com/threat-intelligence/2021/08/new-variant-of-konni-malware-used-in-campaign-targetting-russia/
author: Bhabesh Raj
date: 2021/07/30
modified: 2023/02/07
tags:
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - .cab
            - '/F:'
            - '-F:'
            - C:\ProgramData\
            - C:\Public\
            - \AppData\Local\Temp\
            - \AppData\Roaming\Temp\
        NewProcessName|endswith: \expand.exe
    filter_dell:
        CommandLine|contains: C:\ProgramData\Dell\UpdateService\Temp\
        ParentProcessName: C:\Program Files (x86)\Dell\UpdateService\ServiceShell.exe
    condition: process_creation and (selection and not 1 of filter_*)
fields:
    - SubjectUserName
    - ComputerName
    - CommandLine
    - ParentCommandLine
falsepositives:
    - System administrator Usage
level: medium
ruletype: Sigma
