title: Potential PowerShell Console History Access Attempt via History File
id: 3becf1a9-6869-2795-e158-31485eae103f
related:
    - id: f4ff7323-b5fc-4323-8b52-6b9408e15788
      type: derived
status: experimental
description: |
    Detects potential access attempts to the PowerShell console history directly via history file (ConsoleHost_history.txt).
    This can give access to plaintext passwords used in PowerShell commands or used for general reconnaissance.
references:
    - https://0xdf.gitlab.io/2018/11/08/powershell-history-file.html
author: Luc Génaux
date: 2025-04-03
tags:
    - attack.credential-access
    - attack.t1552.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - ConsoleHost_history.txt
            - (Get-PSReadLineOption).HistorySavePath
    condition: process_creation and selection
falsepositives:
    - Legitimate access of the console history file is possible
level: medium
ruletype: Sigma
