title: Suspicious Add User to Remote Desktop Users Group
ruletype: Sigma
author: Florian Roth
date: 2021/12/06
description: Detects suspicious command line in which a user gets added to the local
    Remote Desktop Users group
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*localgroup *'
    SELECTION_4:
        CommandLine: '* /add*'
    SELECTION_5:
        CommandLine: '*Add-LocalGroupMember *'
    SELECTION_6:
        CommandLine: '* -Group *'
    SELECTION_7:
        CommandLine:
        - '*Remote Desktop Users*'
        - "*Utilisateurs du Bureau \xE0 distance*"
        - '*Usuarios de escritorio remoto*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
        (SELECTION_5 and SELECTION_6)) and SELECTION_7)
falsepositives:
- Administrative activity
fields:
- CommandLine
- ParentCommandLine
id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/09
references:
- https://www.microsoft.com/security/blog/2021/11/16/evolving-trends-in-iranian-threat-actor-activity-mstic-presentation-at-cyberwarcon-2021/
related:
-   id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
    type: similar
status: experimental
tags:
- attack.persistence
- attack.lateral_movement
- attack.t1133
- attack.t1136.001
- attack.t1021.001

