title: Suspicious Child Process Of SQL Server
id: 869b9ca7-9ea2-4a5a-8325-e80e62f75445
related:
    - id: 344482e4-a477-436c-aa70-7536d18a48c7
      type: obsoletes
status: test
description: Detects suspicious child processes of the SQLServer process. This could indicate potential RCE or SQL Injection.
references:
    - Internal Research
author: FPT.EagleEye Team, wagga
date: 2020/12/11
modified: 2023/05/04
tags:
    - attack.t1505.003
    - attack.t1190
    - attack.initial_access
    - attack.persistence
    - attack.privilege_escalation
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \sqlservr.exe
        NewProcessName|endswith:
            # You can add other uncommon or suspicious processes
            - \bash.exe
            - \bitsadmin.exe
            - \cmd.exe
            - \netstat.exe
            - \nltest.exe
            - \ping.exe
            - \powershell.exe
            - \pwsh.exe
            - \regsvr32.exe
            - \rundll32.exe
            - \sh.exe
            - \systeminfo.exe
            - \tasklist.exe
            - \wsl.exe
    filter_optional_datev:
        CommandLine|startswith: '"C:\Windows\system32\cmd.exe" '
        ParentProcessName|startswith: C:\Program Files\Microsoft SQL Server\
        ParentProcessName|endswith: DATEV_DBENGINE\MSSQL\Binn\sqlservr.exe
        NewProcessName: C:\Windows\System32\cmd.exe
    condition: process_creation and (selection and not 1 of filter_optional_*)
level: high
ruletype: Sigma
