title: Potential WinAPI Calls Via CommandLine
id: acf0cb14-e141-75f6-8a56-a843022146d1
status: test
description: Detects the use of WinAPI Functions via the commandline. As seen used by threat actors via the tool winapiexec
references:
    - https://twitter.com/m417z/status/1566674631788007425
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/06
modified: 2023/01/09
tags:
    - attack.execution
    - attack.t1106
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - AddSecurityPackage
            - AdjustTokenPrivileges
            - Advapi32
            - CloseHandle
            - CreateProcessWithToken
            - CreatePseudoConsole
            - CreateRemoteThread
            - CreateThread
            - CreateUserThread
            - DangerousGetHandle
            - DuplicateTokenEx
            - EnumerateSecurityPackages
            - FreeHGlobal
            - FreeLibrary
            - GetDelegateForFunctionPointer
            - GetLogonSessionData
            - GetModuleHandle
            - GetProcAddress
            - GetProcessHandle
            - GetTokenInformation
            - ImpersonateLoggedOnUser
            - kernel32
            - LoadLibrary
            - memcpy
            - MiniDumpWriteDump
            # - 'msvcrt'
            - ntdll
            - OpenDesktop
            - OpenProcess
            - OpenProcessToken
            - OpenThreadToken
            - OpenWindowStation
            - PtrToString
            - QueueUserApc
            - ReadProcessMemory
            - RevertToSelf
            - RtlCreateUserThread
            - secur32
            - SetThreadToken
            # - 'user32'
            - VirtualAlloc
            - VirtualFree
            - VirtualProtect
            - WaitForSingleObject
            - WriteInt32
            - WriteProcessMemory
            - ZeroFreeGlobalAllocUnicode
    filter_optional_mpcmdrun:
        CommandLine|contains: GetLoadLibraryWAddress32
        NewProcessName|endswith: \MpCmdRun.exe
    condition: process_creation and (selection and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
