title: Parent in Public Folder Suspicious Process
id: 69bd9b97-2be2-41b6-9816-fb08757a4d1a
status: test
description: This rule detects suspicious processes with parent images located in the C:\Users\Public folder
references:
    - https://redcanary.com/blog/blackbyte-ransomware/
author: Florian Roth (Nextron Systems)
date: 2022/02/25
modified: 2022/11/18
tags:
    - attack.defense_evasion
    - attack.execution
    - attack.t1564
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - powershell
            - 'cmd.exe /c '
            - 'cmd.exe /r '
            - 'cmd.exe /k '
            - 'cmd /c '
            - 'cmd /r '
            - 'cmd /k '
            - wscript.exe
            - cscript.exe
            - bitsadmin
            - certutil
            - mshta.exe
        ParentProcessName|startswith: C:\Users\Public\
    condition: process_creation and selection
fields:
    - SubjectUserName
    - ComputerName
    - CommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
