title: PsExec/PAExec Flags
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2021/05/22
description: Detects suspicious flags used by PsExec and PAExec but no usual program
    name in command line
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '* -s cmd*'
        - '* /s cmd*'
        - '* -s -i cmd*'
        - '* /s /i cmd*'
        - '* /s -i cmd*'
        - '* -s /i cmd*'
        - '* -i -s cmd*'
        - '* /i /s cmd*'
        - '* -i /s cmd*'
        - '* /i -s cmd*'
        - '* -s pwsh*'
        - '* /s pwsh*'
        - '* -s -i pwsh*'
        - '* /s /i pwsh*'
        - '* /s -i pwsh*'
        - '* -s /i pwsh*'
        - '* -i -s pwsh*'
        - '* /i /s pwsh*'
        - '* -i /s pwsh*'
        - '* /i -s pwsh*'
        - '* -s powershell*'
        - '* /s powershell*'
        - '* -s -i powershell*'
        - '* /s /i powershell*'
        - '* /s -i powershell*'
        - '* -s /i powershell*'
        - '* -i -s powershell*'
        - '* /i /s powershell*'
        - '* -i /s powershell*'
        - '* /i -s powershell*'
    SELECTION_4:
        CommandLine: '*accepteula*'
    SELECTION_5:
        CommandLine: '* -u *'
    SELECTION_6:
        CommandLine: '* -p *'
    SELECTION_7:
        CommandLine: '* \\\*'
    SELECTION_8:
        CommandLine:
        - '*paexec*'
        - '*PsExec*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5 and SELECTION_6 and SELECTION_7)) and  not (SELECTION_8))
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PsExec/PAExec with their software and rename it,
    so that it is less embarrassing
id: 207b0396-3689-42d9-8399-4222658efc99
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/06
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
related:
-   id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
    type: similar
status: experimental
tags:
- attack.resource_development
- attack.t1587.001

