title: Arbitrary File Download Via MSEDGE_PROXY.EXE
id: d6d1a63b-5f0f-795e-fe18-4c2e1784568d
related:
    - id: e84d89c4-f544-41ca-a6af-4b92fd38b023
      type: derived
status: test
description: Detects usage of "msedge_proxy.exe" to download arbitrary files
references:
    - https://lolbas-project.github.io/lolbas/Binaries/msedge_proxy/
author: Swachchhanda Shrawan Poudel
date: 2023-11-09
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \msedge_proxy.exe
        - OriginalFileName: msedge_proxy.exe
    selection_cli:
        CommandLine|contains:
            - http://
            - https://
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
