title: Taskmgr as Parent
id: 3d7679bd-0c00-440c-97b0-3f204273e6c7
status: test
description: Detects the creation of a process from Windows task manager
author: Florian Roth (Nextron Systems)
date: 2018/03/13
modified: 2021/11/27
tags:
    - attack.defense_evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \taskmgr.exe
    filter:
        NewProcessName|endswith:
            - \resmon.exe
            - \mmc.exe
            - \taskmgr.exe
    condition: process_creation and (selection and not filter)
fields:
    - NewProcessName
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Administrative activity
level: low
ruletype: Sigma
