title: Remote Access Tool - Team Viewer Session Started On Windows Host
id: 6ea28a10-22c9-94e3-ecf6-cd29b8bc75bd
related:
    - id: 1f6b8cd4-3e60-47cc-b282-5aa1cbc9182d
      type: similar
    - id: f459ccb4-9805-41ea-b5b2-55e279e2424a
      type: similar
    - id: ab70c354-d9ac-4e11-bbb6-ec8e3b153357
      type: derived
status: test
description: |
    Detects the command line executed when TeamViewer starts a session started by a remote host.
    Once a connection has been started, an investigator can verify the connection details by viewing the "incoming_connections.txt" log file in the TeamViewer folder.
references:
    - Internal Research
author: Josh Nickels, Qi Nan
date: 2024-03-11
tags:
    - attack.persistence
    - attack.initial-access
    - attack.t1133
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|endswith: TeamViewer_Desktop.exe --IPCport 5939 --Module 1
        NewProcessName: TeamViewer_Desktop.exe
        ParentProcessName: TeamViewer_Service.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate usage of TeamViewer
level: low
ruletype: Sigma
