title: Arbitrary Command Execution Using WSL
ruletype: Sigma
author: oscd.community, Zach Stanford @svch0st, Nasreddine Bencherchali
date: 2020/10/05
description: Detects Possible usage of Windows Subsystem for Linux (WSL) binary as
    a LOLBIN to execute arbitrary linux and windows commands
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wsl.exe'
    SELECTION_4:
        OriginalFileName: wsl.exe
    SELECTION_5:
        CommandLine:
        - '* -e *'
        - '* --exec*'
        - '* --system*'
        - '* --shell-type *'
        - '* /mnt/c*'
        - '* --user root*'
        - '* -u root*'
    SELECTION_6:
        ParentProcessName: '*\cmd.exe'
    SELECTION_7:
        CommandLine: '* -d *'
    SELECTION_8:
        CommandLine: '* -e kill *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        SELECTION_5) and  not ((SELECTION_6 and SELECTION_7 and SELECTION_8)))
falsepositives:
- Automation and orchestration scripts may use this method to execute scripts etc.
- Legitimate use by Windows to kill processes opened via WSL (example VsCode WSL server)
id: dec44ca7-61ad-493c-bfd7-8819c5faa09b
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/23
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Wsl/
- https://twitter.com/nas_bench/status/1535431474429808642
related:
-   id: 2267fe65-0681-42ad-9a6d-46553d3f3480
    type: similar
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202

