title: Suspicious Execution of Shutdown
ruletype: Sigma
author: frack113
date: 2022/01/01
description: Use of the commandline to shutdown or reboot windows
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\shutdown.exe'
    SELECTION_4:
        CommandLine:
        - '*/r *'
        - '*/s *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 34ebb878-1b15-4895-b352-ca2eeb99b274
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1529/T1529.md
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/shutdown
status: test
tags:
- attack.impact
- attack.t1529

