title: Suspicious Service Path Modification
ruletype: Sigma
author: Victor Sergeev, oscd.community, Nasreddine Bencherchali (update)
date: 2019/10/21
description: Detects service path modification via the "sc" binary to a suspicious
    command or path
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\sc.exe'
    SELECTION_4:
        CommandLine: '*config*'
    SELECTION_5:
        CommandLine: '*binPath*'
    SELECTION_6:
        CommandLine:
        - '*powershell*'
        - '*cmd *'
        - '*mshta*'
        - '*wscript*'
        - '*cscript*'
        - '*rundll32*'
        - '*svchost*'
        - '*dllhost*'
        - '*cmd.exe /c*'
        - '*C:\Users\Public*'
        - '*\Downloads\\*'
        - '*\Desktop\\*'
        - '*\Microsoft\Windows\Start Menu\Programs\Startup\\*'
        - '*C:\Windows\TEMP\\*'
        - '*\AppData\Local\Temp*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unlikely
fields:
- CommandLine
- ParentCommandLine
id: 138d3531-8793-4f50-a2cd-f291b2863d78
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1543.003/T1543.003.md
- https://web.archive.org/web/20180331144337/https://www.fireeye.com/blog/threat-research/2018/03/sanny-malware-delivery-method-updated-in-recently-observed-attacks.html
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003

