title: Microsoft IIS Connection Strings Decryption
ruletype: Sigma
author: Tim Rauch
date: 2022/09/28
description: Detects use of aspnet_regiis to decrypt Microsoft IIS connection strings.
    An attacker with Microsoft IIS web server access via a webshell or alike can decrypt
    and dump any hardcoded connection strings, such as the MSSQL service account password
    using aspnet_regiis command.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\aspnet_regiis.exe'
    SELECTION_4:
        OriginalFileName: aspnet_regiis.exe
    SELECTION_5:
        CommandLine: '*connectionStrings*'
    SELECTION_6:
        CommandLine: '* -pdf*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 97dbf6e2-e436-44d8-abee-4261b24d3e41
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/30
references:
- https://www.elastic.co/guide/en/security/current/microsoft-iis-connection-strings-decryption.html
status: experimental
tags:
- attack.credential_access
- attack.t1003

