title: Suspicious Stop Windows Service
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/09/01
description: Detects the usage of one of the the commands to stop services such as
    'net', 'sc'...etc in order to stop critical or important windows services such
    as AV, Backup...etc. As seen being used in some ransomware scripts
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*"Acronis VSS Provider"*'
        - '*"Client Agent 7.60"*'
        - '*"Enterprise Client Service"*'
        - '*"Sophos Agent"*'
        - '*"Sophos AutoUpdate Service"*'
        - '*"Sophos Clean Service"*'
        - '*"Sophos Device Control Service"*'
        - '*"Sophos File Scanner Service"*'
        - '*"Sophos Health Service"*'
        - '*"Sophos MCS Agent"*'
        - '*"Sophos MCS Client"*'
        - '*"Sophos Message Router"*'
        - '*"Sophos Safestore Service"*'
        - '*"Sophos System Protection Service"*'
        - '*"Sophos Web Control Service"*'
        - '*"SQL Backups"*'
        - '*"SQL Server (MSSQLSERVER)"*'
        - '*"SQL Server (SQLEXPRESS)*'
        - '*"SQLsafe Backup Service"*'
        - '*"SQLsafe Filter Service"*'
        - '*"Symantec System Recovery"*'
        - '*"Veeam Backup Catalog Data Service"*'
        - '*"Veritas System Recovery"*'
        - '*"Zoolz 2 Service"*'
        - "*\u201CAvast Business Console Client Antivirus Service\u201D*"
        - "*\u201Cavast! Antivirus\u201D*"
        - "*\u201CSQL Backups\u201D*"
        - "*\u201CZoolz 2 Service\u201D*"
        - '*143Svc*'
        - '*AcronisAgent*'
        - '*AcrSch2Svc*'
        - '*Antivirus*'
        - '*ARSM*'
        - '*aswBcc*'
        - '*AVP*'
        - '*BackupExecAgentAccelerator*'
        - '*BackupExecAgentBrowser*'
        - '*BackupExecDeviceMediaService*'
        - '*BackupExecJobEngine*'
        - '*BackupExeclobEngine*'
        - '*BackupExecManagementService*'
        - '*BackupExecRPCService*'
        - '*BackupExecVSSProvider*'
        - '*bedbg*'
        - '*BITS*'
        - '*BrokerInfrastructure*'
        - '*DCAgent*'
        - '*EhttpSrv*'
        - '*EhttpSry*'
        - '*ekrn*'
        - '*epag*'
        - '*EPIntegrationService*'
        - '*EPlntegrationService*'
        - '*EPProtectedService*'
        - '*EPRedline*'
        - '*EPSecurityService*'
        - '*EPUpdateService*'
        - '*EraserSvc11710*'
        - '*EsgShKernel*'
        - '*ESHASRV*'
        - '*FA_Scheduler*'
        - '*HealthTLService*'
        - '*HISSQLFDLauncherSSHAREPOINIT*'
        - '*HMS*'
        - '*IISAdmin*'
        - '*IMANSVC*'
        - '*IMAP4Svc*'
        - '*KAVFS*'
        - '*KAVFSGT*'
        - '*kavfsslp*'
        - '*klnagent*'
        - '*LogProcessorService*'
        - '*M8EndpointAgent*'
        - '*macmnsvc*'
        - '*masvc*'
        - '*MBAMService*'
        - '*MBEndpointAgent*'
        - '*McAfeeEngineService*'
        - '*MCAFEEEVENTPARSERSRV*'
        - '*McAfeeFramework*'
        - '*McAfeeFrameworkMcAfeeFramework*'
        - '*MCAFEETOMCATSRV530*'
        - '*McShield*'
        - '*McTaskManager*'
        - '*mfefire*'
        - '*mfemms*'
        - '*mfevto*'
        - '*mfevtp*'
        - '*mfewc*'
        - '*MMS*'
        - '*mozyprobackup*'
        - '*MsDtsServer*'
        - '*MsDtsServer100*'
        - '*MsDtsServer110*'
        - '*MsDtsServer130*'
        - '*MSExchangeES*'
        - '*MSExchangeIS*'
        - '*MSExchangeMGMT*'
        - '*MSExchangeMIA*'
        - '*MSExchangeMTA*'
        - '*MSExchangeSA*'
        - '*MSExchangeSRS*'
        - '*msftesq1SPROO*'
        - '*msftesql$PROD*'
        - '*MSOLAP$SQL_2008*'
        - '*MSOLAP$SYSTEM_BGC*'
        - '*MSOLAP$TPS*'
        - '*MSOLAP$TPSAMA*'
        - '*MSOLAPSTPS*'
        - '*MSOLAPSTPSAMA*'
        - '*MSSQ!I.SPROFXENGAGEMEHT*'
        - '*MSSQ0SHAREPOINT*'
        - '*MSSQ0SOPHOS*'
        - '*MSSQL$BKUPEXEC*'
        - '*MSSQL$ECWDB2*'
        - '*MSSQL$EPOSERVER*'
        - '*MSSQL$ITRIS*'
        - '*MSSQL$PRACTICEMGT*'
        - '*MSSQL$PRACTTICEBGC*'
        - '*MSSQL$PROD*'
        - '*MSSQL$PROFXENGAGEMENT*'
        - '*MSSQL$SBSMONITORING*'
        - '*MSSQL$SHAREPOINT*'
        - '*MSSQL$SOPHOS*'
        - '*MSSQL$SQL_2008*'
        - '*MSSQL$SQLEXPRESS*'
        - '*MSSQL$SYSTEM_BGC*'
        - '*MSSQL$TPS*'
        - '*MSSQL$TPSAMA*'
        - '*MSSQL$VEEAMSQL2008R2*'
        - '*MSSQL$VEEAMSQL2012*'
        - '*MSSQLFDLauncher*'
        - '*MSSQLFDLauncher$ITRIS*'
        - '*MSSQLFDLauncher$PROFXENGAGEMENT*'
        - '*MSSQLFDLauncher$S8SMONITORING*'
        - '*MSSQLFDLauncher$SBSMONITORING*'
        - '*MSSQLFDLauncher$SHAREPOINT*'
        - '*MSSQLFDLauncher$SQL_2008*'
        - '*MSSQLFDLauncher$SYSTEM_BGC*'
        - '*MSSQLFDLauncher$TPS*'
        - '*MSSQLFDLauncher$TPSAMA*'
        - '*MSSQLFDLauncherSPROFXENGAGEMENT*'
        - '*MSSQLFDLauncherSTPS*'
        - '*MSSQLFDLauncherSTPSAMA*'
        - '*MSSQLFOLauncherSSVSTEM_BGC*'
        - '*MSSQLFOLavocher*'
        - '*MSSQLLaunchpad$ITRIS*'
        - '*MSSQLSBKUPEXEC*'
        - '*MSSQLSECWDB2*'
        - '*MSSQLSERVER*'
        - '*MSSQLServerADHelper*'
        - '*MSSQLServerADHelper100*'
        - '*MSSQLServerOLAPService*'
        - '*mSSQLSFRACTICEMGT*'
        - '*MSSQLSPRACTTICEBGE*'
        - '*MSSQLSPROO*'
        - '*MSSQLSSBSMONITORIMG*'
        - '*MSSQLSSQL_2008*'
        - '*MSSQLSSQLEXPRESS*'
        - '*MSSQLSSVSTEM_BGC*'
        - '*MSSQLSTPS*'
        - '*MSSQLSTPSAMA*'
        - '*MSSQLSVEEAMSQL2012*'
        - '*MSSQLSVIEAMSQL2008112*'
        - '*MSSQLWEEAMSQL2008R2*'
        - '*MySQL57*'
        - '*MySQL80*'
        - '*MySQLS7*'
        - '*NetMsmqActivator*'
        - '*ntrtscan*'
        - '*OracleClientCache80*'
        - '*PDVFSService*'
        - '*POP3Svc*'
        - '*POVFSService*'
        - '*ReportServer*'
        - '*ReportServer$SQL_2008*'
        - '*ReportServer$SYSTEM_BGC*'
        - '*ReportServer$TPS*'
        - '*ReportServer$TPSAMA*'
        - '*RESvc*'
        - '*sacsvr*'
        - '*SamSs*'
        - '*SAVAdminService*'
        - '*SAVService*'
        - '*SDRSVC*'
        - '*SentinelAgent*'
        - '*SentinelHelperService*'
        - '*SepMasterService*'
        - '*ShMonitor*'
        - '*Smcinst*'
        - '*SmcService*'
        - '*SMTPSvc*'
        - '*SNAC*'
        - '*SntpService*'
        - '*sophossps*'
        - '*SQ1SafeOLRService*'
        - '*SQLAgent$BKUPEXEC*'
        - '*SQLAgent$CITRIX_METAFRAME*'
        - '*SQLAgent$CXDB*'
        - '*SQLAgent$ECWDB2*'
        - '*SQLAgent$EPOSERVER*'
        - '*SQLAgent$ITRIS*'
        - '*SQLAgent$PRACTTICEBGC*'
        - '*SQLAgent$PRACTTICEMGT*'
        - '*SQLAgent$PROD*'
        - '*SQLAgent$PROFXENGAGEMENT*'
        - '*SQLAgent$SBSMONITORING*'
        - '*SQLAgent$SHAREPOINT*'
        - '*SQLAgent$SOPHOS*'
        - '*SQLAgent$SQL_2008*'
        - '*SQLAgent$SQLEXPRESS*'
        - '*SQLAgent$SVSTEM_BGC*'
        - '*SQLAgent$SYSTEM_BGC*'
        - '*SQLAgent$TPS*'
        - '*SQLAgent$TPSAMA*'
        - '*SQLAgent$VEEAMSQL2008R2*'
        - '*SQLAgent$VEEAMSQL2012*'
        - '*SQLAgentSCITRIX_METAFRAME*'
        - '*SQLAgentSCXDB*'
        - '*SQLAgentSPRACTTICEBGC*'
        - '*SQLAgentSPROO*'
        - '*SQLAgentSSBSMONITORING*'
        - '*SQLAgentSSQL EXPRESS*'
        - '*SQLAgentSTPS*'
        - '*SQLAgentSTPSAMA*'
        - '*SQLAgentSVEEAMSQL2008R2*'
        - '*SQLBrowser*'
        - '*SQLSafeOLRService*'
        - '*SQLSERVERAGENT*'
        - '*SQLTELEMETRY*'
        - '*SQLTELEMETRY$ECWDB2*'
        - '*SQLTELEMETRY$ITRIS*'
        - '*SQLWriter*'
        - '*SSISTELEMETRY130*'
        - '*SstpSvc*'
        - '*svcGenericHost*'
        - '*svcienericHost*'
        - '*swi_filter*'
        - '*swi_service*'
        - '*swi_update*'
        - '*swi_update_64*'
        - '*Telemetryserver*'
        - '*ThreatLockerService*'
        - '*TmCCSF*'
        - '*tmlisten*'
        - '*TmPfw*'
        - '*TrueKey*'
        - '*TruekeyScheduler*'
        - '*TrueKeyServiceHelper*'
        - '*UI0Detect*'
        - '*UTODetect*'
        - '*VeeamBackupSvc*'
        - '*VeeamBrokerSvc*'
        - '*VeeamCatalogSvc*'
        - '*VeeamCloudSvc*'
        - '*VeeamDeploymentService*'
        - '*VeeamDeploySvc*'
        - '*VeeamEnterpriseHanagerSvc*'
        - '*VeeamEnterpriseManagerSvc*'
        - '*VeeamHvIntegrationSvc*'
        - '*VeeamMountSvc*'
        - '*VeeamNFSSvc*'
        - '*VeeamRESTSvc*'
        - '*VeeamRISTSvc*'
        - '*VeeamTransportSvc*'
        - '*VeemaDep/oySvc*'
        - '*VSS*'
        - '*W3Svc*'
        - '*wbengine*'
        - '*WdNisSvc*'
        - '*WeanClOudSve*'
        - '*Weems JY*'
        - '*WinDefend*'
        - '*wozyprobackup*'
        - '*WRSVC*'
    SELECTION_4:
        OriginalFileName:
        - sc.exe
        - net.exe
        - net1.exe
    SELECTION_5:
        NewProcessName:
        - '*\sc.exe'
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_6:
        CommandLine: '* stop *'
    SELECTION_7:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_8:
        CommandLine: '*Stop-Service *'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (((SELECTION_4 or
        SELECTION_5) and SELECTION_6) or (SELECTION_7 and SELECTION_8)))
falsepositives:
- Administrator or tools shutting down the services due to upgrade or removal purposes.
    If you experience some FP please consider adding filters to the parent process
    launching this command and not removing the entry
id: ce72ef99-22f1-43d4-8695-419dcb5d9330
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/29
references:
- https://www.trendmicro.com/content/dam/trendmicro/global/en/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus/Genshin%20Impact%20Figure%2010.jpg
- https://www.trellix.com/en-sg/about/newsroom/stories/threat-labs/lockergoga-ransomware-family-used-in-targeted-attacks.html
related:
-   id: eb87818d-db5d-49cc-a987-d5da331fbd90
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1489

