title: Change PowerShell Policies to an Insecure Level
id: 0fd941d7-3dec-afd3-d991-d693f0a6dff8
status: test
description: Detects changing the PowerShell script execution policy to a potentially insecure level using the "-ExecutionPolicy" flag.
references:
    - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.security/set-executionpolicy?view=powershell-7.1
    - https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.core/about/about_execution_policies?view=powershell-7.1
    - https://adsecurity.org/?p=2604
    - https://thedfirreport.com/2021/11/01/from-zero-to-domain-admin/
author: frack113
date: 2021/11/01
modified: 2023/12/13
tags:
    - attack.execution
    - attack.t1059.001
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
    selection_option:
        CommandLine|contains:
            - '-executionpolicy '
            - ' -ep '
            - ' -exec '
    selection_level:
        CommandLine|contains:
            - Bypass
            - Unrestricted
    condition: process_creation and (all of selection_*)
falsepositives:
    - Administrator scripts
level: medium
ruletype: Sigma
