title: Application Whitelisting Bypass via DLL Loaded by odbcconf.exe
ruletype: Sigma
author: Kirill Kiryanov, Beyu Denis, Daniil Yugoslavskiy, oscd.community
date: 2019/10/25
description: Detects defence evasion attempt via odbcconf.exe execution to load DLL
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\odbcconf.exe'
    SELECTION_4:
        OriginalFileName: odbcconf.exe
    SELECTION_5:
        CommandLine:
        - '*-a*'
        - '*-f*'
        - '*/a*'
        - '*/f*'
        - '*regsvr*'
    SELECTION_6:
        ParentProcessName: '*\odbcconf.exe'
    SELECTION_7:
        NewProcessName: '*\rundll32.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or SELECTION_4) and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Legitimate use of odbcconf.exe by legitimate user
id: 65d2be45-8600-4042-b4c0-577a1ff8a60e
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/30
references:
- https://lolbas-project.github.io/lolbas/Binaries/Odbcconf/
- https://twitter.com/Hexacorn/status/1187143326673330176
- https://redcanary.com/blog/raspberry-robin/
- https://github.com/elastic/protections-artifacts/commit/746086721fd385d9f5c6647cada1788db4aea95f#diff-94a1964b682707e4e3f77dd61a3bfface5401d08d8cf81145f388e09614aceca
status: test
tags:
- attack.defense_evasion
- attack.t1218.008

