title: Process Launched Without Image Name
id: ded5cb8d-2fb5-7bbb-b00c-0009dc64f546
related:
    - id: f208d6d8-d83a-4c2c-960d-877c37da84e5
      type: derived
status: test
description: Detect the use of processes with no name (".exe"), which can be used to evade Image-based detections.
references:
    - https://www.huntress.com/blog/fake-browser-updates-lead-to-boinc-volunteer-computing-software
author: Matt Anderson (Huntress)
date: 2024-07-23
tags:
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        NewProcessName|endswith: \.exe
    condition: process_creation and selection
falsepositives:
    - Rare legitimate software.
level: medium
ruletype: Sigma
