title: Suspicious File Download via CertOC.exe
id: 70ad0861-d1fe-491c-a45f-fa48148a300d
status: experimental
description: Detects when a user downloads file by using CertOC.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/16
tags:
    - attack.command_and_control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        -   NewProcessName|endswith: \certoc.exe
        -   OriginalFileName: CertOC.exe
    selection_cli:
        CommandLine|contains: -GetCACAPS
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
