title: Potentially Suspicious Call To Win32_NTEventlogFile Class
id: fdb2c7f2-63dc-72cd-5261-f3ab65d5d157
status: experimental
description: Detects usage of the WMI class "Win32_NTEventlogFile" in a potentially suspicious way (delete, backup, change permissions, etc.) from a PowerShell script
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/desktop/legacy/aa394225(v=vs.85)
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/07/13
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_class:
        CommandLine|contains: Win32_NTEventlogFile
    selection_function:
        CommandLine|contains:
            - .BackupEventlog(
            - .ChangeSecurityPermissions(
            - .ChangeSecurityPermissionsEx(
            - .ClearEventLog(
            - .Delete(
            - .DeleteEx(
            - .Rename(
            - .TakeOwnerShip(
            - .TakeOwnerShipEx(
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
