title: CreateDump Process Dump
id: 1cc14403-ea65-fe73-9eab-a49768dbd354
status: test
description: Detects uses of the createdump.exe LOLOBIN utility to dump process memory
references:
    - https://www.crowdstrike.com/blog/overwatch-exposes-aquatic-panda-in-possession-of-log-4-shell-exploit-tools/
    - https://twitter.com/bopin2020/status/1366400799199272960
author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/01/04
modified: 2022/08/19
tags:
    - attack.defense_evasion
    - attack.t1036
    - attack.t1003.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \createdump.exe
        - OriginalFileName: FX_VER_INTERNALNAME_STR
    selection_cli:
        CommandLine|contains:
            - ' -u ' # Short version of '--full'
            - ' --full '
            - ' -f ' # Short version of '--name'
            - ' --name '
            - '.dmp '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Command lines that use the same flags
level: high
ruletype: Sigma
