title: Script Event Consumer Spawning Process
id: 874b58be-13ea-f81c-3413-0356498356e2
related:
    - id: f6d1dd2f-b8ce-40ca-bc23-062efb686b34
      type: derived
status: test
description: Detects a suspicious child process of Script Event Consumer (scrcons.exe).
references:
    - https://redcanary.com/blog/child-processes/
    - https://docs.paloaltonetworks.com/cortex/cortex-xdr/cortex-xdr-analytics-alert-reference/cortex-xdr-analytics-alert-reference/scrcons-exe-rare-child-process.html
author: Sittikorn S
date: 2021-06-21
modified: 2022-07-14
tags:
    - attack.execution
    - attack.t1047
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \scrcons.exe
        NewProcessName|endswith:
            - \svchost.exe
            - \dllhost.exe
            - \powershell.exe
            - \pwsh.exe
            - \wscript.exe
            - \cscript.exe
            - \schtasks.exe
            - \regsvr32.exe
            - \mshta.exe
            - \rundll32.exe
            - \msiexec.exe
            - \msbuild.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
