title: Visual Basic Command Line Compiler Usage
id: c321b26c-a257-c5cc-1fb8-5496e91a7381
related:
    - id: 7b10f171-7f04-47c7-9fa2-5be43c76e535
      type: derived
status: test
description: Detects successful code compilation via Visual Basic Command Line Compiler that utilizes Windows Resource to Object Converter.
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Vbc/
author: Ensar Şamil, @sblmsrsn, @oscd_initiative
date: 2020-10-07
modified: 2021-11-27
tags:
    - attack.defense-evasion
    - attack.t1027.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \vbc.exe
        NewProcessName|endswith: \cvtres.exe
    condition: process_creation and selection
falsepositives:
    - Utilization of this tool should not be seen in enterprise environment
level: high
ruletype: Sigma
