title: Non-privileged Usage of Reg or Powershell
id: 8f02c935-effe-45b3-8fc9-ef8696a9e41d
status: test
description: Search for usage of reg or Powershell by non-privileged users to modify service configuration in registry
references:
    - https://image.slidesharecdn.com/kheirkhabarovoffzonefinal-181117201458/95/hunting-for-privilege-escalation-in-windows-environment-20-638.jpg
author: Teymur Kheirkhabarov (idea), Ryan Plas (rule), oscd.community
date: 2020/10/05
modified: 2022/07/07
tags:
    - attack.defense_evasion
    - attack.t1112
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    reg:
        CommandLine|contains|all:
            - 'reg '
            - add
    powershell:
        CommandLine|contains:
            - powershell
            - set-itemproperty
            - ' sp '
            - new-itemproperty
    select_data:
        CommandLine|contains|all:
            - ControlSet
            - Services
        CommandLine|contains:
            - ImagePath
            - FailureCommand
            - ServiceDLL
        MandatoryLabel: S-1-16-8192
    condition: process_creation and ((reg or powershell) and select_data)
fields:
    - MandatoryLabel
    - EventID
    - CommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
