title: Potentially Suspicious Powershell Script Execution From Temp Folder
id: 18f506e1-2726-f3fa-8429-f7b06ce69825
related:
    - id: a6a39bdb-935c-4f0a-ab77-35f4bbf44d33
      type: derived
status: test
description: Detects a potentially suspicious powershell script executions from temporary folder
references:
    - https://www.microsoft.com/security/blog/2021/07/13/microsoft-discovers-threat-actor-targeting-solarwinds-serv-u-software-with-0-day-exploit/
author: Florian Roth (Nextron Systems), Max Altgelt (Nextron Systems), Tim Shelton
date: 2021-07-14
modified: 2026-02-17
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - \Windows\Temp
            - \Temporary Internet
            - \AppData\Local\Temp
            - \AppData\Roaming\Temp
            - '%TEMP%'
            - '%TMP%'
            - '%LocalAppData%\Temp'
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    filter_optional_vscode:
        CommandLine|contains: -WindowStyle hidden -Verb runAs
    filter_optional_amazon_ec2:
        CommandLine|contains: \Windows\system32\config\systemprofile\AppData\Local\Temp\Amazon\EC2-Windows\
    filter_optional_generic:
        CommandLine|contains:
            - ' >'
            - Out-File
            - ConvertTo-Json
    filter_optional_chocolatey_installer:
        CommandLine|contains|all:
            - -NoProfile -ExecutionPolicy Bypass -Command
            - AppData\Local\Temp\
            - Install-Chocolatey.ps1
        ParentProcessName:
            - C:\Windows\System32\Msiexec.exe
            - C:\Windows\SysWOW64\Msiexec.exe
        NewProcessName|endswith: \powershell.exe
    condition: process_creation and (selection and not 1 of filter_optional_*)
falsepositives:
    - Administrative scripts
level: medium
ruletype: Sigma
