title: Execution via stordiag.exe
id: fa60721b-3812-856b-d15f-7c528214d125
related:
    - id: 961e0abb-1b1e-4c84-a453-aafe56ad0d34
      type: derived
status: test
description: Detects the use of stordiag.exe to execute schtasks.exe systeminfo.exe and fltmc.exe
references:
    - https://strontic.github.io/xcyclopedia/library/stordiag.exe-1F08FC87C373673944F6A7E8B18CD845.html
    - https://twitter.com/eral4m/status/1451112385041911809
author: Austin Songer (@austinsonger)
date: 2021-10-21
modified: 2022-12-25
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \stordiag.exe
        NewProcessName|endswith:
            - \schtasks.exe
            - \systeminfo.exe
            - \fltmc.exe
    filter:
        ParentProcessName|startswith: # as first is "Copy c:\windows\system32\stordiag.exe to a folder"
            - c:\windows\system32\
            - c:\windows\syswow64\
    condition: process_creation and (selection and not filter)
falsepositives:
    - Legitimate usage of stordiag.exe.
level: high
ruletype: Sigma
