title: File Download From IP Based URL Via CertOC.EXE
id: 67db6bcf-cb5b-3e0b-2ba8-4afd9e5ca3a8
status: experimental
description: Detects when a user downloads a file from an IP based URL using CertOC.exe
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Certoc/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/10/18
tags:
    - attack.command_and_control
    - attack.execution
    - attack.t1105
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \certoc.exe
        - OriginalFileName: CertOC.exe
    selection_ip:
        CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    selection_cli:
        CommandLine|contains: -GetCACAPS
    condition: process_creation and (all of selection*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
