title: PowerShell Download Pattern
ruletype: Sigma
author: Florian Roth, oscd.community, Jonhnathan Ribeiro
date: 2019/01/16
description: Detects a Powershell process that contains download commands in its command
    line string
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine: '*new-object*'
    SELECTION_6:
        CommandLine: '*net.webclient).*'
    SELECTION_7:
        CommandLine: '*download*'
    SELECTION_8:
        CommandLine:
        - '*string(*'
        - '*file(*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/01/26
related:
-   id: e6c54d94-498c-4562-a37c-b469d8e9a275
    type: derived
status: test
tags:
- attack.execution
- attack.t1059.001

