title: PUA - 3Proxy Execution
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/09/13
description: Detects the use of 3proxy, a tiny free proxy server
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\3proxy.exe'
    SELECTION_4:
        Description: 3proxy - tiny proxy server
    SELECTION_5:
        CommandLine: '*.exe -i127.0.0.1 -p*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Administrative activity
id: f38a82d2-fba3-4781-b549-525efbec8506
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/21
references:
- https://github.com/3proxy/3proxy
- https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: experimental
tags:
- attack.command_and_control
- attack.t1572

