title: Potential AMSI Bypass Using NULL Bits
id: 9b9bf6cd-1e4c-25a1-5857-4e6793b53d32
status: test
description: Detects usage of special strings/null bits in order to potentially bypass AMSI functionalities
references:
    - https://github.com/r00t-3xp10it/hacking-material-books/blob/43cb1e1932c16ff1f58b755bc9ab6b096046853f/obfuscation/simple_obfuscation.md#amsi-bypass-using-null-bits-satoshi
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/04
modified: 2023/05/09
tags:
    - attack.defense_evasion
    - attack.t1562.001
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - if(0){{{0}}}' -f $(0 -as [char]) +
            - '#<NULL>'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
