title: PsExec/PAExec Escalation to LOCAL SYSTEM
ruletype: Sigma
author: Florian Roth, Nasreddine Bencherchali
date: 2021/11/23
description: Detects suspicious flags used by PsExec and PAExec to escalate a command
    line to LOCAL_SYSTEM rights
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '* -s cmd*'
        - '* /s cmd*'
        - '* -s -i cmd*'
        - '* /s /i cmd*'
        - '* /s -i cmd*'
        - '* -s /i cmd*'
        - '* -i -s cmd*'
        - '* /i /s cmd*'
        - '* -i /s cmd*'
        - '* /i -s cmd*'
        - '* -s pwsh*'
        - '* /s pwsh*'
        - '* -s -i pwsh*'
        - '* /s /i pwsh*'
        - '* /s -i pwsh*'
        - '* -s /i pwsh*'
        - '* -i -s pwsh*'
        - '* /i /s pwsh*'
        - '* -i /s pwsh*'
        - '* /i -s pwsh*'
        - '* -s powershell*'
        - '* /s powershell*'
        - '* -s -i powershell*'
        - '* /s /i powershell*'
        - '* /s -i powershell*'
        - '* -s /i powershell*'
        - '* -i -s powershell*'
        - '* /i /s powershell*'
        - '* -i /s powershell*'
        - '* /i -s powershell*'
    SELECTION_4:
        CommandLine:
        - '*psexec*'
        - '*paexec*'
        - '*accepteula*'
        - '*cmd /c *'
        - '*cmd /k *'
        - '*cmd /r *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Admins that use PsExec or PAExec to escalate to the SYSTEM account for maintenance
    purposes (rare)
id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/18
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
related:
-   id: 207b0396-3689-42d9-8399-4222658efc99
    type: similar
status: experimental
tags:
- attack.resource_development
- attack.t1587.001

