title: Suspicious Service DACL Modification Via Set-Service Cmdlet
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/18
description: Detects suspicious DACL modifications via the "Set-Service" cmdlet using
    the "SecurityDescriptorSddl" flag (Only available with PowerShell 7) that can
    be used to hide services or make them unstopable
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName: pwsh.dll
    SELECTION_5:
        CommandLine:
        - '*-SecurityDescriptorSddl *'
        - '*-sd *'
    SELECTION_6:
        CommandLine: '*Set-Service *'
    SELECTION_7:
        CommandLine: '*D;;*'
    SELECTION_8:
        CommandLine:
        - '*;;;IU*'
        - '*;;;SU*'
        - '*;;;BA*'
        - '*;;;SY*'
        - '*;;;WD*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and (SELECTION_6 and SELECTION_7 and SELECTION_8))
falsepositives:
- Unknown
id: a95b9b42-1308-4735-a1af-abb1c5e6f5ac
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://docs.microsoft.com/pt-br/windows/win32/secauthz/sid-strings
related:
-   id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
    type: derived
status: experimental
tags:
- attack.persistence
- attack.t1543.003

