title: Sysmon Driver Unloaded Via Fltmc.EXE
id: 3412c13e-f0d6-c967-da33-0c43c8817356
related:
    - id: 4931188c-178e-4ee7-a348-39e8a7a56821 # Generic
      type: similar
    - id: 4d7cda18-1b12-4e52-b45c-d28653210df8
      type: derived
status: test
description: Detects possible Sysmon filter driver unloaded via fltmc.exe
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
author: Kirill Kiryanov, oscd.community
date: 2019-10-23
modified: 2023-02-13
tags:
    - attack.defense-evasion
    - attack.t1070
    - attack.t1562
    - attack.t1562.002
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \fltMC.exe
        - OriginalFileName: fltMC.exe
    selection_cli:
        CommandLine|contains|all:
            - unload
            - sysmon
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
