title: Suspicious X509Enrollment - Process Creation
id: 5e80556b-2efe-2558-9119-c09636c4c9e4
status: test
description: Detect use of X509Enrollment
references:
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=42
    - https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=41
    - https://learn.microsoft.com/en-us/dotnet/api/microsoft.hpc.scheduler.store.cx509enrollmentwebclassfactoryclass?view=hpc-sdk-5.1.6115
author: frack113
date: 2022/12/23
tags:
    - attack.defense_evasion
    - attack.t1553.004
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - X509Enrollment.CBinaryConverter
            - 884e2002-217d-11da-b2a4-000e7bbb2b09
    condition: process_creation and selection
falsepositives:
    - Legitimate administrative script
level: medium
ruletype: Sigma
