title: Potential Password Spraying Attempt Using Dsacls.EXE
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/20
description: Detects possible password spraying attempts using Dsacls
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\dsacls.exe'
    SELECTION_4:
        OriginalFileName: DSACLS.EXE
    SELECTION_5:
        CommandLine: '*/user:*'
    SELECTION_6:
        CommandLine: '*/passwd:*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Legitimate use of dsacls to bind to an LDAP session
id: bac9fb54-2da7-44e9-988f-11e9a5edbc0c
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/using-dsacls-to-check-ad-object-permissions#password-spraying-anyone
- https://ss64.com/nt/dsacls.html
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc771151(v=ws.11)
status: experimental
tags:
- attack.execution
- attack.t1218

