title: CleanWipe Usage
ruletype: Sigma
author: Nasreddine Bencherchali @nas_bench
date: 2021/12/18
description: Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*/enterprise*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\SepRemovalToolNative_x64.exe'
    SELECTION_4:
        NewProcessName: '*\CATClean.exe'
    SELECTION_5:
        CommandLine: '*--uninstall*'
    SELECTION_6:
        NewProcessName: '*\NetInstaller.exe'
    SELECTION_7:
        CommandLine: '*-r*'
    SELECTION_8:
        NewProcessName: '*\WFPUnins.exe'
    SELECTION_9:
        CommandLine: '*/uninstall*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10)))
falsepositives:
- Legitimate administrative use
id: f44800ac-38ec-471f-936e-3fa7d9c53100
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

