
title: Network Sniffing
ruletype: Sigma
author: Timur Zinniatullin, oscd.community
date: 2019/10/21
description: Network sniffing refers to using the network interface on a system to
  monitor or capture information sent over a wired or wireless connection. An adversary
  may place a network interface into promiscuous mode to passively access data in
  transit over the network, or use span ports to capture a larger amount of data.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\tshark.exe'
  SELECTION_4:
    CommandLine: '*-i*'
  SELECTION_5:
    NewProcessName: '*\windump.exe'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    SELECTION_5))
falsepositives:
- Admin activity
fields:
- Image
- CommandLine
- User
- LogonGuid
- Hashes
- ParentProcessGuid
- ParentCommandLine
id: ba1f7802-adc7-48b4-9ecb-81e227fddfd5
level: low
logsource:
  category: process_creation
  product: windows
modified: 2022/07/11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1040/T1040.md
status: test
tags:
- attack.credential_access
- attack.discovery
- attack.t1040
