title: Cmd.exe CommandLine Path Traversal
ruletype: Sigma
author: xknow @xknow_infosec, Tim Shelton
date: 2020/06/11
description: detects the usage of path traversal in cmd.exe indicating possible command/argument
    confusion/hijacking
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentCommandLine: '*cmd*'
    SELECTION_4:
        ParentProcessName: '*\cmd.exe'
    SELECTION_5:
        ParentCommandLine:
        - '*/c*'
        - '*/k*'
        - '*/r*'
    SELECTION_6:
        CommandLine: '*/../../*'
    SELECTION_7:
        CommandLine: '*\Tasktop\keycloak\bin\/../../jre\bin\java*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7)))
falsepositives:
- (not much) some benign Java tools may product false-positive commandlines for loading
    libraries
id: 087790e3-3287-436c-bccf-cbd0184a7db1
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/11/18
references:
- https://hackingiscool.pl/cmdhijack-command-argument-confusion-with-path-traversal-in-cmd-exe/
- https://twitter.com/Oddvarmoe/status/1270633613449723905
status: test
tags:
- attack.execution
- attack.t1059.003

