title: Potentially Suspicious Ping/Copy Command Combination
id: 3efca659-a57d-a642-952a-5f476a210a07
related:
    - id: ded2b07a-d12f-4284-9b76-653e37b6c8b0
      type: derived
status: test
description: |
    Detects uncommon and potentially suspicious one-liner command containing both "ping" and "copy" at the same time, which is usually used by malware.
references:
    - Internal Research
author: X__Junior (Nextron Systems)
date: 2023-07-18
modified: 2024-03-06
tags:
    - attack.defense-evasion
    - attack.t1070.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_cmd:
        - NewProcessName|endswith: \cmd.exe
        - OriginalFileName: Cmd.Exe
    selection_action:
        CommandLine|contains|all:
            - ping   # Covers "ping" and "ping.exe"
            - 'copy '
    selection_cli_1:
        CommandLine|contains|windash: ' -n ' # Count
    selection_cli_2:
        CommandLine|contains|windash: ' -y '
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
