title: Suspicious Scheduled Task Creation Involving Temp Folder
id: 41405b7a-f9bc-bce2-50ed-abfca5390f19
related:
    - id: 39019a4e-317f-4ce3-ae63-309a8c6b53c5
      type: derived
status: test
description: Detects the creation of scheduled tasks that involves a temporary folder and runs only once
references:
    - https://discuss.elastic.co/t/detection-and-response-for-hafnium-activity/266289/3
author: Florian Roth (Nextron Systems)
date: 2021-03-11
modified: 2022-10-09
tags:
    - attack.privilege-escalation
    - attack.execution
    - attack.persistence
    - attack.t1053.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains|all:
            - ' /create '
            - ' /sc once '
            - \Temp\
        NewProcessName|endswith: \schtasks.exe
    condition: process_creation and selection
falsepositives:
    - Administrative activity
    - Software installation
level: high
ruletype: Sigma
