title: Potential Suspicious Registry File Imported Via Reg.EXE
id: 7ebc545f-8b8d-1d34-7a2e-99467ab1008d
status: test
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe' utility
references:
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import
author: frack113, Nasreddine Bencherchali
date: 2022/08/01
modified: 2023/02/05
tags:
    - attack.t1112
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \reg.exe
        - OriginalFileName: reg.exe
    selection_cli:
        CommandLine|contains: ' import '
    selection_paths:
        CommandLine|contains:
            - C:\Users\
            - '%temp%'
            - '%tmp%'
            - '%appdata%'
            - \AppData\Local\Temp\
            - C:\Windows\Temp\
            - C:\ProgramData\
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate import of keys
level: medium
ruletype: Sigma
