
title: Overwrite Deleted Data with Cipher
ruletype: Sigma
author: frack113
date: 2021/12/26
description: |
  Adversaries may destroy data and files on specific systems or in large numbers on a network to interrupt availability to systems, services, and network resources.
  Data destruction is likely to render stored data irrecoverable by forensic techniques through overwriting files or data on local and remote drives
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\cipher.exe'
  SELECTION_4:
    CommandLine: '* /w:*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 4b046706-5789-4673-b111-66f25fe99534
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.md#atomic-test-3---overwrite-deleted-data-on-c-drive
status: experimental
tags:
- attack.impact
- attack.t1485
