title: Execution via WorkFolders.exe
ruletype: Sigma
author: Maxime Thiebaut (@0xThiebaut)
date: 2021/10/21
description: Detects using WorkFolders.exe to execute an arbitrary control.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\control.exe'
    SELECTION_4:
        ParentProcessName: '*\WorkFolders.exe'
    SELECTION_5:
        NewProcessName: C:\Windows\System32\control.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Legitimate usage of the uncommon Windows Work Folders feature.
id: 0bbc6369-43e3-453d-9944-cae58821c173
level: high
logsource:
    category: process_creation
    definition: 'Requirements: Sysmon ProcessCreation logging must be activated'
    product: windows
modified: 2022/12/25
references:
- https://twitter.com/elliotkillick/status/1449812843772227588
status: test
tags:
- attack.defense_evasion
- attack.t1218

