title: Filter Driver Unloaded Via Fltmc.EXE
id: bd94e379-d774-a7fa-3d0c-ce6765196ac0
status: test
description: Detect filter driver unloading activity via fltmc.exe
references:
    - https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
    - https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/13
modified: 2024/06/24
tags:
    - attack.defense_evasion
    - attack.t1070
    - attack.t1562
    - attack.t1562.002
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \fltMC.exe
        - OriginalFileName: fltMC.exe
    selection_cli:
        CommandLine|contains: unload
    filter_optional_avira:
        CommandLine|endswith: unload rtp_filesystem_filter
        ParentProcessName|startswith: C:\Users\
        ParentProcessName|contains: \AppData\Local\Temp\
        ParentProcessName|endswith: \endpoint-protection-installer-x64.tmp
    filter_optional_manageengine:
        CommandLine|endswith: unload DFMFilter
        ParentProcessName: C:\Program Files (x86)\ManageEngine\uems_agent\bin\dcfaservice64.exe
    condition: process_creation and (all of selection_* and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
