title: Execution of Remote Utilities RAT (RURAT) From Unusual Location
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/19
description: Detects execution of Remote Utilities RAT (RURAT) from an unsual location
    (outisde of 'C:\Program Files')
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\rutserv.exe'
        - '*\rfusclient.exe'
    SELECTION_4:
        Product: Remote Utilities
    SELECTION_5:
        NewProcessName:
        - C:\Program Files\Remote Utilities*
        - C:\Program Files (x86)\Remote Utilities*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: e01fa958-6893-41d4-ae03-182477c5e77d
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://redcanary.com/blog/misbehaving-rats/
status: experimental
tags:
- attack.defense_evasion

