title: Potential Credential Dumping Via Windows Error Reporting
ruletype: Sigma
author: '@pbssubhash , Nasreddine Bencherchali'
date: 2022/12/08
description: Detects potential credential dumping via Windows Error Reporting LSASS
    Shtinkering technique which uses the Windows Error Reporting to dump lsass
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        ParentProcessName: C:\Windows\System32\lsass.exe
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\Werfault.exe'
    SELECTION_4:
        OriginalFileName: WerFault.exe
    SELECTION_5:
        ParentUser:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_6:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_7:
        CommandLine: '* -u -p *'
    SELECTION_8:
        CommandLine: '* -ip *'
    SELECTION_9:
        CommandLine: '* -s *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8 and SELECTION_9))
        and  not ((SELECTION_10)))
falsepositives:
- Windows Error Reporting might produce similar behavior. In that case, check the
    PID associated with the "-p" parameter in the CommandLine.
id: 9a4ccd1a-3526-4d99-b980-9f9c5d3a6ff3
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/deepinstinct/Lsass-Shtinkering
- https://media.defcon.org/DEF%20CON%2030/DEF%20CON%2030%20presentations/Asaf%20Gilboa%20-%20LSASS%20Shtinkering%20Abusing%20Windows%20Error%20Reporting%20to%20Dump%20LSASS.pdf
status: experimental
tags:
- attack.credential_access
- attack.t1003.001

