title: Potential Ransomware or Unauthorized MBR Tampering Via Bcdedit.EXE
ruletype: Sigma
author: '@neu5ron'
date: 2019/02/07
description: Detects potential malicious and unauthorized usage of bcdedit.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\bcdedit.exe'
    SELECTION_4:
        OriginalFileName: bcdedit.exe
    SELECTION_5:
        CommandLine:
        - '*delete*'
        - '*deletevalue*'
        - '*import*'
        - '*safeboot*'
        - '*network*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
id: c9fbe8e9-119d-40a6-9b59-dd58a5d84429
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/15
references:
- https://docs.microsoft.com/en-us/windows-hardware/drivers/devtest/bcdedit--set
- https://twitter.com/malwrhunterteam/status/1372536434125512712/photo/2
status: test
tags:
- attack.defense_evasion
- attack.t1070
- attack.persistence
- attack.t1542.003

