title: Webshell Recon Detection Via CommandLine & Processes
ruletype: Sigma
author: Cian Heasley, Florian Roth
date: 2020/07/22
description: Detects processes spawned from web servers (php, tomcat, iis...etc) that
    perform reconnaissance looking for the existence of popular scripting tools (perl,
    python, wget) on the system via the help commands
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName:
        - '*\w3wp.exe'
        - '*\php-cgi.exe'
        - '*\nginx.exe'
        - '*\httpd.exe'
        - '*\caddy.exe'
        - '*\ws_tomcatservice.exe'
    SELECTION_4:
        ParentProcessName:
        - '*\java.exe'
        - '*\javaw.exe'
    SELECTION_5:
        ParentProcessName:
        - '*-tomcat-*'
        - '*\tomcat*'
    SELECTION_6:
        ParentProcessName:
        - '*\java.exe'
        - '*\javaw.exe'
    SELECTION_7:
        CommandLine:
        - '*catalina.jar*'
        - '*CATALINA_HOME*'
    SELECTION_8:
        CommandLine:
        - '*perl --help*'
        - '*python --help*'
        - '*python -h*'
        - '*python3 --help*'
        - '*python3 -h*'
        - '*wget --help*'
        - '*perl -h*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or (SELECTION_4 and
        SELECTION_5) or (SELECTION_6 and SELECTION_7)) and SELECTION_8)
falsepositives:
- Unknown
fields:
- Image
- CommandLine
- ParentCommandLine
id: f64e5c19-879c-4bae-b471-6d84c8339677
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/07/27
references:
- https://ragged-lab.blogspot.com/2020/07/webshells-automating-reconnaissance.html
status: test
tags:
- attack.persistence
- attack.t1505.003

