title: UAC Bypass Using PkgMgr and DISM
ruletype: Sigma
author: Christian Burkard (Nextron Systems)
date: 2021/08/23
description: Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe
    23)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\pkgmgr.exe'
    SELECTION_4:
        NewProcessName: '*\dism.exe'
    SELECTION_5:
        IntegrityLevel:
        - High
        - System
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: a743ceba-c771-4d75-97eb-8a90f7f4844c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002

