title: HKTL - SharpSuccessor Privilege Escalation Tool Execution
id: b0559eb5-33e0-09c4-c9bb-88007b5981ca
related:
    - id: 38a1ac5f-9c74-47d2-a345-dd6f5eb4e7c8
      type: derived
status: experimental
description: |
    Detects the execution of SharpSuccessor, a tool used to exploit the BadSuccessor attack for privilege escalation in WinServer 2025 Active Directory environments.
    Successful usage of this tool can let the attackers gain the domain admin privileges by exploiting the BadSuccessor vulnerability.
references:
    - https://github.com/logangoins/SharpSuccessor
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-06-06
tags:
    - attack.privilege-escalation
    - attack.t1068
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \SharpSuccessor.exe
        - OriginalFileName: SharpSuccessor.exe
        - CommandLine|contains: SharpSuccessor
        - CommandLine|contains|all:
              - ' add '
              - ' /impersonate'
              - ' /path'
              - ' /account'
              - ' /name'
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
