title: Potentially Suspicious Child Processes Spawned by ConHost
id: faa3b493-02b2-9e9c-3d74-8a59a0205e5d
related:
    - id: 7dc2dedd-7603-461a-bc13-15803d132355
      type: similar
    - id: dfa03a09-8b92-4d83-8e74-f72839b1c407
      type: derived
status: experimental
description: Detects suspicious child processes related to Windows Shell utilities spawned by `conhost.exe`, which could indicate malicious activity using trusted system components.
references:
    - https://tria.ge/241015-l98snsyeje/behavioral2
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-02-05
tags:
    - attack.t1202
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \conhost.exe
    selection_child:
        - NewProcessName|endswith:
              - \cmd.exe               # Windows Command Prompt
              - \cscript.exe           # Windows Script Host (used for scripting exploits)
              - \mshta.exe             # MSHTA (HTML Application Host, often abused)
              - \powershell_ise.exe    # PowerShell ISE
              - \powershell.exe        # Windows PowerShell
              - \pwsh.exe              # PowerShell Core
              - \regsvr32.exe          # Windows Registry Server (commonly used for exploits)
              - \wscript.exe           # Windows Script Host (for executing scripts)
        - OriginalFileName:
              - cmd.exe
              - cscript.exe
              - mshta.exe
              - powershell_ise.exe
              - powershell.exe
              - pwsh.dll
              - regsvr32.exe
              - wscript.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate administrative tasks using `conhost.exe` to spawn child processes such as `cmd.exe`, `powershell.exe`, or `regsvr32.exe`.
level: high
ruletype: Sigma
