title: Suspicious Elevated System Shell
ruletype: Sigma
author: frack113, Tim Shelton (update fp)
date: 2022/12/05
description: Detects when a shell program such as the windows Command Prompt or PowerShell
    is launched with system privileges.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        NewProcessName: '*\cmd.exe'
    SELECTION_11:
        ParentProcessName: C:\Windows\SysWOW64\config\systemprofile\Citrix\UpdaterBinaries\\*
    SELECTION_12:
        ParentProcessName: '*\CitrixReceiverUpdater.exe'
    SELECTION_13:
        NewProcessName: '*\cmd.exe'
    SELECTION_14:
        CommandLine: C:\WINDOWS\system32\cmd.exe /c "*
    SELECTION_15:
        CurrentDirectory: '*C:\WINDOWS\Temp\asgard2-agent\\*'
    SELECTION_16:
        ParentProcessName: C:\Windows\Temp*
    SELECTION_17:
        ParentProcessName: '*\invcol.exe'
    SELECTION_18:
        ParentCommandLine: '*C:\ProgramData\Dell\UpdateService\\*'
    SELECTION_19:
        NewProcessName: '*\cmd.exe'
    SELECTION_2:
        Channel: Security
    SELECTION_20:
        ParentProcessName: C:\Windows\WinSxS\\*
    SELECTION_21:
        ParentProcessName: '*\CompatTelRunner.exe'
    SELECTION_22:
        ParentCommandLine: C:\Windows\system32\CompatTelRunner.exe -m:appraiser.dll
            -f:DoScheduledTelemetryRun*
    SELECTION_23:
        ParentProcessName: C:\IBM\SpectrumProtect\webserver\scripts\\*
    SELECTION_24:
        CommandLine: '*C:\IBM\SpectrumProtect\webserver\scripts\\*'
    SELECTION_25:
        CommandLine: 'powershell.exe -ExecutionPolicy Restricted -Command Write-Host
            ''Final result: 1'';'
    SELECTION_26:
        NewProcessName: '*\cmd.exe'
    SELECTION_27:
        CommandLine: '*/d /c C:\Windows\system32\silcollector.cmd*'
    SELECTION_28:
        NewProcessName: '*\cmd.exe'
    SELECTION_29:
        CommandLine:
        - '*cmd.exe /c btool server list replication_port --no-log'
        - '*cmd.exe /c btool server list general --no-log'
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
    SELECTION_30:
        NewProcessName: '*\cmd.exe'
    SELECTION_31:
        CommandLine: '*C:\Windows\system32\reg.exe query hklm\software\microsoft\windows\softwareinventorylogging
            /v collectionstate /reg:64*'
    SELECTION_32:
        NewProcessName: C:\Windows\System32\cmd.exe
    SELECTION_33:
        CommandLine: C:\Windows\system32\cmd.exe /c PAUSE
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
        - Cmd.Exe
    SELECTION_5:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_6:
        SubjectLogonId: '0x3e7'
    SELECTION_7:
        ParentProcessName:
        - C:\Windows\System32\\*
        - C:\Program Files (x86)\\*
        - C:\Program Files\\*
    SELECTION_8:
        NewProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
    SELECTION_9:
        ParentProcessName: C:\ManageEngine\ADManager Plus\pgsql\bin\postgres.exe
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6)) and  not ((SELECTION_7 and SELECTION_8) or
        (SELECTION_9 and SELECTION_10) or (SELECTION_11 and SELECTION_12 and SELECTION_13)
        or (SELECTION_14 and SELECTION_15) or (SELECTION_16 and SELECTION_17 and SELECTION_18
        and SELECTION_19) or (SELECTION_20 and SELECTION_21 and SELECTION_22) or (SELECTION_23
        and SELECTION_24) or (SELECTION_25) or (SELECTION_26 and SELECTION_27) or
        (SELECTION_28 and SELECTION_29) or (SELECTION_30 and SELECTION_31) or (SELECTION_32
        and SELECTION_33)))
falsepositives:
- Unknown
id: 178e615d-e666-498b-9630-9ed363038101
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/20
references:
- https://github.com/Wh04m1001/SysmonEoP
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.execution
- attack.t1059

