title: WSL Kali-Linux Usage
id: d63e46b7-e8e4-0adf-ae74-e7e8d30f7d79
related:
    - id: 6f1a11aa-4b8a-4b7f-9e13-4d3e4ff0e0d4
      type: derived
status: experimental
description: Detects the use of Kali Linux through Windows Subsystem for Linux
references:
    - https://medium.com/@redfanatic7/running-kali-linux-on-windows-51ad95166e6e
    - https://learn.microsoft.com/en-us/windows/wsl/install
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-10-10
tags:
    - attack.defense-evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img_appdata:
        - NewProcessName|contains|all:
              - :\Users\
              - \AppData\Local\packages\KaliLinux
        - NewProcessName|contains|all:
              - :\Users\
              - \AppData\Local\Microsoft\WindowsApps\kali.exe
    selection_img_windowsapps:
        NewProcessName|contains: :\Program Files\WindowsApps\KaliLinux.
        NewProcessName|endswith: \kali.exe
    selection_kali_wsl_parent:
        ParentProcessName|endswith:
            - \wsl.exe
            - \wslhost.exe
    selection_kali_wsl_child:
        - NewProcessName|contains:
              - \kali.exe
              - \KaliLinux
        - CommandLine|contains:
              - Kali.exe
              - Kali-linux
              - kalilinux
    filter_main_install_uninstall:
        CommandLine|contains:
            - ' -i '
            - ' --install '
            - ' --unregister '
    condition: process_creation and (1 of selection_img_* or all of selection_kali_* and not 1 of filter_main_*)
falsepositives:
    - Legitimate installation or usage of Kali Linux WSL by administrators or security teams
level: high
ruletype: Sigma
