title: Rundll32 Execution Without DLL File
ruletype: Sigma
author: Tim Shelton, Florian Roth (Nextron Systems), Yassine Oukessou (fix + fp)
date: 2022/01/13
description: Detects the execution of rundll32 with a command line that doesn't contain
    a .dll file
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*.cpl*'
    SELECTION_11:
        ParentProcessName: '*:\Windows\SysWOW64\msiexec.exe'
    SELECTION_12:
        ParentCommandLine: C:\Windows\syswow64\MsiExec.exe -Embedding*
    SELECTION_13:
        ParentProcessName: '*:\Windows\System32\msiexec.exe'
    SELECTION_14:
        ParentCommandLine: C:\Windows\system32\MsiExec.exe -Embedding*
    SELECTION_15:
        ParentProcessName: '*:\Windows\System32\cmd.exe'
    SELECTION_16:
        ParentCommandLine: '* C:\Program Files\SplunkUniversalForwarder\\*'
    SELECTION_17:
        CommandLine: '* -localserver *'
    SELECTION_18:
        ParentCommandLine: C:\Windows\system32\rundll32.exe" "C:\Program Files\McAfee\MSC\mcmscins.dll",DllUninstallFunction
            *
    SELECTION_19:
        CommandLine: C:\Windows\system32\rundll32.exe" /uninstall /longpath "C:\Program
            Files\McAfee\MSC\mscrem.inf*
    SELECTION_2:
        Channel: Security
    SELECTION_20:
        ParentProcessName: C:\Users\\*
    SELECTION_21:
        ParentProcessName: '*\AppData\Local\Microsoft\EdgeUpdate\Install\{*'
    SELECTION_22:
        ParentProcessName: '*\setup.exe'
    SELECTION_23:
        ParentCommandLine: '*\setup.exe" --install-archive="C:\Users\\*'
    SELECTION_24:
        CommandLine: '*C:\Windows\Installer\MSI*'
    SELECTION_25:
        CommandLine: '*.tmp*'
    SELECTION_26:
        CommandLine: '*zzzzInvokeManagedCustomActionOutOfProc*'
    SELECTION_27:
        CommandLine: '*Avira.OE.Setup*'
    SELECTION_3:
        NewProcessName: '*\rundll32.exe'
    SELECTION_4:
        OriginalFileName: RUNDLL32.EXE
    SELECTION_5:
        CommandLine: null
    SELECTION_6:
        CommandLine: '*.dll*'
    SELECTION_7:
        CommandLine: ''
    SELECTION_8:
        CommandLine: C:\Windows\system32\rundll32.exe C:\Windows\system32\inetcpl.cpl,ClearMyTracksByProcess
    SELECTION_9:
        ParentProcessName: '*:\Program Files\Internet Explorer\iexplore.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 or SELECTION_7) or (SELECTION_8) or (SELECTION_9
        and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13 and
        SELECTION_14) or (SELECTION_15 and SELECTION_16) or (SELECTION_17) or (SELECTION_18
        or SELECTION_19) or (SELECTION_20 and SELECTION_21 and SELECTION_22 and SELECTION_23)
        or (SELECTION_24 and SELECTION_25 and SELECTION_26 and SELECTION_27)))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/03/13
references:
- https://twitter.com/mrd0x/status/1481630810495139841?s=12
status: experimental

