title: PowerShell Base64 Encoded FromBase64String Keyword
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2019/08/24
description: Detects usage of a base64 encoded "FromBase64String" cmdlet in a process
    command line
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine|base64offset|contains: ::FromBase64String
    SELECTION_4:
        CommandLine:
        - '*OgA6AEYAcgBvAG0AQgBhAHMAZQA2ADQAUwB0AHIAaQBuAGcA*'
        - '*oAOgBGAHIAbwBtAEIAYQBzAGUANgA0AFMAdAByAGkAbgBnA*'
        - '*6ADoARgByAG8AbQBCAGEAcwBlADYANABTAHQAcgBpAG4AZw*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: fdb62a13-9a81-4e5c-a38f-ea93a16f6d7c
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/31
status: test
tags:
- attack.defense_evasion
- attack.t1140
- attack.execution
- attack.t1059.001

