title: Filter Driver Unloaded Via Fltmc.EXE
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/02/13
description: Detect filter driver unloading activity via fltmc.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\fltMC.exe'
    SELECTION_4:
        OriginalFileName: fltMC.exe
    SELECTION_5:
        CommandLine: '*unload*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 4931188c-178e-4ee7-a348-39e8a7a56821
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
- https://www.cybereason.com/blog/threat-analysis-report-lockbit-2.0-all-paths-lead-to-ransom
related:
-   id: 4d7cda18-1b12-4e52-b45c-d28653210df8
    type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1070
- attack.t1562
- attack.t1562.002

