title: Potential Command Line Path Traversal Evasion Attempt
id: 2cc522c8-300b-2344-e384-3db7df590412
related:
    - id: 1327381e-6ab0-4f38-b583-4c1b8346a56b
      type: derived
status: test
description: Detects potential evasion or obfuscation attempts using bogus path traversal via the commandline
references:
    - https://twitter.com/hexacorn/status/1448037865435320323
    - https://twitter.com/Gal_B1t/status/1062971006078345217
author: Christian Burkard (Nextron Systems)
date: 2021-10-26
modified: 2023-03-29
tags:
    - attack.defense-evasion
    - attack.t1036
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_1:
        CommandLine|contains:
            - \..\Windows\
            - \..\System32\
            - \..\..\
        NewProcessName|contains: \Windows\
    selection_2:
        CommandLine|contains: .exe\..\
    filter_optional_google_drive:
        CommandLine|contains: \Google\Drive\googledrivesync.exe\..\
    filter_optional_citrix:
        CommandLine|contains: \Citrix\Virtual Smart Card\Citrix.Authentication.VirtualSmartcard.Launcher.exe\..\
    condition: process_creation and (1 of selection_* and not 1 of filter_optional_*)
falsepositives:
    - Google Drive
    - Citrix
level: medium
ruletype: Sigma
