title: Process Hacker Usage
ruletype: Sigma
author: Florian Roth
date: 2022/10/10
description: Detects suspicious use of Process Hacker, a tool to view and manipulate
    processes, kernel options and other low level stuff
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        sha256:
        - d4a0fe56316a2c45b9ba9ac1005363309a3edc7acf9e4df64d326a0ff273e80f
        - bd2c2cf0631d881ed382817afcce2b093f4e412ffb170a719e2762f250abfea4
    SELECTION_11:
        imphash:
        - 04de0ad9c37eb7bd52043d2ecac958df
        - 3695333c60dedecdcaff1590409aa462
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\ProcessHacker_*'
    SELECTION_4:
        OriginalFileName:
        - ProcessHacker.exe
        - Process Hacker
    SELECTION_5:
        Description: Process Hacker
    SELECTION_6:
        Product: Process Hacker
    SELECTION_7:
        Hashes:
        - '*MD5=68F9B52895F4D34E74112F3129B3B00D*'
        - '*SHA1=C5E2018BF7C0F314FED4FD7FE7E69FA2E648359E*'
        - '*SHA256=D4A0FE56316A2C45B9BA9AC1005363309A3EDC7ACF9E4DF64D326A0FF273E80F*'
        - '*IMPHASH=04DE0AD9C37EB7BD52043D2ECAC958DF*'
        - '*MD5=B365AF317AE730A67C936F21432B9C71*'
        - '*SHA1=A0BDFAC3CE1880B32FF9B696458327CE352E3B1D*'
        - '*SHA256=BD2C2CF0631D881ED382817AFCCE2B093F4E412FFB170A719E2762F250ABFEA4*'
        - '*IMPHASH=3695333C60DEDECDCAFF1590409AA462*'
    SELECTION_8:
        md5:
        - 68f9b52895f4d34e74112f3129b3b00d
        - b365af317ae730a67c936f21432b9c71
    SELECTION_9:
        sha1:
        - c5e2018bf7c0f314fed4fd7fe7e69fa2e648359e
        - a0bdfac3ce1880b32ff9b696458327ce352e3b1d
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9 or SELECTION_10
        or SELECTION_11))
falsepositives:
- Sometimes used by developers or system administrators for debugging purposes
id: 811e0002-b13b-4a15-9d00-a613fce66e42
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://processhacker.sourceforge.io/
- https://www.crowdstrike.com/blog/falcon-overwatch-report-finds-increase-in-ecrime/
status: experimental

