title: Suspicious Elevated System Shell
ruletype: Sigma
author: frack113
date: 2022/12/05
description: Detects when a shell program such as the windows Command Prompt or PowerShell
    is launched with system privileges.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\cmd.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
        - Cmd.Exe
    SELECTION_5:
        User:
        - '*AUTHORI*'
        - '*AUTORI*'
    SELECTION_6:
        SubjectLogonId: '0x3e7'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Unknown
id: 178e615d-e666-498b-9630-9ed363038101
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/Wh04m1001/SysmonEoP
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.execution
- attack.t1059

