title: Read and Execute a File Via Cmd.exe
ruletype: Sigma
author: frack113
date: 2022/08/20
description: Detect use of "/R <" to read and execute a file via cmd.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        CommandLine: '*<*'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: Cmd.Exe
    SELECTION_4:
        NewProcessName: '*\cmd.exe'
    SELECTION_5:
        ParentCommandLine: '*cmd*'
    SELECTION_6:
        ParentCommandLine: '*/r *'
    SELECTION_7:
        ParentCommandLine: '*<*'
    SELECTION_8:
        CommandLine: '*cmd*'
    SELECTION_9:
        CommandLine: '*/r *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        ((SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9
        and SELECTION_10)))
falsepositives:
- Legitimate use
id: 00a4bacd-6db4-46d5-9258-a7d5ebff4003
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/10
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1059.003/T1059.003.md
status: experimental
tags:
- attack.execution
- attack.t1059.003

