title: Suspicious New Instance Of An Office COM Object
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/13
description: 'Detects an svchost process spawning an instance of an office application.
    This happens when the initial word application creates an instance of one of the
    Office COM objects such as ''Word.Application'', ''Excel.Application'', etc.

    This can be used by malicious actors to create malicious Office documents with
    macros on the fly. (See vba2clr project in the references)

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\svchost.exe'
    SELECTION_4:
        NewProcessName:
        - '*\winword.exe'
        - '*\excel.exe'
        - '*\powerpnt.exe'
        - '*\msaccess.exe'
        - '*\mspub.exe'
        - '*\eqnedt32.exe'
        - '*\visio.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate usage of office automation via scripting
id: 9bdaf1e9-fdef-443b-8081-4341b74a7e28
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/04
references:
- https://learn.microsoft.com/en-us/previous-versions/office/troubleshoot/office-developer/automate-word-create-file-using-visual-basic
- https://github.com/med0x2e/vba2clr
status: experimental
tags:
- attack.execution
- attack.defense_evasion

