title: Uncommon  Assistive Technology Applications Execution Via AtBroker.EXE
id: d5a94ccf-58fd-7481-3683-e59fbf33e8c1
related:
    - id: f24bcaea-0cd1-11eb-adc1-0242ac120002
      type: derived
status: test
description: Detects the start of a non built-in assistive technology applications via "Atbroker.EXE".
references:
    - http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
    - https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
author: Mateusz Wydra, oscd.community
date: 2020-10-12
modified: 2024-03-06
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \AtBroker.exe
        - OriginalFileName: AtBroker.exe
    selection_cli:
        CommandLine|contains: start
    filter_main_builtin:
        CommandLine|contains:
            - animations
            - audiodescription
            - caretbrowsing
            - caretwidth
            - colorfiltering
            - cursorindicator
            - cursorscheme
            - filterkeys
            - focusborderheight
            - focusborderwidth
            - highcontrast
            - keyboardcues
            - keyboardpref
            - livecaptions
            - magnifierpane
            - messageduration
            - minimumhitradius
            - mousekeys
            - Narrator
            - osk
            - overlappedcontent
            - showsounds
            - soundsentry
            - speechreco
            - stickykeys
            - togglekeys
            - voiceaccess
            - windowarranging
            - windowtracking
            - windowtrackingtimeout
            - windowtrackingzorder
    filter_optional_java:
        CommandLine|contains: Oracle_JavaAccessBridge
    condition: process_creation and (all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*)
falsepositives:
    - Legitimate, non-default assistive technology applications execution
level: medium
ruletype: Sigma
