title: MMC Spawning Windows Shell
id: 05a2ab7e-ce11-4b63-86db-ab32e763e11d
status: test
description: Detects a Windows command line executable started from MMC
references:
    - https://enigma0x3.net/2017/01/05/lateral-movement-using-the-mmc20-application-com-object/
author: Karneades, Swisscom CSIRT
date: 2019/08/05
modified: 2022/07/14
tags:
    - attack.lateral_movement
    - attack.t1021.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        ParentProcessName|endswith: \mmc.exe
    selection2:
        - NewProcessName|endswith:
              - \cmd.exe
              - \powershell.exe
              - \pwsh.exe
              - \wscript.exe
              - \cscript.exe
              - \sh.exe
              - \bash.exe
              - \reg.exe
              - \regsvr32.exe
        - NewProcessName|contains: \BITSADMIN
    condition: process_creation and (all of selection*)
fields:
    - NewProcessName
    - CommandLine
    - ParentCommandLine
level: high
ruletype: Sigma
