title: Deny Service Access Using Security Descriptor Tampering Via Sc.EXE
ruletype: Sigma
author: Jonhnathan Ribeiro, oscd.community
date: 2020/10/16
description: Detects suspicious DACL modifications to deny access to a service that
    affects critical trustees. This can be used to hide services or make them unstoppable.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\sc.exe'
    SELECTION_4:
        OriginalFileName: sc.exe
    SELECTION_5:
        CommandLine: '*sdset*'
    SELECTION_6:
        CommandLine: '*D;*'
    SELECTION_7:
        CommandLine:
        - '*;IU*'
        - '*;SU*'
        - '*;BA*'
        - '*;SY*'
        - '*;WD*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6) and SELECTION_7)
falsepositives:
- Unknown
id: 99cf1e02-00fb-4c0d-8375-563f978dfd37
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/28
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
- https://learn.microsoft.com/en-us/windows/win32/secauthz/sid-strings
related:
-   id: 98c5aeef-32d5-492f-b174-64a691896d25
    type: similar
-   id: a537cfc3-4297-4789-92b5-345bfd845ad0
    type: similar
status: test
tags:
- attack.persistence
- attack.t1543.003

