title: Suspicious Registration via cscript.exe
id: 28c8f68b-098d-45af-8d43-8089f3e35403
status: experimental
description: Detects when the registration of a VSS/VDS Provider as a COM+ application.
references:
    - https://twitter.com/sblmsrsn/status/1456613494783160325?s=20
    - https://ss64.com/vb/cscript.html
author: Austin Songer @austinsonger
date: 2021/11/05
modified: 2022/07/07
tags:
    - attack.defense_evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        CommandLine|contains: -register
        NewProcessName|endswith: \cscript.exe
    selection2:
        CommandLine|contains:
            - \Windows Kits\10\bin\10.0.22000.0\x64
            - \Windows Kits\10\bin\10.0.19041.0\x64
            - \Windows Kits\10\bin\10.0.17763.0\x64
    condition: process_creation and (all of selection*)
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
