title: Suspicious Child Process Of Veeam Dabatase
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/04
description: Detects suspicious child processes of the Veeam service process. This
    could indicate potential RCE or SQL Injection.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\sqlservr.exe'
    SELECTION_4:
        ParentCommandLine: '*VEEAMSQL*'
    SELECTION_5:
        NewProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\wsl.exe'
        - '*\wt.exe'
    SELECTION_6:
        CommandLine:
        - '*-ex *'
        - '*bypass*'
        - '*cscript*'
        - '*DownloadString*'
        - '*http://*'
        - '*https://*'
        - '*mshta*'
        - '*regsvr32*'
        - '*rundll32*'
        - '*wscript*'
        - '*copy *'
    SELECTION_7:
        NewProcessName:
        - '*\net.exe'
        - '*\net1.exe'
        - '*\netstat.exe'
        - '*\nltest.exe'
        - '*\ping.exe'
        - '*\tasklist.exe'
        - '*\whoami.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or SELECTION_7))
id: d55b793d-f847-4eea-b59a-5ab09908ac90
level: critical
logsource:
    category: process_creation
    product: windows
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
related:
-   id: 869b9ca7-9ea2-4a5a-8325-e80e62f75445
    type: similar
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation

