title: Rundll32 Execution Without DLL File
ruletype: Sigma
author: Tim Shelton, Florian Roth (Nextron Systems), Yassine Oukessou (fix + fp)
date: 2022/01/13
description: Detects the execution of rundll32 with a command line that doesn't contain
    a .dll file
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        ParentProcessName: '*:\Windows\SysWOW64\msiexec.exe'
    SELECTION_11:
        ParentCommandLine: C:\Windows\syswow64\MsiExec.exe -Embedding*
    SELECTION_12:
        ParentProcessName: '*:\Windows\System32\msiexec.exe'
    SELECTION_13:
        ParentCommandLine: C:\Windows\system32\MsiExec.exe -Embedding*
    SELECTION_14:
        ParentProcessName: '*:\Windows\System32\cmd.exe'
    SELECTION_15:
        ParentCommandLine: '* C:\Program Files\SplunkUniversalForwarder\\*'
    SELECTION_16:
        CommandLine: '* -localserver *'
    SELECTION_17:
        ParentCommandLine: C:\Windows\system32\rundll32.exe" "C:\Program Files\McAfee\MSC\mcmscins.dll",DllUninstallFunction
            *
    SELECTION_18:
        CommandLine: C:\Windows\system32\rundll32.exe" /uninstall /longpath "C:\Program
            Files\McAfee\MSC\mscrem.inf*
    SELECTION_19:
        ParentProcessName: C:\Users\\*
    SELECTION_2:
        Channel: Security
    SELECTION_20:
        ParentProcessName: '*\AppData\Local\Microsoft\EdgeUpdate\Install\{*'
    SELECTION_21:
        ParentProcessName: '*\setup.exe'
    SELECTION_22:
        ParentCommandLine: '*\setup.exe" --install-archive="C:\Users\\*'
    SELECTION_3:
        NewProcessName: '*\rundll32.exe'
    SELECTION_4:
        OriginalFileName: RUNDLL32.EXE
    SELECTION_5:
        CommandLine: null
    SELECTION_6:
        CommandLine: '*.dll*'
    SELECTION_7:
        CommandLine: ''
    SELECTION_8:
        ParentProcessName: '*:\Program Files\Internet Explorer\iexplore.exe'
    SELECTION_9:
        CommandLine: '*.cpl*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6 or SELECTION_7) or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11) or (SELECTION_12 and SELECTION_13) or (SELECTION_14
        and SELECTION_15) or (SELECTION_16) or (SELECTION_17 or SELECTION_18) or (SELECTION_19
        and SELECTION_20 and SELECTION_21 and SELECTION_22)))
falsepositives:
- Unknown
fields:
- Image
- CommandLine
id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/02/09
references:
- https://twitter.com/mrd0x/status/1481630810495139841?s=12
status: experimental

