title: Esentutl Steals Browser Information
id: 115e60c2-cee5-d274-5b18-9313cca77106
related:
    - id: 6a69f62d-ce75-4b57-8dce-6351eb55b362
      type: derived
status: test
description: One way Qbot steals sensitive information is by extracting browser data from Internet Explorer and Microsoft Edge by using the built-in utility esentutl.exe
references:
    - https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
    - https://redcanary.com/threat-detection-report/threats/qbot/
    - https://thedfirreport.com/2022/10/31/follina-exploit-leads-to-domain-compromise/
author: frack113
date: 2022-02-13
modified: 2024-03-05
tags:
    - attack.collection
    - attack.t1005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \esentutl.exe
        - OriginalFileName: esentutl.exe
    selection_flag:
        CommandLine|contains|windash: -r
    selection_webcache:
        CommandLine|contains: \Windows\WebCache
    condition: process_creation and (all of selection*)
falsepositives:
    - Legitimate use
level: medium
ruletype: Sigma
