title: DumpMinitool Usage
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/04/06
description: Detects the use of "DumpMinitool.exe" a tool bundled with Visual Studio
    and DotNTET
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\DumpMinitool.exe'
    SELECTION_4:
        OriginalFileName: DumpMinitool.exe
    SELECTION_5:
        CommandLine: '* --processId *'
    SELECTION_6:
        CommandLine: '* --dumpType Full*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) or
        (SELECTION_5 and SELECTION_6)))
falsepositives:
- Unknown
id: dee0a7a3-f200-4112-a99b-952196d81e42
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/11/18
references:
- https://twitter.com/mrd0x/status/1511415432888131586
- https://twitter.com/mrd0x/status/1511489821247684615
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1003.001

