
title: Invoke-Obfuscation STDIN+ Launcher
ruletype: Sigma
author: Jonathan Cheong, oscd.community
date: 2020/10/15
description: Detects Obfuscated use of stdin to execute PowerShell
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine|re: .*cmd.{0,5}(?:/c|/r).+powershell.+(?:\$\{?input\}?|noexit).+"
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 6c96fc76-0eb1-11eb-adc1-0242ac120002
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/Neo23x0/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
