title: Remote Access Tool - NetSupport Execution
ruletype: Sigma
author: frack113
date: 2022/09/25
description: 'An adversary may use legitimate desktop support and remote access software,
    such as Team Viewer, Go2Assist, LogMein, AmmyyAdmin, etc, to establish an interactive
    command and control channel to target systems within networks.

    These services are commonly used as legitimate technical support software, and
    may be allowed by application control within a target environment.

    Remote access tools like VNC, Ammyy, and Teamviewer are used frequently when compared
    with other legitimate software commonly used by adversaries. (Citation: Symantec
    Living off the Land)

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Description: NetSupport Client Configurator
    SELECTION_4:
        Product: NetSupport Remote Control
    SELECTION_5:
        Company: NetSupport Ltd
    SELECTION_6:
        OriginalFileName: PCICFGUI.EXE
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6))
falsepositives:
- Legitimate use
id: 758ff488-18d5-4cbe-8ec4-02b6285a434f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/06
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1219/T1219.md
status: experimental
tags:
- attack.command_and_control
- attack.t1219

