title: PowerShell Base64 Encoded Invoke Keyword
ruletype: Sigma
author: pH-T (Nextron Systems), Harjot Singh, '@cyb3rjy0t'
date: 2022/05/20
description: Detects UTF-8 and UTF-16 Base64 encoded powershell 'Invoke-' calls
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*SQBuAHYAbwBrAGUALQ*'
        - '*kAbgB2AG8AawBlAC0A*'
        - '*JAG4AdgBvAGsAZQAtA*'
        - '*SW52b2tlL*'
        - '*ludm9rZS*'
        - '*JbnZva2Ut*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
id: 6385697e-9f1b-40bd-8817-f4a91f40508e
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/27
references:
- https://thedfirreport.com/2022/05/09/seo-poisoning-a-gootloader-story/
related:
-   id: fd6e2919-3936-40c9-99db-0aa922c356f7
    type: obsoletes
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.defense_evasion
- attack.t1027

