title: Wlrmdr.EXE Uncommon Argument Or Child Process
id: 0331991b-8942-aa87-70c4-84360f95b7ce
related:
    - id: 9cfc00b6-bfb7-49ce-9781-ef78503154bb
      type: derived
status: test
description: |
    Detects the execution of "Wlrmdr.exe" with the "-u" command line flag which allows anything passed to it to be an argument of the ShellExecute API, which would allow an attacker to execute arbitrary binaries.
    This detection also focuses on any uncommon child processes spawned from "Wlrmdr.exe" as a supplement for those that posses "ParentImage" telemetry.
references:
    - https://twitter.com/0gtweet/status/1493963591745220608?s=20&t=xUg9DsZhJy1q9bPTUWgeIQ
    - https://lolbas-project.github.io/lolbas/Binaries/Wlrmdr/
author: frack113, manasmbellani
date: 2022-02-16
modified: 2024-03-06
tags:
    - attack.defense-evasion
    - attack.t1218
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent: # This selection is looking for processes spawned from wlrmdr using the "-u" flag
        ParentProcessName|endswith: \wlrmdr.exe
    selection_child_img:
        - NewProcessName|endswith: \wlrmdr.exe
        - OriginalFileName: WLRMNDR.EXE
    selection_child_cli:
        CommandLine|contains|all|windash:
            - '-s '
            - '-f '
            - '-t '
            - '-m '
            - '-a '
            - '-u '
    filter_main_winlogon:
        ParentProcessName: C:\Windows\System32\winlogon.exe
    filter_main_empty:
        ParentProcessName:
            - ''
            - '-'
    filter_main_null:
        ParentProcessName: null
    condition: process_creation and (selection_parent or (all of selection_child_* and not 1 of filter_main_*))
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
