title: HackTool - TruffleSnout Execution
id: 56a9069d-21e3-4b02-f132-6a4e930a4432
related:
    - id: 69ca006d-b9a9-47f5-80ff-ecd4d25d481a
      type: derived
status: test
description: Detects the use of TruffleSnout.exe an iterative AD discovery toolkit for offensive operators, situational awareness and targeted low noise enumeration.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
    - https://github.com/dsnezhkov/TruffleSnout
    - https://github.com/dsnezhkov/TruffleSnout/blob/7c2f22e246ef704bc96c396f66fa854e9ca742b9/TruffleSnout/Docs/USAGE.md
author: frack113
date: 2022-08-20
modified: 2023-02-13
tags:
    - attack.discovery
    - attack.t1482
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - OriginalFileName: TruffleSnout.exe
        - NewProcessName|endswith: \TruffleSnout.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
