title: Remote Access Tool - RURAT Execution From Unusual Location
id: 69775960-6b6d-e4c6-a758-e539859c34d4
related:
    - id: e01fa958-6893-41d4-ae03-182477c5e77d
      type: derived
status: test
description: Detects execution of Remote Utilities RAT (RURAT) from an unusual location (outside of 'C:\Program Files')
references:
    - https://redcanary.com/blog/misbehaving-rats/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-09-19
modified: 2023-03-05
tags:
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith:
              - \rutserv.exe
              - \rfusclient.exe
        - Product: Remote Utilities
    filter:
        NewProcessName|startswith:
            - C:\Program Files\Remote Utilities
            - C:\Program Files (x86)\Remote Utilities
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
