title: Potential Data Exfiltration Activity Via CommandLine Tools
id: 7d1aaf3d-4304-425c-b7c3-162055e0b3ab
status: experimental
description: Detects the use of various CLI utilities exfiltrating data via web requests
references:
    - https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/02
modified: 2023/07/27
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_iwr:
        CommandLine|contains:
            - Invoke-WebRequest
            - 'iwr '
            - 'wget '
            - 'curl '
        CommandLine|contains|all:
            - ' -ur' # Shortest possible version of the -uri flag
            - ' -me' # Shortest possible version of the -method flag
            - ' -b'
            - ' POST '
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
            - \cmd.exe
    selection_curl:
        CommandLine|contains: --ur   # Shortest possible version of the --uri flag
        NewProcessName|endswith: \curl.exe
    selection_curl_data:
        CommandLine|contains:
            - ' -d ' # Shortest possible version of the --data flag
            - ' --data '
    selection_wget:
        CommandLine|contains:
            - --post-data
            - --post-file
        NewProcessName|endswith: \wget.exe
    payloads:
        - CommandLine|contains:
              - Get-Content
              - GetBytes
              - hostname
              - ifconfig
              - ipconfig
              - net view
              - netstat
              - nltest
              - qprocess
              - sc query
              - systeminfo
              - tasklist
              - ToBase64String
              - whoami
        - CommandLine|contains|all:
              - 'type '
              - ' > '
              - ' C:\'
    condition: process_creation and ((selection_iwr or all of selection_curl* or selection_wget) and payloads)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
