title: Suspicious WindowsTerminal Child Processes
id: 3870935a-4632-088f-5f37-1baf2d7d56fe
related:
    - id: 8de89e52-f6e1-4b5b-afd1-41ecfa300d48
      type: derived
status: test
description: Detects suspicious children spawned via the Windows Terminal application which could be a sign of persistence via WindowsTerminal (see references section)
references:
    - https://persistence-info.github.io/Data/windowsterminalprofile.html
    - https://twitter.com/nas_bench/status/1550836225652686848
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-25
modified: 2023-02-14
tags:
    - attack.execution
    - attack.persistence
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith:
            - \WindowsTerminal.exe
            - \wt.exe
    selection_susp:
        - NewProcessName|endswith:
              # Add more LOLBINS
              - \rundll32.exe
              - \regsvr32.exe
              - \certutil.exe
              - \cscript.exe
              - \wscript.exe
              - \csc.exe
        - NewProcessName|contains:
              # Add more suspicious paths
              - C:\Users\Public\
              - \Downloads\
              - \Desktop\
              - \AppData\Local\Temp\
              - \Windows\TEMP\
        - CommandLine|contains:
              # Add more suspicious commandline
              - ' iex '
              - ' icm'
              - Invoke-
              - 'Import-Module '
              - 'ipmo '
              - DownloadString(
              - ' /c '
              - ' /k '
              - ' /r '
    filter_builtin_visual_studio_shell:
        CommandLine|contains|all:
            - Import-Module
            - Microsoft.VisualStudio.DevShell.dll
            - Enter-VsDevShell
    filter_open_settings:
        CommandLine|contains|all:
            - \AppData\Local\Packages\Microsoft.WindowsTerminal_
            - \LocalState\settings.json
    filter_vsdevcmd:
        CommandLine|contains|all:
            - C:\Program Files\Microsoft Visual Studio\
            - \Common7\Tools\VsDevCmd.bat
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Other legitimate "Windows Terminal" profiles
level: medium
ruletype: Sigma
