title: Suspicious Scheduled Task Creation via Masqueraded XML File
ruletype: Sigma
author: Swachchhanda Shrawan Poudel, Elastic (idea)
date: 2023/04/20
description: Detects the creation of a scheduled task using the "-XML" flag with a
    file without the '.xml' extension. This behavior could be indicative of potential
    defense evasion attempt during persistence
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        ParentCommandLine: '*:\WINDOWS\Installer\MSI*'
    SELECTION_11:
        ParentCommandLine: '*.tmp,zzzzInvokeManagedCustomActionOutOfProc*'
    SELECTION_12:
        ParentProcessName:
        - '*:\ProgramData\OEM\UpgradeTool\CareCenter_*\BUnzip\Setup_msi.exe'
        - '*:\Program Files\Axis Communications\AXIS Camera Station\SetupActions.exe'
        - '*:\Program Files\Axis Communications\AXIS Device Manager\AdmSetupActions.exe'
        - '*:\Program Files (x86)\Zemana\AntiMalware\AntiMalware.exe'
        - '*:\Program Files\Dell\SupportAssist\pcdrcui.exe'
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\schtasks.exe'
    SELECTION_4:
        OriginalFileName: schtasks.exe
    SELECTION_5:
        CommandLine:
        - '*/create*'
        - '*-create*'
    SELECTION_6:
        CommandLine:
        - '*/xml*'
        - '*-xml*'
    SELECTION_7:
        CommandLine: '*.xml*'
    SELECTION_8:
        IntegrityLevel: System
    SELECTION_9:
        ParentProcessName: '*\rundll32.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6) and  not ((SELECTION_7) or (SELECTION_8) or (SELECTION_9
        and SELECTION_10 and SELECTION_11))) and  not ((SELECTION_12)))
falsepositives:
- Unknown
id: dd2a821e-3b07-4d3b-a9ac-929fe4c6ca0c
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://docs.microsoft.com/en-us/windows/win32/taskschd/daily-trigger-example--xml-
- https://github.com/elastic/protections-artifacts/blob/084067123d3328a823b1c3fdde305b694275c794/behavior/rules/persistence_suspicious_scheduled_task_creation_via_masqueraded_xml_file.toml
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1036.005
- attack.t1053.005

