title: Executable Used by PlugX in Uncommon Location
ruletype: Sigma
author: Florian Roth
date: 2017/06/12
description: Detects the execution of an executable that is typically used by PlugX
    for DLL side loading started from an uncommon location
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        NewProcessName: '*\Windows Media Player\\*'
    SELECTION_11:
        NewProcessName: '*\hcc.exe'
    SELECTION_12:
        NewProcessName: '*\HTML Help Workshop\\*'
    SELECTION_13:
        NewProcessName: '*\hkcmd.exe'
    SELECTION_14:
        NewProcessName:
        - '*\System32\\*'
        - '*\SysNative\\*'
        - '*\SysWow64\\*'
    SELECTION_15:
        NewProcessName: '*\Mc.exe'
    SELECTION_16:
        NewProcessName:
        - '*\Microsoft Visual Studio*'
        - '*\Microsoft SDK*'
        - '*\Windows Kit*'
    SELECTION_17:
        NewProcessName: '*\MsMpEng.exe'
    SELECTION_18:
        NewProcessName:
        - '*\Microsoft Security Client\\*'
        - '*\Windows Defender\\*'
        - '*\AntiMalware\\*'
    SELECTION_19:
        NewProcessName: '*\msseces.exe'
    SELECTION_2:
        Channel: Security
    SELECTION_20:
        NewProcessName:
        - '*\Microsoft Security Center\\*'
        - '*\Microsoft Security Client\\*'
        - '*\Microsoft Security Essentials\\*'
    SELECTION_21:
        NewProcessName: '*\OInfoP11.exe'
    SELECTION_22:
        NewProcessName: '*\Common Files\Microsoft Shared\\*'
    SELECTION_23:
        NewProcessName: '*\OleView.exe'
    SELECTION_24:
        NewProcessName:
        - '*\Microsoft Visual Studio*'
        - '*\Microsoft SDK*'
        - '*\Windows Kit*'
        - '*\Windows Resource Kit\\*'
    SELECTION_25:
        NewProcessName: '*\rc.exe'
    SELECTION_26:
        NewProcessName:
        - '*\Microsoft Visual Studio*'
        - '*\Microsoft SDK*'
        - '*\Windows Kit*'
        - '*\Windows Resource Kit\\*'
        - '*\Microsoft.NET\\*'
    SELECTION_3:
        NewProcessName: '*\CamMute.exe'
    SELECTION_4:
        NewProcessName:
        - '*\Lenovo\Communication Utility\\*'
        - '*\Lenovo\Communications Utility\\*'
    SELECTION_5:
        NewProcessName: '*\chrome_frame_helper.exe'
    SELECTION_6:
        NewProcessName: '*\Google\Chrome\application\\*'
    SELECTION_7:
        NewProcessName: '*\dvcemumanager.exe'
    SELECTION_8:
        NewProcessName: '*\Microsoft Device Emulator\\*'
    SELECTION_9:
        NewProcessName: '*\Gadget.exe'
    condition: ((SELECTION_1 and SELECTION_2) and ((((((((((((SELECTION_3 and  not
        (SELECTION_4)) or (SELECTION_5 and  not (SELECTION_6))) or (SELECTION_7 and  not
        (SELECTION_8))) or (SELECTION_9 and  not (SELECTION_10))) or (SELECTION_11
        and  not (SELECTION_12))) or (SELECTION_13 and  not (SELECTION_14))) or (SELECTION_15
        and  not (SELECTION_16))) or (SELECTION_17 and  not (SELECTION_18))) or (SELECTION_19
        and  not (SELECTION_20))) or (SELECTION_21 and  not (SELECTION_22))) or (SELECTION_23
        and  not (SELECTION_24))) or (SELECTION_25 and  not (SELECTION_26))))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: aeab5ec5-be14-471a-80e8-e344418305c2
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/01/28
references:
- http://www.hexacorn.com/blog/2016/03/10/beyond-good-ol-run-key-part-36/
- https://countuponsecurity.com/2017/06/07/threat-hunting-in-the-enterprise-with-appcompatprocessor/
status: test
tags:
- attack.s0013
- attack.defense_evasion
- attack.t1574.002

