title: Dynamic .NET Compilation Via Csc.EXE
id: dcaa3f04-70c3-427a-80b4-b870d73c94c4
status: test
description: Detects execution of "csc.exe" to compile .NET code. Attackers often
    leverage this to compile code on the fly and use it in other stages.
references:
    - https://securityboulevard.com/2019/08/agent-tesla-evading-edr-by-removing-api-hooks/
    - https://www.clearskysec.com/wp-content/uploads/2018/11/MuddyWater-Operations-in-Lebanon-and-Oman.pdf
    - https://app.any.run/tasks/c6993447-d1d8-414e-b856-675325e5aa09/
    - https://twitter.com/gN3mes1s/status/1206874118282448897
author: Florian Roth (Nextron Systems)
date: 2019/08/24
modified: 2023/08/02
tags:
    - attack.defense_evasion
    - attack.t1027.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - \AppData\Local\Temp\
            - \Windows\Temp\
        NewProcessName|endswith: \csc.exe
    filter_main_programfiles:
        ParentProcessName|startswith:
            - C:\Program Files (x86)\
            - C:\Program Files\
    filter_main_sdiagnhost:
        ParentProcessName: C:\Windows\System32\sdiagnhost.exe
    filter_main_w3p:
        ParentProcessName: C:\Windows\System32\inetsrv\w3wp.exe
    filter_optional_chocolatey:
        ParentProcessName: C:\ProgramData\chocolatey\choco.exe
    filter_optional_defender:
        ParentCommandLine|contains: \ProgramData\Microsoft\Windows Defender Advanced
            Threat Protection
    filter_optional_ansible:
        ParentCommandLine|contains:
            - JwB7ACIAZgBhAGkAbABlAGQAIgA6AHQAcgB1AGUALAAiAG0AcwBnACIAOgAiAEEAbgBzAGkAYgBsAGUAIAByAGUAcQB1AGkAcgBlAHMAIABQAG8AdwBlAHIAUwBoAGUAbABsACAAdgAzAC4AMAAgAG8AcgAgAG4AZQB3AGUAcgAiAH0AJw
            - cAewAiAGYAYQBpAGwAZQBkACIAOgB0AHIAdQBlACwAIgBtAHMAZwAiADoAIgBBAG4AcwBpAGIAbABlACAAcgBlAHEAdQBpAHIAZQBzACAAUABvAHcAZQByAFMAaABlAGwAbAAgAHYAMwAuADAAIABvAHIAIABuAGUAdwBlAHIAIgB9ACcA
            - nAHsAIgBmAGEAaQBsAGUAZAAiADoAdAByAHUAZQAsACIAbQBzAGcAIgA6ACIAQQBuAHMAaQBiAGwAZQAgAHIAZQBxAHUAaQByAGUAcwAgAFAAbwB3AGUAcgBTAGgAZQBsAGwAIAB2ADMALgAwACAAbwByACAAbgBlAHcAZQByACIAfQAnA
    condition: process_creation and (selection and not 1 of filter_main_* and not
        1 of filter_optional_*)
falsepositives:
    - Legitimate software from program files - https://twitter.com/gN3mes1s/status/1206874118282448897
    - Legitimate Microsoft software - https://twitter.com/gabriele_pippi/status/1206907900268072962
    - Ansible
level: medium
ruletype: Sigma
