title: HackTool - Certify Execution
ruletype: Sigma
author: pH-T (Nextron Systems)
date: 2023/04/17
description: Detects Certify a tool for Active Directory certificate abuse based on
    PE metadata characteristics and common command line arguments.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\Certify.exe'
    SELECTION_4:
        OriginalFileName: Certify.exe
    SELECTION_5:
        Description: '*Certify*'
    SELECTION_6:
        CommandLine:
        - '*.exe cas *'
        - '*.exe find *'
        - '*.exe pkiobjects *'
        - '*.exe request *'
        - '*.exe download *'
    SELECTION_7:
        CommandLine:
        - '* /vulnerable*'
        - '* /template:*'
        - '* /altname:*'
        - '* /domain:*'
        - '* /path:*'
        - '* /ca:*'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4 or
        SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 762f2482-ff21-4970-8939-0aa317a886bb
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/25
references:
- https://github.com/GhostPack/Certify
status: experimental
tags:
- attack.discovery
- attack.credential_access
- attack.t1649

