title: Suspicious Spool Service Child Process
id: dcdbc940-0bff-46b2-95f3-2d73f848e33b
status: test
description: Detects suspicious print spool service (spoolsv.exe) child processes.
references:
    - https://github.com/microsoft/Microsoft-365-Defender-Hunting-Queries/blob/efa17a600b43c897b4b7463cc8541daa1987eeb4/Exploits/Print%20Spooler%20RCE/Suspicious%20Spoolsv%20Child%20Process.md
author: Justin C. (@endisphotic), @dreadphones (detection), Thomas Patzke (Sigma rule)
date: 2021/07/11
modified: 2023/02/09
tags:
    - attack.execution
    - attack.t1203
    - attack.privilege_escalation
    - attack.t1068
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    spoolsv:
        ParentProcessName|endswith: \spoolsv.exe
        MandatoryLabel: S-1-16-16384
    suspicious_unrestricted:
        NewProcessName|endswith:
            - \gpupdate.exe
            - \whoami.exe
            - \nltest.exe
            - \taskkill.exe
            - \wmic.exe
            - \taskmgr.exe
            - \sc.exe
            - \findstr.exe
            - \curl.exe
            - \wget.exe
            - \certutil.exe
            - \bitsadmin.exe
            - \accesschk.exe
            - \wevtutil.exe
            - \bcdedit.exe
            - \fsutil.exe
            - \cipher.exe
            - \schtasks.exe
            - \write.exe
            - \wuauclt.exe
            - \systeminfo.exe
            - \reg.exe
            - \query.exe
    suspicious_net:
        NewProcessName|endswith:
            - \net.exe
            - \net1.exe
    suspicious_net_filter:
        CommandLine|contains: start
    suspicious_cmd:
        NewProcessName|endswith: \cmd.exe
    suspicious_cmd_filter:
        CommandLine|contains:
            - .spl
            - route add
            - program files
    suspicious_netsh:
        NewProcessName|endswith: \netsh.exe
    suspicious_netsh_filter:
        CommandLine|contains:
            - add portopening
            - rule name
    suspicious_powershell:
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    suspicious_powershell_filter:
        CommandLine|contains: .spl
    suspicious_rundll32_img:
        - NewProcessName|endswith: \rundll32.exe
        - OriginalFileName: RUNDLL32.EXE
    suspicious_rundll32_cli:
        CommandLine|endswith: rundll32.exe
    condition: process_creation and (spoolsv and ( suspicious_unrestricted or (suspicious_net and not suspicious_net_filter) or (suspicious_cmd and not suspicious_cmd_filter) or (suspicious_netsh and not suspicious_netsh_filter) or (suspicious_powershell and not suspicious_powershell_filter) or all of suspicious_rundll32_* ))
fields:
    - NewProcessName
    - CommandLine
falsepositives:
    - Unknown
level: high
ruletype: Sigma
