title: Run Once Task Execution as Configured in Registry
id: aa8af443-e70d-a6a2-5903-1c62f232c0ed
related:
    - id: 198effb6-6c98-4d0c-9ea3-451fa143c45c
      type: derived
status: test
description: This rule detects the execution of Run Once task as configured in the registry
references:
    - https://twitter.com/pabraeken/status/990717080805789697
    - https://lolbas-project.github.io/lolbas/Binaries/Runonce/
    - https://twitter.com/0gtweet/status/1602644163824156672?s=20&t=kuxbUnZPltpvFPZdCrqPXA
author: Avneet Singh @v3t0_, oscd.community, Christopher Peacock @SecurePeacock (updated)
date: 2020-10-18
modified: 2022-12-13
tags:
    - attack.defense-evasion
    - attack.t1112
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \runonce.exe
        - Description: Run Once Wrapper
    selection_cli:
        - CommandLine|contains: /AlternateShellStartup
        - CommandLine|endswith: /r
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: low
ruletype: Sigma
