title: Potential Arbitrary DLL Load Using Winword
id: eacb8d30-18b2-df70-fb8e-b5b8bb773983
status: test
description: Detects potential DLL sideloading using the Microsoft Office winword process via the '/l' flag.
references:
    - https://github.com/D4Vinci/One-Lin3r/blob/9fdfa5f0b9c698dfbd4cdfe7d2473192777ae1c6/one_lin3r/core/liners/windows/cmd/dll_loader_word.py
author: Victor Sergeev, oscd.community
date: 2020/10/09
modified: 2023/03/29
tags:
    - attack.defense_evasion
    - attack.t1202
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: \WINWORD.exe
        - OriginalFileName: WinWord.exe
    selection_dll:
        CommandLine|contains|all:
            - '/l '
            - .dll
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
