title: Delete Important Scheduled Task
id: 7aeff814-b27b-e580-603c-4c71d478a677
status: test
description: Detects when adversaries stop services or processes by deleting their respective scheduled tasks in order to conduct data destructive activities
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/09
tags:
    - attack.impact
    - attack.t1489
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    schtasks_exe:
        CommandLine|contains|all:
            - /delete
            - /tn
        CommandLine|contains:
            # Add more important tasks
            - \Windows\SystemRestore\SR
            - \Windows\Windows Defender\
            - \Windows\BitLocker
            - \Windows\WindowsBackup\
            - \Windows\WindowsUpdate\
            - \Windows\UpdateOrchestrator\
            - \Windows\ExploitGuard
        NewProcessName|endswith: \schtasks.exe
    condition: process_creation and (all of schtasks_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
