title: UtilityFunctions.ps1 Proxy Dll
id: e158c0fd-66a1-71d4-8c4c-0728569ed574
related:
    - id: 0403d67d-6227-4ea8-8145-4e72db7da120
      type: derived
status: test
description: Detects the use of a Microsoft signed script executing a managed DLL with PowerShell.
references:
    - https://lolbas-project.github.io/lolbas/Scripts/UtilityFunctions/
author: frack113
date: 2022-05-28
tags:
    - attack.defense-evasion
    - attack.t1216
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - UtilityFunctions.ps1
            - 'RegSnapin '
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
