title: Bad Opsec Defaults Sacrificial Processes With Improper Arguments
id: a7c3d773-caef-227e-a7e7-c2f13c622329
related:
    -   id: f5647edc-a7bf-4737-ab50-ef8c60dc3add
        type: obsoletes
status: experimental
description: 'Detects attackers using tooling with bad opsec defaults.

    E.g. spawning a sacrificial process to inject a capability into the process without
    taking into account how the process is normally run.

    One trivial example of this is using rundll32.exe without arguments as a sacrificial
    process (default in CS, now highlighted by c2lint), running WerFault without arguments
    (Kraken - credit am0nsec), and other examples.

    '
references:
    - https://blog.malwarebytes.com/malwarebytes-news/2020/10/kraken-attack-abuses-wer-service/
    - https://www.cobaltstrike.com/help-opsec
    - https://twitter.com/CyberRaiju/status/1251492025678983169
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/regsvr32
    - https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/rundll32
    - https://docs.microsoft.com/en-us/dotnet/framework/tools/regasm-exe-assembly-registration-tool
    - https://docs.microsoft.com/en-us/dotnet/framework/tools/regsvcs-exe-net-services-installation-tool#feedback
author: Oleg Kolesnikov @securonix invrep_de, oscd.community, Florian Roth (Nextron
    Systems), Christian Burkard (Nextron Systems)
date: 2020/10/23
modified: 2023/01/25
tags:
    - attack.defense_evasion
    - attack.t1218.011
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection1:
        CommandLine|endswith: WerFault.exe
        NewProcessName|endswith: \WerFault.exe
    selection2:
        CommandLine|endswith: rundll32.exe
        NewProcessName|endswith: \rundll32.exe
    selection3:
        CommandLine|endswith: regsvcs.exe
        NewProcessName|endswith: \regsvcs.exe
    selection4:
        CommandLine|endswith: regasm.exe
        NewProcessName|endswith: \regasm.exe
    selection5:
        CommandLine|endswith: regsvr32.exe
        NewProcessName|endswith: \regsvr32.exe
    filter_edge_update:
        ParentCommandLine|contains: \setup.exe" --install-archive="C:\Users\
        ParentProcessName|startswith: C:\Users\
        ParentProcessName|contains: \AppData\Local\Microsoft\EdgeUpdate\Install\{
        ParentProcessName|endswith: \setup.exe
    condition: process_creation and (1 of selection* and not 1 of filter*)
fields:
    - ParentProcessName
    - ParentCommandLine
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
