title: Computer Discovery And Export Via Get-ADComputer Cmdlet
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/11/10
description: Detects usage of the Get-ADComputer cmdlet to collect computer information
    and output it to a file
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine: '*Get-ADComputer *'
    SELECTION_6:
        CommandLine: '* -Filter \*'
    SELECTION_7:
        CommandLine:
        - '* > *'
        - '*Out-File*'
        - '*Set-Content*'
        - '*Add-Content*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6) and SELECTION_7)
falsepositives:
- Legitimate admin scripts may use the same technique, it's better to exclude specific
    computers or users who execute these commands or scripts often
id: 435e10e4-992a-4281-96f3-38b11106adde
level: medium
logsource:
    category: process_creation
    product: windows
references:
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
- https://www.microsoft.com/en-us/security/blog/2022/10/18/defenders-beware-a-case-for-post-ransomware-investigations/
status: experimental
tags:
- attack.discovery
- attack.t1033

