title: Webshell Hacking Activity Patterns
id: 4ebc877f-4612-45cb-b3a5-8e3834db36c9
status: test
description: 'Detects certain parent child patterns found in cases in which a web
    shell is used to perform certain credential dumping or exfiltration activities
    on a compromised system

    '
references:
    - https://youtu.be/7aemGhaE9ds?t=641
author: Florian Roth (Nextron Systems)
date: 2022/03/17
modified: 2023/11/09
tags:
    - attack.persistence
    - attack.t1505.003
    - attack.t1018
    - attack.t1033
    - attack.t1087
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_webserver_image:
        ParentProcessName|endswith:
            - \caddy.exe
            - \httpd.exe
            - \nginx.exe
            - \php-cgi.exe
            - \w3wp.exe
            - \ws_tomcatservice.exe
    selection_webserver_characteristics_tomcat1:
        ParentProcessName|endswith:
            - \java.exe
            - \javaw.exe
        ParentProcessName|contains:
            - -tomcat-
            - \tomcat
    selection_webserver_characteristics_tomcat2:
        CommandLine|contains:
            - catalina.jar
            - CATALINA_HOME
        ParentProcessName|endswith:
            - \java.exe
            - \javaw.exe
    selection_child_1:
        CommandLine|contains|all:
            - rundll32
            - comsvcs
    selection_child_2:
        CommandLine|contains|all:
            - ' -hp'
            - ' a '
            - ' -m'
    selection_child_3:
        CommandLine|contains|all:
            - net
            - ' user '
            - ' /add'
    selection_child_4:
        CommandLine|contains|all:
            - net
            - ' localgroup '
            - ' administrators '
            - /add
    selection_child_5:
        NewProcessName|endswith:
            - \ntdsutil.exe
            - \ldifde.exe
            - \adfind.exe
            - \procdump.exe
            - \Nanodump.exe
            - \vssadmin.exe
            - \fsutil.exe
    selection_child_6:
        CommandLine|contains:
            - ' -decode '
            - ' -NoP '
            - ' -W Hidden '
            - ' /decode '
            - ' /ticket:'
            - ' sekurlsa'
            - .dmp full
            - .downloadfile(
            - .downloadstring(
            - FromBase64String
            - process call create
            - 'reg save '
            - whoami /priv
    condition: process_creation and (1 of selection_webserver_* and 1 of selection_child_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
