title: New Generic Credentials Added Via Cmdkey.EXE
ruletype: Sigma
author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/03
description: Detects usage of cmdkey to add generic credentials. As an example, this
    has to be used before connecting to an RDP session via command line interface.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\cmdkey.exe'
    SELECTION_4:
        OriginalFileName: cmdkey.exe
    SELECTION_5:
        CommandLine: '* /g*'
    SELECTION_6:
        CommandLine: '* /u*'
    SELECTION_7:
        CommandLine: '* /p*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and SELECTION_6 and SELECTION_7))
falsepositives:
- Legitimate usage for administration purposes
id: b1ec66c6-f4d1-4b5c-96dd-af28ccae7727
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1021.001/T1021.001.md#t1021001---remote-desktop-protocol
status: experimental
tags:
- attack.credential_access
- attack.t1003.005

