title: Suspicious CodePage Switch Via CHCP
ruletype: Sigma
author: Florian Roth (Nextron Systems), Jonhnathan Ribeiro, oscd.community
date: 2019/10/14
description: Detects a code page switch in command line or batch scripts to a rare
    language
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\chcp.com'
    SELECTION_4:
        CommandLine:
        - '* 936'
        - '* 1258'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrative activity (adjust code pages according to your organization's region)
fields:
- ParentCommandLine
id: c7942406-33dd-4377-a564-0f62db0593a3
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/07
references:
- https://docs.microsoft.com/en-us/windows/win32/intl/code-page-identifiers
- https://twitter.com/cglyer/status/1183756892952248325
status: test
tags:
- attack.t1036
- attack.defense_evasion

