title: Privilege Escalation via Named Pipe Impersonation
id: f97091ca-49b9-ea39-1091-bc06ed73b48f
status: test
description: Detects a remote file copy attempt to a hidden network share. This may indicate lateral movement or data staging activity.
references:
    - https://www.elastic.co/guide/en/security/current/privilege-escalation-via-named-pipe-impersonation.html
author: Tim Rauch, Elastic (idea)
date: 2022/09/27
modified: 2022/12/30
tags:
    - attack.lateral_movement
    - attack.t1021
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_name:
        - NewProcessName|endswith:
              - \cmd.exe
              - \powershell.exe
        - OriginalFileName:
              - Cmd.Exe
              - PowerShell.EXE
    selection_args:
        CommandLine|contains|all:
            - echo
            - '>'
            - \\\\.\\pipe\\
    condition: process_creation and (all of selection*)
falsepositives:
    - Other programs that cause these patterns (please report)
level: high
ruletype: Sigma
