
title: Enumeration for 3rd Party Creds From CLI
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/20
description: Detects processes that query known 3rd party registry keys that holds
  credentials via commandline
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine:
    - '*\Software\SimonTatham\PuTTY\Sessions*'
    - '*\Software\\SimonTatham\PuTTY\SshHostKeys\\*'
    - '*\Software\Mobatek\MobaXterm\\*'
    - '*\Software\WOW6432Node\Radmin\v3.0\Server\Parameters\Radmin*'
    - '*\Software\Aerofox\FoxmailPreview*'
    - '*\Software\Aerofox\Foxmail\V3.1*'
    - '*\Software\IncrediMail\Identities*'
    - '*\Software\Qualcomm\Eudora\CommandLine*'
    - '*\Software\RimArts\B2\Settings*'
    - '*\Software\OpenVPN-GUI\configs*'
    - '*\Software\Martin Prikryl\WinSCP 2\Sessions*'
    - '*\Software\FTPWare\COREFTP\Sites*'
    - '*\Software\DownloadManager\Passwords*'
    - '*\Software\OpenSSH\Agent\Keys*'
    - '*\Software\TightVNC\Server*'
    - '*\Software\ORL\WinVNC3\Password*'
    - '*\Software\RealVNC\WinVNC4*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
id: 87a476dc-0079-4583-a985-dee7a20a03de
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://isc.sans.edu/diary/More+Data+Exfiltration/25698
- https://github.com/synacktiv/Radmin3-Password-Cracker/blob/acfc87393e4b7c06353973a14a6c7126a51f36ac/regkey.txt
- https://github.com/HyperSine/how-does-MobaXterm-encrypt-password
- https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation#inside-the-registry
related:
- id: e0b0c2ab-3d52-46d9-8cb7-049dc775fbd1
  type: derived
status: experimental
tags:
- attack.credential_access
- attack.t1552.002
