title: Terminal Service Process Spawn
ruletype: Sigma
author: Florian Roth
date: 2019/05/22
description: Detects a process spawned by the terminal service server process (this
    could be an indicator for an exploitation of CVE-2019-0708)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentCommandLine: '*\svchost.exe*'
    SELECTION_4:
        ParentCommandLine: '*termsvcs*'
    SELECTION_5:
        NewProcessName:
        - '*\rdpclip.exe'
        - '*:\Windows\System32\csrss.exe'
        - '*:\Windows\System32\wininit.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5))
falsepositives:
- Unknown
id: 1012f107-b8f1-4271-af30-5aed2de89b39
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/06/24
references:
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/rdp-stands-for-really-do-patch-understanding-the-wormable-rdp-vulnerability-cve-2019-0708/
status: test
tags:
- attack.initial_access
- attack.t1190
- attack.lateral_movement
- attack.t1210
- car.2013-07-002

