title: UAC Bypass Using PkgMgr and DISM
id: 08a52423-1768-5eb8-726f-bfae99db5f64
related:
    - id: a743ceba-c771-4d75-97eb-8a90f7f4844c
      type: derived
status: test
description: Detects the pattern of UAC Bypass using pkgmgr.exe and dism.exe (UACMe 23)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-23
modified: 2024-12-01
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \pkgmgr.exe
        NewProcessName|endswith: \dism.exe
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
            - None
            - None
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
