title: Potential Active Directory Enumeration Using AD Module - ProcCreation
id: 617ab1b8-544d-3774-60f6-7fcbd7612a8f
status: test
description: Detects usage of the "Import-Module" cmdlet to load the "Microsoft.ActiveDirectory.Management.dl" DLL. Which is often used by attackers to perform AD enumeration.
references:
    - https://github.com/samratashok/ADModule
    - https://twitter.com/cyb3rops/status/1617108657166061568?s=20
    - https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/active-directory-enumeration-with-ad-module-without-rsat-or-admin-privileges
author: frack113
date: 2023/01/22
tags:
    - attack.reconnaissance
    - attack.discovery
    - attack.impact
    - sysmon
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith:
              - \powershell.exe
              - \pwsh.exe
        - OriginalFileName:
              - PowerShell.EXE
              - pwsh.dll
    selection_cmdlet:
        CommandLine|contains:
            - 'Import-Module '
            - 'ipmo '
    selection_dll:
        CommandLine|contains: Microsoft.ActiveDirectory.Management.dll
    condition: process_creation and (all of selection_*)
falsepositives:
    - Legitimate use of the library for administrative activity
level: medium
ruletype: Sigma
