title: Microsoft Workflow Compiler Execution
ruletype: Sigma
author: Nik Seetharaman, frack113
date: 2019/01/16
description: Detects invocation of Microsoft Workflow Compiler, which may permit the
    execution of arbitrary unsigned code.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\Microsoft.Workflow.Compiler.exe'
    SELECTION_4:
        OriginalFileName: Microsoft.Workflow.Compiler.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate MWC use (unlikely in modern enterprise environments)
fields:
- CommandLine
- ParentCommandLine
id: 419dbf2b-8a9b-4bea-bf99-7544b050ec8d
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/02/03
references:
- https://posts.specterops.io/arbitrary-unsigned-code-execution-vector-in-microsoft-workflow-compiler-exe-3d9294bc5efb
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1218/T1218.md
- https://lolbas-project.github.io/lolbas/Binaries/Microsoft.Workflow.Compiler/
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1127
- attack.t1218

