title: Conhost Parent Process Executions
ruletype: Sigma
author: omkar72
date: 2020/10/25
description: Detects the conhost execution as parent process. Can be used to evaded
    defense mechanism.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_10:
        Provider_Name: Microsoft-Windows-Kernel-Process
    SELECTION_11:
        ParentCommandLine:
        - '* cat-file -s *'
        - '*show --textconv*'
    SELECTION_12:
        NewProcessName: C:\Windows\System32\conhost.exe
    SELECTION_13:
        ParentCommandLine:
        - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0x4
        - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0xffffffff -ForceV1
    SELECTION_14:
        NewProcessName: C:\Windows\System32\conhost.exe
    SELECTION_15:
        ParentCommandLine:
        - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0xffffffff -ForceV1'
        - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0x4'
    SELECTION_16:
        NewProcessName: C:\Program Files\Git\mingw64\bin\git.exe
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\conhost.exe'
    SELECTION_4:
        Provider_Name: SystemTraceProvider-Process
    SELECTION_5:
        Provider_Name: Microsoft-Windows-Kernel-Process
    SELECTION_6:
        NewProcessName: '*\git.exe'
    SELECTION_7:
        ParentCommandLine:
        - '* show --textconv *'
        - '* cat-file -s *'
    SELECTION_8:
        ParentCommandLine: '*C:\WINDOWS\system32\conhost.exe 0x4*'
    SELECTION_9:
        CommandLine:
        - '* show --textconv *'
        - '* cat-file -s *'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5 and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9)
        or (SELECTION_10 and SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14)
        or (SELECTION_15 and SELECTION_16)))
falsepositives:
- Unknown
id: 7dc2dedd-7603-461a-bc13-15803d132355
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/12/07
references:
- http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202

