title: DeviceCredentialDeployment Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/19
description: Detects the execution of DeviceCredentialDeployment to hide a process
    from view
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\DeviceCredentialDeployment.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unlikely
id: b8b1b304-a60f-4999-9a6e-c547bde03ffd
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/pull/147
status: experimental
tags:
- attack.defense_evasion
- attack.t1218

