title: Potential WMI Lateral Movement WmiPrvSE Spawned PowerShell
ruletype: Sigma
author: Markus Neis @Karneades
date: 2019/04/03
description: Detects Powershell as a child of the WmiPrvSE process. Which could be
    a sign of lateral movement via WMI.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\WmiPrvSE.exe'
    SELECTION_4:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_5:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or
        SELECTION_5))
falsepositives:
- AppvClient
- CCM
- WinRM
id: 692f0bec-83ba-4d04-af7e-e884a96059b6
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2023/03/29
references:
- https://any.run/report/68bc255f9b0db6a0d30a8f2dadfbee3256acfe12497bf93943bc1eab0735e45e/a2385d6f-34f7-403c-90d3-b1f9d2a90a5e
related:
-   id: 8a582fe2-0882-4b89-a82a-da6b2dc32937
    type: similar
-   id: d21374ff-f574-44a7-9998-4a8c8bf33d7d
    type: similar
status: stable
tags:
- attack.execution
- attack.t1047
- attack.t1059.001

