title: DriverQuery.EXE Execution
id: 6c78dafc-594b-ab99-d6da-cafcb37ab087
related:
    - id: 9fc3072c-dc8f-4bf7-b231-18950000fadd
      type: similar
    - id: a20def93-0709-4eae-9bd2-31206e21e6b2
      type: derived
status: test
description: Detect usage of the "driverquery" utility. Which can be used to perform reconnaissance on installed drivers
references:
    - https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
    - https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/
    - https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-01-19
modified: 2023-09-29
tags:
    - attack.discovery
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: driverquery.exe
        - OriginalFileName: drvqry.exe
    filter_main_other: # These are covered in 9fc3072c-dc8f-4bf7-b231-18950000fadd to avoid duplicate alerting
        - ParentProcessName|endswith:
              - \cscript.exe
              - \mshta.exe
              - \regsvr32.exe
              - \rundll32.exe
              - \wscript.exe
        - ParentProcessName|contains:
              - \AppData\Local\
              - \Users\Public\
              - \Windows\Temp\
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Legitimate use by third party tools in order to investigate installed drivers
level: medium
regression_tests_path: regression_data/rules/windows/process_creation/proc_creation_win_driverquery_usage/info.yml
ruletype: Sigma
