title: Suspicious Redirection to Local Admin Share
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/01/16
description: Detects a suspicious output redirection to the local admins share, this
    technique is often found in malicious scripts or hacktool stagers
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*>*'
    SELECTION_4:
    - \\\\127.0.0.1\\admin$\\
    - \\\\localhost\\admin$\\
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4))
falsepositives:
- Unknown
id: ab9e3b40-0c85-4ba1-aede-455d226fd124
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/09/09
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: experimental

