title: SafeBoot Registry Key Deleted Via Reg.EXE
id: 9069f74a-131e-643b-86fc-0f23d29805d7
related:
    - id: d7662ff6-9e97-4596-a61d-9839e32dee8d
      type: similar
    - id: fc0e89b5-adb0-43c1-b749-c12a10ec37de
      type: derived
status: test
description: Detects execution of "reg.exe" commands with the "delete" flag on safe boot registry keys. Often used by attacker to prevent safeboot execution of security products
references:
    - https://www.trendmicro.com/en_us/research/22/e/avoslocker-ransomware-variant-abuses-driver-file-to-disable-anti-Virus-scans-log4shell.html
author: Nasreddine Bencherchali (Nextron Systems), Tim Shelton
date: 2022-08-08
modified: 2023-02-04
tags:
    - attack.defense-evasion
    - attack.t1562.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - NewProcessName|endswith: reg.exe
        - OriginalFileName: reg.exe
    selection_delete:
        CommandLine|contains|all:
            - ' delete '
            - \SYSTEM\CurrentControlSet\Control\SafeBoot
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
