title: Fast Reverse Proxy (FRP)
ruletype: Sigma
author: frack113, Florian Roth
date: 2022/09/02
description: Detects the use of Fast Reverse Proxy. frp is a fast reverse proxy to
    help you expose a local server behind a NAT or firewall to the Internet.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\frpc.exe'
        - '*\frps.exe'
    SELECTION_4:
        CommandLine: '*\frpc.ini*'
    SELECTION_5:
        Hashes:
        - '*MD5=7D9C233B8C9E3F0EA290D2B84593C842*'
        - '*SHA1=06DDC9280E1F1810677935A2477012960905942F*'
        - '*SHA256=57B0936B8D336D8E981C169466A15A5FD21A7D5A2C7DAF62D5E142EE860E387C*'
    SELECTION_6:
        md5: 7d9c233b8c9e3f0ea290d2b84593c842
    SELECTION_7:
        sha1: 06ddc9280e1f1810677935a2477012960905942f
    SELECTION_8:
        sha256: 57b0936b8d336d8e981c169466a15a5fd21a7d5a2c7daf62d5e142ee860e387c
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8))
falsepositives:
- Legitimate use
id: 32410e29-5f94-4568-b6a3-d91a8adad863
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/10/08
references:
- https://asec.ahnlab.com/en/38156/
- https://github.com/fatedier/frp
status: experimental
tags:
- attack.command_and_control
- attack.t1090

