title: Process Dump via Rundll32 and Comsvcs.dll
ruletype: Sigma
author: Florian Roth, Modexp, Nasreddine Bencherchali (update)
date: 2020/02/18
description: Detects process memory dump via comsvcs.dll and rundll32 using different
    techniques (ordinal, minidump function...etc)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\rundll32.exe'
    SELECTION_4:
        OriginalFileName: RUNDLL32.EXE
    SELECTION_5:
        CommandLine: '*rundll32*'
    SELECTION_6:
        CommandLine: '*comsvcs*'
    SELECTION_7:
        CommandLine: '*full*'
    SELECTION_8:
        Commandline:
        - '*24 *'
        - '*#24*'
        - '*#+24*'
        - '*MiniDump*'
    SELECTION_9:
        CommandLine: '*#-4294967272*'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 or SELECTION_4 or
        SELECTION_5) and (SELECTION_6 and SELECTION_7 and SELECTION_8)) or SELECTION_9))
falsepositives:
- Unlikely, because no one should dump the process memory in that way
id: 646ea171-dded-4578-8a4d-65e9822892e3
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/04
references:
- https://twitter.com/shantanukhande/status/1229348874298388484
- https://twitter.com/pythonresponder/status/1385064506049630211?s=21
- https://twitter.com/Hexacorn/status/1224848930795552769
- https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/
- https://twitter.com/SBousseaden/status/1167417096374050817
- https://twitter.com/Wietze/status/1542107456507203586
related:
-   id: 09e6d5c0-05b8-4ff8-9eeb-043046ec774c
    type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1036
- attack.t1003.001
- car.2013-05-009

