title: WmiPrvSE Spawned A Process
id: 26773337-b821-6c5b-2c1f-2e6cca581b84
status: stable
description: Detects WmiPrvSE spawning a process
references:
    - https://threathunterplaybook.com/hunts/windows/190815-RemoteServiceInstallation/notebook.html
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/08/15
modified: 2023/03/23
tags:
    - attack.execution
    - attack.t1047
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \WmiPrvSe.exe
    filter_logonid:
        SubjectLogonId:
            - '0x3e7'  # LUID 999 for SYSTEM
            - 'null'   # too many false positives
    filter_system_user:
        SubjectUserName|contains: # covers many language settings
            - AUTHORI
            - AUTORI
    filter_wmiprvse:
        NewProcessName|endswith: \WmiPrvSE.exe
    filter_werfault:
        NewProcessName|endswith: \WerFault.exe
    filter_null:  # some backends need the null value in a separate expression
        SubjectLogonId: null
    condition: process_creation and (selection and not 1 of filter_*)
falsepositives:
    - False positives are expected (e.g. in environments where WinRM is used legitimately)
level: medium
ruletype: Sigma
