title: Non Interactive PowerShell
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g (rule), oscd.community (improvements)
date: 2019/09/12
description: Detects non-interactive PowerShell activity by looking at powershell.exe
    with not explorer.exe as a parent.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\powershell.exe'
    SELECTION_4:
        ParentProcessName:
        - '*\explorer.exe'
        - '*\CompatTelRunner.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4))
falsepositives:
- Legitimate programs executing PowerShell scripts
id: f4bbd493-b796-416e-bbf2-121235348529
level: low
logsource:
    category: process_creation
    product: windows
modified: 2021/05/10
references:
- https://threathunterplaybook.com/notebooks/windows/02_execution/WIN-190410151110.html
status: experimental
tags:
- attack.execution
- attack.t1059.001

