title: Abusing Print Executable
id: 6e8f01f5-1282-1217-9c7a-9b84824e30a7
related:
    - id: bafac3d6-7de9-4dd9-8874-4a1194b493ed
      type: derived
status: test
description: Attackers can use print.exe for remote file copy
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Print/
    - https://twitter.com/Oddvarmoe/status/985518877076541440
author: Furkan CALISKAN, @caliskanfurkan_, @oscd_initiative
date: 2020-10-05
modified: 2022-07-07
tags:
    - attack.defense-evasion
    - attack.t1218
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|startswith: print
        CommandLine|contains|all:
            - /D
            - .exe
        NewProcessName|endswith: \print.exe
    filter_print:
        CommandLine|contains: print.exe
    condition: process_creation and (selection and not filter_print)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
