title: Suspicious Invoke-WebRequest Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/02
description: Detects a suspicious call to Invoke-WebRequest cmdlet where the and output
    is located in a suspicious location
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine:
        - '*curl *'
        - '*Invoke-WebRequest*'
        - '*iwr *'
        - '*wget *'
    SELECTION_6:
        CommandLine:
        - '* -ur*'
        - '* -o*'
    SELECTION_7:
        CommandLine:
        - '*\AppData\\*'
        - '*\Desktop\\*'
        - '*\Temp\\*'
        - '*\Users\Public\\*'
        - '*%AppData%*'
        - '*%Public%*'
        - '*%Temp%*'
        - '*%tmp%*'
        - '*C:\Windows\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6 and SELECTION_7)
falsepositives:
- Unknown
id: 5e3cc4d8-3e68-43db-8656-eaaeefdec9cc
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/21
references:
- https://www.sentinelone.com/blog/living-off-windows-defender-lockbit-ransomware-sideloads-cobalt-strike-through-microsoft-security-tool/
related:
-   id: e218595b-bbe7-4ee5-8a96-f32a24ad3468
    type: derived
status: experimental
tags:
- attack.command_and_control
- attack.t1105

