title: UAC Bypass Tools Using ComputerDefaults
id: f8836306-dba7-b71c-033f-6a42b39ae975
related:
    - id: 3c05e90d-7eba-4324-9972-5d7f711a60a8
      type: derived
status: test
description: Detects tools such as UACMe used to bypass UAC with computerdefaults.exe (UACMe 59)
references:
    - https://github.com/hfiref0x/UACME
author: Christian Burkard (Nextron Systems)
date: 2021-08-31
modified: 2024-12-01
tags:
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.t1548.002
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        MandatoryLabel:
            - S-1-16-12288
            - S-1-16-16384
            - None
            - None
        NewProcessName: C:\Windows\System32\ComputerDefaults.exe
    filter:
        ParentProcessName|contains:
            - :\Windows\System32
            - :\Program Files
    condition: process_creation and (selection and not filter)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
