title: Execution of Suspicious File Type Extension
id: c09dad97-1c78-4f71-b127-7edb2b8e491a
status: experimental
description: Checks whether the image specified in a process creation event doesn't
    refer to an .exe file (caused by process ghosting or other unorthodox methods
    to start a process)
references:
    - https://pentestlaboratories.com/2021/12/08/process-ghosting/
author: Max Altgelt (Nextron Systems)
date: 2021/12/09
modified: 2023/10/10
tags:
    - attack.defense_evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    known_image_extension:
        NewProcessName|endswith:
            - .exe
            - .tmp
            - .scr
    filter_main_image:
        NewProcessName:
            - System
            - Registry
            - MemCompression
            - vmmem
    filter_main_msi_installers:
        NewProcessName|startswith: C:\Windows\Installer\MSI
    filter_main_driver_store:
        NewProcessName|startswith: C:\Windows\System32\DriverStore\FileRepository\
    filter_main_msi_rollbackfiles:
        NewProcessName|startswith: C:\Config.Msi\
        NewProcessName|endswith:
            - .rbf
            - .rbs
    filter_main_windows_helper:
        ParentProcessName|startswith: C:\Windows\Temp\
        NewProcessName|startswith: C:\Windows\Temp\Helper\
    filter_main_com:
        NewProcessName|startswith:
            - C:\Windows\System32\
            - C:\Windows\SysWOW64\
        NewProcessName|endswith: .com
    filter_main_deleted:
        NewProcessName|startswith: C:\$Extend\$Deleted\
    filter_optional_empty:
        NewProcessName:
            - '-'
            - ''
    filter_optional_null:
        NewProcessName: null
    filter_optional_avira:
        ParentProcessName|startswith: C:\ProgramData\Avira\
    filter_optional_nvidia:
        NewProcessName|contains: NVIDIA\NvBackend\
        NewProcessName|endswith: .dat
    filter_optional_winscp:
        NewProcessName|endswith: \WinSCP.com
    filter_optional_vscode:
        NewProcessName|contains|all:
            - C:\Users\
            - \AppData\
            - .tmp
            - CodeSetup
    filter_optional_libreoffice:
        NewProcessName|endswith: \program\soffice.bin
    filter_optional_openoffice:
        NewProcessName|endswith: \program\unopkg.bin
    filter_optional_emc_networker:
        NewProcessName:
            - C:\Program Files\EMC NetWorker\Management\GST\apache\cgi-bin\update_jnlp.cgi
            - C:\Program Files (x86)\EMC NetWorker\Management\GST\apache\cgi-bin\update_jnlp.cgi
    filter_optional_winpakpro:
        NewProcessName|startswith:
            - C:\Program Files (x86)\WINPAKPRO\
            - C:\Program Files\WINPAKPRO\
        NewProcessName|endswith: .ngn
    filter_optional_myq_server:
        NewProcessName:
            - C:\Program Files (x86)\MyQ\Server\pcltool.dll
            - C:\Program Files\MyQ\Server\pcltool.dll
    filter_optional_visualstudio:
        NewProcessName|startswith:
            - C:\Program Files\Microsoft Visual Studio\
            - C:\Program Files (x86)\Microsoft Visual Studio
        NewProcessName|endswith: .com
    filter_optional_wsl:
        NewProcessName|contains|all:
            - \AppData\Local\Packages\
            - \LocalState\rootfs\
    filter_optional_lzma_exe:
        NewProcessName|endswith: \LZMA_EXE
    filter_optional_dell_dock:
        ParentProcessName|startswith: C:\Windows\Temp\
        ParentProcessName|endswith: \TBT_Dock_Firmware\GetDockVer32W.exe
    filter_optional_firefox_crashreporter:
        NewProcessName|startswith: C:\Program Files\Mozilla Firefox\tobedeleted\
    filter_optional_office_c2r:
        CommandLine|contains|all:
            - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\OfficeC2RClient.exe
            - /update UPDATEORCHESTRATOR displaylevel=False
        ParentProcessName: C:\Windows\UUS\amd64\MoUsoCoreWorker.exe
        NewProcessName|startswith: C:\$Extend\$Deleted\
    filter_optional_docker:
        ParentProcessName: C:\Windows\System32\services.exe
        NewProcessName|endswith: com.docker.service
    condition: process_creation and (not known_image_extension and not 1 of filter_main_*
        and not 1 of filter_optional_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
