title: Registry Parse with Pypykatz
ruletype: Sigma
author: frack113
date: 2022/01/05
description: Adversaries may attempt to extract credential material from the Security
    Account Manager (SAM) database either through Windows Registry where the SAM database
    is stored
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\pypykatz.exe'
        - '*\python.exe'
    SELECTION_4:
        CommandLine: '*live*'
    SELECTION_5:
        CommandLine: '*registry*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: a29808fd-ef50-49ff-9c7a-59a9b040b404
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/25
references:
- https://github.com/skelsec/pypykatz
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-2---registry-parse-with-pypykatz
status: test
tags:
- attack.credential_access
- attack.t1003.002

