title: Lolbin Defaultpack.exe Use As Proxy
ruletype: Sigma
author: frack113
date: 2022/12/31
description: Detect usage of the "defaultpack.exe" binary as a proxy to launch other
    programs
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\defaultpack.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: b2309017-4235-44fe-b5af-b15363011957
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
- https://www.echotrail.io/insights/search/defaultpack.exe
status: experimental
tags:
- attack.t1218
- attack.defense_evasion
- attack.execution

