title: HackTool - Stracciatella Execution
ruletype: Sigma
author: pH-T (Nextron Systems)
date: 2023/04/17
description: Detects Stracciatella which executes a Powershell runspace from within
    C# (aka SharpPick technique) with AMSI, ETW and Script Block Logging disabled
    based on PE metadata characteristics.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\Stracciatella.exe'
    SELECTION_4:
        OriginalFileName: Stracciatella.exe
    SELECTION_5:
        Description: Stracciatella
    SELECTION_6:
        Hashes:
        - '*SHA256=9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956*'
        - '*SHA256=fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a*'
    SELECTION_7:
        sha256:
        - 9d25e61ec1527e2a69d7c2a4e3fe2fe15890710c198a66a9f25d99fdf6c7b956
        - fd16609bd9830c63b9413671678bb159b89c357d21942ddbb6b93add808d121a
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5
        or SELECTION_6 or SELECTION_7))
falsepositives:
- Unlikely
id: 7a4d9232-92fc-404d-8ce1-4c92e7caf539
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/mgeeky/Stracciatella
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1059
- attack.t1562.001

