title: Use of OpenConsole
id: 94528740-76e2-5bfd-e3d5-a6fc1aea5bcd
related:
    - id: 814c95cc-8192-4378-a70a-f1aafd877af1
      type: derived
status: test
description: Detects usage of OpenConsole binary as a LOLBIN to launch other binaries to bypass application Whitelisting
references:
    - https://twitter.com/nas_bench/status/1537563834478645252
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-06-16
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - OriginalFileName: OpenConsole.exe
        - NewProcessName|endswith: \OpenConsole.exe
    filter:
        NewProcessName|startswith: C:\Program Files\WindowsApps\Microsoft.WindowsTerminal
    condition: process_creation and (selection and not filter)
falsepositives:
    - Legitimate use by an administrator
level: medium
ruletype: Sigma
