title: Suspicious Nmap Execution
ruletype: Sigma
author: frack113
date: 2021/12/10
description: Adversaries may attempt to get a listing of services running on remote
    hosts, including those that may be vulnerable to remote software exploitation
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        OriginalFileName: nmap.exe
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Network administrator computer
id: f6ecd1cf-19b8-4488-97f6-00f0924991a3
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/12/25
references:
- https://nmap.org/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-3---port-scan-nmap-for-windows
status: test
tags:
- attack.discovery
- attack.t1046

