title: Suspicious Double Extension File Execution
id: 452b2159-5e6e-c494-63b9-b385d6195f58
status: stable
description: Detects suspicious use of an .exe extension after a non-executable file extension like .pdf.exe, a set of spaces or underlines to cloak the executable file in spear phishing campaigns
references:
    - https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html
    - https://twitter.com/blackorbird/status/1140519090961825792
author: Florian Roth (Nextron Systems), @blu3_team (idea), Nasreddine Bencherchali (Nextron Systems)
date: 2019/06/26
modified: 2023/02/28
tags:
    - attack.initial_access
    - attack.t1566.001
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - .doc.exe
            - .docx.exe
            - .xls.exe
            - .xlsx.exe
            - .ppt.exe
            - .pptx.exe
            - .rtf.exe
            - .pdf.exe
            - .txt.exe
            - '      .exe'
            - ______.exe
            - .doc.js
            - .docx.js
            - .xls.js
            - .xlsx.js
            - .ppt.js
            - .pptx.js
            - .rtf.js
            - .pdf.js
            - .txt.js
        NewProcessName|endswith:
            - .doc.exe
            - .docx.exe
            - .xls.exe
            - .xlsx.exe
            - .ppt.exe
            - .pptx.exe
            - .rtf.exe
            - .pdf.exe
            - .txt.exe
            - '      .exe'
            - ______.exe
            - .doc.js
            - .docx.js
            - .xls.js
            - .xlsx.js
            - .ppt.js
            - .pptx.js
            - .rtf.js
            - .pdf.js
            - .txt.js
    condition: process_creation and selection
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
