title: Suspicious Persistence Via VMwareToolBoxCmd.EXE VM State Change Script
id: 2f54a1b2-dad9-be0e-bdd0-a299137396ac
status: experimental
description: Detects execution of the "VMwareToolBoxCmd.exe" with the "script" and "set" flag to setup a specific script that's located in a potentially suspicious location to run for a specific VM state
references:
    - https://bohops.com/2021/10/08/analyzing-and-detecting-a-vmtools-persistence-technique/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/14
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_bin_img:
        - NewProcessName|endswith: \VMwareToolBoxCmd.exe
        - OriginalFileName: toolbox-cmd.exe
    selection_bin_cli:
        CommandLine|contains|all:
            - ' script '
            - ' set '
    selection_susp_paths:
        CommandLine|contains:
            - :\PerfLogs\
            - :\Temp\
            - :\Windows\System32\Tasks\
            - :\Windows\Tasks\
            - :\Windows\Temp\
            - \AppData\Local\Temp
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
