title: Potential Memory Dumping Activity Via LiveKD
id: 4015c0bf-a80a-7b4f-cff2-cb50ea14b40f
related:
    - id: a85f7765-698a-4088-afa0-ecfbf8d01fa4
      type: derived
status: test
description: Detects execution of LiveKD based on PE metadata or image name
references:
    - https://learn.microsoft.com/en-us/sysinternals/downloads/livekd
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023-05-15
tags:
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith:
              - \livekd.exe
              - \livekd64.exe
        - OriginalFileName: livekd.exe
    condition: process_creation and selection
falsepositives:
    - Administration and debugging activity (must be investigated)
level: medium
ruletype: Sigma
