title: Remote PowerShell Session Host Process (WinRM)
ruletype: Sigma
author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: Detects remote PowerShell sections by monitoring for wsmprovhost (WinRM
    host process) as a parent or child process (sign of an active PowerShell remote
    session).
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\wsmprovhost.exe'
    SELECTION_4:
        ParentProcessName: '*\wsmprovhost.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate usage of remote Powershell, e.g. for monitoring purposes.
fields:
- ComputerName
- User
- CommandLine
id: 734f8d9b-42b8-41b2-bcf5-abaf49d5a3c8
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.t1021.006

