title: Webshell Tool Reconnaissance Activity
id: f64e5c19-879c-4bae-b471-6d84c8339677
status: test
description: |
    Detects processes spawned from web servers (PHP, Tomcat, IIS, etc.) that perform reconnaissance looking for the existence of popular scripting tools (perl, python, wget) on the system via the help commands
references:
    - https://ragged-lab.blogspot.com/2020/07/webshells-automating-reconnaissance.html
author: Cian Heasley, Florian Roth (Nextron Systems)
date: 2020/07/22
modified: 2023/11/09
tags:
    - attack.persistence
    - attack.t1505.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_webserver_image:
        ParentProcessName|endswith:
            - \caddy.exe
            - \httpd.exe
            - \nginx.exe
            - \php-cgi.exe
            - \w3wp.exe
            - \ws_tomcatservice.exe
    selection_webserver_characteristics_tomcat1:
        ParentProcessName|endswith:
            - \java.exe
            - \javaw.exe
        ParentProcessName|contains:
            - -tomcat-
            - \tomcat
    selection_webserver_characteristics_tomcat2:
        CommandLine|contains:
            - CATALINA_HOME
            - catalina.jar
        ParentProcessName|endswith:
            - \java.exe
            - \javaw.exe
    selection_recon:
        CommandLine|contains:
            - perl --help
            - perl -h
            - python --help
            - python -h
            - python3 --help
            - python3 -h
            - wget --help
    condition: process_creation and (1 of selection_webserver_* and selection_recon)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
