title: Netcat Suspicious Execution
ruletype: Sigma
author: frack113, Florian Roth
date: 2021/07/21
description: Detects execution of Netcat. Adversaries may use a non-application layer
    protocol for communication between host and C2 server or among infected hosts
    within a network
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\nc.exe'
        - '*\ncat.exe'
        - '*\netcat.exe'
    SELECTION_4:
        CommandLine:
        - '* -lvp *'
        - '* -lvnp*'
        - '* -l -v -p *'
        - '* -lv -p *'
        - '* -l --proxy-type http *'
        - '* -vnl --exec *'
        - '* -vnl -e *'
        - '* --lua-exec *'
        - '* --sh-exec *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate ncat use
id: e31033fc-33f0-4020-9a16-faf9b31cbf08
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/02
references:
- https://nmap.org/ncat/
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1095/T1095.md
- https://www.revshells.com/
status: experimental
tags:
- attack.command_and_control
- attack.t1095

