title: Execute Arbitrary Binaries Using GUP Utility
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/10
description: Detects execution of the Notepad++ updater (gup) to launch other commands
    or executables
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\gup.exe'
    SELECTION_4:
        NewProcessName: '*\explorer.exe'
    SELECTION_5:
        NewProcessName: '*\explorer.exe'
    SELECTION_6:
        CommandLine: '*\Notepad++\notepad++.exe*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        (SELECTION_5 and SELECTION_6))
falsepositives:
- Other parent binaries using GUP not currently identified
id: d65aee4d-2292-4cea-b832-83accd6cfa43
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://twitter.com/nas_bench/status/1535322445439180803
status: experimental
tags:
- attack.execution

