title: Conhost Parent Process Executions
id: 7dc2dedd-7603-461a-bc13-15803d132355
status: experimental
description: Detects the conhost execution as parent process. Can be used to evaded
    defense mechanism.
references:
    - http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
author: omkar72
date: 2020/10/25
modified: 2022/12/07
tags:
    - attack.defense_evasion
    - attack.t1202
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith: \conhost.exe
    filter_provider:
        Provider_Name: SystemTraceProvider-Process
    filter_git:
        Provider_Name: Microsoft-Windows-Kernel-Process
        ParentCommandLine|contains:
            - ' show --textconv '
            - ' cat-file -s '
        NewProcessName|endswith: \git.exe
    filter_git_show:
        ParentCommandLine|contains: C:\WINDOWS\system32\conhost.exe 0x4
        CommandLine|contains:
            - ' show --textconv '
            - ' cat-file -s '
    filter_image_conhost:
        Provider_Name: Microsoft-Windows-Kernel-Process
        ParentCommandLine|contains:
            - ' cat-file -s '
            - show --textconv
        NewProcessName: C:\Windows\System32\conhost.exe
    filter_image_conhost2:
        ParentCommandLine:
            - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0x4
            - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0xffffffff -ForceV1
        NewProcessName: C:\Windows\System32\conhost.exe
    filter_image_git:
        ParentCommandLine:
            - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0xffffffff -ForceV1'
            - \\\?\?\\C:\\WINDOWS\\system32\\conhost.exe 0x4'
        NewProcessName: C:\Program Files\Git\mingw64\bin\git.exe
    condition: process_creation and (selection and not 1 of filter_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
