title: SQLite Chrome Cookie DB Access
ruletype: Sigma
author: TropChaud
date: 2022/12/19
description: Detect use of sqlite binary to query the Chrome Cookies database and
    steal the cookie data contained within it
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        Product: SQLite
    SELECTION_4:
        NewProcessName:
        - '*\sqlite.exe'
        - '*\sqlite3.exe'
    SELECTION_5:
        CommandLine:
        - '*\Google\Chrome\User Data\Default\Network\Cookies*'
        - '*\Google\Chrome\User Data\Default\Cookies*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Unknown
id: 24c77512-782b-448a-8950-eddb0785fc71
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/84d9edaaaa2c5511144521b0e4af726d1c7276ce/atomics/T1539/T1539.md#atomic-test-2---steal-chrome-cookies-windows
status: experimental
tags:
- attack.credential_access
- attack.t1539

