title: HackTool - SharpUp PrivEsc Tool Execution
id: 9a8e6f2d-2a56-788b-343a-a50584a15079
related:
    - id: c484e533-ee16-4a93-b6ac-f0ea4868b2f1
      type: derived
status: test
description: Detects the use of SharpUp, a tool for local privilege escalation
references:
    - https://github.com/GhostPack/SharpUp
author: Florian Roth (Nextron Systems)
date: 2022-08-20
modified: 2023-02-13
tags:
    - attack.persistence
    - attack.defense-evasion
    - attack.privilege-escalation
    - attack.discovery
    - attack.execution
    - attack.t1615
    - attack.t1569.002
    - attack.t1574.005
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \SharpUp.exe
        - Description: SharpUp
        - CommandLine|contains:
              - HijackablePaths
              - UnquotedServicePath
              - ProcessDLLHijack
              - ModifiableServiceBinaries
              - ModifiableScheduledTask
              - DomainGPPPassword
              - CachedGPPPassword
    condition: process_creation and selection
falsepositives:
    - Unknown
level: critical
ruletype: Sigma
