title: Taskkill Symantec Endpoint Protection
ruletype: Sigma
author: Ilya Krestinichev, Florian Roth (Nextron Systems)
date: 2022/09/13
description: 'Detects one of the possible scenarios for disabling Symantec Endpoint
    Protection.

    Symantec Endpoint Protection antivirus software services incorrectly implement
    the protected service mechanism.

    As a result, the NT AUTHORITY/SYSTEM user can execute the taskkill /im command
    several times ccSvcHst.exe /f, thereby killing the process belonging to the service,
    and thus shutting down the service.

    '
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*taskkill*'
    SELECTION_4:
        CommandLine: '* /F *'
    SELECTION_5:
        CommandLine: '* /IM *'
    SELECTION_6:
        CommandLine: '*ccSvcHst.exe*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
        and SELECTION_6)
falsepositives:
- Unknown
id: 4a6713f6-3331-11ed-a261-0242ac120002
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.exploit-db.com/exploits/37525
- https://community.spiceworks.com/topic/2195015-batch-script-to-uninstall-symantec-endpoint-protection
- https://community.broadcom.com/symantecenterprise/communities/community-home/digestviewer/viewthread?MessageKey=6ce94b67-74e1-4333-b16f-000b7fd874f0&CommunityKey=1ecf5f55-9545-44d6-b0f4-4e4a7f5f5e68&tab=digestviewer
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001

