title: Suspicious ConfigSecurityPolicy Execution
id: 956a39b3-a319-4b78-6305-a216732d379e
related:
    - id: 1f0f6176-6482-4027-b151-00071af39d7e
      type: derived
status: test
description: Upload file, credentials or data exfiltration with Binary part of Windows Defender
references:
    - https://lolbas-project.github.io/lolbas/Binaries/ConfigSecurityPolicy/
author: frack113
date: 2021/11/26
modified: 2022/05/16
tags:
    - attack.exfiltration
    - attack.t1567
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    lolbas:
        - CommandLine|contains: ConfigSecurityPolicy.exe
        - NewProcessName|endswith: \ConfigSecurityPolicy.exe
        - OriginalFileName: ConfigSecurityPolicy.exe
    remote:
        CommandLine|contains:
            - https://
            - http://
            - ftp://
    condition: process_creation and (lolbas and remote)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
