title: Potentially Suspicious Child Process of KeyScrambler.exe
id: b2e90afd-fc69-1c5c-0457-d908fe3c4335
status: experimental
description: Detects potentially suspicious child processes of KeyScrambler.exe
references:
    - https://twitter.com/DTCERT/status/1712785421845790799
author: Swachchhanda Shrawan Poudel
date: 2024/05/13
tags:
    - attack.execution
    - attack.defense_evasion
    - attack.privilege_escalation
    - attack.t1203
    - attack.t1574.002
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \KeyScrambler.exe
    selection_binaries:
        # Note: add additional binaries that the attacker might use
        - NewProcessName|endswith:
              - \cmd.exe
              - \cscript.exe
              - \mshta.exe
              - \powershell.exe
              - \pwsh.exe
              - \regsvr32.exe
              - \rundll32.exe
              - \wscript.exe
        - OriginalFileName:
              - Cmd.Exe
              - cscript.exe
              - mshta.exe
              - PowerShell.EXE
              - pwsh.dll
              - regsvr32.exe
              - RUNDLL32.EXE
              - wscript.exe
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
