title: Renamed Microsoft Teams Execution
id: 5db91ae7-124a-c74c-5c9c-d5317ea74dd7
related:
    - id: 88f46b67-14d4-4f45-ac2c-d66984f22191
      type: derived
status: experimental
description: Detects the execution of a renamed Microsoft Teams binary.
references:
    - Internal Research
author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/07/12
tags:
    - attack.defense_evasion
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        OriginalFileName:
            - msteams.exe
            - teams.exe
    filter_main_legit_names:
        NewProcessName|endswith:
            - \msteams.exe
            - \teams.exe
    condition: process_creation and (selection and not 1 of filter_main_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
