title: Suspicious Csc.exe Source File Folder
id: dcaa3f04-70c3-427a-80b4-b870d73c94c4
status: test
description: Detects a suspicious execution of csc.exe, which uses a source in a suspicious
    folder (e.g. AppData)
references:
    - https://securityboulevard.com/2019/08/agent-tesla-evading-edr-by-removing-api-hooks/
    - https://www.clearskysec.com/wp-content/uploads/2018/11/MuddyWater-Operations-in-Lebanon-and-Oman.pdf
    - https://app.any.run/tasks/c6993447-d1d8-414e-b856-675325e5aa09/
    - https://twitter.com/gN3mes1s/status/1206874118282448897
author: Florian Roth (Nextron Systems)
date: 2019/08/24
modified: 2022/10/09
tags:
    - attack.defense_evasion
    - attack.t1027.004
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        CommandLine|contains:
            - \AppData\
            - \Windows\Temp\
        NewProcessName|endswith: \csc.exe
    filter:
        -   ParentProcessName|startswith: C:\Program Files
        -   ParentProcessName|endswith:
                - \sdiagnhost.exe
                - \w3wp.exe
                - \choco.exe
        -   ParentCommandLine|contains: \ProgramData\Microsoft\Windows Defender Advanced
                Threat Protection
    condition: process_creation and (selection and not filter)
falsepositives:
    - Legitimate software from program files - https://twitter.com/gN3mes1s/status/1206874118282448897
    - Legitimate Microsoft software - https://twitter.com/gabriele_pippi/status/1206907900268072962
level: medium
ruletype: Sigma
