title: Potential Recon Activity Using DriverQuery.EXE
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2023/01/19
description: Detect usage of the "driverquery" utility to perform reconnaissance on
    installed drivers
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*driverquery.exe'
    SELECTION_4:
        OriginalFileName: drvqry.exe
    SELECTION_5:
        ParentProcessName:
        - '*\cmd.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\mshta.exe'
    SELECTION_6:
        ParentProcessName:
        - '*\AppData\Local\\*'
        - '*\Users\Public\\*'
        - '*\Windows\Temp\\*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 or SELECTION_6))
falsepositives:
- Unknown
id: 9fc3072c-dc8f-4bf7-b231-18950000fadd
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://thedfirreport.com/2023/01/09/unwrapping-ursnifs-gifts/
- https://www.vmray.com/cyber-security-blog/analyzing-ursnif-behavior-malware-sandbox/
- https://www.fireeye.com/blog/threat-research/2020/01/saigon-mysterious-ursnif-fork.html
related:
-   id: a20def93-0709-4eae-9bd2-31206e21e6b2
    type: similar
status: experimental
tags:
- attack.discovery

