title: Suspicious Child Process of AspNetCompiler
id: 300b2c4e-03e9-b2ee-c6c3-9c87971d4bf2
status: experimental
description: Detects potentially suspicious child processes of "aspnet_compiler.exe".
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Aspnet_Compiler/
    - https://ijustwannared.team/2020/08/01/the-curious-case-of-aspnet_compiler-exe/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/14
tags:
    - attack.defense_evasion
    - attack.t1127
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_parent:
        ParentProcessName|endswith: \aspnet_compiler.exe
    selection_child:
        # Note: add other potential suspicious child processes and paths
        - NewProcessName|endswith:
              - \calc.exe
              - \notepad.exe
        - NewProcessName|contains:
              - \Users\Public\
              - \AppData\Local\Temp\
              - \AppData\Local\Roaming\
              - :\Temp\
              - :\Windows\Temp\
              - :\Windows\System32\Tasks\
              - :\Windows\Tasks\
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
