title: Suspicious Encoded PowerShell Command Line
ruletype: Sigma
author: Florian Roth (Nextron Systems), Markus Neis, Jonhnathan Ribeiro, Daniil Yugoslavskiy,
    Anton Kutepov, oscd.community
date: 2018/09/03
description: Detects suspicious powershell process starts with base64 encoded commands
    (e.g. Emotet)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine: '* -e*'
    SELECTION_6:
        CommandLine:
        - '* JAB*'
        - '* SUVYI*'
        - '* SQBFAFgA*'
        - '* aQBlAHgA*'
        - '* aWV4I*'
        - '* IAA*'
        - '* IAB*'
        - '* UwB*'
        - '* cwB*'
    SELECTION_7:
        CommandLine:
        - '*.exe -ENCOD *'
        - '* BA^J e-*'
    SELECTION_8:
        CommandLine: '* -ExecutionPolicy remotesigned *'
    condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or SELECTION_7)) and  not ((SELECTION_8)))
id: ca2092a1-c273-4878-9b4b-0d60115bf5ea
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/04/06
references:
- https://app.any.run/tasks/6217d77d-3189-4db2-a957-8ab239f3e01e
status: test
tags:
- attack.execution
- attack.t1059.001

