title: Suspicious ftp.exe
ruletype: Sigma
author: Victor Sergeev, oscd.community
date: 2020/10/09
description: Detects renamed ftp.exe, ftp.exe script execution and child processes
    ran by ftp.exe
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*ftp.exe'
    SELECTION_4:
        CommandLine: '*-s:*'
    SELECTION_5:
        OriginalFileName: ftp.exe
    SELECTION_6:
        CommandLine: '*-s:*'
    SELECTION_7:
        OriginalFileName: ftp.exe
    SELECTION_8:
        NewProcessName: '*ftp.exe'
    SELECTION_9:
        ParentProcessName: '*ftp.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (((SELECTION_3 and SELECTION_4)
        or (SELECTION_5 and SELECTION_6)) or (SELECTION_7 and  not (SELECTION_8))
        or SELECTION_9))
falsepositives:
- Unknown
fields:
- CommandLine
- ParentImage
id: 06b401f4-107c-4ff9-947f-9ec1e7649f1e
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/05/13
references:
- https://lolbas-project.github.io/lolbas/Binaries/Ftp/
status: test
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202

