title: Suspicious Extrac32 Execution
id: 1a6983b5-f09c-767b-3ebe-349e7cde3c8e
related:
    - id: aa8e035d-7be4-48d3-a944-102aec04400d
      type: derived
status: test
description: Download or Copy file with Extrac32
references:
    - https://lolbas-project.github.io/lolbas/Binaries/Extrac32/
author: frack113
date: 2021-11-26
modified: 2022-08-13
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_lolbas:
        - CommandLine|contains: extrac32.exe
        - NewProcessName|endswith: \extrac32.exe
        - OriginalFileName: extrac32.exe
    selection_archive:
        CommandLine|contains: .cab
    selection_options:
        CommandLine|contains:
            - /C
            - /Y
            - ' \\\\'
    condition: process_creation and (all of selection_*)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
