title: Execute MSDT Via Answer File
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/06/13
description: Detects execution of "msdt.exe" using an answer file which is simulating
    the legitimate way of calling msdt via "pcwrun.exe" (For example from the compatibility
    tab)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName: '*\msdt.exe'
    SELECTION_4:
        CommandLine: '*\WINDOWS\diagnostics\index\PCWDiagnostic.xml*'
    SELECTION_5:
        CommandLine:
        - '* -af *'
        - '* /af *'
    SELECTION_6:
        ParentProcessName: '*\pcwrun.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not (SELECTION_6))
falsepositives:
- Possible undocumented parents of "msdt" other than "pcwrun"
id: 9c8c7000-3065-44a8-a555-79bcba5d9955
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msdt/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
- attack.execution

