title: HackTool - Jlaive In-Memory Assembly Execution
id: 0a99eb3e-1617-41bd-b095-13dc767f3def
status: test
description: Detects the use of Jlaive to execute assemblies in a copied PowerShell
references:
    - https://jstnk9.github.io/jstnk9/research/Jlaive-Antivirus-Evasion-Tool
    - https://web.archive.org/web/20220514073704/https://github.com/ch2sh/Jlaive
author: Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)
date: 2022/05/24
modified: 2023/02/22
tags:
    - attack.execution
    - attack.t1059.003
logsource:
    product: windows
    category: process_creation
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    parent_selection:
        ParentCommandLine|endswith: .bat
        ParentProcessName|endswith: \cmd.exe
    selection1:
        CommandLine|contains|all:
            - powershell.exe
            - .bat.exe
        NewProcessName|endswith: \xcopy.exe
    selection2:
        CommandLine|contains|all:
            - pwsh.exe
            - .bat.exe
        NewProcessName|endswith: \xcopy.exe
    selection3:
        CommandLine|contains|all:
            - +s
            - +h
            - .bat.exe
        NewProcessName|endswith: \attrib.exe
    condition: process_creation and (parent_selection and (1 of selection*))
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
