title: PUA - DIT Snapshot Viewer
id: 835ff144-018a-4ec5-3788-ea773f0fd869
related:
    - id: d3b70aad-097e-409c-9df2-450f80dc476b
      type: derived
status: test
description: Detects the use of Ditsnap tool, an inspection tool for Active Directory database, ntds.dit.
references:
    - https://thedfirreport.com/2020/06/21/snatch-ransomware/
    - https://web.archive.org/web/20201124182207/https://github.com/yosqueoy/ditsnap
author: Furkan Caliskan (@caliskanfurkan_)
date: 2020-07-04
modified: 2023-02-21
tags:
    - attack.credential-access
    - attack.t1003.003
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        - NewProcessName|endswith: \ditsnap.exe
        - CommandLine|contains: ditsnap.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate admin usage
level: high
ruletype: Sigma
