title: MSExchange Transport Agent Installation
ruletype: Sigma
author: Tobias Michalski
date: 2021/06/08
description: Detects the Installation of a Exchange Transport Agent
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine: '*Install-TransportAgent*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate installations of exchange TransportAgents. AssemblyPath is a good indicator
    for this.
fields:
- AssemblyPath
id: 83809e84-4475-4b69-bc3e-4aad8568612f
level: medium
logsource:
    category: process_creation
    product: windows
modified: 2022/10/09
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=7
related:
-   id: 83809e84-4475-4b69-bc3e-4aad8568612f
    type: similar
status: test
tags:
- attack.persistence
- attack.t1505.002

