title: Unsigned AppX Installation Attempt Using Add-AppxPackage
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/31
description: Detects usage of the "Add-AppxPackage" or it's alias "Add-AppPackage"
    to install unsigned AppX packages
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\powershell.exe'
        - '*\pwsh.exe'
    SELECTION_4:
        OriginalFileName:
        - PowerShell.EXE
        - pwsh.dll
    SELECTION_5:
        CommandLine:
        - '*Add-AppPackage *'
        - '*Add-AppxPackage *'
    SELECTION_6:
        CommandLine: '* -AllowUnsigned*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5 and SELECTION_6)
falsepositives:
- Installation of unsigned packages for testing purposes
id: 37651c2a-42cd-4a69-ae0d-22a4349aa04a
level: medium
logsource:
    category: process_creation
    product: windows
references:
- https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
- https://twitter.com/WindowsDocs/status/1620078135080325122
related:
-   id: 975b2262-9a49-439d-92a6-0709cccdf0b2
    type: similar
status: experimental
tags:
- attack.persistence
- attack.defense_evasion

