title: Suspicious PowerShell Invocation From Script Engines
id: 82fb76c3-b42b-096c-0e6c-8733e1993492
related:
    - id: 95eadcb2-92e4-4ed1-9031-92547773a6db
      type: derived
status: test
description: Detects suspicious powershell invocations from interpreters or unusual programs
references:
    - https://www.securitynewspaper.com/2017/03/20/attackers-leverage-excel-powershell-dns-latest-non-malware-attack/
author: Florian Roth (Nextron Systems)
date: 2019-01-16
modified: 2023-01-05
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection:
        ParentProcessName|endswith:
            - \wscript.exe
            - \cscript.exe
        NewProcessName|endswith:
            - \powershell.exe
            - \pwsh.exe
    filter_health_service:
        CurrentDirectory|contains: \Health Service State\
    condition: process_creation and (selection and not 1 of filter_*)
falsepositives:
    - Microsoft Operations Manager (MOM)
    - Other scripts
level: medium
ruletype: Sigma
