title: Potential WinAPI Calls Via CommandLine
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/06
description: Detects the use of WinAPI Functions via the commandline. As seen used
    by threat actors via the tool winapiexec
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        CommandLine:
        - '*AddSecurityPackage*'
        - '*AdjustTokenPrivileges*'
        - '*Advapi32*'
        - '*CloseHandle*'
        - '*CreateProcessWithToken*'
        - '*CreatePseudoConsole*'
        - '*CreateRemoteThread*'
        - '*CreateThread*'
        - '*CreateUserThread*'
        - '*DangerousGetHandle*'
        - '*DuplicateTokenEx*'
        - '*EnumerateSecurityPackages*'
        - '*FreeHGlobal*'
        - '*FreeLibrary*'
        - '*GetDelegateForFunctionPointer*'
        - '*GetLogonSessionData*'
        - '*GetModuleHandle*'
        - '*GetProcAddress*'
        - '*GetProcessHandle*'
        - '*GetTokenInformation*'
        - '*ImpersonateLoggedOnUser*'
        - '*kernel32*'
        - '*LoadLibrary*'
        - '*memcpy*'
        - '*MiniDumpWriteDump*'
        - '*ntdll*'
        - '*OpenDesktop*'
        - '*OpenProcess*'
        - '*OpenProcessToken*'
        - '*OpenThreadToken*'
        - '*OpenWindowStation*'
        - '*PtrToString*'
        - '*QueueUserApc*'
        - '*ReadProcessMemory*'
        - '*RevertToSelf*'
        - '*RtlCreateUserThread*'
        - '*secur32*'
        - '*SetThreadToken*'
        - '*VirtualAlloc*'
        - '*VirtualFree*'
        - '*VirtualProtect*'
        - '*WaitForSingleObject*'
        - '*WriteInt32*'
        - '*WriteProcessMemory*'
        - '*ZeroFreeGlobalAllocUnicode*'
    SELECTION_4:
        NewProcessName: '*\MpCmdRun.exe'
    SELECTION_5:
        CommandLine: '*GetLoadLibraryWAddress32*'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4
        and SELECTION_5)))
falsepositives:
- Unknown
id: ba3f5c1b-6272-4119-9dbd-0bc8d21c2702
level: high
logsource:
    category: process_creation
    product: windows
modified: 2023/01/09
references:
- https://twitter.com/m417z/status/1566674631788007425
related:
-   id: 03d83090-8cba-44a0-b02f-0b756a050306
    type: derived
status: experimental
tags:
- attack.execution
- attack.t1106

