title: Suspicious Shells Spawned by Java
ruletype: Sigma
author: Andreas Hunkeler (@Karneades), Florian Roth
date: 2021/12/17
description: Detects suspicious shell spawned from Java host process (e.g. log4j exploitation)
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\java.exe'
    SELECTION_4:
        NewProcessName:
        - '*\sh.exe'
        - '*\bash.exe'
        - '*\powershell.exe'
        - '*\pwsh.exe'
        - '*\schtasks.exe'
        - '*\certutil.exe'
        - '*\whoami.exe'
        - '*\bitsadmin.exe'
        - '*\wscript.exe'
        - '*\cscript.exe'
        - '*\scrcons.exe'
        - '*\regsvr32.exe'
        - '*\hh.exe'
        - '*\wmic.exe'
        - '*\mshta.exe'
        - '*\rundll32.exe'
        - '*\forfiles.exe'
        - '*\scriptrunner.exe'
        - '*\mftrace.exe'
        - '*\AppVLP.exe'
        - '*\curl.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
level: high
logsource:
    category: process_creation
    product: windows
modified: 2022/08/02
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation

