title: Python Inline Command Execution
id: 899133d5-4d7c-4a7f-94ee-27355c879d90
status: test
description: Detects execution of python using the "-c" flag. This is could be used as a way to launch a reverse shell or execute live python code.
references:
    - https://docs.python.org/3/using/cmdline.html#cmdoption-c
    - https://www.revshells.com/
    - https://pentestmonkey.net/cheat-sheet/shells/reverse-shell-cheat-sheet
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/02
modified: 2023/02/17
tags:
    - attack.execution
    - attack.t1059
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_img:
        - OriginalFileName: python.exe
        - NewProcessName|endswith:
              - python.exe   # no \ bc of e.g. ipython.exe
              - python3.exe
              - python2.exe
    selection_cli:
        CommandLine|contains: ' -c'
    filter_python: # Based on baseline
        ParentCommandLine|contains: -E -s -m ensurepip -U --default-pip
        ParentProcessName|startswith: C:\Program Files\Python
        ParentProcessName|endswith: \python.exe
    filter_vscode:
        ParentProcessName|endswith: \AppData\Local\Programs\Microsoft VS Code\Code.exe
    condition: process_creation and (all of selection_* and not 1 of filter_*)
falsepositives:
    - Python libraries that use a flag starting with "-c". Filter according to your environment
level: medium
ruletype: Sigma
