title: Start Windows Service Via Net.EXE
ruletype: Sigma
author: Timur Zinniatullin, Daniil Yugoslavskiy, oscd.community
date: 2019/10/21
description: Detects the usage of the "net.exe" command to start a service using the
    "start" flag
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\net.exe'
        - '*\net1.exe'
    SELECTION_4:
        OriginalFileName:
        - net.exe
        - net1.exe
    SELECTION_5:
        CommandLine: '* start *'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        SELECTION_5)
falsepositives:
- Legitimate administrator or user executes a service for legitimate reasons.
id: 2a072a96-a086-49fa-bcb5-15cc5a619093
level: low
logsource:
    category: process_creation
    product: windows
modified: 2023/03/05
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1569.002/T1569.002.md
status: test
tags:
- attack.execution
- attack.t1569.002

