title: MSHTA Spwaned by SVCHOST
ruletype: Sigma
author: Markus Neis
date: 2018/06/07
description: Detects MSHTA.EXE spwaned by SVCHOST as seen in LethalHTA and described
    in report
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        ParentProcessName: '*\svchost.exe'
    SELECTION_4:
        NewProcessName: '*\mshta.exe'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: ed5d72a6-f8f4-479d-ba79-02f6a80d7471
level: high
logsource:
    category: process_creation
    product: windows
modified: 2021/11/27
references:
- https://codewhitesec.blogspot.com/2018/07/lethalhta.html
status: test
tags:
- attack.defense_evasion
- attack.t1218.005

