title: PCHunter Execution
ruletype: Sigma
author: Nasreddine Bencherchali
date: 2022/10/05
description: Detects the execution PCHunter based on image and Original File Name
    fields.
detection:
    SELECTION_1:
        EventID: 4688
    SELECTION_2:
        Channel: Security
    SELECTION_3:
        NewProcessName:
        - '*\PCHunter32.exe'
        - '*\PCHunter64.exe'
    SELECTION_4:
        OriginalFileName: PCHunter.exe
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Unlikely
id: df5daa7b-c2d5-4a4d-972b-5f85febe56bc
level: high
logsource:
    category: process_creation
    product: windows
references:
- http://www.xuetr.com/
- https://www.hexacorn.com/blog/2018/04/20/kernel-hacking-tool-you-might-have-never-heard-of-xuetr-pchunter/
status: experimental
tags:
- attack.defense_evasion

