
title: Suspicious Execution of InstallUtil Without Log
ruletype: Sigma
author: frack113
date: 2022/01/23
description: Uses the .NET InstallUtil.exe application in order to execute image without
  log
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\InstallUtil.exe'
  SELECTION_4:
    NewProcessName: '*Microsoft.NET\Framework*'
  SELECTION_5:
    CommandLine: '*/logfile= *'
  SELECTION_6:
    CommandLine: '*/LogToConsole=false*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: d042284c-a296-4988-9be5-f424fadcc28c
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/04
references:
- https://securelist.com/moonbounce-the-dark-side-of-uefi-firmware/105468/
- https://docs.microsoft.com/en-us/dotnet/framework/tools/installutil-exe-installer-tool
status: experimental
tags:
- attack.defense_evasion
