
title: Raw Disk Access Using Illegitimate Tools
ruletype: Sigma
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Raw disk access using illegitimate tools, possible defence evasion
detection:
  SELECTION_1:
    EventID: 9
  SELECTION_2:
    Device: '*floppy*'
  SELECTION_3:
    Image:
    - C:\Windows\System32\\*
    - C:\Windows\SystemApps\\*
  SELECTION_4:
    Image:
    - '*\wmiprvse.exe'
    - '*\sdiagnhost.exe'
    - '*\searchindexer.exe'
    - '*\csrss.exe'
    - '*\defrag.exe'
    - '*\smss.exe'
    - '*\vssvc.exe'
    - '*\compattelrunner.exe'
    - '*\wininit.exe'
    - '*\autochk.exe'
    - '*\taskhost.exe'
    - '*\dfsrs.exe'
    - '*\vds.exe'
    - '*\lsass.exe'
    - '*\svchost.exe'
    - '*\MsMpEng.exe'
    - '*\SearchApp.exe'
    - '*C:\Windows\System32\taskhostw.exe'
    - '*C:\Windows\System32\SrTasks.exe'
    - '*C:\Windows\System32\dllhost.exe'
    - '*C:\Windows\System32\DeviceCensus.exe'
  SELECTION_5:
    ProcessId: 4
  SELECTION_6:
    Image:
    - C:\Program Files\Bitdefender Antivirus Free\updatesrv.exe
    - C:\Program Files\Bitdefender Antivirus Free\downloader.exe
    - C:\Program Files\Bitdefender Antivirus Free\vsserv.exe
    - C:\Windows\System32\backgroundTaskHost.exe
    - C:\Windows\System32\RuntimeBroker.exe
    - C:\Windows\System32\MoUsoCoreWorker.exe
  SELECTION_7:
    Image: '*\Keybase\upd.exe'
  condition: (SELECTION_1 and  not ((SELECTION_2) or (SELECTION_3 and SELECTION_4)
    or (SELECTION_5) or (SELECTION_6) or (SELECTION_7)))
falsepositives:
- Legitimate Administrator using tool for raw access or ongoing forensic investigation
fields:
- ComputerName
- Image
- ProcessID
- Device
id: db809f10-56ce-4420-8c86-d6a7d793c79c
level: medium
logsource:
  category: raw_access_thread
  product: windows
modified: 2021/12/22
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: experimental
tags:
- attack.defense_evasion
- attack.t1006
