
title: Raw Disk Access Using Illegitimate Tools
author: Teymur Kheirkhabarov, oscd.community
date: 2019/10/22
description: Raw disk access using illegitimate tools, possible defence evasion
detection:
  SELECTION_1:
    Device: '*floppy*'
  SELECTION_10:
    Image: '*C:\Users\\*'
  SELECTION_11:
    Image: '*\AppData\\*'
  SELECTION_12:
    Image: '*\Microsoft\\*'
  SELECTION_13:
    Image: C:\Windows\SystemApps\Microsoft.Windows.StartMenuExperienceHost*
  SELECTION_14:
    Image: '*\StartMenuExperienceHost.exe'
  SELECTION_2:
    Image:
    - C:\Windows\System32\\*
    - C:\Windows\SystemApps\\*
    - C:\Windows\WinSxS\\*
    - C:\Windows\servicing\\*
    - C:\Windows\CCM\\*
    - C:\Windows\uus\\*
    - C:\Windows\WinSxs\\*
  SELECTION_3:
    ProcessId: 4
  SELECTION_4:
    Image:
    - C:\Windows\UUS\amd64\MoUsoCoreWorker.exe
    - C:\Windows\explorer.exe
  SELECTION_5:
    Image:
    - System
    - Registry
  SELECTION_6:
    Image: '*\Keybase\upd.exe'
  SELECTION_7:
    Image: C:\ProgramData\Microsoft\Windows Defender\Platform\\*
  SELECTION_8:
    Image: '*\MsMpEng.exe'
  SELECTION_9:
    Image:
    - C:\Program Files\\*
    - C:\Program Files (x86)\\*
  condition: ' not ((SELECTION_1) or (SELECTION_2) or (SELECTION_3) or (SELECTION_4)
    or (SELECTION_5) or (SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9)
    or (SELECTION_10 and SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14))'
falsepositives:
- Legitimate Administrator using tool for raw access or ongoing forensic investigation
fields:
- ComputerName
- Image
- ProcessID
- Device
id: db809f10-56ce-4420-8c86-d6a7d793c79c
level: low
logsource:
  category: raw_access_thread
  product: windows
modified: 2022/02/21
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
status: test
tags:
- attack.defense_evasion
- attack.t1006
