title: Leviathan Registry Key Activity
id: 09b9f622-28c3-d403-0447-f3858c57995e
related:
    - id: 70d43542-cd2d-483c-8f30-f16b436fd7db
      type: derived
status: test
description: Detects registry key used by Leviathan APT in Malaysian focused campaign
references:
    - https://www.elastic.co/blog/advanced-techniques-used-in-malaysian-focused-apt-campaign
author: Aidan Bracher
date: 2020-07-07
modified: 2023-09-19
tags:
    - attack.privilege-escalation
    - attack.persistence
    - attack.t1547.001
    - detection.emerging-threats
logsource:
    category: registry_event
    product: windows
detection:
    registry_event:
        EventID: 4657
        Channel: Security
    selection:
        ObjectName|contains: \Software\Microsoft\Windows\CurrentVersion\Run\ntkd
    condition: registry_event and selection
level: critical
ruletype: Sigma
