title: Communication To LocaltoNet Tunneling Service Initiated
id: 7077ede2-92d3-1e30-78f3-ca6d35c31825
related:
    - id: 3ab65069-d82a-4d44-a759-466661a082d1
      type: derived
status: test
description: |
    Detects an executable initiating a network connection to "LocaltoNet" tunneling sub-domains.
    LocaltoNet is a reverse proxy that enables localhost services to be exposed to the Internet.
    Attackers have been seen to use this service for command-and-control activities to bypass MFA and perimeter controls.
references:
    - https://localtonet.com/documents/supported-tunnels
    - https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
author: Andreas Braathen (mnemonic.io)
date: '2024-06-17'
tags:
    - attack.command-and-control
    - attack.t1572
    - attack.t1090
    - attack.t1102
    - sysmon
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        DestinationHostname|endswith:
            - .localto.net
            - .localtonet.com
        Initiated: 'true'
    condition: network_connection and selection
falsepositives:
    - Legitimate use of the LocaltoNet service.
level: high
ruletype: Sigma
