title: PowerShell Network Connections
id: 1f21ec3f-810d-4b0e-8045-322202e22b4b
status: experimental
description: Detects a Powershell process that opens network connections - check for
    suspicious target ports and target systems - adjust to your environment (e.g.
    extend filters with company's ip range')
references:
    - https://www.youtube.com/watch?v=DLtJTxMWZ2o
author: Florian Roth (Nextron Systems)
date: 2017/03/13
modified: 2023/01/20
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith:
            - \powershell.exe
            - \pwsh.exe
        Initiated: 'true'
        DestinationIsIpv6: 'false'
    filter_internal_ip:
        DestinationIp|startswith:
            - '10.'
            - 192.168.
            - 172.16.
            - 172.17.
            - 172.18.
            - 172.19.
            - 172.20.
            - 172.21.
            - 172.22.
            - 172.23.
            - 172.24.
            - 172.25.
            - 172.26.
            - 172.27.
            - 172.28.
            - 172.29.
            - 172.30.
            - 172.31.
            - 127.0.0.1
        User|contains:
            - AUTHORI
            - AUTORI
    filter_ipv6:
        DestinationIp|startswith:
            - ::1
            - 0:0:0:0:0:0:0:1
            - 'fe80:'
            - fc
            - fd
    filter_msrange:
        DestinationIp|startswith:
            - 20.184.
            - 20.185.
            - 20.186.
            - 20.187.
            - 20.188.
            - 20.189.
            - 20.190.
            - 20.191.
            - 23.79.
            - 51.10.
            - 51.103.
            - 51.104.
            - 51.105.
            - 52.239.
    condition: network_connection and (selection and not 1 of filter_*)
falsepositives:
    - Administrative scripts
    - Microsoft IP range
level: low
ruletype: Sigma
