title: RDP Over Reverse SSH Tunnel
id: 5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4
status: test
description: Detects svchost hosting RDP termsvcs communicating with the loopback address and on TCP port 3389
references:
    - https://twitter.com/cyb3rops/status/1096842275437625346
author: Samir Bousseaden
date: 2019/02/16
modified: 2022/10/09
tags:
    - attack.command_and_control
    - attack.t1572
    - attack.lateral_movement
    - attack.t1021.001
    - car.2013-07-002
    - sysmon
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection_img:
        Image|endswith: \svchost.exe
        Initiated: 'true'
        SourcePort: 3389
    selection_destination:
        - DestinationIp|startswith: '127.'
        - DestinationIp: ::1
    condition: network_connection and (all of selection_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
