title: Script Initiated Connection to Non-Local Network
ruletype: Sigma
author: frack113, Florian Roth
date: 2022/08/28
description: Detects a script interpreter wscript/cscript opening a network connection
    to a non-local network. Adversaries may use script to download malicious payloads.
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        Image:
        - '*\wscript.exe'
        - '*\cscript.exe'
    SELECTION_5:
        DestinationIp:
        - 127.*
        - 10.*
        - 172.*
        - 192.*
        - 169.254.*
        - 20.*
    SELECTION_6:
        DestinationIp:
        - ::1*
        - 0:0:0:0:0:0:0:1*
        - fe80:*
        - fc*
        - fd*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6)))
falsepositives:
- Legitimate scripts
id: 992a6cae-db6a-43c8-9cec-76d7195c96fc
level: high
logsource:
    category: network_connection
    product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
status: experimental
tags:
- attack.command_and_control
- attack.t1105

