title: Cmstp Making Network Connection
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/30
description: Detects suspicious network connection by Cmstp
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\cmstp.exe'
    SELECTION_4:
        Initiated: 'true'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: efafe0bf-4238-479e-af8f-797bd3490d2d
level: high
logsource:
    category: network_connection
    product: windows
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.003

