title: Network Connection Initiated To BTunnels Domains
id: b1b10bb8-c8f4-6c98-3427-b50b4fe61b19
related:
    - id: 9e02c8ec-02b9-43e8-81eb-34a475ba7965
      type: derived
status: test
description: |
    Detects network connections to BTunnels domains initiated by a process on the system.
    Attackers can abuse that feature to establish a reverse shell or persistence on a machine.
references:
    - https://defr0ggy.github.io/research/Utilizing-BTunnel-For-Data-Exfiltration/
author: Kamran Saifullah
date: '2024-09-13'
tags:
    - attack.exfiltration
    - attack.command-and-control
    - attack.t1567
    - attack.t1572
    - sysmon
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Initiated: 'true'
        DestinationHostname|endswith: .btunnel.co.in
    condition: network_connection and selection
falsepositives:
    - Legitimate use of BTunnels will also trigger this.
level: medium
ruletype: Sigma
