title: Communication To Ngrok Tunneling Service
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2022/11/03
description: Detects an executable accessing an ngrok tunneling endpoint, which could
    be a sign of forbidden exfiltration of data exfiltration by malicious actors
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        DestinationHostname:
        - '*tunnel.us.ngrok.com*'
        - '*tunnel.eu.ngrok.com*'
        - '*tunnel.ap.ngrok.com*'
        - '*tunnel.au.ngrok.com*'
        - '*tunnel.sa.ngrok.com*'
        - '*tunnel.jp.ngrok.com*'
        - '*tunnel.in.ngrok.com*'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate use of ngrok
id: 1d08ac94-400d-4469-a82f-daee9a908849
level: high
logsource:
    category: network_connection
    product: windows
references:
- https://twitter.com/hakluke/status/1587733971814977537/photo/1
- https://ngrok.com/docs/secure-tunnels/tunnels/ssh-reverse-tunnel-agent
status: experimental
tags:
- attack.exfiltration
- attack.command_and_control
- attack.t1567
- attack.t1568.002
- attack.t1572
- attack.t1090
- attack.t1102
- attack.s0508

