title: Microsoft Binary Suspicious Communication Endpoint
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2018/08/30
description: Detects an executable in the Windows folder accessing suspicious domains
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        DestinationHostname:
        - '*dl.dropboxusercontent.com'
        - '*.pastebin.com'
        - '*.githubusercontent.com'
        - '*cdn.discordapp.com/attachments/'
        - '*mediafire.com'
        - '*mega.nz'
        - '*ddns.net'
        - '*.paste.ee'
        - '*.hastebin.com/raw/'
        - '*.ghostbin.co/'
        - '*ufile.io'
        - '*anonfiles.com'
        - '*send.exploit.in'
        - '*transfer.sh'
        - '*privatlab.net'
        - '*privatlab.com'
        - '*sendspace.com'
        - '*pastetext.net'
        - '*pastebin.pl'
        - '*paste.ee'
    SELECTION_5:
        Image:
        - C:\Windows\\*
        - C:\Users\Public\\*
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: e0f8ab85-0ac9-423b-a73a-81b3c7b1aa97
level: high
logsource:
    category: network_connection
    product: windows
modified: 2023/01/19
references:
- https://twitter.com/M_haggis/status/900741347035889665
- https://twitter.com/M_haggis/status/1032799638213066752
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
status: test
tags:
- attack.lateral_movement
- attack.t1105

