title: HH.EXE Network Connections
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/05
description: Detects network connections made by the "hh.exe" process, which could
    indicate the execution/download of remotely hosted .chm files
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\hh.exe'
    SELECTION_4:
        Initiated: 'true'
    SELECTION_5:
        DestinationPort: 80
    SELECTION_6:
        DestinationPort: 443
    SELECTION_7:
        DestinationPort: 135
    SELECTION_8:
        DestinationPort: 445
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and (SELECTION_5
        or SELECTION_6 or SELECTION_7 or SELECTION_8))
falsepositives:
- Unknown
id: 468a8cea-2920-4909-a593-0cbe1d96674a
level: medium
logsource:
    category: network_connection
    product: windows
references:
- https://www.splunk.com/en_us/blog/security/follina-for-protocol-handlers.html
- https://github.com/redcanaryco/atomic-red-team/blob/1cf4dd51f83dcb0ebe6ade902d6157ad2dbc6ac8/atomics/T1218.001/T1218.001.md
related:
-   id: f57c58b3-ee69-4ef5-9041-455bf39aaa89
    type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.001

