title: Suspicious Non-Browser Network Communication With Reddit API
ruletype: Sigma
author: Gavin Knapp
date: 2023/02/16
description: Detects an a non-browser process interacting with the Reddit API which
    could indicate use of a covert C2 such as RedditC2
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_10:
        Image: '*\WindowsApps\MicrosoftEdge.exe'
    SELECTION_11:
        Image:
        - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
        - C:\Program Files\Microsoft\Edge\Application\msedge.exe
    SELECTION_12:
        Image:
        - C:\Program Files (x86)\Microsoft\EdgeCore\\*
        - C:\Program Files\Microsoft\EdgeCore\\*
    SELECTION_13:
        Image:
        - '*\msedge.exe'
        - '*\msedgewebview2.exe'
    SELECTION_14:
        Image: '*\opera.exe'
    SELECTION_15:
        Image: '*\safari.exe'
    SELECTION_16:
        Image: '*\seamonkey.exe'
    SELECTION_17:
        Image: '*\vivaldi.exe'
    SELECTION_18:
        Image: '*\whale.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        DestinationHostname: '*reddit.com*'
    SELECTION_4:
        Image: '*\brave.exe'
    SELECTION_5:
        Image:
        - C:\Program Files\Google\Chrome\Application\chrome.exe
        - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
    SELECTION_6:
        Image:
        - C:\Program Files\Mozilla Firefox\firefox.exe
        - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    SELECTION_7:
        Image:
        - C:\Program Files (x86)\Internet Explorer\iexplore.exe
        - C:\Program Files\Internet Explorer\iexplore.exe
    SELECTION_8:
        Image: '*\maxthon.exe'
    SELECTION_9:
        Image: C:\Program Files (x86)\Microsoft\EdgeWebView\Application\\*
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8) or (SELECTION_9
        or SELECTION_10 or SELECTION_11) or (SELECTION_12 and SELECTION_13) or (SELECTION_14)
        or (SELECTION_15) or (SELECTION_16) or (SELECTION_17) or (SELECTION_18)))
falsepositives:
- Legitimate applications communicating with the Reddit API e.g. web browsers not
    in the exclusion list, app with an RSS  etc.
id: d7b09985-95a3-44be-8450-b6eadf49833e
level: medium
logsource:
    category: network_connection
    product: windows
modified: 2023/04/18
references:
- https://github.com/kleiton0x00/RedditC2
- https://twitter.com/kleiton0x7e/status/1600567316810551296
- https://www.linkedin.com/posts/kleiton-kurti_github-kleiton0x00redditc2-abusing-reddit-activity-7009939662462984192-5DbI/?originalSubdomain=al
status: experimental
tags:
- attack.command_and_control
- attack.t1102

