title: Communication To Ngrok.Io
ruletype: Sigma
author: Florian Roth
date: 2022/07/16
description: Detects an executable accessing ngrok.io, which could be a sign of forbidden
    exfiltration of data exfiltration by malicious actors
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        DestinationHostname: '*.ngrok.io'
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use of ngrok.io
id: 18249279-932f-45e2-b37a-8925f2597670
level: high
logsource:
    category: network_connection
    product: windows
references:
- https://ngrok.com/
- https://www.virustotal.com/gui/file/cca0c1182ac114b44dc52dd2058fcd38611c20bb6b5ad84710681d38212f835a/
status: experimental
tags:
- attack.exfiltration
- attack.t1567.001
yml_filename: net_connection_win_ngrok_io.yml
yml_path: rules/windows/network_connection
---

