title: Dead Drop Resolvers
ruletype: Sigma
author: Sorina Ionescu
date: 2022/08/17
description: Detects an executable, which is not an internet browser, making DNS request
    to legit popular websites, which were seen to be used as dead drop resolvers in
    previous attacks.
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        DestinationHostname:
        - '*cdn.discordapp.com'
        - '*pastebin.com'
        - '*youtube.com'
        - '*technet.microsoft.com'
        - '*facebook.com'
        - '*.cloudflare.com'
        - '*docs.google.com'
        - '*steamcommunity.com'
        - '*reddit.com'
        - '*fotolog.com'
        - '*twitter.com'
        - '*imgur.com'
        - '*feeds.rapidfeeds.com'
        - '*livejournal.com'
        - '*.githubusercontent.com'
        - '*pastetext.net'
        - '*pastebin.pl'
        - '*paste.ee'
    SELECTION_5:
        Image:
        - '*\iexplore.exe'
        - '*\msedge.exe'
        - '*\edge.exe'
        - '*\opera.exe'
        - '*\brave.exe'
        - '*\vivaldi.exe'
        - '*\whale.exe'
        - '*\chrome.exe'
        - '*\firefox.exe'
    SELECTION_6:
        Image:
        - '*\MsMpEng.exe'
        - '*\MsSense.exe'
        - '*\PRTG Probe.exe'
        - '*\Engine.exe'
        - '*\msedgewebview2.exe'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5) or (SELECTION_6)))
falsepositives:
- One might need to exclude other internet browsers found in it's network or other
    applications like ones mentioned above from Microsoft Defender.
id: 297ae038-edc2-4b2e-bb3e-7c5fc94dd5c7
level: high
logsource:
    category: network_connection
    product: windows
modified: 2023/01/19
references:
- https://content.fireeye.com/apt-41/rpt-apt41
- https://securelist.com/the-tetrade-brazilian-banking-malware/97779/
- https://blog.bushidotoken.net/2021/04/dead-drop-resolvers-espionage-inspired.html
status: test
tags:
- attack.command_and_control
- attack.t1102
- attack.t1102.001

