title: Python Initiated Connection
id: bef0bc5a-b9ae-425d-85c6-7b2d705980c6
status: experimental
description: Detects a Python process initiating a network connection. While this
    often relates to package installation, it can also indicate a potential malicious
    script communicating with a C&C server.
references:
    - https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1046/T1046.md#atomic-test-4---port-scan-using-python
    - https://pypi.org/project/scapy/
author: frack113
date: 2021/12/10
modified: 2023/09/07
tags:
    - attack.discovery
    - attack.t1046
    - sysmon
logsource:
    category: network_connection
    product: windows
detection:
    network_connection:
        EventID: 3
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Initiated: 'true'
        Image|contains: python
    filter_optional_conda:
        ParentImage: C:\ProgramData\Anaconda3\Scripts\conda.exe
        CommandLine|contains|all:
            - :\ProgramData\Anaconda3\Scripts\conda-script.py
            - update
    filter_optional_conda_jupyter_notebook:
        ParentImage: C:\ProgramData\Anaconda3\python.exe
        CommandLine|contains: C:\ProgramData\Anaconda3\Scripts\jupyter-notebook-script.py
    filter_main_local_communication:
        DestinationIp: 127.0.0.1
        SourceIp: 127.0.0.1
    condition: network_connection and (selection and not 1 of filter_main_* and not
        1 of filter_optional_*)
falsepositives:
    - Legitimate python script
level: medium
ruletype: Sigma
