title: Certutil Initiated Connection
ruletype: Sigma
author: frack113, Florian Roth
date: 2022/09/02
description: Detects a network connection intitiated by the certutil.exe tool. Attackers
    can abuse `certutil.exe` to download malware or offensive security tools.
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\certutil.exe'
    SELECTION_4:
        OriginalFilename: CertUtil.exe
    SELECTION_5:
        Initiated: 'true'
    SELECTION_6:
        DestinationPort: 80
    SELECTION_7:
        DestinationPort: 443
    SELECTION_8:
        DestinationPort: 135
    SELECTION_9:
        DestinationPort: 445
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and
        (SELECTION_5 and (SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9)))
falsepositives:
- Legitimate certutil network connection
id: 0dba975d-a193-4ed1-a067-424df57570d1
level: high
logsource:
    category: network_connection
    product: windows
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
status: experimental
tags:
- attack.command_and_control
- attack.t1105

