title: Outbound Network Connection To Public IP Via Winlogon
ruletype: Sigma
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: 2023/04/28
description: Detects a "winlogon.exe" process that initiate network communications
    with public IP addresses
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\winlogon.exe'
    SELECTION_4:
        Initiated: 'true'
    SELECTION_5:
        DestinationIp:
        - 10.*
        - 127.*
        - 172.16.*
        - 172.17.*
        - 172.18.*
        - 172.19.*
        - 172.20.*
        - 172.21.*
        - 172.22.*
        - 172.23.*
        - 172.24.*
        - 172.25.*
        - 172.26.*
        - 172.27.*
        - 172.28.*
        - 172.29.*
        - 172.30.*
        - 172.31.*
        - 192.168.*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
        ((SELECTION_5)))
falsepositives:
- Communication to other corporate systems that use IP addresses from public address
    spaces
id: 7610a4ea-c06d-495f-a2ac-0a696abcfd3b
level: medium
logsource:
    category: network_connection
    product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.command_and_control
- attack.t1218.011

