title: Suspicious Network Connection Binary No CommandLine
ruletype: Sigma
author: Florian Roth
date: 2022/07/03
description: Detects suspicious network connections made by a well-known Windows binary
    run with no command line parameters
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Initiated: 'true'
    SELECTION_4:
        Image:
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\dllhost.exe'
    SELECTION_5:
        CommandLine:
        - '*\regsvr32.exe'
        - '*\rundll32.exe'
        - '*\dllhost.exe'
    SELECTION_6:
        CommandLine: ''
    SELECTION_7:
        CommandLine|re: ^$
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and
        SELECTION_5) and  not ((SELECTION_6) or (SELECTION_7)))
falsepositives:
- Unknown
id: 20384606-a124-4fec-acbb-8bd373728613
level: high
logsource:
    category: network_connection
    product: windows
references:
- https://redcanary.com/blog/raspberry-robin/
status: experimental
tags:
- attack.defense_evasion

