
title: RDP to HTTP or HTTPS Target Ports
ruletype: Sigma
author: Florian Roth
date: 2022/04/29
description: Detects svchost hosting RDP termsvcs communicating to target systems
  on TCP port 80 or 443
detection:
  SELECTION_1:
    EventID: 3
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    Image: '*\svchost.exe'
  SELECTION_4:
    Initiated: 'true'
  SELECTION_5:
    SourcePort: 3389
  SELECTION_6:
    TargetPort: 80
  SELECTION_7:
    TargetPort: 443
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and (SELECTION_6 or SELECTION_7))
falsepositives:
- Unknown
id: b1e5da3b-ca8e-4adf-915c-9921f3d85481
level: high
logsource:
  category: network_connection
  product: windows
references:
- https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
- https://www.mandiant.com/resources/bypassing-network-restrictions-through-rdp-tunneling
status: experimental
tags:
- attack.command_and_control
- attack.t1572
- attack.lateral_movement
- attack.t1021.001
- car.2013-07-002
