title: Wuauclt Network Connection
ruletype: Sigma
author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/10/12
description: 'Detects the use of the Windows Update Client binary (wuauclt.exe) to
    proxy execute code and making a network connections.

    One could easily make the DLL spawn a new process and inject to it to proxy the
    network connection and bypass this rule.

    '
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*wuauclt*'
    SELECTION_4:
        DestinationIp: 51.10*
    SELECTION_5:
        CommandLine: '*\UpdateDeploy.dll /ClassId *'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5)))
falsepositives:
- Legitimate use of wuauclt.exe over the network.
id: c649a6c7-cd8c-4a78-9c04-000fc76df954
level: medium
logsource:
    category: network_connection
    product: windows
modified: 2022/12/15
references:
- https://dtm.uk/wuauclt/
status: test
tags:
- attack.defense_evasion
- attack.t1218

