title: Suspicious Program Location with Network Connections
ruletype: Sigma
author: Florian Roth, Tim Shelton
date: 2017/03/19
description: Detects programs with network connections running in suspicious files
    system locations
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image:
        - '*\Users\All Users\\*'
        - '*\Users\Default\\*'
        - '*\Users\Public\\*'
        - '*\Users\Contacts\\*'
        - '*\Users\Searches\\*'
        - '*\config\systemprofile\\*'
        - '*\Windows\Fonts\\*'
        - '*\Windows\IME\\*'
        - '*\Windows\addins\\*'
    SELECTION_4:
        Image:
        - '*\$Recycle.bin'
    SELECTION_5:
        Image:
        - C:\Perflogs\\*
    SELECTION_6:
        Image: C:\Users\Public\IBM\ClientSolutions\Start_Programs\\*
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5)
        and  not ((SELECTION_6)))
falsepositives:
- Unknown
id: 7b434893-c57d-4f41-908d-6a17bf1ae98f
level: high
logsource:
    category: network_connection
    definition: Use the following config to generate the necessary Event ID 3 Network
        Connection events
    product: windows
modified: 2022/05/26
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
status: test
tags:
- attack.command_and_control
- attack.t1105

