title: Potentially Suspicious Network Connection To Notion API
ruletype: Sigma
author: Gavin Knapp
date: 2023/05/03
description: Detects a non-browser process communicating with the Notion API. This
    could indicate potential use of a covert C2 channel such as "OffensiveNotion C2"
detection:
    SELECTION_1:
        EventID: 3
    SELECTION_10:
        Image: C:\Program Files (x86)\Microsoft\EdgeWebView\Application\\*
    SELECTION_11:
        Image: '*\WindowsApps\MicrosoftEdge.exe'
    SELECTION_12:
        Image:
        - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe
        - C:\Program Files\Microsoft\Edge\Application\msedge.exe
    SELECTION_13:
        Image:
        - C:\Program Files (x86)\Microsoft\EdgeCore\\*
        - C:\Program Files\Microsoft\EdgeCore\\*
    SELECTION_14:
        Image:
        - '*\msedge.exe'
        - '*\msedgewebview2.exe'
    SELECTION_15:
        Image: '*\opera.exe'
    SELECTION_16:
        Image: '*\safari.exe'
    SELECTION_17:
        Image: '*\seamonkey.exe'
    SELECTION_18:
        Image: '*\vivaldi.exe'
    SELECTION_19:
        Image: '*\whale.exe'
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        DestinationHostname: '*api.notion.com*'
    SELECTION_4:
        Image: '*\AppData\Local\Programs\Notion\Notion.exe'
    SELECTION_5:
        Image: '*\brave.exe'
    SELECTION_6:
        Image:
        - C:\Program Files\Google\Chrome\Application\chrome.exe
        - C:\Program Files (x86)\Google\Chrome\Application\chrome.exe
    SELECTION_7:
        Image:
        - C:\Program Files\Mozilla Firefox\firefox.exe
        - C:\Program Files (x86)\Mozilla Firefox\firefox.exe
    SELECTION_8:
        Image:
        - C:\Program Files (x86)\Internet Explorer\iexplore.exe
        - C:\Program Files\Internet Explorer\iexplore.exe
    SELECTION_9:
        Image: '*\maxthon.exe'
    condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)
        or (SELECTION_5) or (SELECTION_6) or (SELECTION_7) or (SELECTION_8) or (SELECTION_9)
        or (SELECTION_10 or SELECTION_11 or SELECTION_12) or (SELECTION_13 and SELECTION_14)
        or (SELECTION_15) or (SELECTION_16) or (SELECTION_17) or (SELECTION_18) or
        (SELECTION_19)))
falsepositives:
- Legitimate applications communicating with the "api.notion.com" endpoint that are
    not already in the exclusion list. The desktop and browser applications do not
    appear to be using the API by default unless integrations are configured.
id: 7e9cf7b6-e827-11ed-a05b-15959c120003
level: low
logsource:
    category: network_connection
    product: windows
references:
- https://github.com/mttaggart/OffensiveNotion
- https://medium.com/@huskyhacks.mk/we-put-a-c2-in-your-notetaking-app-offensivenotion-3e933bace332
status: experimental
tags:
- attack.command_and_control
- attack.t1102

