author: Zach Mathis
date: 2020/11/08
modified: 2022/03/22

title: Logon Type 9 - NewCredentials
title_jp: ログオンタイプ 9 - 新しい資格情報
details: 'User: %TargetUserName% | Computer: %WorkstationName% | IP Addr: %IpAddress% | LID: %TargetLogonId% | (Warning: Credentials are stored in memory)'
details_jp: 'ユーザ: %TargetUserName% | 端末: %WorkstationName% | IPアドレス: %IpAddress% | ログオンID: %TargetLogonId% | (注意: 資格情報がメモリに格納される)'
description: Prints logon information. 
description_jp: Prints logon information.

id: d80facaa-ca97-47bb-aed2-66362416eb49
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 9
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
ruletype: Hayabusa