author: Zach Mathis
date: 2020/11/08
modified: 2022/03/22

title: Logon Type 2 - Interactive
title_jp: ログオンタイプ 2 - インタラクティブ
details: 'User: %TargetUserName% | Comp: %WorkstationName% | IP Addr: %IpAddress% | LID: %TargetLogonId% | (Warning: Credentials are stored in memory)'
details_jp: 'ユーザ: %TargetUserName% | 端末: %WorkstationName% | IPアドレス: %IpAddress% | ログオンID: %TargetLogonId% | (注意: 資格情報がメモリに格納される)'
description: Prints logon information
description_jp: Prints logon information

id: 7beb4832-f357-47a4-afd8-803d69a5c85c
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 2
    filter:
        IpAddress: "-"
    condition: selection and not filter
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
ruletype: Hayabusa