author: Zach Mathis
date: 2020/11/08
modified: 2022/03/22

title: Logon Type 0 - System
title_jp: ログオンタイプ 0 - System
details: 'Bootup'
details_jp: 'システム起動'
description: Prints logon information
description_jp: Prints logon information

id: 9fa273cc-bcb2-4789-85e3-14ca253ac7f4
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4624
        LogonType: 0
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
ruletype: Hayabusa