author: Zach Mathis
date: 2020/11/08
modified: 2022/03/22

title: Logoff - User Initiated
title_jp: ログオフ - ユーザが行った
details: 'User: %TargetUserName% | LID: %TargetLogonId%'
details_jp: 'ユーザ: %TargetUserName% | ログオンID: %TargetLogonId%'
description: Prints logon information. 
description_jp: Prints logon information.

id: 6bad16f1-02c4-4075-b414-3cd16944bc65
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4647
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
ruletype: Hayabusa
