author: Zach Mathis
date: 2020/11/08
modified: 2022/05/21

title: Admin Logon
details: 'User: %SubjectUserName% | LID: %SubjectLogonId%'
description: Prints logon information. 

id: fdd0b325-8b89-469c-8b0c-e5ddfe39b62e
level: informational
status: stable
logsource:
    product: windows
    service: security
detection:
    selection:
        Channel: Security
        EventID: 4672
    filter:
        - SubjectUserName: "SYSTEM"
        - SubjectUserName: "LOCAL SERVICE"
        - SubjectUserName: "NETWORK SERVICE"
        - SubjectUserName|endswith: "$"
        - SubjectUserName: "DWM-1"
    condition: selection and not filter
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
ruletype: Hayabusa
