title: Antivirus - APT Malware Signature
id: 0b2383a0-61e7-179f-6504-7b70ef887e65
related:
    - id: 101a1877-2cf4-474d-abfd-7f6ac4788d1a
      type: derived
status: experimental
description: |
    Detects a highly relevant Antivirus alert that reports APT malware.
    This event must not be ignored just because the AV has blocked the malware but investigate, how it came there in the first place.
references:
    - https://www.nextron-systems.com/?s=antivirus
author: Arnim Rupp (Nextron Systems)
date: 2026-06-15
tags:
    - attack.execution
    - attack.t1203
    - attack.command-and-control
    - attack.t1219.002
logsource:
    category: antivirus
    product: windows
    service: windefend
detection:
    antivirus:
        EventID:      # https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus IDs with existing 'Threat Name' or 'Path'
            - 1006
            - 1007
            - 1008
            - 1009
            - 1010
            - 1011
            - 1012
            - 1017
            - 1018
            - 1019
            - 1115
            - 1116
        Channel: Microsoft-Windows-Windows Defender/Operational
    selection:
        - ThreatName|re:
              - APT\d
              - ATK\d
              - UNC\d
              - UAC\d
        - ThreatName|contains:
              - '[APT]'
              - APT_
              - APT-
              - BackOrder
              - BlindingCan
              - Blizzard
              - Chollima
              - Cleaver
              - Cobra
              - DarkHotel
              - Dragon
              - DTrack
              - Equation
              - GiftedCrook
              - GraphSteel
              - GreyEnergy
              - GEnergy
              - GrimPlant
              - Hydra
              - Jackal
              - Kitten
              - Kimsuky
              - Lazar    # Lazarus
              - LightRail
              - Lotus
              - Luminous
              - LumiMoth
              - Nimbus
              - Manticore
              - MiniBike
              - MiniBrowse
              - MiniBus
              - MiniFast
              - MiniJuke
              - MiniUpdate
              - MuddyWater
              - NukeSped
              - OilRig
              - Panda
              - Sandstorm
              - SandWorm
              - Seamonkey
              - Sleet
              - SlugResin
              - SnailResin
              - Snake
              - Tempest
              - Tsunami
              - Turla
              - Typhoon
              - UAC_
              - UAC-
              - UNC_
              - UNC-
              - VinoSiren
              - Winnti
    condition: antivirus and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
