title: Antivirus Hacktool Detection
id: fa0c05b6-8ad3-468d-8231-c1cbccb64fba
status: stable
description: Detects a highly relevant Antivirus alert that reports a hack tool or other attack tool
references:
    - https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/
    - https://www.nextron-systems.com/?s=antivirus
author: Florian Roth (Nextron Systems), Arnim Rupp
date: 2021/08/16
modified: 2023/02/03
tags:
    - attack.execution
    - attack.t1204
logsource:
    category: antivirus
    product: windows
    service: windefend
detection:
    antivirus:
        EventID:      # https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus IDs with existing 'Threat Name' or 'Path'
            - 1006
            - 1007
            - 1008
            - 1009
            - 1010
            - 1011
            - 1012
            - 1017
            - 1018
            - 1019
            - 1115
            - 1116
        Channel: Microsoft-Windows-Windows Defender/Operational
    selection:
        - ThreatName|startswith:
              - HTOOL
              - HKTL
              - SecurityTool
              - Adfind
              - ATK/
              - Exploit.Script.CVE
              # - 'FRP.'
              - PWS.
              - PWSX
        - ThreatName|contains:
              - Hacktool
              - ATK/    # Sophos
              - Potato
              - Rozena
              - Sbelt
              - Seatbelt
              - SecurityTool
              - SharpDump
              - Sliver
              - Splinter
              - Swrort
              - Impacket
              - Koadic
              - Lazagne
              - Metasploit
              - Meterpreter
              - MeteTool
              - Mimikatz
              - Mpreter
              - Nighthawk
              - PentestPowerShell
              - PowerSploit
              - PowerSSH
              - PshlSpy
              - PSWTool
              - PWCrack
              - Brutel
              - BruteR
              - Cobalt
              - COBEACON
              - Cometer
              - DumpCreds
              - FastReverseProxy
              - PWDump
    condition: antivirus and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
