title: Antivirus Hacktool Detection
id: f3d20838-65fe-0575-52a9-fd41ce2a5fdd
related:
    - id: fa0c05b6-8ad3-468d-8231-c1cbccb64fba
      type: derived
status: stable
description: |
    Detects a highly relevant Antivirus alert that reports a hack tool or other attack tool.
    This event must not be ignored just because the AV has blocked the malware but investigate, how it came there in the first place.
references:
    - https://www.nextron-systems.com/2021/08/16/antivirus-event-analysis-cheat-sheet-v1-8-2/
    - https://www.nextron-systems.com/?s=antivirus
author: Florian Roth (Nextron Systems), Arnim Rupp
date: 2021-08-16
modified: 2024-11-02
tags:
    - attack.execution
    - attack.t1204
logsource:
    category: antivirus
    product: windows
    service: windefend
detection:
    antivirus:
        EventID:      # https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus IDs with existing 'Threat Name' or 'Path'
            - 1006
            - 1007
            - 1008
            - 1009
            - 1010
            - 1011
            - 1012
            - 1017
            - 1018
            - 1019
            - 1115
            - 1116
        Channel: Microsoft-Windows-Windows Defender/Operational
    selection:
        - ThreatName|startswith:
              - ATK/    # Sophos
              - Exploit.Script.CVE
              - HKTL
              - HTOOL
              - PWS.
              - PWSX
              - SecurityTool
              # - 'FRP.'
        - ThreatName|contains:
              - Adfind
              - Brutel
              - BruteR
              - Cobalt
              - COBEACON
              - Cometer
              - DumpCreds
              - FastReverseProxy
              - Hacktool
              - Havoc
              - Impacket
              - Keylogger
              - Koadic
              - Mimikatz
              - Nighthawk
              - PentestPowerShell
              - Potato
              - PowerSploit
              - PowerSSH
              - PshlSpy
              - PSWTool
              - PWCrack
              - PWDump
              - Rozena
              - Rusthound
              - Sbelt
              - Seatbelt
              - SecurityTool
              - SharpDump
              - SharpHound
              - Shellcode
              - Sliver
              - Snaffler
              - SOAPHound
              - Splinter
              - Swrort
              - TurtleLoader
    condition: antivirus and selection
falsepositives:
    - Unlikely
level: high
ruletype: Sigma
