title: Antivirus Password Dumper Detection
id: 78cc2dd2-7d20-4d32-93ff-057084c38b93
status: stable
description: Detects a highly relevant Antivirus alert that reports a password dumper
references:
    - https://www.nextron-systems.com/?s=antivirus
    - https://www.virustotal.com/gui/file/5fcda49ee7f202559a6cbbb34edb65c33c9a1e0bde9fa2af06a6f11b55ded619
    - https://www.virustotal.com/gui/file/a4edfbd42595d5bddb442c82a02cf0aaa10893c1bf79ea08b9ce576f82749448
author: Florian Roth (Nextron Systems)
date: 2018/09/09
modified: 2023/01/18
tags:
    - attack.credential_access
    - attack.t1003
    - attack.t1558
    - attack.t1003.001
    - attack.t1003.002
logsource:
    category: antivirus
    product: windows
    service: windefend
detection:
    antivirus:
        EventID:      # https://learn.microsoft.com/en-us/microsoft-365/security/defender-endpoint/troubleshoot-microsoft-defender-antivirus IDs with existing 'Threat Name' or 'Path'
            - 1006
            - 1007
            - 1008
            - 1009
            - 1010
            - 1011
            - 1012
            - 1017
            - 1018
            - 1019
            - 1115
            - 1116
        Channel: Microsoft-Windows-Windows Defender/Operational
    selection:
        - ThreatName|startswith: PWS
        - ThreatName|contains:
              - DumpCreds
              - Mimikatz
              - PWCrack
              - HTool/WCE
              - PSWTool
              - PWDump
              - SecurityTool
              - PShlSpy
              - Rubeus
              - Kekeo
              - LsassDump
              - Outflank
              - DumpLsass
              - SharpDump
              - PWSX
              - PWS.
    condition: antivirus and selection
falsepositives:
    - Unlikely
level: critical
ruletype: Sigma
