title: Sysinternals Tools AppX Versions Execution
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects execution of Sysinternals tools via an AppX package. Attackers
    could instal the Sysinternals Suite to get access to tools such as psexec and
    procdump to avoid detection based on System paths
detection:
    SELECTION_1:
        Channel: Microsoft-Windows-AppModel-Runtime/Admin
    SELECTION_2:
        EventID: 201
    SELECTION_3:
        ImageName:
        - procdump.exe
        - psloglist.exe
        - psexec.exe
        - livekd.exe
        - ADExplorer.exe
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Legitimate usage of the applications from the Windows Store
id: d29a20b2-be4b-4827-81f2-3d8a59eab5fc
level: medium
logsource:
    product: windows
    service: appmodel-runtime
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.execution

