title: MSMQ Corrupted Packet Encountered
ruletype: Sigma
author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/21
description: Detects corrupted packets sent to the MSMQ service. Could potentially
    be a sign of CVE-2023-21554 exploitation
detection:
    SELECTION_1:
        Channel: Application
    SELECTION_2:
        Provider_Name: MSMQ
    SELECTION_3:
        EventID: 2027
    SELECTION_4:
        Level: 2
    condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: ae94b10d-fee9-4767-82bb-439b309d5a27
level: high
logsource:
    product: windows
    service: application
references:
- https://www.randori.com/blog/vulnerability-analysis-queuejumper-cve-2023-21554/
status: experimental
tags:
- attack.execution

