title: UNC2452 Process Creation Patterns
id: 4a5b4327-68a3-c67b-3a03-2e238380c196
related:
    - id: 9be34ad0-b6a7-4fbd-91cf-fc7ec1047f5f
      type: derived
status: test
description: Detects a specific process creation patterns as seen used by UNC2452 and provided by Microsoft as Microsoft Defender ATP queries
references:
    - https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
author: Florian Roth (Nextron Systems)
date: 2021-01-22
modified: 2024-09-12
tags:
    - attack.execution
    - attack.t1059.001
    - detection.emerging-threats
    # - sunburst
    # - unc2452
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 4688
        Channel: Security
    selection_generic_1:
        CommandLine|contains:
            - 7z.exe a -v500m -mx9 -r0 -p
            - 7z.exe a -mx9 -r0 -p
        CommandLine|contains|all:
            - .zip
            - .txt
    selection_generic_2:
        CommandLine|contains:
            - 7z.exe a -v500m -mx9 -r0 -p
            - 7z.exe a -mx9 -r0 -p
        CommandLine|contains|all:
            - .zip
            - .log
    selection_generic_3:
        ParentCommandLine|contains|all:
            - wscript.exe
            - .vbs
        CommandLine|contains|all:
            - rundll32.exe
            - C:\Windows
            - .dll,Tk_
    selection_generic_4:
        ParentCommandLine|contains|all:
            - C:\Windows
            - .dll
        CommandLine|contains: 'cmd.exe /C '
        ParentProcessName|endswith: \rundll32.exe
    selection_generic_5:
        CommandLine: ''
        ParentProcessName|endswith: \rundll32.exe
        NewProcessName|endswith: \dllhost.exe
    condition: process_creation and (1 of selection_generic_*)
falsepositives:
    - Unknown
level: high
ruletype: Sigma
