
title: New Root or CA or AuthRoot Certificate to Store
ruletype: Sigma
author: frack113
date: 2022/04/04
description: Detects the addition of new root, CA or AuthRoot certificates to the
  Windows registry
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetObject:
    - '*\SOFTWARE\Microsoft\SystemCertificates\Root\Certificates\\*'
    - '*\SOFTWARE\Policies\Microsoft\SystemCertificates\Root\Certificates\\*'
    - '*\SOFTWARE\Microsoft\EnterpriseCertificates\Root\Certificates\\*'
    - '*\SOFTWARE\Microsoft\SystemCertificates\CA\Certificates\\*'
    - '*\SOFTWARE\Policies\Microsoft\SystemCertificates\CA\Certificates\\*'
    - '*\SOFTWARE\Microsoft\EnterpriseCertificates\CA\Certificates\\*'
    - '*\Software\Microsoft\SystemCertificates\AuthRoot\Certificates\\*'
    - '*\SOFTWARE\Policies\Microsoft\SystemCertificates\AuthRoot\Certificates\\*'
    - '*\SOFTWARE\Microsoft\EnterpriseCertificates\AuthRoot\Certificates\\*'
  SELECTION_4:
    TargetObject: '*\Blob'
  SELECTION_5:
    Details: Binary Data
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: d223b46b-5621-4037-88fe-fda32eead684
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1553.004/T1553.004.md#atomic-test-6---add-root-certificate-to-currentuser-certificate-store
- https://posts.specterops.io/code-signing-certificate-cloning-attacks-and-defenses-6f98657fc6ec
status: experimental
tags:
- attack.impact
- attack.t1490
