
title: Persistent Outlook Landing Pages
author: Tobias Michalski
date: 2021/06/10
description: Detects the manipulation of persistent URLs which could execute malicious
  code
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetObject:
    - '*Software\Microsoft\Office\\*'
    - '*\Outlook\Today\\*'
  SELECTION_4:
    EventType: SetValue
  SELECTION_5:
    TargetObject: '*Stamp'
  SELECTION_6:
    Details: DWORD (0x00000001)
  SELECTION_7:
    TargetObject: '*UserDefinedUrl'
  SELECTION_8:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_9:
    Image: '*\OfficeClickToRun.exe'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and ((SELECTION_4 and
    SELECTION_5 and SELECTION_6) or SELECTION_7)) and  not ((SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
fields:
- Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/03/26
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=70
status: experimental
tags:
- attack.persistence
- attack.t1112
