
title: ServiceDll Modification
ruletype: Sigma
author: frack113
date: 2022/02/04
description: Detects the modification of a ServiceDLL value in the service settings
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    EventType: SetValue
  SELECTION_4:
    TargetObject: HKLM\System\CurrentControlSet\Services\\*
  SELECTION_5:
    TargetObject: '*\Parameters\ServiceDll'
  SELECTION_6:
    Details: C:\Windows\system32\spool\drivers\x64\3\PrintConfig.dll
  SELECTION_7:
    Image: C:\Windows\system32\lsass.exe
  SELECTION_8:
    TargetObject: '*\CurrentControlSet\Services\NTDS\Parameters\ServiceDll'
  SELECTION_9:
    Details: '%%systemroot%%\system32\ntdsa.dll'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Administrative scripts
- Installation of a service
id: 612e47e9-8a59-43a6-b404-f48683f45bd6
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/04/21
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.003/T1543.003.md#atomic-test-4---tinyturla-backdoor-service-w64time
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
