
title: Registry Disable System Restore
ruletype: Sigma
author: frack113
date: 2022/04/04
description: Detects the modification of the registry to disable a system restore
  on the computer
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    TargetObject:
    - HKLM\SOFTWARE\Policies\Microsoft\Windows NT\SystemRestore*
    - HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SystemRestore*
  SELECTION_4:
    TargetObject:
    - '*DisableConfig'
    - '*DisableSR'
  SELECTION_5:
    Details: DWORD (0x00000001)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 5de03871-5d46-4539-a82d-3aa992a69a83
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
status: experimental
tags:
- attack.impact
- attack.t1490
