
title: Disable Microsoft Office Security Features
author: frack113
date: 2021/06/08
description: Disable Microsoft Office Security Features by registry
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    EventType: SetValue
  SELECTION_4:
    TargetObject: '*\SOFTWARE\Microsoft\Office\\*'
  SELECTION_5:
    TargetObject:
    - '*VBAWarnings'
    - '*DisableInternetFilesInPV'
    - '*DisableUnsafeLocationsInPV'
    - '*DisableAttachementsInPV'
  SELECTION_6:
    Details: DWORD (0x00000001)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 7c637634-c95d-4bbf-b26c-a82510874b34
level: high
logsource:
  category: registry_set
  definition: key must be add to the sysmon configuration to works
  product: windows
modified: 2022/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
- https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
