
title: Scripted Diagnostics Turn Off Check Enabled - Registry
ruletype: Sigma
author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: 2022/06/15
description: Detects enabling TurnOffCheck which can be used to bypass defense of
  MSDT Follina vulnerability
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_3:
    EventType: SetValue
  SELECTION_4:
    TargetObject: HKLM\SOFTWARE\Policies\Microsoft\Windows\ScriptedDiagnostics\TurnOffCheck
  SELECTION_5:
    Details: DWORD (0x00000001)
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Administrator actions
id: 7d995e63-ec83-4aa3-89d5-8a17b5c87c86
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://twitter.com/wdormann/status/1537075968568877057?s=20&t=0lr18OAnmAGoGpma6grLUw
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
