
title: CurrentVersion Autorun Keys Modification
ruletype: Sigma
author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  SELECTION_1:
    EventID: 13
  SELECTION_10:
    Image: C:\Windows\system32\LogonUI.exe
  SELECTION_11:
    TargetObject:
    - '*\Authentication\Credential Providers\{D6886603-9D2F-4EB2-B667-1971041FA96B}\\*'
    - '*\Authentication\Credential Providers\{BEC09223-B018-416D-A0AC-523971B639F5}\\*'
    - '*\Authentication\Credential Providers\{8AF662BF-65A0-4D0A-A540-A338A999D36F}\\*'
    - '*\Authentication\Credential Providers\{27FBDB57-B613-4AF2-9D7E-4FA7A66C21AD}\\*'
  SELECTION_12:
    Image:
    - C:\Program Files (x86)\Microsoft\EdgeUpdate\Install\\*
    - C:\Program Files (x86)\Microsoft\EdgeWebView\\*
    - C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe*
  SELECTION_13:
    Image: C:\Windows\system32\regsvr32.exe
  SELECTION_14:
    TargetObject: '*DropboxExt*'
  SELECTION_15:
    Details: '*A251-47B7-93E1-CDD82E34AF8B}'
  SELECTION_16:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\Opera Browser Assistant'
  SELECTION_17:
    Details: C:\Program Files\Opera\assistant\browser_assistant.exe
  SELECTION_18:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\iTunesHelper'
  SELECTION_19:
    Details: '"C:\Program Files\iTunes\iTunesHelper.exe"'
  SELECTION_2:
    Channel: Microsoft-Windows-Sysmon/Operational
  SELECTION_20:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce\zoommsirepair'
  SELECTION_21:
    Details: '"C:\Program Files\Zoom\bin\installer.exe" /repair'
  SELECTION_22:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Run\Greenshot'
  SELECTION_23:
    Details: C:\Program Files\Greenshot\Greenshot.exe
  SELECTION_24:
    TargetObject: '*\Software\Microsoft\Windows\CurrentVersion\Run\GoogleDriveFS'
  SELECTION_25:
    Details: C:\Program Files\Google\Drive File Stream\\*
  SELECTION_26:
    Details: '*\GoogleDriveFS.exe --startup_mode'
  SELECTION_27:
    TargetObject: '*GoogleDrive*'
  SELECTION_28:
    Details:
    - '{CFE8B367-77A7-41D7-9C90-75D16D7DC6B6}'
    - '{A8E52322-8734-481D-A7E2-27B309EF8D56}'
    - '{C973DA94-CBDF-4E77-81D1-E5B794FBD146}'
    - '{51EF1569-67EE-4AD6-9646-E726C3FFC8A2}'
  SELECTION_29:
    Details: C:\Windows\system32\cmd.exe /q /c rmdir /s /q "C:\Users\\*
  SELECTION_3:
    EventType: SetValue
  SELECTION_30:
    Details: '*\AppData\Local\Microsoft\OneDrive\\*'
  SELECTION_31:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce\{c60fd5ac-367d-4e3a-a975-f157502ac30a}'
  SELECTION_32:
    Details: '*\AppData\Local\Package Cache\{c60fd5ac-367d-4e3a-a975-f157502ac30a}\python*'
  SELECTION_33:
    Details: '*.exe" /burn.runonce'
  SELECTION_34:
    Image:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\\*
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\\*
  SELECTION_35:
    Image: '*\OfficeClickToRun.exe'
  SELECTION_36:
    Image: C:\Program Files\Windows Defender\MsMpEng.exe
  SELECTION_4:
    TargetObject: '*\SOFTWARE\Microsoft\Windows\CurrentVersion*'
  SELECTION_5:
    TargetObject:
    - '*\ShellServiceObjectDelayLoad*'
    - '*\Run\\*'
    - '*\RunOnce\\*'
    - '*\Policies\System\Shell*'
    - '*\Policies\Explorer\Run*'
    - '*\Group Policy\Scripts\Startup*'
    - '*\Group Policy\Scripts\Shutdown*'
    - '*\Group Policy\Scripts\Logon*'
    - '*\Group Policy\Scripts\Logoff*'
    - '*\Explorer\ShellServiceObjects*'
    - '*\Explorer\ShellIconOverlayIdentifiers*'
    - '*\Explorer\ShellExecuteHooks*'
    - '*\Explorer\SharedTaskScheduler*'
    - '*\Explorer\Browser Helper Objects*'
    - '*\Authentication\PLAP Providers*'
    - '*\Authentication\Credential Providers*'
    - '*\Authentication\Credential Provider Filters*'
  SELECTION_6:
    Details: (Empty)
  SELECTION_7:
    TargetObject: '*\NgcFirst\ConsecutiveSwitchCount'
  SELECTION_8:
    Image:
    - '*\AppData\Local\Microsoft\OneDrive\Update\OneDriveSetup.exe'
    - '*\AppData\Roaming\Spotify\Spotify.exe'
  SELECTION_9:
    Image:
    - C:\WINDOWS\system32\devicecensus.exe
    - C:\Program Files\Microsoft OneDrive\StandaloneUpdater\OneDriveSetup.exe
    - C:\Program Files\KeePass Password Safe 2\ShInstUtil.exe
    - C:\Program Files\Everything\Everything.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4 and SELECTION_5)
    and  not ((SELECTION_6 or SELECTION_7 or SELECTION_8 or SELECTION_9) or (SELECTION_10
    and SELECTION_11) or (SELECTION_12) or (SELECTION_13 and SELECTION_14 and SELECTION_15)
    or (SELECTION_16 and SELECTION_17) or (SELECTION_18 and SELECTION_19) or (SELECTION_20
    and SELECTION_21) or (SELECTION_22 and SELECTION_23) or (SELECTION_24 and SELECTION_25
    and SELECTION_26) or (SELECTION_27 and SELECTION_28) or (SELECTION_29 and SELECTION_30)
    or (SELECTION_31 and SELECTION_32 and SELECTION_33) or (SELECTION_34 and SELECTION_35)
    or (SELECTION_36)))
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: 20f0ee37-5942-4e45-b7d5-c5b5db9df5cd
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2022/04/04
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: derived
status: experimental
tags:
- attack.persistence
- attack.t1547.001
