author: Zach Mathis
date: 2022/02/05
modified: 2022/05/21

title: Process Creation
details: 'Path: %NewProcessName% | PID: %NewProcessId% | User: %SubjectUserName% | LID: %SubjectLogonId%'
description: 

id: a3d42feb-ca30-4fce-ac98-fbc92107d3aa
level: informational
status: stable
logsource:
    product: windows
    service: security
    description: Process Creation needs to be turned on.
detection:
    selection:
        Channel: Security
        EventID: 4688
        Version: 0     #Command line information is only in version 1.
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
ruletype: Hayabusa