author: Zach Mathis
date: 2022/02/05
modified: 2022/02/05

title: Process Creation
title_jp: プロセス起動
details: 'Command Line: %CommandLine%  :  Path: %NewProcessName%  :  Process ID: %NewProcessId%  :  User: %SubjectUserName%  :  LogonID: %SubjectLogonId%'
details_jp: 'コマンドライン: %CommandLine%  :  パス: %NewProcessName%  :  プロセスID: %NewProcessId%  :  ユーザ: %SubjectUserName%  :  ログオンID: %SubjectLogonId%'
description: 
description_jp: 

id: a3d42feb-ca30-4fce-ac98-fbc92107d3aa
level: informational
status: stable
detection:
    selection:
        Channel: Security
        EventID: 4688
        Version: 1      #Command line information is only in version 1.
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
sample-evtx: 
logsource: non-default
ruletype: Hayabusa