author: Zach Mathis
date: 2022/02/05
modified: 2022/03/22

title: Process Creation
title_jp: プロセス起動
details: 'Cmd Line: %CommandLine% | Path: %NewProcessName% | PID: %NewProcessId% | User: %SubjectUserName% | LID: %SubjectLogonId%'
details_jp: 'コマンドライン: %CommandLine% | パス: %NewProcessName% | プロセスID: %NewProcessId% | ユーザ: %SubjectUserName% | ログオンID: %SubjectLogonId%'
description: 
description_jp: 

id: ac933178-c222-430d-8dcf-17b4f3a2fed8
level: informational
status: stable
logsource:
    product: windows
    service: security
    description: Process Creation with command line option logging needs to be turned on.
detection:
    selection:
        Channel: Security
        EventID: 4688
        Version: 1      #Command line information is only in version 1.
    condition: selection
falsepositives:
    - normal system usage
tags:
references:
ruletype: Hayabusa