author: Zach Mathis
date: 2022/02/06
modified: 2022/12/07

title: Event Log Svc Started
details: '-'
description: Startup, restarting the event log service, etc...

id: 11dc7d25-01c9-4b07-9d91-8e07b60d8fd3
level: informational
status: stable
logsource:
    product: windows
    service: system
detection:
    selection:
        Channel: System
        EventID: 6005
    condition: selection
falsepositives:
tags:
references:
ruletype: Hayabusa