author: Fukusuke Takahashi
date: 2024/03/28

title: Computer Uptime/Timezone
details: 'UpTime: %Data[5]% ¦ Timezone: %Data[7]%'
description: |
    This is an event that shows the computer uptime.This event is important because it also contains the OS timezone information.

id: 982fdd1f-38fe-4243-bea3-6032fc01b723
level: informational
status: test
logsource:
    product: windows
    service: system
detection:
    selection:
        Channel: System
        EventID: 6013
    condition: selection
falsepositives:
tags:
references:
ruletype: Hayabusa

sample-evtx:
    <Event xmlns="http://schemas.microsoft.com/win/2004/08/events/event">
      <System>
        <Provider Name="EventLog" />
        <EventID Qualifiers="32768">6013</EventID>
        <Version>0</Version>
        <Level>4</Level>
        <Task>0</Task>
        <Opcode>0</Opcode>
        <Keywords>0x80000000000000</Keywords>
        <TimeCreated SystemTime="2025-03-27T22:34:51.3133019Z" />
        <EventRecordID>1796</EventRecordID>
        <Correlation />
        <Execution ProcessID="1908" ThreadID="2084" />
        <Channel>System</Channel>
        <Computer>samurai</Computer>
        <Security />
      </System>
      <EventData>
        <Data />
        <Data />
        <Data />
        <Data />
        <Data>8852</Data>
        <Data>60</Data>
        <Data>-540 東京 (標準時)</Data>
        <Binary>
          31002E003100000030000000570069006E0064006F00770073002000310030002000500072006F000000310030002E0030002E003200360031003000300020004200750069006C0064002000320036003100300030002000200000004D0075006C0074006900700072006F0063006500730073006F007200200046007200650065000000320036003100300030002E00670065005F00720065006C0065006100730065002E003200340030003300330031002D00310034003300350000003600370064003400650035003600310000004E006F007400200041007600610069006C00610062006C00650000004E006F007400200041007600610069006C00610062006C006500000031003200000032000000340030003900310000003400310031000000730061006D00750072006100690000000000</Binary>
      </EventData>
    </Event>