title: PowerShell Downgrade Attack - PowerShell
id: 05ab81d4-8539-cffc-89f9-e470468bb28c
related:
    - id: 6331d09b-4785-4c13-980f-f96661356249
      type: derived
status: test
description: Detects PowerShell downgrade attack by comparing the host versions with the actually used engine version 2.0
references:
    - http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
author: Florian Roth (Nextron Systems), Lee Holmes (idea), Harish Segar (improvements)
date: 2017-03-22
modified: 2023-10-27
tags:
    - attack.defense-evasion
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: ps_classic_start
detection:
    ps_classic_start:
        EventID: 400
        Channel: Windows PowerShell
    selection:
        Data|contains: EngineVersion=2.
    filter_main:
        Data|contains: HostVersion=2.
    condition: ps_classic_start and (selection and not filter_main)
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
