
title: KrbRelay Hack Tool
ruletype: Sigma
author: Florian Roth
date: 2022/04/27
description: Detects the use of KrbRelay, a Kerberos relaying tool
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_10:
    CommandLine: '*spn*'
  SELECTION_11:
    CommandLine: '*spn *'
  SELECTION_12:
    CommandLine: '*session *'
  SELECTION_13:
    CommandLine: '*clsid *'
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\KrbRelay.exe'
  SELECTION_4:
    OriginalFilename: KrbRelay.exe
  SELECTION_5:
    CommandLine: '* -spn *'
  SELECTION_6:
    CommandLine: '* -clsid *'
  SELECTION_7:
    CommandLine: '* -rbcd *'
  SELECTION_8:
    CommandLine: '*shadowcred*'
  SELECTION_9:
    CommandLine: '*clsid*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or (SELECTION_5
    and SELECTION_6 and SELECTION_7) or (SELECTION_8 and SELECTION_9 and SELECTION_10)
    or (SELECTION_11 and SELECTION_12 and SELECTION_13)))
falsepositives:
- Unlikely
id: e96253b8-6b3b-4f90-9e59-3b24b99cf9b4
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/cube0x0/KrbRelay
status: experimental
tags:
- attack.credential_access
- attack.t1558.003
