
title: Suspicious Shells Spawn by SQL Server
ruletype: Sigma
author: FPT.EagleEye Team, wagga
date: 2020/12/11
description: Detects suspicious shell spawn from MSSQL process, this might be sight
  of RCE or SQL Injection
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\sqlservr.exe'
  SELECTION_4:
    NewProcessName:
    - '*\cmd.exe'
    - '*\sh.exe'
    - '*\bash.exe'
    - '*\powershell.exe'
    - '*\bitsadmin.exe'
  SELECTION_5:
    ParentProcessName: C:\Program Files\Microsoft SQL Server\\*
  SELECTION_6:
    ParentProcessName: '*DATEV_DBENGINE\MSSQL\Binn\sqlservr.exe'
  SELECTION_7:
    NewProcessName: C:\Windows\System32\cmd.exe
  SELECTION_8:
    CommandLine: '"C:\Windows\system32\cmd.exe" *'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    ((SELECTION_5 and SELECTION_6 and SELECTION_7 and SELECTION_8)))
id: 869b9ca7-9ea2-4a5a-8325-e80e62f75445
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/03/08
status: experimental
tags:
- attack.t1505.003
- attack.t1190
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
