
title: Base64 Encoded Command Line Param Indicator
ruletype: Sigma
author: Florian Roth
date: 2022/04/05
description: Detects programs that use base64 encoded values provided via command
  line, which is often an indicator of obfuscation but could also be used for legitimate
  purposes (e.g. if certain special characters would mess with the command line interface,
  enccrypted keys etc.)
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*=='
  SELECTION_4:
    CommandLine: '*== -*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4))
falsepositives:
- Legitimate software that uses base64 encoded values in its command line
id: eee65975-bfb8-41e6-af33-18011ba24c99
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://blog.malwarebytes.com/threat-intelligence/2022/04/new-uac-0056-activity-theres-a-go-elephant-in-the-room/d
status: experimental
