
title: Cscript Visual Basic Script Execution
ruletype: Sigma
author: frack113
date: 2022/01/02
description: Adversaries may abuse Visual Basic (VB) for execution
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\cscript.exe'
  SELECTION_4:
    CommandLine: '*.vbs*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 23250293-eed5-4c39-b57a-841c8933a57d
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.005/T1059.005.md
status: experimental
tags:
- attack.execution
- attack.t1059.005
