
title: Suspicious WMI Execution Using Rundll32
author: Florian Roth
date: 2020/10/12
description: Detects WMI executing rundll32
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*process call create*'
  SELECTION_4:
    CommandLine: '*rundll32*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://thedfirreport.com/2020/10/08/ryuks-return/
status: test
tags:
- attack.execution
- attack.t1047
