
title: Regedit as Trusted Installer
ruletype: Sigma
author: Florian Roth
date: 2021/05/27
description: Detects a regedit started with TrustedInstaller privileges or by ProcessHacker.exe
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\regedit.exe'
  SELECTION_4:
    ParentProcessName:
    - '*\TrustedInstaller.exe'
    - '*\ProcessHacker.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unlikely
id: 883835a7-df45-43e4-bf1d-4268768afda4
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
status: experimental
tags:
- attack.privilege_escalation
- attack.t1548
