
title: Schtasks From Suspicious Folders
ruletype: Sigma
author: Florian Roth
date: 2022/04/15
description: Detects scheduled task creations that have suspicious action command
  and folder combinations
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\schtasks.exe'
  SELECTION_4:
    CommandLine: '* /create *'
  SELECTION_5:
    CommandLine:
    - '*powershell*'
    - '*cmd /c *'
    - '*cmd.exe /c *'
  SELECTION_6:
    CommandLine:
    - '*C:\ProgramData\\*'
    - '*%ProgramData%*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown
id: 8a8379b8-780b-4dbf-b1e9-31c8d112fefb
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/lazarus-dream-job-chemical
status: experimental
tags:
- attack.execution
- attack.t1053.005
