
title: Suspicious Del in CommandLine
author: frack113
date: 2021/12/02
description: suspicious command line to remove exe or dll
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*del *.exe*'
  SELECTION_4:
    CommandLine: '*/f *'
  SELECTION_5:
    CommandLine: '*/q *'
  SELECTION_6:
    CommandLine: '*del *.dll*'
  SELECTION_7:
    CommandLine: '*C:\ProgramData\\*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5) or (SELECTION_6 and SELECTION_7)))
falsepositives:
- Unknown
id: 204b17ae-4007-471b-917b-b917b315c5db
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.joesandbox.com/analysis/509330/0/html#1044F3BDBE3BB6F734E357235F4D5898582D
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
