
title: Suspicious XOR Encoded PowerShell Command Line
ruletype: Sigma
author: Sami Ruohonen, Harish Segar (improvement), Tim Shelton
date: 2018/09/05
description: Detects suspicious powershell process which includes bxor command, alternative
  obfuscation method to b64 encoded commands.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    Description: Windows PowerShell
  SELECTION_4:
    Product: PowerShell Core 6
  SELECTION_5:
    CommandLine:
    - '*bxor*'
    - '*-join *'
    - "*-join'*"
    - '*-join"*'
    - '*-join`*'
    - '*char*'
  SELECTION_6:
    ParentProcessName: C:\Program Files\Amazon\SSM\ssm-document-worker.exe
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 or SELECTION_4) and
    SELECTION_5) and  not (SELECTION_6))
falsepositives:
- Unknown
id: bb780e0c-16cf-4383-8383-1e5471db6cf9
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/10
status: test
tags:
- attack.defense_evasion
- attack.t1059.001
- attack.t1140
- attack.t1027
