
title: Psexec Accepteula Condition
ruletype: Sigma
author: omkar72 - https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
date: 2020/10/30
description: Detect ed user accept agreement execution in psexec commandline
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\psexec.exe'
  SELECTION_4:
    CommandLine: '*accepteula*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Administrative scripts.
fields:
- ComputerName
- User
- CommandLine
id: 730fc21b-eaff-474b-ad23-90fd265d4988
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
status: test
tags:
- attack.execution
- attack.t1569
- attack.t1021
