
title: Suspicious Diantz Download and Compress Into a CAB File
author: frack113
date: 2021/11/26
description: Download and compress a remote file and store it in a cab file on local
  machine.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*diantz.exe*'
  SELECTION_4:
    CommandLine: '* \\\*'
  SELECTION_5:
    CommandLine: '*.cab*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5)
falsepositives:
- Unknown
id: 185d7418-f250-42d0-b72e-0c8b70661e93
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Diantz/
status: experimental
tags:
- attack.command_and_control
- attack.t1105
