
title: Cmdkey Cached Credentials Recon
ruletype: Sigma
author: jmallette, Florian Roth
date: 2019/01/16
description: Detects usage of cmdkey to look for cached credentials
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\cmdkey.exe'
  SELECTION_4:
    OriginalFileName: cmdkey.exe
  SELECTION_5:
    CommandLine:
    - '* /list*'
    - '* -list*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and SELECTION_5)
falsepositives:
- Legitimate administrative tasks
fields:
- CommandLine
- ParentCommandLine
- User
id: 07f8bdc2-c9b3-472a-9817-5a670b872f53
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/16
references:
- https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation
- https://technet.microsoft.com/en-us/library/cc754243(v=ws.11).aspx
status: experimental
tags:
- attack.credential_access
- attack.t1003.005
