
title: Suspicious ZipExec Execution
author: frack113
date: 2021/11/07
description: ZipExec is a Proof-of-Concept (POC) tool to wrap binary-based tools into
  a password-protected zip file.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*/generic:Microsoft_Windows_Shell_ZipFolder:filename=*'
  SELECTION_4:
    CommandLine: '*.zip*'
  SELECTION_5:
    CommandLine: '*/pass:*'
  SELECTION_6:
    CommandLine: '*/user:*'
  SELECTION_7:
    CommandLine: '*/delete*'
  SELECTION_8:
    CommandLine: '*Microsoft_Windows_Shell_ZipFolder:filename=*'
  SELECTION_9:
    CommandLine: '*.zip*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4 and
    SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8 and SELECTION_9)))
falsepositives:
- Unknown
id: 90dcf730-1b71-4ae7-9ffc-6fcf62bd0132
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/SBousseaden/status/1451237393017839616
- https://github.com/Tylous/ZipExec
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
- attack.t1202
