
title: Possible Shim Database Persistence via sdbinst.exe
ruletype: Sigma
author: Markus Neis
date: 2019/01/16
description: Detects installation of a new shim using sdbinst.exe. A shim can be used
  to load malicious DLLs into applications.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\sdbinst.exe'
  SELECTION_4:
    CommandLine: '*.sdb*'
  SELECTION_5:
    CommandLine: '*iisexpressshim.sdb*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- Unknown
id: 517490a7-115a-48c6-8862-1a481504d5a8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/08/14
references:
- https://www.fireeye.com/blog/threat-research/2017/05/fin7-shim-databases-persistence.html
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1546.011
