
title: Shadow Copies Deletion Using Operating Systems Utilities
ruletype: Sigma
author: Florian Roth, Michael Haag, Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community,
  Andreas Hunkeler (@Karneades)
date: 2019/10/22
description: Shadow Copies deletion using operating systems utilities
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_10:
    CommandLine: '*catalog*'
  SELECTION_11:
    CommandLine: '*quiet*'
  SELECTION_12:
    NewProcessName: '*\vssadmin.exe'
  SELECTION_13:
    OriginalFileName: VSSADMIN.EXE
  SELECTION_14:
    CommandLine: '*resize*'
  SELECTION_15:
    CommandLine: '*shadowstorage*'
  SELECTION_16:
    CommandLine: '*unbounded*'
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName:
    - '*\powershell.exe'
    - '*\wmic.exe'
    - '*\vssadmin.exe'
    - '*\diskshadow.exe'
  SELECTION_4:
    OriginalFileName:
    - PowerShell.EXE
    - wmic.exe
    - VSSADMIN.EXE
    - diskshadow.exe
  SELECTION_5:
    CommandLine: '*shadow*'
  SELECTION_6:
    CommandLine: '*delete*'
  SELECTION_7:
    NewProcessName: '*\wbadmin.exe'
  SELECTION_8:
    OriginalFileName: WBADMIN.EXE
  SELECTION_9:
    CommandLine: '*delete*'
  condition: ((SELECTION_1 and SELECTION_2) and ((((SELECTION_3 or SELECTION_4) and
    (SELECTION_5 and SELECTION_6)) or ((SELECTION_7 or SELECTION_8) and (SELECTION_9
    and SELECTION_10 and SELECTION_11))) or ((SELECTION_12 or SELECTION_13) and (SELECTION_14
    and SELECTION_15 and SELECTION_16))))
falsepositives:
- Legitimate Administrator deletes Shadow Copies using operating systems utilities
  for legitimate reason
- LANDesk LDClient Ivanti-PSModule (PS EncodedCommand)
fields:
- CommandLine
- ParentCommandLine
id: c947b146-0abc-4c87-9c64-b17e9d7274a2
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2022/05/16
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://blog.talosintelligence.com/2017/05/wannacry.html
- https://securingtomorrow.mcafee.com/other-blogs/mcafee-labs/new-teslacrypt-ransomware-arrives-via-spam/
- https://www.bleepingcomputer.com/news/security/why-everyone-should-disable-vssadmin-exe-now/
- https://www.hybrid-analysis.com/sample/ed01ebfbc9eb5bbea545af4d01bf5f1071661840480439c6e5babe8e080e41aa?environmentId=100
- https://github.com/Neo23x0/Raccine#the-process
- https://github.com/Neo23x0/Raccine/blob/main/yara/gen_ransomware_command_lines.yar
- https://redcanary.com/blog/intelligence-insights-october-2021/
status: stable
tags:
- attack.defense_evasion
- attack.impact
- attack.t1070
- attack.t1490
