
title: Suspicious Rundll32 Activity
author: juju4, Jonhnathan Ribeiro, oscd.community
date: 2019/01/16
description: Detects suspicious process related to rundll32 based on arguments
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_10:
    CommandLine: '*FileProtocolHandler*'
  SELECTION_11:
    CommandLine: '*zipfldr.dll*'
  SELECTION_12:
    CommandLine: '*RouteTheCall*'
  SELECTION_13:
    CommandLine: '*shell32.dll*'
  SELECTION_14:
    CommandLine: '*Control_RunDLL*'
  SELECTION_15:
    CommandLine: '*shell32.dll*'
  SELECTION_16:
    CommandLine: '*ShellExec_RunDLL*'
  SELECTION_17:
    CommandLine: '*mshtml.dll*'
  SELECTION_18:
    CommandLine: '*PrintHTML*'
  SELECTION_19:
    CommandLine: '*advpack.dll*'
  SELECTION_2:
    Channel: Security
  SELECTION_20:
    CommandLine: '*LaunchINFSection*'
  SELECTION_21:
    CommandLine: '*advpack.dll*'
  SELECTION_22:
    CommandLine: '*RegisterOCX*'
  SELECTION_23:
    CommandLine: '*ieadvpack.dll*'
  SELECTION_24:
    CommandLine: '*LaunchINFSection*'
  SELECTION_25:
    CommandLine: '*ieadvpack.dll*'
  SELECTION_26:
    CommandLine: '*RegisterOCX*'
  SELECTION_27:
    CommandLine: '*ieframe.dll*'
  SELECTION_28:
    CommandLine: '*OpenURL*'
  SELECTION_29:
    CommandLine: '*shdocvw.dll*'
  SELECTION_3:
    CommandLine: '*javascript:*'
  SELECTION_30:
    CommandLine: '*OpenURL*'
  SELECTION_31:
    CommandLine: '*syssetup.dll*'
  SELECTION_32:
    CommandLine: '*SetupInfObjectInstallAction*'
  SELECTION_33:
    CommandLine: '*setupapi.dll*'
  SELECTION_34:
    CommandLine: '*InstallHinfSection*'
  SELECTION_35:
    CommandLine: '*pcwutl.dll*'
  SELECTION_36:
    CommandLine: '*LaunchApplication*'
  SELECTION_37:
    CommandLine: '*dfshim.dll*'
  SELECTION_38:
    CommandLine: '*ShOpenVerbApplication*'
  SELECTION_4:
    CommandLine: '*.RegisterXLL*'
  SELECTION_5:
    CommandLine: '*url.dll*'
  SELECTION_6:
    CommandLine: '*OpenURL*'
  SELECTION_7:
    CommandLine: '*url.dll*'
  SELECTION_8:
    CommandLine: '*OpenURLA*'
  SELECTION_9:
    CommandLine: '*url.dll*'
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) or
    (SELECTION_5 and SELECTION_6) or (SELECTION_7 and SELECTION_8) or (SELECTION_9
    and SELECTION_10) or (SELECTION_11 and SELECTION_12) or (SELECTION_13 and SELECTION_14)
    or (SELECTION_15 and SELECTION_16) or (SELECTION_17 and SELECTION_18) or (SELECTION_19
    and SELECTION_20) or (SELECTION_21 and SELECTION_22) or (SELECTION_23 and SELECTION_24)
    or (SELECTION_25 and SELECTION_26) or (SELECTION_27 and SELECTION_28) or (SELECTION_29
    and SELECTION_30) or (SELECTION_31 and SELECTION_32) or (SELECTION_33 and SELECTION_34)
    or (SELECTION_35 and SELECTION_36) or (SELECTION_37 and SELECTION_38)))
falsepositives:
- False positives depend on scripts and administrative tools used in the monitored
  environment
id: e593cf51-88db-4ee1-b920-37e89012a3c9
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/12/04
references:
- http://www.hexacorn.com/blog/2017/05/01/running-programs-via-proxy-jumping-on-a-edr-bypass-trampoline/
- https://twitter.com/Hexacorn/status/885258886428725250
- https://gist.github.com/ryhanson/227229866af52e2d963cf941af135a52
status: test
tags:
- attack.defense_evasion
- attack.t1218.011
