
title: Sticky-Key Backdoor Copy Cmd.exe
ruletype: Sigma
author: Sreeman
date: 2020/02/18
description: By replacing the sticky keys executable with the local admins CMD executable,
  an attacker is able to access a privileged windows console session without authenticating
  to the system. When the sticky keys are "activated" the privilleged shell is launched.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: copy /y C:\windows\system32\cmd.exe C:\windows\system32\sethc.exe
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
fields:
- CommandLine
- ParentProcess
id: 1070db9a-3e5d-412e-8e7b-7183b616e1b3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/04/19
references:
- https://www.fireeye.com/blog/threat-research/2017/03/apt29_domain_frontin.html
- https://www.clearskysec.com/wp-content/uploads/2020/02/ClearSky-Fox-Kitten-Campaign-v1.pdf
status: experimental
tags:
- attack.t1546.008
- attack.privilege_escalation
