
title: Run Whoami as Privileged User
ruletype: Sigma
author: Florian Roth
date: 2022/01/28
description: Detects a whoami.exe executed by privileged accounts that are often misused
  by threat actors
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    User: '*TrustedInstaller*'
  SELECTION_4:
    NewProcessName: '*\whoami.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 79ce34ca-af29-4d0e-b832-fc1b377020db
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://nsudo.m2team.org/en-us/
status: experimental
tags:
- attack.privilege_escalation
- attack.discovery
- attack.t1033
