
title: Suspicious Program Names
ruletype: Sigma
author: Florian Roth
date: 2022/02/11
description: Detects suspicious patterns in program names or folders that are often
  found in malicious samples or hacktools
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\CVE-202*'
  SELECTION_4:
    NewProcessName:
    - '*\poc.exe'
    - '*\artifact.exe'
    - '*\artifact64.exe'
    - '*\artifact_protected.exe'
    - '*\artifact32.exe'
    - '*\artifact32big.exe'
    - '*obfuscated.exe'
    - '*obfusc.exe'
    - '*\meterpreter'
  SELECTION_5:
    CommandLine:
    - '*inject.ps1*'
    - '*Invoke-CVE*'
    - '*pupy.ps1*'
    - '*payload.ps1*'
    - '*beacon.ps1*'
    - '*PowerView.ps1*'
    - '*bypass.ps1*'
    - '*obfuscated.ps1*'
    - '*obfusc.ps1*'
    - '*obfus.ps1*'
    - '*obfs.ps1*'
    - '*evil.ps1*'
    - '*MiniDogz.ps1*'
    - '*_enc.ps1*'
    - '*\shell.ps1*'
    - '*\rshell.ps1*'
    - '*revshell.ps1*'
    - '*\av.ps1*'
    - '*\av_test.ps1*'
    - '*adrecon.ps1*'
    - '*mimikatz.ps1*'
    - '*\PowerUp_*'
    - '*powerup.ps1*'
    - '*\Temp\a.ps1*'
    - '*\Temp\p.ps1*'
    - '*\Temp\1.ps1*'
    - '*Hound.ps1*'
    - '*encode.ps1*'
    - '*powercat.ps1*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Legitimate tools that accidentally match on the searched patterns
fields:
- CommandLine
- ParentCommandLine
- CurrentDirectory
id: efdd8dd5-cee8-4e59-9390-7d4d5e4dd6f6
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
status: experimental
