
title: Bypass UAC via WSReset.exe
ruletype: Sigma
author: E.M. Anhaus (originally from Atomic Blue Detections, Tony Lambert), oscd.community
date: 2019/10/24
description: Identifies use of WSReset.exe to bypass User Account Control. Adversaries
  use this technique to execute privileged processes.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\wsreset.exe'
  SELECTION_4:
    NewProcessName: '*\conhost.exe'
  SELECTION_5:
    OriginalFileName: CONHOST.EXE
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not (SELECTION_4
    or SELECTION_5))
falsepositives:
- Unknown
id: d797268e-28a9-49a7-b9a8-2f5039011c5c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/13
references:
- https://eqllib.readthedocs.io/en/latest/analytics/532b5ed4-7930-11e9-8f5c-d46d6d62a49e.html
status: test
tags:
- attack.privilege_escalation
- attack.t1548.002
