
title: Imports Registry Key From a File
ruletype: Sigma
author: Oddvar Moe, Sander Wiebing, oscd.community
date: 2020/10/07
description: Detects the import of the specified file to the registry with regedit.exe.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\regedit.exe'
  SELECTION_4:
    CommandLine:
    - '* /i *'
    - '* /s *'
    - '*.reg*'
  SELECTION_5:
    CommandLine:
    - '* /e *'
    - '* /a *'
    - '* /c *'
  SELECTION_6:
    CommandLine|re: :[^ \\\\]
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5)) and  not (SELECTION_6))
falsepositives:
- Legitimate import of keys
- Evernote
fields:
- ParentImage
- CommandLine
id: 73bba97f-a82d-42ce-b315-9182e76c57b1
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/02/15
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/master/yml/OSBinaries/Regedit.yml
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
status: test
tags:
- attack.t1112
- attack.defense_evasion
