
title: IIS Native-Code Module Command Line Installation
ruletype: Sigma
author: Florian Roth
date: 2019/12/11
description: Detects suspicious IIS native-code module installations via command line
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\appcmd.exe'
  SELECTION_4:
    CommandLine: '*install*'
  SELECTION_5:
    CommandLine: '*module*'
  SELECTION_6:
    CommandLine: '*/name:*'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4 and SELECTION_5
    and SELECTION_6)
falsepositives:
- Unknown as it may vary from organisation to arganisation how admins use to install
  IIS modules
id: 9465ddf4-f9e4-4ebd-8d98-702df3a93239
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/01/07
references:
- https://researchcenter.paloaltonetworks.com/2018/01/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
status: test
tags:
- attack.persistence
- attack.t1505.003
