
title: Mouse Lock Credential Gathering
author: Cian Heasley
date: 2020/08/13
description: In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate
  tool "Mouse Lock" as being used for both credential access and collection in security
  incidents.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    Product: '*Mouse Lock*'
  SELECTION_4:
    Company: '*Misc314*'
  SELECTION_5:
    CommandLine: '*Mouse Lock_*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4 or SELECTION_5))
falsepositives:
- Legitimate uses of Mouse Lock software
fields:
- Product
- Company
- CommandLine
id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://github.com/klsecservices/Publications/blob/master/Incident-Response-Analyst-Report-2020.pdf
- https://sourceforge.net/projects/mouselock/
status: test
tags:
- attack.credential_access
- attack.collection
- attack.t1056.002
