
title: Suspicious Subsystem for Linux Bash Execution
author: frack113
date: 2021/11/24
description: Performs execution of specified file, can be used as a defensive evasion.
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    CommandLine: '*bash.exe*'
  SELECTION_4:
    CommandLine: '*-c *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Unknown
id: 5edc2273-c26f-406c-83f3-f4d948e740dd
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Bash/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
