
title: Renamed Msdt.exe
ruletype: Sigma
author: pH-T
date: 2022/06/03
description: Detects process creation with a renamed Msdt.exe
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    OriginalFileName: msdt.exe
  SELECTION_4:
    NewProcessName: '*\msdt.exe'
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and  not ((SELECTION_4)))
falsepositives:
- Unlikely
id: bd1c6866-65fc-44b2-be51-5588fcff82b9
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msdt/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036.003
