
title: MSDT Executed with Suspicious Parent
ruletype: Sigma
author: Nextron Systems
date: 2022/06/01
description: Detects msdt.exe executed by a suspicious parent as seen in CVE-2022-30190
  / Follina exploitation
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName:
    - '*\powershell.exe'
    - '*\cmd.exe'
    - '*\mshta.exe'
    - '*\cscript.exe'
    - '*\wscript.exe'
    - '*\wsl.exe'
    - '*\rundll32.exe'
    - '*\regsvr32.exe'
  SELECTION_4:
    NewProcessName: '*\msdt.exe'
  SELECTION_5:
    OriginalFileName: msdt.exe
  condition: ((SELECTION_1 and SELECTION_2) and SELECTION_3 and (SELECTION_4 or SELECTION_5))
falsepositives:
- Unknown
id: 7a74da6b-ea76-47db-92cc-874ad90df734
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/06/02
references:
- https://twitter.com/nao_sec/status/1530196847679401984
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
- attack.t1218
