
title: NSudo Tool Execution As System
ruletype: Sigma
author: Florian Roth
date: 2022/01/24
description: Detects the use of NSudo tool for command execution
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName: '*\NSudo.exe'
  SELECTION_4:
    CommandLine: '* -U:S *'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3 and SELECTION_4)
falsepositives:
- Legitimate use by administrators
fields:
- CommandLine
- ParentCommandLine
id: 771d1eb5-9587-4568-95fb-9ec44153a012
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://nsudo.m2team.org/en-us/
- https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
status: experimental
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
