
title: Emotet RunDLL32 Process Creation
ruletype: Sigma
author: FPT.EagleEye
date: 2020/12/25
description: Detecting Emotet DLL loading by looking for rundll32.exe processes with
  command lines ending in ,RunDLL or ,Control_RunDLL
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName:
    - '*\rundll32.exe'
  SELECTION_4:
    CommandLine:
    - '*,RunDLL'
    - '*,Control_RunDLL'
  SELECTION_5:
    ParentProcessName:
    - '*\tracker.exe'
  SELECTION_6:
    CommandLine:
    - '*.dll,Control_RunDLL'
    - '*.dll",Control_RunDLL'
    - "*.dll',Control_RunDLL"
  condition: ((SELECTION_1 and SELECTION_2) and ((SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5)) and  not (SELECTION_6))
falsepositives:
- Unknown
id: 54e57ce3-0672-46eb-a402-2c0948d5e3e9
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/17
references:
- https://paste.cryptolaemus.com/emotet/2020/12/22/emotet-malware-IoCs_12-22-20.html
- https://cyber.wtf/2021/11/15/guess-whos-back/
status: test
tags:
- attack.defense_evasion
- attack.t1218.011
