
title: RunDLL32 Spawning Explorer
ruletype: Sigma
author: elhoim, CD_ROM_
date: 2022/04/27
description: Detects RunDLL32.exe spawning explorer.exe as child, which is very uncommon,
  often observes Gamarue spawning the explorer.exe process in an unusual way
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    ParentProcessName: '*\rundll32.exe'
  SELECTION_4:
    NewProcessName: '*\explorer.exe'
  SELECTION_5:
    ParentCommandLine: '*\shell32.dll,Control_RunDLL*'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- Unknown
id: caa06de8-fdef-4c91-826a-7f9e163eef4b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/05/25
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
