
title: Renamed jusched.exe
ruletype: Sigma
author: Markus Neis, Swisscom
date: 2019/06/04
description: Detects renamed jusched.exe used by cobalt group
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    Description: Java Update Scheduler
  SELECTION_4:
    Description: Java(TM) Update Scheduler
  SELECTION_5:
    NewProcessName:
    - '*\jusched.exe'
  condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 or SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- Unknown
id: edd8a48c-1b9f-4ba1-83aa-490338cd1ccb
level: high
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://www.bitdefender.com/files/News/CaseStudies/study/262/Bitdefender-WhitePaper-An-APT-Blueprint-Gaining-New-Visibility-into-Financial-Threats-interactive.pdf
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1036.003
