
title: Suspicious Double Extension
ruletype: Sigma
author: Florian Roth (rule), @blu3_team (idea)
date: 2019/06/26
description: Detects suspicious use of an .exe extension after a non-executable file
  extension like .pdf.exe, a set of spaces or underlines to cloak the executable file
  in spear phishing campaigns
detection:
  SELECTION_1:
    EventID: 4688
  SELECTION_2:
    Channel: Security
  SELECTION_3:
    NewProcessName:
    - '*.doc.exe'
    - '*.docx.exe'
    - '*.xls.exe'
    - '*.xlsx.exe'
    - '*.ppt.exe'
    - '*.pptx.exe'
    - '*.rtf.exe'
    - '*.pdf.exe'
    - '*.txt.exe'
    - '*      .exe'
    - '*______.exe'
  condition: (SELECTION_1 and SELECTION_2 and SELECTION_3)
falsepositives:
- Unknown
id: 1cdd9a09-06c9-4769-99ff-626e2b3991b8
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2021/11/27
references:
- https://blu3-team.blogspot.com/2019/06/misleading-extensions-xlsexe-docexe.html
- https://twitter.com/blackorbird/status/1140519090961825792
status: stable
tags:
- attack.initial_access
- attack.t1566.001
