title: DLL Names Used By SVR For GraphicalProton Backdoor
id: 3a3bcc4b-03c7-1824-ed5c-6f7c2075ba72
related:
    - id: e64c8ef3-9f98-40c8-b71e-96110991cb4c
      type: derived
status: test
description: Hunts known SVR-specific DLL names.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
author: CISA
date: '2023-12-18'
tags:
    - attack.defense-evasion
    - attack.t1574.001
    - detection.emerging-threats
    - sysmon
logsource:
    category: image_load
    product: windows
detection:
    image_load:
        EventID: 7
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ImageLoaded|endswith:
            - \AclNumsInvertHost.dll
            - \AddressResourcesSpec.dll
            - \BlendMonitorStringBuild.dll
            - \ChildPaletteConnected.dll
            - \DeregisterSeekUsers.dll
            - \HandleFrequencyAll.dll
            - \HardSwapColor.dll
            - \LengthInMemoryActivate.dll
            - \ModeBitmapNumericAnimate.dll
            - \ModeFolderSignMove.dll
            - \ParametersNamesPopup.dll
            - \PerformanceCaptionApi.dll
            - \ScrollbarHandleGet.dll
            - \UnregisterAncestorAppendAuto.dll
            - \WowIcmpRemoveReg.dll
    condition: image_load and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
