
title: Delete Log from Application
ruletype: Sigma
author: frack113
date: 2022/01/16
description: Deletion of log files is a known anti-forensic technique
detection:
  SELECTION_1:
    EventID: 23
  SELECTION_2:
    EventID: 26
  SELECTION_3:
    TargetFilename: '*.log'
  SELECTION_4:
    TargetFilename: '*\TeamViewer_*'
  SELECTION_5:
    Image: C:\Windows\system32\svchost.exe
  condition: ((SELECTION_1 or SELECTION_2) and (SELECTION_3 and SELECTION_4) and  not
    (SELECTION_5))
falsepositives:
- Unknown
id: b1decb61-ed83-4339-8e95-53ea51901720
level: low
logsource:
  category: file_delete
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.004/T1070.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
