
title: Deletes Backup Files
author: frack113
date: 2022/01/02
description: Adversaries may delete or remove built-in operating system data and turn
  off services designed to aid in the recovery of a corrupted system to prevent recovery.
detection:
  SELECTION_1:
    Image: '*cmd.exe'
  SELECTION_2:
    TargetFilename:
    - '*.VHD'
    - '*.bac'
    - '*.bak'
    - '*.wbcat'
    - '*.bkf'
    - '*.set'
    - '*.win'
    - '*.dsk'
  condition: (SELECTION_1 and SELECTION_2)
falsepositives:
- Legitime usage
id: 06125661-3814-4e03-bfa2-1e4411c60ac3
level: medium
logsource:
  category: file_delete
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-6---windows---delete-backup-files
status: experimental
tags:
- attack.impact
- attack.t1490
