title: Uncommon Scheduled Task Once 00:00
ruletype: Sigma
author: pH-T
date: 2022/07/15
description: Detects scheduled task creation events that include suspicious actions,
    and is run once at 00:00
detection:
    SELECTION_1:
        EventID: 1
    SELECTION_2:
        Channel: Microsoft-Windows-Sysmon/Operational
    SELECTION_3:
        Image: '*\schtasks.exe*'
    SELECTION_4:
        CommandLine:
        - '*wscript*'
        - '*vbscript*'
        - '*cscript*'
        - '*wmic *'
        - '*wmic.exe*'
        - '*regsvr32.exe*'
        - '*powershell*'
        - '*\AppData\\*'
    SELECTION_5:
        CommandLine: '*once*'
    SELECTION_6:
        CommandLine: '*00:00*'
    SELECTION_7:
        CommandLine: '*Joke*'
    condition: ((SELECTION_1 and SELECTION_2) and (SELECTION_3 and SELECTION_4) and
        ((SELECTION_5 and SELECTION_6) or SELECTION_7))
falsepositives:
- Software installation
id: 970823b7-273b-460a-8afc-3a6811998529
level: high
logsource:
    category: process_creation
    product: windows
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
status: experimental
yml_filename: win_scheduled_task_once_0000.yml
yml_path: rules/windows/builtin/security
---

