title: DNS Server Error Failed Loading the ServerLevelPluginDLL
ruletype: Sigma
author: Florian Roth (Nextron Systems)
date: 2017/05/08
description: Detects a DNS server error in which a specified plugin DLL (in registry)
    could not be loaded
detection:
    SELECTION_1:
        Channel: DNS Server
    SELECTION_2:
        EventID: 150
    SELECTION_3:
        EventID: 770
    SELECTION_4:
        EventID: 771
    condition: (SELECTION_1 and (SELECTION_2 or SELECTION_3 or SELECTION_4))
falsepositives:
- Unknown
id: cbe51394-cd93-4473-b555-edf0144952d9
level: high
logsource:
    product: windows
    service: dns-server
modified: 2023/02/05
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://technet.microsoft.com/en-us/library/cc735829(v=ws.10).aspx
- https://twitter.com/gentilkiwi/status/861641945944391680
related:
-   id: e61e8a88-59a9-451c-874e-70fcc9740d67
    type: derived
-   id: f63b56ee-3f79-4b8a-97fb-5c48007e8573
    type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1574.002

