title: Tor Client/Browser Execution
id: 62f7c9bf-9135-49b2-8aeb-1e54a6ecc13c
status: test
description: Detects the use of Tor or Tor-Browser to connect to onion routing networks
references:
    - https://www.logpoint.com/en/blog/detecting-tor-use-with-logpoint/
author: frack113
date: 2022/02/20
modified: 2023/02/13
tags:
    - attack.command_and_control
    - attack.t1090.003
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith:
            - \tor.exe
            - \Tor Browser\Browser\firefox.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: high
ruletype: Sigma
