title: Lolbin Defaultpack.exe Use As Proxy
id: b2309017-4235-44fe-b5af-b15363011957
status: test
description: Detect usage of the "defaultpack.exe" binary as a proxy to launch other programs
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/DefaultPack/
    - https://www.echotrail.io/insights/search/defaultpack.exe
author: frack113
date: 2022/12/31
tags:
    - attack.t1218
    - attack.defense_evasion
    - attack.execution
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        ParentImage|endswith: \defaultpack.exe
    condition: process_creation and selection
falsepositives:
    - Unknown
level: medium
ruletype: Sigma
