title: Application Whitelisting Bypass via Dnx.exe
id: 81ebd28b-9607-4478-bf06-974ed9d53ed7
status: test
description: Execute C# code located in the consoleapp folder
references:
    - https://lolbas-project.github.io/lolbas/OtherMSBinaries/Csi/
    - https://enigma0x3.net/2016/11/17/bypassing-application-whitelisting-by-using-dnx-exe/
author: Beyu Denis, oscd.community
date: 2019/10/26
modified: 2021/11/27
tags:
    - attack.defense_evasion
    - attack.t1218
    - attack.t1027.004
    - sysmon
logsource:
    category: process_creation
    product: windows
detection:
    process_creation:
        EventID: 1
        Channel: Microsoft-Windows-Sysmon/Operational
    selection:
        Image|endswith: \dnx.exe
    condition: process_creation and selection
falsepositives:
    - Legitimate use of dnx.exe by legitimate user
level: medium
ruletype: Sigma
